[{"section_title": "Introduction", "text": "A disproportionately large share of global primary production and fish catch is supported by Eastern Boundary Upwelling Systems (EBUS) such as the California Current System (CCS) [Chavez and Toggweiler, 1995;Pauly and Christensen, 1995]. In these systems, surface winds drive deep, nutrient-rich water to the sunlit surface layer, stimulating blooms of microscopic phytoplankton that form the base of the oceanic food web. The total amount of nutrient delivered to the ocean surface by upwelling, and therefore the potential for new production, depends on two factors: (i) the total volume of upwelled water and (ii) the nutrient content of that water. Total upwelled volume is dictated largely by the strength of equatorward winds that drive offshore Ekman transport, though it may be tempered or enhanced by the cross-shore component of the geostrophic flow [Marchesiello and Estrade, 2010]. The nutrient concentration in upwelled waters is dependent on upwelling source depth, which is modulated by the local winds, density profile, and topography Edwards, 2011, 2012], and on the nitrate depth profile, which is set by large-scale circulation patterns and is modified locally through biological processes. Investigating nutrient supply trends in coastal regions of the northeast Pacific therefore requires careful consideration of local and large-scale atmospheric and oceanic drivers, which may be evolving independently or in concert. Bakun [1990] hypothesized an increase in upwelling-favorable winds due to intensification of the land-sea temperature gradient under global warming. While the existence of an upward trend in coastal upwelling has been largely supported by prior studies [Sydeman et al., 2014], future changes are likely to be latitude and region dependent [Wang et al., 2015] and may be driven by mechanisms other than that described by the Bakun hypothesis [Garreaud and Falvey, 2009;Belmadani et al., 2014]. At the same time, increased oceanic heat uptake may enhance stratification and inhibit upwelling of deep water, reducing nutrient supply to the surface mixed layer. Such a scenario was invoked to explain widespread declines of CCS biological populations in the latter half of the twentieth century [McGowan et al., 2003;Palacios et al., 2004]. Finally, reduced ventilation of the North Pacific may lead to increased nitrate concentration in upwelling source waters [Rykaczewski and Dunne, 2010], a change that appears to be consistent with observations off California in recent decades [Bograd et al., 2015]. Taken together, this suite of potential changes to EBUS dynamics presents a complex framework in which nutrient supply trends must be evaluated (Figure 1). Indeed, the relative influence of each of these changes on ecosystem productivity and functioning remains a subject of active debate [Doney et al.,  • Figure S2 • Figure S3 do not agree on the direction of change in CCS primary productivity over the 21st century [Henson et al., 2010]. Ultimately, upwelled nitrate supply could increase due to dominant control of the wind [Auad et al., 2006] or the nitrate concentration of source waters [Rykaczewski and Dunne, 2010], or it could decrease due to the dominance of increased stratification [Di Lorenzo et al., 2005]. Additionally, decadal-scale climate variability exerts significant control over upwelling, nutrient fluxes, and biology in the CCS. Each of the most widely used indices of north Pacific climate-the El Niño-Southern Oscillation (ENSO), the Pacific Decadal Oscillation (PDO), and the North Pacific Gyre Oscillation (NPGO)has been linked to modification of upwelling intensity and the upwelled nutrient supply in the CCS [Chhak and Di Lorenzo, 2007;Di Lorenzo et al., 2008;Jacox et al., 2015]. This decadal variability further complicates extraction of long-term trends from observational records and model simulations. In this study we explore the relative importance of local winds, surface heat fluxes, and basin-scale climate variability as drivers of nitrate flux to the ocean's surface layer in recent decades. We then compare our results with published findings from earlier decades in order to explore implications for longer time scales when environmental trends may or may not match those seen in the current study period."}, {"section_title": "Methods", "text": ""}, {"section_title": "Ocean Circulation Model", "text": "The ocean circulation model is a CCS configuration of the Regional Ocean Modeling System (ROMS) for 1980-2010. The model domain covers 30-48°N and 115.5-134°W, spanning the U.S. west coast and extending~1000 km from shore. For our analysis, we focus on the region between Cape Mendocino and Point Conception (35-40°N), which is the portion of the CCS that experiences persistent equatorward winds [Dorman and Winant, 1995], and from the coast to 50 km offshore, the band of strong vertical nitrate flux (Figure 1). The model has 1/10°horizontal resolution and 42 sigma levels in the vertical, "}, {"section_title": "Geophysical Research Letters", "text": "10.1002/2015GL065147 reproduces observed circulation patterns [Veneziani et al., 2009], and adequately resolves spatial upwelling variability [Jacox et al., 2014[Jacox et al., , 2015 and nearshore carbon dynamics [Fiechter et al., 2014].\n10.1002/2015GL065147 geostrophic flow, which reduces upwelling in the central CCS by~25% relative to wind-based estimates [Jacox et al., 2014], and (ii) we use nitrate concentration at the mixed layer depth (on average~40 m) to estimate nitrate flux, while Messié et al. use 60 m depth, where nitrate concentrations are higher.\n10.1002/2015GL065147 upper ocean heating by intensifying the air-sea temperature gradient near the coast, evidenced by a strong positive correlation between upwelling and surface heat flux (Figures 2b and 2d). Opposite trends in the local wind-and heat-driven nitrate fluxes are therefore expected. Remote ocean forcing is examined here by isolating the large-scale oceanic influence transmitted through the lateral boundaries of the model domain. As in the case of surface heat fluxes, there is no significant change in vertical transport associated with remote ocean forcing (Figure 2e). There is an upward trend in the nitrate concentration at depth (Figure 2h), which we suspect is related to decadal basin-scale variability. Di Lorenzo et al. [2005] found a decrease in coastal surface salinity (and presumably nitrate) due to remote ocean forcing for the period 1950-2000, when the net change in the PDO was positive, while we find a remotely forced increase in nitrate from 1980 to 2010, a period of net decrease in the PDO. This is consistent with reversals of basin-scale environmental trends in the late twentieth century, including a shift to strengthening trades [England et al., 2014] and shoaling of the eastern Pacific thermocline [Deutsch et al., 2011]. As our model runs are not long enough to explicitly account for decadal variability, comparisons with prior analyses of contrasting time periods prove informative (see section 4). On shorter time scales, we are able to explore remote ocean forcing of CCS nitrate fluxes by focusing on change related to ENSO events. ENSO variability moderates nitrate flux in the CCS through several mechanisms. During an El Niño event, depression of the thermocline by poleward propagation of coastally trapped waves reduces the nitrate concentration in source waters (Figure 2h). At the same time, weakened equatorward winds and a consequent decrease in upwelling (Figure 2c) result from ENSO-driven weakening of the North Pacific high-pressure system. We find also a third means by which El Niño reduces nitrate flux in the CCS. The alongshore coastal sea surface height gradient in the CCS is strengthened during El Niño ( Figure S2), increasing the barotropic alongshore pressure gradient and resultant onshore geostrophic flow and reducing vertical transport independent of the wind (Figure 2e). This threefold effect results in the most extreme nitrate flux anomalies occurring during El Niño (e.g., 1992and 1998) and La Niña (e.g., 2008 events (Figure 2), an important consideration especially if the frequency of such events should increase in the future [Timmermann et al., 1999;Cai et al., 2015]. Overall, nitrate flux anomalies arising from ENSO forcing are more tightly coupled to remote ocean influences than to the local CCS winds, though the two effects are of similar magnitude (Figure 3). A weak positive correlation between the Oceanic Niño Index (ONI; http://www.cpc.ncep.noaa.gov/data/indices/oni.ascii.txt) and heat-driven nitrate flux anomalies is due to warmer sea surface temperatures during El Niño, which weaken the coastal ocean heat sink.\n10.1002/2015GL065147 a precipitous decline in the zooplankton population that has been attributed to reductions in the upwelled nitrate supply [Roemmich and McGowan, 1995]. However, the late 1990s brought an abrupt reversal of many environmental and biogeochemical trends both in the CCS [Peterson and Schwing, 2003] and across the Pacific [England et al., 2014]. The subsequent period of increased upwelling and productivity is reflected in our results. It is necessary therefore to place our findings in the context of longer time scales, and we do so by comparison with previously published results. Using an approach similar to ours for 1950, Di Lorenzo et al. [2005 found increased upwelling and also surface warming driven primarily by remote forcing through the model boundaries. In their study, as in ours, the warming trend generated by local heat fluxes is weaker than the wind-driven cooling trend, but the addition of remote forcing through the model boundaries resulted in net warming of the CCS. Therefore, while the local wind and heat flux trends are consistent between their study and ours, the remote ocean influence is of opposite sign. This suggests that the local wind and heat flux effects are decoupled from remote ocean forcing on long time scales. Remote forcing effects appear to be related to basin-scale climate variability, and while the local wind and heat flux trends are influenced by basin-scale variability, their persistence through climate regime shifts indicates that they may be secular. These different forcing mechanisms may therefore drive similar ecosystem responses on different time scales, with important implications for the distinction of transient ecosystem shifts from climate-change-driven trends [Doney et al., 2012]. In the CCS, basin-scale climate variability, including ENSO, the PDO, and the NPGO, may make differentiation of climate-change-driven upwelling trends from natural variability more difficult than in other EBUS [Wang et al., 2015]. Comparison of our results with previous studies indicates that even on 30-50 year time scales, basin-scale variability may dominate, and Henson et al. [2010] found that detection of biologically relevant climate trends in the CCS may require time series as long as 60 years. Fortunately, we are now reaching that threshold with a regional observational program (CalCOFI), upwelling indices (NOAA Pacific Fisheries Environmental Laboratory), and model products (e.g., the National Centers for Environmental Prediction/National Center for Atmospheric Research Reanalysis) providing over six decades of data for analysis of long-term environmental change. Continuation of these time series will reveal whether historical dynamics in the climate system continue into the future. Though there is no consensus at present on the direction of environmental change in the CCS under climatic warming [Snyder et al., 2003;Wang et al., 2015], if the past 60 years are representative of the future, changes in upwelling intensity will dictate long-term trends in the nutrient supply of the CCS."}, {"section_title": "Model Forcing", "text": "Monthly fields from the Simple Ocean Data Assimilation reanalysis [Carton et al., 2000] are used to force the model at the open boundaries. Surface forcing was derived as follows: Atmospheric state variables were taken from the European Centre for Medium-Range Weather Forecasting (ECMWF) 40 Year Reanalysis (ERA-40) [Uppala et al., 2005] for 1980-2001 and from ERA-Interim [Dee et al., 2011] for 2002-2010, except for the winds which were provided by ERA-40 for 1980-1987 and by the Cross-Calibrated Multi-Platform product (CCMP) [Atlas et al., 2011] for 1988-2010. With this forcing configuration, surface heat, momentum, and freshwater fluxes were calculated internally in ROMS using the bulk parameterizations of Liu et al. [1979] and Fairall et al. [1996aFairall et al. [ , 1996b. This approach is preferable to prescribing fluxes directly from an atmospheric model, as it allows the surface fluxes to adjust to local sea surface temperature in the model. The calculated fluxes were stored on the ROMS grid at 6 h frequency and then provided as forcing for subsequent ROMS runs (described in section 2.4) used in our analysis."}, {"section_title": "Climatological Forcing", "text": "Climatological forcing is typically constructed by computing mean monthly values from the entire study period, an approach that has been employed in sensitivity studies similar to ours [Di Lorenzo et al., 2005;Auad et al. 2006]. However, averaging wind stress over multiple years eliminates strong vertical transport events that are ubiquitous in EBUS, instead providing persistent weak winds that limit the ability of upwelling to reach deep in the water column. This model bias has been implicated in the underestimation of isopycnal displacement and chlorophyll concentration in a coastal upwelling system [Gruber et al., 2006]. To avoid this bias, we add submonthly variability from the year 1994 to the monthly surface forcing climatologies, an approach that has been applied previously in ocean modeling studies [e.g., Frischknecht et al., 2015]."}, {"section_title": "Model Runs", "text": "Five model runs form the core of our analysis (Table 1). A base run is forced with climatological wind stress, surface heat fluxes, and lateral boundary conditions. As expected, no trends emerge in the climatological run. Three other runs employ realistic surface wind stress, heat fluxes, and boundary conditions, respectively, while continuing to use climatology for the other two parameters. These runs are used to characterize the individual contributions of each forcing mechanism. Surface freshwater fluxes are varied in concert with heat fluxes (i.e., for any given run they are either both climatological or both realistic), though their contributions to trends of interest in this region are negligible [Auad et al., 2006]. Finally, the run forced by realistic surface wind stress, heat fluxes, and boundary conditions is used to characterize the combined response to all forcing mechanisms. In all cases, model output is stored as 8 day averages.    obtained from the World Ocean Database. In total, we use 3548 data points from the upper 200 m of the water column, taken from 389 unique casts. The California Cooperative Oceanic Fisheries Investigations (CalCOFI) program is the primary source of data. Density proves to be an extremely good predictor of nitrate concentration for our study, capturing 94% of the observed variance ( Figure S1 in the supporting information). However, we must also be wary of low-frequency variability in the nitrate model residuals, which may relate to the climate state [Kim and Miller, 2007]. To ensure that sensitivity of the nitrate model to the climate state is not a concern, we perform an ad hoc removal of low-frequency variability in the density-nitrate fit by subtracting a 12 month running mean of the model residuals ( Figure S1). Comparison of this analysis with that presented in the body of the paper indicates that low-frequency variability in the density-nitrate relationship tends to increase modeled nitrate flux trends slightly, consistent with increased nitrate in source waters [Rykaczewski and Dunne, 2010;Bograd et al., 2015] but not enough to impact our conclusions (Table 2). Vertical nitrate flux is calculated as follows: 1. Mixed layer depth (MLD) is estimated according to Kara et al. [2000], which first defines a reference density at the base of a well-mixed layer and then searches for the depth at which the density deviation from the reference equates to a temperature change of 0.8°C (allowing for variable salinity). The results presented here are not sensitive to the method used to choose the depth at which nitrate flux is calculated. For example, replacing the MLD with the isothermal layer depth, which defines the surface mixed layer based on temperature instead of density and is often much deeper [Kara et al., 2000], does not significantly alter our findings (Table 2). 2. Temperature, salinity, and vertical transport (W) are extracted from model output at the MLD. 3. Potential density at the MLD is calculated from temperature and salinity using the UNESCO [1983] polynomial."}, {"section_title": "Nitrate concentration [NO 3", "text": "À ] is calculated as a function of potential density (see above)."}, {"section_title": "Vertical nitrate flux is determined as", "text": ". 6. Regional time series of variables are created by horizontally integrating (vertical transport, nitrate flux) or averaging (nitrate concentration) over all grid cells within the study region (35-40°N, 0-50 km from shore)."}, {"section_title": "Model Evaluation", "text": "In Figure S3 we compare modeled transport, nitrate concentration, and nitrate flux with a version of the model that employs four-dimensional variational assimilation (4D-Var) to assimilate satellite sea surface height and temperature as well as in situ temperature and salinity measurements [Moore et al., 2013]. Nitrate concentration at the MLD is also compared with data from CalCOFI line 76.7 (~35°N), the northernmost routinely sampled line. Both the data-assimilative model and CalCOFI data indicate that nitrate at the MLD is biased high in the forward model; however, the trends in all three are very similar. Vertical transport and nitrate fluxes calculated from the data-assimilative model produce the same qualitative results as the forward model, and quantitative differences are minor. We also compare the magnitude of modeled nitrate flux with Messié et al. [2009], who used climatological nitrate concentrations and QuikSCAT winds for the period 1999-2008 to estimate mean vertical nitrate flux in the central CCS at 19.3 mmol s À1 per meter of coastline. Their estimate equates to a total flux of~12.2 kmol s À1 in our study region (~630 km coastline), considerably higher than our estimate of~6.2 kmol s À1 for the same period ( Figure 2). We attribute the difference to two sources: (i) Messié et al. do not take into account onshore ) are shown for the standard methodology, an analysis with low-frequency variability removed from the nitrate model ( Figure S1), and an analysis where the isothermal layer depth [Kara et al., 2000] is used in place of the MLD. Bold indicates trend significance greater than 95%."}, {"section_title": "Results", "text": "A strong upward trend in nitrate flux, amounting to an approximate doubling of upwelled nitrate off the central California coast from 1980 to 2010, is forced almost entirely by wind-driven upwelling intensification (Figure 2). These positive trends in upwelling and nitrate flux are consistent with observed sea surface cooling [García-Reyes and Largier, 2010] and increased phytoplankton stocks [Kahru et al., 2012] off the California coast in recent decades. The impact of stronger equatorward winds on nitrate flux is twofold. First, Ekman transport increases linearly with the magnitude of the wind stress, thereby increasing net vertical transport (Figure 2c). Second, more intense upwelling draws from deeper source waters, resulting in higher nitrate concentrations in upwelled waters (Figure 2f). In contrast, increased heating of the surface ocean does not influence vertical transport. Surface heat fluxes drive changes in nitrate flux through deepening and/or strengthening of the thermocline, which alters the source depth and nitrate content of upwelled waters. This effect is apparent in our results (Figure 2g), where increased surface heating drives a decline in the nitrate concentration of upwelled waters. However, this trend is of much weaker magnitude than that driven by the wind, and in fact, the two are not independent. Surface cooling associated with stronger upwelling actually facilitates Figure 2. Dependence of nitrate supply on forcing mechanisms. Twelve month running means and linear trends of (a) equatorward alongshore wind stress, (b) surface heat flux (positive is into the ocean), (c-e) vertical transport, (f-h) nitrate concentration at the base of the mixed layer, and (i-k) upward nitrate flux at the base of the mixed layer. Figures 2c-2k correspond to model runs described in Table 1. Linear trends (decade À1 ) for each time series are indicated in the lower right corner; bold indicates significance greater than 95%."}, {"section_title": "Discussion", "text": "Some of the trends reported here for 1980-2010 are in sharp contrast to prior decades. In the latter half of the twentieth century, the southern CCS experienced considerable surface warming, increased stratification, and "}]