[{"section_title": "Abstract", "text": "Introduction: Few high penetrance variants that explain risk in late-onset Alzheimer's disease (LOAD) families have been found. Methods: We performed genome-wide linkage and identity-by-descent (IBD) analyses on 41 non-Hispanic white families exhibiting likely dominant inheritance of LOAD, and having no mutations at known familial Alzheimer's disease (AD) loci, and a low burden of APOE ε4 alleles.\nResults: Two-point parametric linkage analysis identified 14 significantly linked regions, including three novel linkage regions for LOAD (5q32, 11q12.2-11q14.1, and 14q13.3), one of which replicates a genome-wide association LOAD locus, the MS4A6A-MS4A4E gene cluster at 11q12.2. Five of the 14 regions (3q25. 31, 4q34.1, 8q22.3, 11q12.2-14.1, and 19q13.41) are supported by strong multipoint results (logarithm of odds [LOD*] 1.5). Nonparametric multipoint analyses produced an additional significant locus at 14q32.2 (LOD* 5 4.18). The 1-LOD confidence interval for this region contains one gene, C14orf177, and the microRNA Mir_320, whereas IBD analyses None of the authors has a conflict of interest."}, {"section_title": "Background", "text": "Although more than two dozen loci that contribute to lateonset Alzheimer disease (LOAD) have been identified [1] , few genes with highly penetrant rare variants (e.g., APP, PSEN1, and PSEN2 in early-onset familial Alzheimer's disease [AD] [2] ) that explain risk in families heavily burdened with LOAD have been found. It is likely that rare variants contribute to complex disease, however [3] , and recent reports implicating rare variants in PLD3, APP, and TREM2 [4] [5] [6] [7] support their involvement in both sporadic and familial LOAD. Identification of additional rare mutations driving genetic risk in familial LOAD will help in defining new pathways for therapeutic and preventive treatments.\nLinkage analysis in large multiplex pedigrees is a robust approach for identifying disease loci in the presence of allelic heterogeneity, and thus can be valuable for targeting regions for sequencing studies [8] . To identify genomic regions likely to contain rare (minor allele frequency [MAF] 0.01) and low-frequency (0.01 MAF 0.05) LOAD risk and possibly protective genetic variants, a large number of well-characterized families were screened for inclusion in a linkage scan. The selected extended families are uniquely suited for discovery of genomic regions containing high penetrant AD variants. We performed extensive parametric two-point and nonparametric multipoint linkage analysis on 385 individuals in 41 non-Hispanic white (NHW) families. Loci identified through this study can help prioritize regions of the genome for analyses of whole-exome or whole-genome sequence data from NHW LOAD families or case-control cohorts."}, {"section_title": "Methods", "text": ""}, {"section_title": "Study samples", "text": "The 42 NHW families selected for linkage analyses are from five collections assembled by investigators at the University of Pennsylvania (eight families), the University of Miami (12 families), Case Western University (one family), the National Institute on Aging Late-Onset Alzheimer's Disease (NIALOAD) family study (17 families) , and the National Cell Repository for Alzheimer's Disease (four families). Detailed descriptions of the ascertainment and evaluation of subjects in these cohorts have been provided elsewhere [9] [10] [11] . To maximize the probability of detecting segregating novel rare variants, we developed several selection criteria including (1) having four or more affected individuals with genomic DNA samples; (2) exhibiting likely dominant inheritance of LOAD; (3) free of known mutations at established Alzheimer's Disease/ Frontotemporal Dementia Mendelian loci (APP, PSEN1, PSEN2, MAPT, or GRN); and (4) reduced representation of the APOE ε4 allele. Criterion number 4 included prioritized selection of families with APOE ε2/ε2, ε2/ε3, and ε3/ε3 affected individuals (requiring at least one affected family member without any APOE ε4 allele and any affected individuals with a single APOE ε4 must have age at onset [AAO] ,72). In the 41 NHW families ultimately analyzed, 385 individuals (3-11 cases per pedigree) had genotyping data available and were included in the present analyses. Of those families, 75.6% (31 of 41) have at least one autopsy confirmed LOAD case (Table 1) ."}, {"section_title": "Genotyping and quality control procedures", "text": "Genome-wide single-nucleotide polymorphism (SNP) genotyping was performed on several different platforms across the study cohorts, including the Illumina HumanHap550, Illumina 1M, HumanOmniExpress, HumanOmniExpress Exome, and HumanOmni2.5 arrays. A call rate threshold of 98% was applied, and the data were then merged to form a final linkage data set for analysis. SNPs were only included in the analysis if they were present in at least 60% of samples; 319,409 SNPs were selected for analysis and aligned to the Rutgers Map v.3 [12] . Among this group of SNPs, 26,959 were excluded because the MAF was less than 0.05 and/or the genotype distribution differed significantly (P , 10 26 in controls) from HardyWeinberg equilibrium. An additional 919 SNPs not present in the HapMap CEPH (Utah residents with ancestry from northern and western Europe) (CEU) data set were removed, reducing the number of SNPs available for analysis to 291,531 SNPs. More than three-fourths of these SNPs (77%; n 5 225,250 SNPs) were present in 90% of samples. Checks for relatedness, Mendelian inconsistencies, and gender based on X-chromosome heterozygosity were performed using PLINK [13] . One sample was dropped due to Mendelian inconsistencies, and one duplicate sample was removed. Principal components analysis using EIGEN-STRAT [14] identified a family clustering with African American HapMap samples ( Supplementary Fig.1 ). NIA-LOAD confirmed the family's African American ancestry through recontact with the ascertainment site. This family was removed from the analyses resulting in 41 families included in the linkage analyses reported here."}, {"section_title": "Statistical analyses", "text": "Autosomal and X-chromosome linkage analyses were performed using Merlin [15] and included parametric two-point affected individuals-only and age-dependent penetrance models and a nonparametric multipoint analysis. Parametric multipoint analysis was performed on significant overlapping regions between the families in this report and a companion analysis in Hispanics (Barral et al. [16] ). The package MINX (Merlin in X) was used for analysis of X-chromosome SNPs. Heterogeneity LOD (HLOD) models were applied to the two-point analyses to allow for detection of linkage in the presence of locus heterogeneity [17] . Whittemore and Halpern NPL-pair and NPL-all statistics [18] and Kong and Cox linear model logarithm of odds (LOD*) scores [19] were calculated for the nonparametric multipoint analysis.\nPower analyses using SIMLINK [20] on the 41 families in the linkage analysis, with a dominant model and disease allele frequency of 0.001, showed we have .80% power to generate an LOD .3 for a fully informative (a 5 1) age penetrance model with marker locus allele frequencies equal to 0.2 (MAXLOD 5 5.62) and 0.4 (MAXLOD 5 6.86). Using these same paramaters, the affected individuals-only model has .80% power to generate an LOD .2 with a marker locus frequency of 0.4 (MAXLOD 5 3.61) and 0.71% power to produce an LOD .2 with a marker locus frequency of 0.2 (MAXLOD 5 3.00). Using a heterogeneity model (a 5 0.5) reduced power to generate an LOD .2 to 41% and 18% for the age-penentrance and affected individualsonly models, respectively (Supplementary Table 1) .\nParameters for the parametric two-point models assumed dominant inheritance, a disease allele frequency of 0.001 and penetrances of 0.01, 0.90, and 0.90 (representing NN, NA, AA genotypes, respectively). Age-dependent penetrances used in the analysis are listed in Supplementary  Table 2 . Two-point parametric analysis used all SNPs for each of the analyses. The nonparametric multipoint scan included a linkage disequilibrium (LD)-pruned set of 119,555 SNPs common to all genotype platforms. LD pruning was done using the independent pairwise LD pruning option in PLINK (default settings). Mean distance between markers for the set of nonparametric multipoint markers is 4.55 cM. As some pedigrees were too large for MERLIN to perform nonparametric linkage analysis, uninformative family members (based on an individual's position in the pedigree and/or absence of genotyping) were trimmed before performing analyses using the program PowerTrim [21] . Allele frequencies for all SNPs were based on CEU HapMap data [22] .\nA significance threshold of HLOD 3.5 was set for the parametric two-point linkage scans taking into account testing of two separate parametric models. This is above the Lander and Kruglyak [23] recommendations for significance (LOD 3.3; P value 5 4.9 ! 10"}, {"section_title": "25", "text": ") in LOD score analyses of dense marker genome-wide linkage scans and approximates a level suggested by Camp and Farnham [24] for testing of two independent two-point models. Multipoint significant and suggestive linkage thresholds were defined by LOD 3.60, P 5 2.2 ! 10 25 and LOD 2.20, P 5 7.4 ! 10"}, {"section_title": "24", "text": ", respectively [23] . Linkage regions were considered independent if the locations of their peak HLOD or LOD* scores were separated by .20 cM. Linkage peaks were considered concordant with previous linkage peaks or linkage peaks reported in the companion Hispanic linkage analysis (Barral et al. [16] ), if they were 10 cM apart.\nFollow-up analyses of significant multipoint results included haplotype segregation analysis and examination of overlapping identity-by-descent (IBD) sharing segments for families with a maximized within family LOD 0.59, corresponding to a nominal P value of 0.05, and 100% IBD sharing among all affected individuals in the family. IBD segments were determined by estimating haplotypes in MERLIN followed by identification of IBD sharing regions using Olorin [25] ."}, {"section_title": "Results", "text": ""}, {"section_title": "Data set characteristics", "text": "The selected families have an average of eight affected individuals (range: [4] [5] [6] [7] [8] [9] [10] [11] [12] [13] [14] , with an average of five genotyped affected individuals per family (range: 3-11; Table 1 ). Mean AAO in affected individuals was 75 6 9.04, compared to a mean age of unaffected individuals at last evaluation of 66 6 12.29. APOE ε2, ε3, and ε4 frequency in affected individuals (genotyped and ungenotyped) was 3%, 70%, and 27%, respectively. This compares to an ε4 frequency of 38% in NHW LOAD individuals and 14% for controls [26] , confirming the selection of LOAD families with reduced representation of the APOE ε4 allele. APOE genotype frequencies for affected individuals were ε2/ ε2 5 0.5%, ε2/ε3 5 4.1%, ε2/ε4 5 0.9%, ε3/ε3 5 43.2%, ε3/ε4 5 48.6%, and ε4/ε4 5 2.7%."}, {"section_title": "Linkage results", "text": "Two-point parametric linkage analysis identified 24 SNPs across 14 autosomal regions surpassing a significance level of HLOD 3.5 (P value 5 3 ! 10 25 ) ( As expected based on the family selection criteria for exclusion of clustering of affected subjects who were predominantly APOE ε4, we did not observe linkage to the APOE locus. Age-dependent penetrance HLOD scores were generally lower than our affected individuals-only HLOD scores. Most SNPs generated HLOD scores with alpha values equal to 1.0, suggesting modest contributions to individual loci by each family. No significant results were observed for the overall analyses on the X-chromosome; however, two families had nominally significant LOD scores of 1.39 and 1.14 at Xq28 (rs5963398), the location of the highest HLOD score on the X-chromosome (HLOD 5 2.07).\nNonparametric multipoint analyses identified an additional significant region at 14q32.2 (LOD* 5 4.18; Fig. 2 Table 3 for the 1-LOD region and genes within this region. No significant multipoint results were observed on the X-chromosome."}, {"section_title": "Localization of region at 14q32.2", "text": "The resulting 1-LOD region [17] microRNA (miRNA), Mir_320 according to the University of California, Santa Cruz Genes Track [30] . The pseudogene ribosomal protein L3 psudeogene 4 (RPL3P4) also locates to this segment according to the Gencode database (version 19) [31] . Linked pedigree IBD sharing analyses among the four nominally significantly linked pedigrees (LOD* 0.59) isolated a 0.40-Mbp segment containing one gene, BCL11B, located just outside the 1-LOD region, and Mir_320 (Fig. 2) . Haplotype segregation of these four pedigrees illustrated using the software program Progeny (Progeny Software LLC, Delray Beach, FL; www.progenygenetics.com) is shown in Supplementary Figs. 2-5. Merlin software was used for haplotype construction and inference."}, {"section_title": "Discussion", "text": "We report 14 significant two-point linkage regions (HLOD 3.5), and one significant multipoint region (LOD* 3.6) identified by analysis of 41 multiplex LOAD families that were selected on the basis of the absence of variants at known risk loci, apparent dominant inheritance of disease, and little evidence for association of LOAD with the APOE ε4 allele. Five of the 14 two-point regions are supported by multipoint results within a 1-LOD unit confidence interval with a minimum LOD* 1.5 (3q25.31, 4q34.1, 8q22.3, 11q12.2-14.1, and 19q13.41). The finding of numerous significantly linked loci instead of a few shared loci suggests that there is substantial locus heterogeneity within familial LOAD.\nThree of the 14 two-point loci are novel linkage regions for LOAD (5q32, 11q12.2-11q14.1, and 14q13.3) . The 11 other loci overlap previously reported LOAD regions including five significant loci (3q25.31, 7p21.2, 9p22.1, 11q12.2-11q14.1, and 19q13.41) also showing significant linkage (two-point HLOD 3.3, multipoint LOD* 3.6) or association (P 5 ! 10 28 ) in at least one previous report (Table 2 ). These include two loci reported in the largest LOAD genome-wide association study to date, namely the 11q12.2-11q14.1 locus which overlaps the MS4A6A-MS4A4E association region and the 19q13.41 locus which contains CD33 [1] . One additional GWAS locus (CR1 at 1q32.2) is near a significantly linked marker at 1q32.3. A check of our linked SNPs in these regions for association with LOAD in the International Genomics of Alzheimer's Project GWAS summary statistics found no significant associations after correction for multiple testing (P 5 ! 10 28 ; Supplementary Table 4) [1] . The 7p21.2 and 9p22.1 loci replicate significant linkage from reports that contain families used in the present analyses ( Table 2 ). The number of pedigree members and the phenotypes and genotypes from the previous reports have been continuously expanded and updated since their previous linkage reports, however, and these updates are most likely increasing power to localize linkage in this current report.\nThe locus at 14q32.2 is arguably our most robust result given its significant multipoint LOD* score supported by suggestive two-point scores. This locus is a considerable distance (w33 cM) from the PSEN1 locus at 14q24. Suggestive linkage (two-point LOD 5 2.60) has been reported at 14q32 in an AAO linkage analysis in Hispanic LOAD families [32] . The 1-LOD limit identified a region 0.78 Mbp in length containing C14orf177 and Mir_320, both of which have some support for involvement in dementia-related disease and processes. C14orf177 for instance, has been associated with risk for amyotrophic lateral sclerosis [33] and lipoprotein cholesterol levels [34] , whereas members of the mir-320 miRNA family are significantly altered in sporadic AD brains [35] and associated with both neurite outgrowth [36] and neurodegeneration [37] . Evidence for genomic features with regulatory potential such as several expressed sequence tags and long non-coding RNAs also exists in the region (based on UCSC genome browser data) [30] , including one lincRNA in particular, TCONS_12_ 00008237, which is highly expressed in brain [38, 39] .\nThe region narrowed by IBD analysis in the subset of pedigrees most likely to be linked to 14q32.2 also includes BCL11B, which is a transcription factor and regulator of brain-derived neurotrophic factor (BDNF) signaling [40] , a pathway associated with pathogenesis of several neurodegenerative diseases, including LOAD [41] . BCL11B is predominantly expressed in striatal neurons and may play an important role in adult neurogenesis [42] , a process that when dysregulated may lead to AD [43] . BCL11B is thought to primarily reduce BDNF signaling [40] , consistent with observations that BDNF serum and expression levels are decreased in AD [41, 44, 45] and high BDNF levels protect against AD [46, 47] . A recent neuroimaging study implicated a role for BDNF in cognitive decline in LOAD patients [48] , although AD genetic association studies of BDNF yielded conflicting results [44, 49] . Finally, it has been suggested that BDNF-based drugs might be effective therapies for AD and other neurodegenerative diseases [50] , with targeting of BCL11B interactions with BDNF even being suggested as a feasible therapeutic approach to elevate BDNF signaling in neurodegenerative drug development [40] .\nThe accompanying study in Caribbean Hispanics by Barral et al. [16] found strong evidence for linkage and association near one of our significant loci, 11q12.2-11q14.1. As noted previously, the chromosome 11q12.2-11q14.1 locus is also a significant LOAD GWAS locus from Lambert et al. [1] . Parametric affected individualsonly analysis of this region produced a multipoint peak LOD* of 1.18. An alpha of 0.17 suggests that only a small number of pedigrees are potentially segregating a variant in this region. A combined association and linkage analysis of all markers in this region using CAPL [51] produced no suggestive or significantly associated SNPs (data not shown). One possible explanation for this finding is lack of power for combined linkage and association analysis using these data. Several other significant loci from the Barral et Supplementary Table 5 ). The 3q22.3 region was previously reported as a potential locus for LOAD in a linkage study of a family containing four relatives with LOAD but without tau pathology (LOD 5 4.1) [52] and in a genomewide linkage study of Dutch families (LOD 5 4.3; HLOD 5 4.4) [53] .\nIn summary, we report 15 significant regions for linkage, including novel evidence for linkage at 5q32, 11q12.2-11q14.1, and 14q13.3. Several of our regions overlap significant loci from previous LOAD analyses, including GWAS regions at MS4A6A-MS4A4E and CD33. Our strong multipoint result at 14q32.2 is particularly interesting, as it localizes to a region with a limited amount number of genomic candidates, most with plausible links to dementia-related processes and disease.\nThe 41 families included in these analyses are undergoing whole-genome sequencing (WGS) as part of the National Institute of Health's Alzheimer's Disease Sequencing Project (ADSP) [54] . ADSP WGS variants located in these linkage regions will be primary candidates for examination as contributing to risk or protection for LOAD. Analyses planned by the ADSP to identify these variants include (1) combined linkage and association analyses, and (2) filtering for rare, damaging variants in shared familial segments. An ADSP replication phase will follow to confirm and validate candidate loci from the discovery phase. data for these analyses. The investigators within IGAP contributed to the design and implementation of IGAP and/or provided data but did not participate in analysis or writing of this report. IGAP was made possible by the generous participation of the control subjects, the patients, and their families.\nThe i-Select chips were funded by the French National Foundation on Alzheimer's disease and related disorders. EADI was supported by the Labex (laboratory of excellence program investment for the future) DISTALZ grant, Inserm, Institut Pasteur de Lille, Universit e de Lille 2, and the Lille University Hospital. GERAD was supported by the Medical Research Council (grant 503480), Alzheimer's Research UK (grant 503176), the Wellcome Trust (grant 082604/2/07/Z), and German Federal Ministry of Education and Research (BMBF): Competence Network Dementia (CND) grant 01GI0102, 01GI0711, 01GI0420. CHARGE was partly supported by the NIH/NIA grant R01 AG033193 and the NIA AG081220 and AGES contract N01-AG-12100, the NHLBI grant R01 HL105756, the Icelandic Heart Association, and the Erasmus Medical Center and Erasmus University. ADGC was supported by the NIH/NIA grants U01 AG032984, U24 AG021886, U01 AG016976, and the Alzheimer's Association grant ADGC-10-196728. Data sharing: All data from the analyses in this article, including quality control documentation, GWAS array data and phenotype data for each family, and linkage analyses results, are available for download at the National Institute on Aging Genetics of Alzheimer's Disease Data Storage Site's ADSP Web site (https://www.niagads.org/adsp/content/ home). Applicants must submit a data access request to dbGaP. Applications are reviewed by the ADSP Data Access Committee (DAC) and the NIAGADS Data Use Committee (DUC). ADSP data sharing agreement: ADSP phenotype and sequence data are made available to the research community at large in keeping with the NIH Genomics Data Sharing Policy http://gds.nih.gov/. NIA has established the National Institute on Aging Genetics of Alzheimer's Disease Data Storage Site (NIAGADS) as a national genetics data repository to facilitate access by qualified investigators to genotypic and phenotypic data for the study of the genetics of late-onset Alzheimer's disease. NIAGADS is working in partnership with dbGaP (ADSP at dbGaP) to provide ADSP data to the research community. Data can be requested either from dbGaP or NIAGADS. Instructions for application for ADSP data and an explanation of the review process can be found at: ADSP at dbGaP and NIAGADS ADSP Application Instructions. The ADSP has in place a memorandum of understanding: https://www.niagads.org/sites/all/public_files/ADSPdocs/ ADSP-MOU.pdf. In the spirit of the clear benefit that ensues from converting such data sets into community resources as rapidly as possible, and in keeping with community expectations for the use of unpublished genome sequence data, it is expected for the first phase of the study called the Discovery Phase, that users of the data will withhold publication until the producers of the data have published their findings. ADSP participants will publish their data in an expeditious fashion in at least one major article reporting the results of the ADSP to be jointly submitted by all the members."}, {"section_title": "Supplementary data", "text": "Supplementary data related to this article can be found at http://dx.doi.org/10.1016/j.jalz.2015.05.020."}, {"section_title": "RESEARCH IN CONTEXT", "text": "1. Systematic review: PubMed and Google Scholar were used to search for articles related to genetic linkage and genetic association analyses of Alzheimer's disease (AD). In addition, we searched for literature relating our significant loci to AD and neurodegeneration through a search of each significant chromosomal band (and gene features from the significant multipoint result) and the terms \"Alzheimer's\" and \"Neurodegeneration.\" Relevant research relating our significant loci to Alzheimer's or neurodegeneration is cited.\n2. Interpretation: These findings pinpoint several novel genomic regions linked to increased risk of familial AD, including a region on 14q32.2 containing a gene that regulates brain-derived neurotrophic signaling and the 11q12.2 region previously linked to AD through large genome-wide association analyses of late-onset Alzheimer's disease (LOAD).\n3. Future directions: Identification of these loci as linked to familial AD provides an exciting opportunity to identify causal variants for LOAD through prioritization of these regions for analyses in forthcoming whole-genome sequencing."}]