[{"section_title": "Introduction", "text": "Farm income is highly variable due to exogenous risks associated with agricultural production such as random weather, pests and diseases, and price volatility. In the United States, a number of government programs are in place to insulate farmers against these risks, to promote the conservation of natural resources, and to improve the welfare of farm households. These programs include crop insurance for selected crops, gross margin insurance for dairy cattle, and safety-net programs for covered commodities (e.g., Price Loss Coverage (PLC), Agricultural Risk Coverage (ARC), and Margin Protection Program for Dairy (MPP-D) which was renamed Dairy Margin Coverage in the 2018 Farm Bill). Within this framework, farmers make decisions and implement strategies to mitigate risks and reduce income volatility such as using futures and options markets as well as savings to finance production (Mishra and Paudel, 2011) or engaging in agritourism (Khanal and Mishra, 2014). Another strategy to alleviate farm household income volatility and potentially boost total income is to engage in off-farm work. 1 The amount of time farm households devote to off-farm work has been increasing, and off-farm work has become the major source of income for most farm households (Ahearn et al., 2006). Only 11% of U.S. farm households worked at least 100 days per year off-farm in 1930 (Smith 2002). That increased to 62% in 1974 and 83% in 1992 (Mishra and Goodwin, 1997). In 1999, average off-farm income accounted for approximately 90% of average farm household income, up from 59% in 1973 (Mishra and Sandretto, 2002). It peaked at 95% in 2000 and is projected to account for 80% of average farm household income in 2017 (Schnepf, 2017). Figure 1 shows that off-farm income has grown relative to farm income between 1960 and 2019. While off-farm income can be a significant source of cash which can then be used in altering and improving a farm's scale and input mix, a major disadvantage of working offfarm is that when the farm household (principal operator and spouse) reallocates time from on-farm to off-farm work, the opportunity cost is time to manage the farm. This time reallocation potentially changes management practices and effectiveness and differences in productivity across firms and countries lie largely in variations in management practices (Bloom et al., 2013). With less time on the farm, production decisions may then be based on less information, which could result in technical inefficiency (Kumbhakar et al., 1989;Chang and Mishra, 2013). The additional income obtained from off-farm work also has potential to further adversely affect technical efficiency (TE) by changing the farm household's work ethic and performance. A number of prior studies examine TE of U.S. dairies. Among these, Kumbhakar et al. (1989) include an off-farm income variable, Mayen et al. (2010) and Chang and Mishra, (2013) include an off-farm work variable, and Cabrera et al. (2010) include a family labor variable. Each of these studies finds a negative impact of off-farm income or off-farm work on TE. The objective of this study is to contribute to the literature on the impact of off-farm work on TE of U.S. dairies. Our hypothesis implied by utility maximization is that there is an inverse relationship between an increase in off-farm work and TE. We use stochastic frontier analysis (SFA), a single-step estimation procedure, to conduct empirical tests of the hypothesis. We reduce the chance of omitted variable bias and improve upon prior literature by including all production inputs and using a nationally-representative sample in each test. We heed Sauer et al.'s (2006) recommendation of checking for theoretical consistency when choosing functional form. Additionally, we examine the impact of off-farm work by the operator and the spouse separately, and we examine differences in TE, off-farm work hours, and off-farm income by dairy size to disentangle the impacts of off-farm work from economies of scale. Understanding the relationship between off-farm work and TE is vital given the upward trend in farm households' off-farm labor supply and the necessity of maintaining high TE on U.S. farms for them to be profitable and competitive in the global market (Murova and Chidmi, 2013). Costs can decrease when efficiency improves (Mosheim and Lovell, 2009), and small farms' higher production costs are often caused by inefficiency rather than by inadequate technology (Tauer and Mishra, 2006). Further, TE is a necessary condition for economic efficiency (Kirkley et al., 1998). The relationship between off-farm work and TE may have policy implications. For example, Goodwin (1997), El-Osta et al. (2004), and Ahearn et al. (2006) find that income support payments decrease offfarm labor. Consequently, policy instruments (e.g., government payments) may be designed to prevent farm households from having to rely on off-farm income if a decrease in off-farm labor is associated with an increase in TE. Alternative policies aimed to increase TE may include support for investment or adoption of advanced technologies. Our theoretical analysis provides an unambiguous hypothesis that an increase in farm household off-farm work should decrease TE. Our hypothesis is generally supported by the empirical results using two data sets from national cross-sectional surveys. They show that an increase in the farm household's off-farm work is associated with an increase in technical inefficiency. Results remain robust when we use different measures of off-farm work, but evidence is stronger with the more recent data. Further, there is a statistically significant difference in mean TE between small and large farms and between medium and large farms. Small farms are associated with higher off-farm work and have lower TE which implies that less off-farm work by households with larger farms is at least partially responsible for the evidence of economies of scale in the U.S. dairy industry. The rest of the paper is organized as follows. In the first section we present the theory of the farm household's tripartite decision on time allocation as the farm household seeks to maximize utility subject to time and budget constraints. In the same section, we derive the theoretical hypothesis that an increase in off-farm work negatively impacts TE. This is followed by development of the empirical model used to examine the impact of an increase in off-farm work on TE. Data is presented in the subsequent section. We next discuss empirical results and their implications, and the final section concludes."}, {"section_title": "Theoretical Framework", "text": "The farm household's decision on time allocation is tripartite: work on-farm, work off-farm, and leisure (Ahearn et al., 2006;Chang et al., 2012). We assume that the farm household is a homogeneous 2 price taking unit and solves the following utility (U) maximization problem subject to time and budget constraints and existing production technology: (1) ( ) subject to: (2) , where is the total time endowment for the farm household; , , and are time allocated by the farm household to on-farm work, off-farm work, and leisure, respectively; is the price of an aggregate consumption good; is the quantity of the consumption good; is a column vector of prices for farm inputs other than household on-farm work; is a column 2 Prior research has documented that the quality of farm household labor is heterogeneous and that the principal operator's and spouse's supply decisions for off-farm work are jointly determined (e.g., Huffman and Lange 1989;Abdulai and Delgado 1999;Chang, He, and Saeliw 2017). For simplicity, we treat the quality of labor as homogeneous both in the theoretical model and the empirical implementation. Heterogeneity of labor and joint determination of off-farm labor decisions do not alter the theoretical implication that an increase in off-farm work negatively impacts TE, and maintaining the homogeneity assumption facilitates empirical testing of the hypothesis. vector of corresponding farm input quantities ; is the off-farm wage rate; is farm output price; is farm output quantity; C is other farm household income such as government payments and non-farm investment income; and is a measure of technical inefficiency. Equations (2), (3) and (4) denote the time constraint, budget constraint, and farm production technology, respectively. We make the following additional assumptions: a) The utility function is twice continuously differentiable and strictly quasi-concave which implies that the indifference curves are strictly convex. b) The production function is twice continuously differentiable and strictly concave in labor inputs which indicates positive marginal product and diminishing returns in the labor inputs. c) The farm household allocates its total time endowment such that optimal time allocation is achieved when the marginal values of time allocated to each of the three options are equal. d) Consistent with prior literature (Kwon et al., 2006, Lien et al., 2010, family and hired labor are heterogeneous and imperfect substitutes. Schultz (1999) attributes the imperfect substitution of these two labor inputs to differences in skills, experience, and incentives. e) For the purpose of our objective, there are no constraints on off-farm work opportunities. 3 We present the theoretical framework for the farm household's labor supply decision following developments in labor economics by Chang et al. (2012). The utility function in equation 1can be re-written as: where is total household income (on-farm net revenue + off-farm wages + other income). Substituting equation 6into equation 5, we have The first-order conditions with respect to and , respectively, are where ( ) is the marginal product of the household's on-farm labor, ( ) , and Using equation 3or equation 6as the budget constraint yields the same first-order conditions, and I in equation 6is equivalent to Q in equation 3with all prices normalized by . Equation 8shows that the farm household supplies on-farm labor as long as its marginal value product is at least as high as the off-farm wage rate, i.e., until marginal returns from on-farm work is equal to marginal returns from off-farm work. Equation 9shows that the farm household maximizes its utility when its marginal rate of substitution of leisure for income is also equal to the off-farm wage rate. Therefore, the tripartite decision the farm household has to make is choosing optimal and which we denote as . Once and are found using equations (8) and (9), can be computed using equation 2given the farm household's total labor endowment L. After determining optimal , optimal output can be calculated using equation 4. Then using known prices, the on-farm and off-farm income components of equation (6) can be determined. Assuming that C is known, optimal farm household income can be calculated using equation (6). Since the opportunity cost of off-farm work is time to manage on-farm production, we expect to be less than zero. With leisure held constant, that implies that is greater than zero, so an increase in off-farm work is expected to increase technical inefficiency and decrease TE. To show theoretically that under utility maximization, we perform comparative statics by taking total differentials of equations (8) and (9). To minimize notational clutter, we redefine the following terms: ( ) is f; and ( ) is U. Thus, equations (8) and (9) become: . From the total differentials of (8a) and (9a), we obtain the following Hessian: For maximum utility, the Hessian determinants and signs are: Including the total differentials with respect to we obtain the system of equations: Therefore, Thus, our theoretical hypothesis is unambiguously signed. 4"}, {"section_title": "Empirical Approach", "text": "Due to random factors such as weather, disease, and other exogenous random forces, agricultural output is frequently treated as stochastic (Reinhard et al., 1999). Consequently, we respecify equation 4as a stochastic production frontier (Aigner et al., 1977, Meeusen andvan den Broeck, 1977): where i indexes the farm; is a vector of parameters to be estimated; is a random noise stochastic term that can increase or decrease output; is a nonnegative stochastic inefficiency term (similar to equation 4); is the error term. Technical efficiency for the ith farm (TE i ) is defined as: That is, is the ratio of the observed output to feasible output on the production frontier and , where 1 means the farm is technically efficient. We empirically examine the impact of off-farm work on TE with SFA and use equation 14with the production function specified as a Cobb-Douglas (CD) form. 5 The functional forms most often used in SFA studies are the Translog (TL) (e.g., Kirkleyet al., 1998;Battese et al., 2000; McBride, 2014; Key and Sneeringer, 2014) and the Cobb-Douglas (e.g., Battese and Coelli, 1995;Ahmad and Bravo-Ureta, 1996;Mayen et al., 2010). Since the CD is nested in the TL cost of on-farm work, our theoretical conclusion about the negative impact of off-farm work on technical efficiency is conditioned on the use of the true opportunity cost of on-farm labor rather than the off-farm wage rate. 5 The other method commonly used to examine TE is Data Development Analysis (DEA). The main differences between DEA and SFA are that: (a) DEA is a deterministic method while SFA is a stochastic method which allows for statistical noise, and (b) DEA is nonparametric while SFA is parametric and requires specification of a functional form. Murova and Chidmi (2013) compare these two methods in their analysis of TE of U.S. dairies and federal government programs using 2005 ARMS survey data. They find that both methods produce similar results for most of the variables considered. Battese et al. (2000) note that determining which method dominates the other is impossible because the true level of efficiency is unknown. Thus, which method to use is partly an empirical question and partly determined by the available data and research objective. We use SFA due to its convenience and ability to estimate both the production technology and inefficiency in a single-step estimation. production function, we apply the likelihood ratio test to check whether it is rejected in favor of the TL. As is often the case, the CD is rejected in favor of the TL production function at the 1% significance level. 6 However, theoretical consistency tests for the TL estimates, as recommended in Sauer et al (2006), fail the quasi-concavity test. Thus, we choose theoretical consistency over flexibility and revert to the less flexible but globally well-behaved CD. 7 (17) where includes milk cows, feed, farm labor, land, farm capital and an index of other farm inputs; represents regional fixed effects to control for unobserved regional effects; 8 and the technical inefficiency effects are defined as: where off-farm work, , is represented in three separate models, respectively, by ln(off-farm hours), ln(off-farm income), or two indicator variables equal to one for off-farm work by the principal operator or spouse, respectively. In each model m =2. 9 are factors found in prior literature as important determinants of TE. These factors may impact the farm household's ability to achieve the maximum possible output (i.e., to produce at the frontier) given a set of inputs. Human capital theory asserts that age, education, and experience can each affect TE (Huffman, 1981) as can specific management practices (Bloom et al., 2013). In our model, includes the farm household and farm characteristics of education levels of principal operator and spouse (college education indicator variables), logarithms of principal operator age and principal operator dairy experience (Mayen et al., 2010;Key and McBride, 2014), the squared values of the age and experience variables, and an environmental variable (Key and Sneeringer, 2014). 10 It also includes the farm management indicator variables of using a computerized milking system, milking more frequently than twice per day, using a nutritionist, using regularly scheduled veterinary service, having automatic takeoffs (Chang and Mishra, 2013), and using recombinant bovine somatotropin (rbST) (Mayen et al., 2010). The SFA standard assumptions on and are: , -, - and correlation between and is assumed to be zero (Coelli et al. 2005;Mayen et al., 2010). With additional distributional assumptions about the error terms, and letting ( ), the loglikelihood function for equation 15is: ( ) is the standard normal cumulative distribution function. From estimation of equation 17we are able to determine . To obtain the inefficiency component we calculate the conditional mean (Jondrow et al., 1982): . Similar to prior literature (Key and Sneeringer, 2014), we estimate equation 17using the single-step approach where we incorporate variables from equation (18) directlyinto the estimation equation 17. Also following prior literature (Lien et al., 2010;Key and Sneeringer, 2014), all logged variables are standardized to have means of zero (i.e., each observation for the variable is divided by its geometric mean) so that the estimated input coefficients (linear terms) can be interpreted as output elasticities evaluated at the sample means. To account for zero values for our logarithmic off-farm work measures, we follow Battese's (1997) approach of adding a 1 when the variable is zero and a corresponding dummy variable with a value of 0 when the variable is 0 and 1 otherwise. Our parameter of interest is in equation 18. A positive sign for this parameter implies that an increase in off-farm work increases inefficiency. As we hypothesized in the theoretical section, we expect a positive sign for , i.e., a negative impact of an increase in off-farm work on TE. There are several reasonable ways to measure off-farm work. For our base model, we use total farm household off-farm hours worked. This directly measures the amount of time supplied by the farm household (both principal operator and spouse) to off-farm work. As robustness checks, we use two other measures of off-farm work in separate estimations. Following El-Osta et al., 2008, we use the farm household's off-farm income. The correlation between the farm household's off-farm income and off-farm hours worked is 0.73. Second, we use two indicator variables with the first equal to one if the principal operator worked off-farm and the second equal to one if the spouse worked off-farm. This enables us to determine how each household member's off-farm work affects the farm's TE. Because dairies exhibit considerable economies of scale (Mosheim and Lovell, 2009), we also examine differences in TE, off-farm work hours, and off-farm income by dairy size to disentangle the impacts of off-farm work from economies of scale. If a significant negative difference in off-farm labor supply is accompanied by a significant positive difference in TE for larger farm sizes, it would imply that less off-farm work is at least partially responsible for the evidence of economies of scale."}, {"section_title": "Data", "text": "We use the 2010 and 2005 Phase III Agricultural Resource Management Survey (ARMS) Dairy Costs and Returns Report data collected by the U.S. Department of Agriculture as two cross-sectional data sets for our analysis. 11 The data were collected from dairy production states using a probability-based survey in which farms were randomly selected from groups of dairy farms stratified by value of sales. 12 Some prior studies using ARMS data weight observations in order to deal with the stratification (e.g., Ahearn et al., 2006;El-Osta et al., 2008;Mosheim and Lovell, 2009;Mayen et al., 2010), but others do not (e.g., Goodwin and Mishra, 2004;Paul et al., 2004;Chang and Mishra, 2013;Key and Sneeringer, 2014). Dubman (2000) argues that stratification weights should be used if inferences for the population are to be drawn and he suggests bootstrapping or jackknifing techniques that can be used in the weighting process. He acknowledges that there are cases where weights may distort the estimates and, as an example, notes that a regression with both small and large farms would be dominated by the high weights of small farms and could distort conclusions for large farms. Alternatively, Paul et al. (2004) argue that each observation from the stratified sample can be interpreted as an aggregate in the same sense that state-level data are aggregates and this allows use of classical methods in statistical estimation without the need for stratification weights. Since we include both small and large farms in most models, we do not weight the data. Data collected in the ARMS include farm and operator characteristics, input and output quantities, output revenue, costs of production by input category, marketing and management practices, and production technology. The complete 2010 sample includes a total of 1,915 observations. We drop organic operations and firms converting to organic. Production technology for organic operations is distinct from that of conventional dairies and 11 Ninety-two dairies surveyed in 2005 were also included in the 2010 survey. By linking these dairies, we were able to create a small panel data set with 184 observations. Unfortunately, it was not representative of either survey. With the exception of two variables, its data means all lay outside the range of the 2005 and 2010 cross-sectional data means. The dairies were considerably larger with much less off-farm work and had considerably lower standard deviations in most off-farm work variables. they contribute a relatively small share to total production (Mayen et al., 2010;Key and Sneeringer, 2014). This leaves us with 1,318 observations. Since our focus is on dairy production, we remove farms which reported that the majority of their total gross sale value was not from milk or dairy products. Additional data cleaning, i.e., removing incomplete observations and those with unreasonable values, resulted in 1,214 usable observations for conventional dairies. 13 The 2005 sample includes a total of 1,814 observations from which we obtained 1,351 usable observations for conventional dairies. Although the sampled dairies also produce non-dairy commodities, the output in the production function is quantity of milk produced. Stochastic production frontiers are not suitable for multiple outputs, so one option would have been to use total value of all output as the output measure (e.g., Battese and Coelli, 1995). However, we include milk as the only output for four reasons: a) Milk represents 89% (standard deviation = 7.6%) of the total value of production for the operations in the 2010 sample (89% with sd = 8.4% in the 2005 sample). b) All our input measures in the production function (milk cows, feed, labor, land, capital, and other inputs) are exclusively for dairy production. c) Our focus in this study is on the impact of off-farm work on TE of dairies. Given the high degree of specialization of most farms in our sample, it is plausible that their management practices for the other non-dairy products might not be the best possible. Hence, including the non-dairy output might result in lower TE not because of off-farm work but rather because of poorer management practices for the non-dairy outputs which are not the core business of these farms. In addition to the statistics reported in table 1, the average percent of total on-farm hours of labor provided by the farm household in 2010 was 28%; 387 operations (32%) had one operator involved in making the day-to-day decisions for the operation, and 612 (50%) had two operators involved in the day-to-day decisions. For principal operators who were married (1,061), 470 spouses (44%) were involved in the day-to-day decisions for the operation. Including both principal operators and spouses who worked off-farm, 419 households (34%) had someone who worked off-farm which implies that 68 farm households had both the principal operator and spouse working off-farm."}, {"section_title": "Results and Discussion", "text": "Results of the stochastic production frontier analysis, equations (17) and (18), estimated with the 2010 data set are presented in table 2. We present the base model parameter estimates, with farm household off-farm hours worked as our variable of interest, as model 1 in column 1. Estimates for the robustness checks where we replace off-farm hours with off-farm income or with two indicator variables for off-farm work by principal operator and by spouse are reported as models 2 and 3, respectively. From the base model (model 1) results, the off-farm work parameter estimate is positive and statistically significant at the 0.05 level. This implies that an increase in off-farm work by the farm household is associated with an increase in inefficiency which means a decrease in TE. This finding remains robust (statistically significant at the 0.01 level) when we use farm household off-farm income as a measure of off-farm work (model 2). Estimates using indicator variables (model 3) for off-farm work of the farm household are positive and statistically significant for the spouse and positive but insignificant for the principal operator. Thus, farm households with spouses who worked off-farm had a lower TE than farm households where the spouse did not work off-farm. Given that 44% of the spouses were involved in day-to-day decision making of the farming operation, this finding highlights the importance of the spousal role in ensuring high TE of the dairy. The consistently estimated negative impact of an increase in off-farm work by the farm household on TE supports our theoretical hypothesis. Thus, although working off-farm allows the farm household to add stable and supplementary income which can potentially be invested in dairy production, the time forgone in managing the dairy operation by the farm household is detrimental to TE. Analyzing parameter estimates for the six inputs from the base model (model 1), four inputs (milk cows, feed, labor, and other inputs) have a positive and statistically significant impact on milk production. Their elasticities are 0.74, 0.17, 0.03, and 0.11, respectively, and vary little across models. Although the parameter estimate on capital is positive, its impact is insignificant. Thus, unless the number of milk cows, quantity of feed, labor, or other inputs are simultaneously increased with capital, this finding implies that increasing capital does not independently increase output. Land has a negative and statistically significant impact with an elasticity of -0.02. This could be due to the fact that when cows graze pasture, milk production is lower than when they are fed an unrestricted diet of concentrate and roughage in confinement. 14 The sum of elasticities is 1.047and imply slightly increasing returns to scale, consistent with other literature on the dairy industry (Melhim and Shumway, 2011). Results for milk cows, feed, and other inputs are consistent with findings from prior studies using similar but earlier data (Key and Sneeringer, 2014;Mayen et al., 2010). Among the farm household and farm characteristic impacts on TE, we find that operator age has a positive and statistically significant impact on inefficiency across all models. These estimates indicate that younger farmers are more technically efficient than older farmers. Although operator dairy experience has the expected negative sign in all models, it is statistically insignificant. Similarly, estimates for the indicator variable of principal operator college education are negative, as expected, but insignificant in all models. Consistent with Key and Sneeringer's (2014) finding, THI is positive and statistically significant. For the management impacts on TE, using a computerized milking system, milking more than twice a day, using the services of a nutritionist, having scheduled veterinary service, and using automatic takeoffs are all significantly associated with inefficiency reduction. The significant negative results are consistent across all models, and the parameter magnitudes vary only a little. Although the estimate for rbST is negative, it is insignificant. Results of the stochastic production frontier analysis estimated with the 2005 data set are presented in table 3. All off-farm work parameter estimates are positive and consistent with utility maximization, but only off-farm income (model 2) is statistically significant. Thus, the implication from the 2010 data set that an increase in off-farm work by the farm household is associated with a statistically significant increase in inefficiency and a decrease in TE is only partially supported by the 2005 data set. As with the 2010 data set, estimates with the 2005 data show four inputs that have a positive and statistically significant impact on milk production. Both include milk cows, feed, and other inputs. However, in 2005, capital is significant rather than labor. The elasticities differ somewhat from the 2010 estimates but vary little across models. Land again has a negative and statistically significant impact with an elasticity of -0.02. The sum of elasticities with this data set is lower than that with the 2010 data, 1.035, but also implies slightly increasing returns to scale. Among the farm household, farm characteristic, and management impacts on TE, seven variables are statistically significant in all models (the same as with the 2010 data). Another variable, principal operator dairy experience, is also significant in one model. Other differences from the results based on the 2010 data set include the statistically insignificant variable of principal operator age and the statistically significant negative effect of milking herd receives rbST. Among the statistically significant variables, signs differ from the 2010 data only for principal operator dairy experience and computerized milking system. There is again little difference across models in estimated parameter magnitudes. To determine whether off-farm work is at least partially responsible for the evidence of economies of scale in the dairy industry, we determine whether there are significant differences in TE, off-farm work, and off-farm income by dairy size. 15 For the TE comparison, we estimate the base model for each farm size quantile (small, medium and large) with each data set and follow the quantile categorization of Key and Sneeringer (2014). We then estimate and compare TE, off-farm hours worked, and off-farm income across the quantiles and test whether there are significant differences between the three size quantiles. Results are reported in table 4. With both data sets, we find that TE increases with farm size and that there is a statistically significant difference in its mean between each pair of quantiles. Mean off-farm hours worked and mean off-farm income each decrease with farm size and document a negative correlation with TE. With the 2010 data set, pair-wise tests of these two off-farm labor variables show a statistically significant difference in the average between small and large farms and between medium and large farms but not between small and medium farms. Although neither average is significantly different, households on small farms work more hours off-farm than do households on medium-sized farms and receive more off-farm income. Compared to large farms, households on small and medium-sized farms work significantly more hours off-farm and earn significantly more off-farm income. Households on small farms work an average of 300 more hours off-farm and earn $4,694 more from off-farm work than do households on large farms but have a substantially lower (by 0.142) TE. Households on medium-sized farms work an average of 211 more hours off-farm and earn $3,449 more from off-farm work than households on large farms and have a 0.04 lower TE. These results imply that less off-farm work by households with larger farms is at least partially responsible for the evidence of economies of scale in the U.S. dairy industry. With the 2005 data set, pair-wise tests of both off-farm hours worked and off-farm income show statistically significant differences between the average of small and large farms. We also find a significant difference in off-farm hours worked between small and medium farms. Differences between the averages of small and large farms is smaller for each category in the 2005 data set than in the 2010 data set. Our finding that an increase in off-farm work by the farm household is associated with a statistically significant increase in inefficiency and a decrease in TE is consistent with findings in prior literature focusing on dairies (e.g., Kumbhakar et al., 1989, Mayen et al., 2010, Chang and Mishra, 2013. However, it is not consistent with some prior literature focusing on other enterprises (e.g., Nehring and Fernandez-Cornejo, 2005) which find an empirical result contrary to the utility-maximizing hypothesis."}, {"section_title": "Conclusions", "text": "In this study we investigate the impact of an increase in farm households' off-farm work on the technical efficiency (TE) of U.S. dairies. The opportunity cost of working off-farm is time to manage and operate the dairy. Although a considerable number of studies have examined off-farm work, this study contributes to the literature by developing a theoretical framework that provides a clear hypothesis of an inverse relationship between an increase in off-farm work and TE. Because the impact of an increase in off-farm work is likely to vary by commodity, we focus on a single sector, dairy, which faces both intensive and time-sensitive labor requirements. We use two nationally-representative cross-sectional samples of U.S. dairies and apply stochastic frontier analysis to empirically test our theoretical hypothesis. We also contribute to past literature by testing whether less off-farm work by households with larger farms is partially responsible for the evidence of economies of scale in the U.S. conventional dairy industry. We further contribute to the study of U.S. dairies by checking for theoretical consistency when selecting functional form. Although stronger in the 2010 data set than in the earlier 2005 data set, we find that empirical evidence supports the theoretical hypothesis that an increase in off-farm work by the dairy farm household is associated with a decrease in TE. Our results also imply that less off-farm work by households with larger farms is at least partially responsible for the evidence of economies of scale in the U.S. dairy industry. Further, despite the fact that the additional income the smaller farm households earn through greater off-farm work potentially enables them to substitute their lost on-farm labor with specialized hired labor, imperfect labor substitution seems to dominate as the negative impact on TE is not fully circumvented. Our results suggest that policies or programs that allow farm households to rely less on off-farm income and reallocate their labor back to on-farm work may boost TE, and potentially total factor productivity (TFP), since TE is one component of TFP. That could help drive adjustment toward the competitive long-run equilibrium in which TFP (or average product) is maximized. Given previous findings that government programs such as income support payments (Mishra and Goodwin, 1997;El-Osta et al., 2004;Ahearn et al., 2006) are negatively related to off-farm labor supply, our findings provide evidence of one positive impact of such programs. Since small farms provide more off-farm work hours and are less technically efficient than large farms, programs that help keep these producers from having to rely on off-farm income may help them catch up in productivity. To be successful, they must be sufficient to ensure that the marginal value product of working on-farm is at least as great as the off-farm wage rate. The necessity of maintaining high TE for U.S. dairies to be profitable and competitive in the global market, as noted by Murova and Chidmi (2013), imply that policies which facilitate investment in affordable advanced technologies requiring less on-farm management time by the farm household may also be beneficial. September.   The models differ only in the variables used to represent off-farm work. Robust standard errors are in parentheses. *, **, and *** denote significance at the 0.1, 0.05, and 0.01 levels, respectively. , where is the mean for the respective farm size. ** and *** denote significance at the 0.05 and 0.01 levels, respectively. Online Appendix: Details of Derivation of Equations (10)- 14Total differential of equations (8a) and 9a "}]