[{"section_title": "Abstract", "text": "Alzheimer's disease (AD) and Parkinson's disease (PD) are the two most common neurodegenerative disorders in humans. Because a significant percentage of patients have clinical and pathological features of both diseases, it has been hypothesized that the patho-cascades of the two diseases overlap. Despite this evidence, these two diseases are rarely studied in a joint manner. In this paper, we utilize clinical, imaging, genetic, and biospecimen features to cluster AD and PD patients into the same feature space. By training a machine learning classifier on the combined feature space, we predict the disease stage of patients two years after their baseline visits. We observed a considerable improvement in the prediction accuracy of Parkinson's dementia patients due to combined training on Alzheimer's and Parkinson's patients, thereby affirming the claim that these two diseases can be jointly studied."}, {"section_title": "Introduction", "text": "Alzheimer's disease (AD) is an irreversible, progressive neurological disease that gradually deteriorates cognitive abilities [8] . It is characterized by progressive impairment in memory, judgment, language, and orientation to physical surroundings. The primary pathological features of AD are neuronal loss and the accumulation of extracellular plaques containing amyloid β (Aβ) and neurofibrillary tangles (NFT) containing tau. Parkinson's disease (PD) is a similarly irreversible, progressive neurological disease that impairs movement. PD manifests as a movement disorder and a distinct form of cognitive impairment with typical pathological characteristics of the accumulation of α-synuclein in multiple brain regions.\nThough AD and PD are clinically distinct entities, one can find pathological associations between them. For instance, Aβ, an important hallmark of AD pathology, has been reported to be present in some PD patients [11] , while there have been indications that Lewy body deposition exists even in AD patients [3] . The association might also extend to genes such as APOE and MAPT genes which have been reported to be linked to the presence of Aβ aggregates [16] and increased tau protein expression.\nAn important application of the hypothesis of overlap between AD and PD has been studying cognitive decline in PD patients. Previous works report association of lower levels of cerebrospinal fluid (CSF) amyloid β with cognitive decline in PD patients [18] . Also, many imaging-based measures have been reported to be associated with cognitive performance in PD. A baseline AD pattern of brain atrophy, quantified using the Spatial Pattern of Atrophy for Recognition of AD (SPARE-AD) score, predicted long-term global cognitive decline in non-demented PD patients [21] .\nDespite the discovery of such correlations, AD and PD communities remain distinct. This motivates an aggregated, data-driven study to explore correlation between the two diseases, which could potentially lead to clearer understanding and possible development of therapeutic targets for both ailments. The main contribution of this paper is combining multiple modalities of two different data sets of ADNI and PPMI patients and consequently predicting the onset of Dementia in PD patients using it. To the best of our knowledge, this is the first work exploiting the overlap of these two diseases to improve prediction accuracy of dementia in PD patients."}, {"section_title": "Methodology", "text": ""}, {"section_title": "Problem Statement", "text": "The aim is to predict a given patient's cognitive status (Normal CI/MCI/Dementia) after 24 months using his/her baseline features. Due to high clinical importance of prediction of onset of Dementia in PD patients, the primary goal is to improve on state-of-the-art methods for the same."}, {"section_title": "Data", "text": "Alzheimer's Disease Neuroimaging Initiative (ADNI) database was used to fetch multimodal data for AD patients. ADNI-2 participants meeting the criteria for single-domain or multidomain amnestic MCI were selected, as in prior work [12] . The availability of all desired features and diagnosis after 24 months led to a total of 355 patients. Parkinson's Progression Markers Initiative (PPMI) database was used to fetch multimodal data for PD patients. Montreal Cognitive Assessment (MoCA) scores [13] were used for assignment of Dementia labels for PD patients. MoCA is a widely used screening assessment for detecting cognitive impairment [5] [7] . Based on the availability of MoCA scores, and other required features, we were reduced to 142 patients. The following features were selected for the purpose of this classification task. These features have been found to drive dementia prediction [2] ."}, {"section_title": "Features", "text": ""}, {"section_title": "Imaging Features", "text": "FreeSurferV5.1 software [6] , which can analyze and visualize MRIs, was used to obtain pre-processed image features. This allowed us to map ADNI and PPMI patients into a unified image feature space.\nPrincipal Component Analysis (PCA) [14] was used to reduce the feature space to three dimensions, as illustrated in Fig 1a. Alternative methods such as independent component analysis and t-sne did not perform as well as PCA on this data. Note that each data point is labeled by its cognitive label after 24 months in addition to its dataset of origin. We observe that data points in the ADNI and PPMI datasets that share common cognitive statuses are in close proximity with one another."}, {"section_title": "Genetic Features", "text": "Apolipoprotein E4 (ApoE4), which is the largest known genetic risk factor for late-onset sporadic AD in a variety of ethnic groups [4, 17] was chosen as the only genetic feature. ApoE4 has also been shown to be associated with cognitive decline in Parkinson's disease [1] ."}, {"section_title": "Biospecimen Features", "text": "For biospecimen features, cerebrospinal fluid (CSF) total tau, phosphorylated tau 181 protein (ptau181), and CSF Aβ42 levels were selected. Elevated CSF total tau and p-tau181 concentrations have shown to be associated with neuro degenerative changes in early AD [20, 18, 22] . Each of these biomarkers also have strong prognostic and diagnostic potential in early-stage PD [10] . CSF alpha-synuclein levels were also considered as a potential feature but could not be used due to unavailability of data for ADNI-2/GO participants [9] .\nOne can observe significant overlaps between feature values of clustered ADNI and PPMI patients in Fig 1b, suggesting potential for accurate predictions for both kinds of patients."}, {"section_title": "Classifier", "text": "Using the features at baseline (gender, three imaging features, ApoE4 genotype, and the three biospecimen features), a Random Forest classifier (500 trees with max features parameter as 0.6) was trained to predict a patient's cognitive disease label two years after the baseline. Preliminary testing showed Random Forest outperforming other commonly used classifiers such as logistic regression, support vector machine, multi-layer perceptron etc. This corroborates with the fact that Random forests are inherently suited for multi-class problems and work well in combination with numerical, categorical features. Five-fold cross-validation, splitting the folds on AD and PD patients independently, and recombining them for the training to avoid imbalances between the two diseases, was used. Thus, each fold contained equal proportions of AD and PD patients. Table 1 summarizes the results for the aforementioned classifier, testing different train-test set combinations. Note that even though we list accuracy as a performance parameter, it was not used as a measure of comparison because it can misinterpret the performance when the sample has imbalanced class probabilities [12] . Table 1 . Class 0 represents Dementia, class 1 MCI and class 2 Normal-CI. Fig 2a provides the generalized performance of our model, wherein we train on ADNI+PPMI and test on ADNI+PPMI. Fig 2b  provides the result most relevant to our use-case. One can observe 1.5X increase in AUC-Dementia value when we train our model on a combined ADNI+PPMI set as compared to PPMI set. This shows drastic gains in prediction of Dementia in Parkinson's patients (PDD) when we used a combined feature space. Note that ApoE Genotype has a small contribution in prediction outcome, which is counter-intuitive as it has been found to hold high importance when predicting Dementia. We performed exploratory study to clarify this issue. Fig 3b shows Although there is a dearth of research in prediction of Dementia in PD patients (PDD), we were able to use Berlyand et.al [2] as baseline for our task. They trained a Logistic Regression classifier on a AD cohort of 210 patients to predict control vs Dementia patients. They, then, used the trained model to predict control vs Dementia on a PD cohort of 75 patients with considerably lower performance. Note that we differ in our experiments -(1) usage of raw image features processed through Freesurfer and reduced through PCA, (2) usage of both AD and PD patients for training the model and (3) prediction of Normal_CI/MCI/Dementia patients instead of Normal/Dementia patients. We use (1) as it opens up our model to better extract information from images and does not impose bias unlike SPARE-AD score. Using (2) exposes our model to a larger data set and (3) provides a more fine-grained outcome."}, {"section_title": "Results", "text": ""}, {"section_title": "Conclusion", "text": "This paper makes an attempt at predicting the onset of dementia in patients, with special interest to PD patients. This is a task of high clinical importance. We obtain promising results as compared to the state of the art. We show that using AD patients along with PD patients to build a model to predict the onset of dementia in PD patients is a promising future direction. This also reaffirms our claim that dementia in PD and AD share the same pathology. We believe this can help open up new avenues of research going forward."}]