[{"section_title": "Abstract", "text": "Abstract-The aim of this research is to know the validity and effectiveness of physics learning package based on Guided Inquiry. This research uses development method by Plomp and Nieven research design. Physics learning package that have been developed and then validated by three expert validators from UNESA. Validated sections include Syllabus, RPP Scenario, Student Book, and Student Worksheet. The validation results are, the first is Syllabus that has a high validity with 3.79 average score. Second, the validity score of RPP Scenario is 3.71 with high valid category. Third, the Student Book has a validity score of 3.47 with valid category. Last, Student Worksheet has validity of 3.71 with high validity category. The FGD results of this learning packages are: adjust the usage number, consistency in using the word, numbering in the learning step, check the writing bibliography, numbering of images must be clear, mention the tools and materials more operational. The result of effectiveness can be seen before and after using learning instrument. Before using the developed learning instrument, the average score of student's Science Process Skills was 29.2, while after using the developed instrument, the average score was 85.7. Based on the results of the validity and effectiveness of the instrument shows that the instructional instrument of physics based on Guided Inquiry is very suitable to be used in learning to improve student's Science Process Skills."}, {"section_title": "I. INTRODUCTION", "text": "Indonesia's low quality of education has been widely recognized by various parties, especially by experts and observers of education. In the field of MIPA, the quality of education in Indonesia is also low [1] . The results of the TIMSS (Trends in International Mathematics and Science Study) survey measuring the scientific inquiry ability showed that the average score of Indonesian students' science achievement in 1999 was 435, making Indonesia the 32nd place out of 39 countries, in 2003 on the order 37 out of 46 countries with an average score of 420, as well as the results in 2007 are in the order of 35 out of 49 countries with an average score of 427, and the results of the 2011 survey also show relatively similar results, which are in the order of 39 of 41 countries with the average score of 406 while the average international score has reached the score of 500 [2] [3] .\nResearchers have also tested the Science Process Skills (KPS) of X-MIPA 4 class students as much as 28 students in SMA Negeri 1 Pasuruan. The result is that there are three KPS indicators that have values under 70%, i.e. hypotheses indicator, operational definitions, and describe the graph and interpret the data. There is even one KPS indicator that is under 60%, i.e. states the hypothesis. It shows that the Science Process Skills is not perfectly mastered by the students.\nBased on these data, evaluation of various aspects of learning needs to be done for improvements such as aspects of input, process, and output [4] . From the input aspect, the current Curriculum 2013 has been implemented which is a refinement of the previous curriculum. Physics learning is directed to develop the ability of thinking and problem solving both qualitatively and quantitatively by using mathematics and can develop knowledge, skills, and confidence [5] . From the process aspect, the physics learning should use various approaches, strategies, methods, or learning model [6] . A learning approach that can be used for example the science process skills. If the standard process is well implemented, then the educational output is in accordance with what is stipulated in the standards competency of graduates covering knowledge, score, attitude, and skills [7] [8] .\nThe way that can be used in helping students to improve the science process skills is to maximize the learning model and package used [9] [10] [11] [12] . Inquiry Learning model is a learning model that emphasizes the process of discovery, although still need the teacher's guidance [13] [14] [15] . Based on the description of the problems above, the authors want to develop a learning packages as a support for students to improve their Science Process Skills (KPS)."}, {"section_title": "II. EXPERIMENT METHOD A. General Background of Research", "text": "This research is conducted in State Senior High School 1 Pasuruan (SMAN 1 Pasuruan, East Java, Indonesia). The research's scope is the senior high school students of 10 th grade who took physics subject in school year 2017/2018. The aim was to analyse validity and efectiveness of physics learning package based on guided-inquiry to improve Science Process Skills of Senior High School Student. The validity score assessed by professional validator. While the effectiveness will be determined based on; 1) significant improvement on score between pre-test and post-test of students' science process skills on senior high school of physics subject; 2) N-gain average determined at least on low improvement criteria."}, {"section_title": "B. Sample of Research", "text": "The samples of the research were 15 students of State Senior High School 1 of Pasuruan (East Java, Indonesia) using One Group Pre-test Post-test Design, namely: group-1 (class X-MIA 3 before using learning packages that developed), group-2 (class X-MIA 3 after using learning packages that developed). Each group consists of students on physics subject in academic year 2017/2018."}, {"section_title": "C. Instrument and Procedures", "text": "The students' science process skills were measured by using Science Process Skills Assessment Sheet (SPSA). SPSA is formed based on the measureable science process skills indicator such as: 1) formulating the general problem, 2) writing observation result, 3) formulating a specific problem, 4) stating hypothesis, 5) identifying a variable, 6) writing variable operational definition, 7) writing experiment procedure, 8) organizing the experiment result, 9) analysing the experiment result, and 10) making a conclusion [16] [17] . The materials of physics subject in this research were chosen according to Guided-Inquiry Teaching Model characteristics which is Newton's Law. This research used one group pre-test and post-test design, O1 X O2 [18] . The initial learning has started with conducting the pre-test (O1). Every senior high school students are required to work SPSA. After the pre-test, the teacher will apply Guided Inquiry Teaching Model and physics learning devices on each group (X). The implementation of Guided-Inquiry Teaching Model has been conducted in five meeting on physics subject. Learning packages of physics consist of syllabus, lesson plan, student work sheet, students' textbooks, teachers' textbooks, SPSA, model observation sheets, students' activity sheets, and questionnaires of respond. After the implementation of Guided-Inquiry Teaching Model ended by conducting the post-test (O2) using SPSA, every student was required to finish SPSA on the post-test."}, {"section_title": "Data Analysis", "text": "The students' science process skills on senior high school physics subject is analysed based on a determined assessment before and after using Guided-Inquiry Teaching Model. The students' data on science process skills pre-test, post-test and n-gain were analysed by using Microsoft Excel. The score of students' science process skills was based on these indicators; 1) formulating the general problem, 2) writing observation result, 3) formulating a specific problem, 4) stating hypothesis, 5) identifying a variable, 6) writing variable operational definition, 7) writing experiment procedure, 8) organizing the experiment result, 9) analysing the experiment result, and 10) making a conclusion. N-gain was determined using this equation: n-gain = (score post-test -score pre-test) / (maximum score -pre-test score), with the criteria: (1) if ngain ≥ .7 (high), (2) if .3 <n-gain < .7 (moderate), and (3) if Ngain ≤ .3 (low) [19] ."}, {"section_title": "III. RESULT AND DISCUSSION", "text": "The result of the research showed on Table 1, Table 2, and  Table 3 with the explanation as follows. Table 1 showed the validity score of learning packages of guided-inquiry. Based on the data above, it is show that the all of parts of learning packages based guided-inquiry has a valid category. It can be concluded that the overall learning packages that developed can be used properly by teachers to introduce the science process skills to students. The FGD results of this learning packages are: adjust the usage number, consistency in using the word, numbering in the learning step, check the writing bibliography, numbering of images must be clear, mention the tools and materials more operational. This is in line with Nieveen that the validity of the content of learning packages is related to the needs (need) and state-ofthe-art. This learning packages also has the construct validity, that is the validity associated with consistency between the components of learning packages that are logically designed [20] . Table 2 shows that all of average student's science process skills indicators on pre-test were on the low category, whereas after the implementation of physics learning with GuidedInquiry Teaching Model, it shows that the students' average score has improved. The general n-gain student's science process skills indicator was on the high category with the score 0.72. The positive result is existed because the implementation of physics learning with Guided-Inquiry Teaching Model has improve the student's science process skills. The results are also supported by similar research by Nurul Azizah (2014) [21] , Juhji (2016) [22] , Annur Dewi Ulya (2013) [23] , Fatmi Nuraini and Sahyar (2013) [24] , and Astuti Kusuma Yani (2014) [25] .\nIV. CONCLUSION Guided-Inquiry Teaching Model is a specific model which developed to improve students' science process skill of senior high school. The results of the study prove that: 1) There is an improvement in science process skills; 2) Average score of ngain science process skills of senior high school students' is 0.72 (high category). Therefore, the Guided-Inquiry Teaching Model has been proven to be effective in improving students' science process skills on senior high school physics subjects especially Newton's Law ACKNOWLEDGMENT The author thanked the Surabaya State University, principal and physics teacher of State Senior High School 1 of Pasuruan who has supported and assisted the research."}]