[{"section_title": "Introduction", "text": "Tenure is often seen as the pot of gold at the end of the academic rainbow, a well-deserved reward for years of working at a fever-pitch. For many professors, the job security and academic freedom that tenure provides is a fair trade off for long hours of teaching, research, and service to their universities; however, the prize of tenure continues to elude women in higher education. The low number of tenured female faculty in the United States leads to some difficult questions. Is this disparity a matter of choice, or does the tenure system unfairly discriminate against women? Does the academic work environment allow women to successfully balance work and family? Is the system antiquated? Has the time come for a twenty-first century makeover in the academic workplace? The purpose of this article is to explore the reasons behind the low numbers of tenured female faculty in American higher education and to propose strategies for reversing this trend. Specific suggestions for improving the collegiate work environment for women at the individual, department, and institutional levels are provided."}, {"section_title": "About the Author", "text": "Anne M. Schoening, PhD, RN is an Assistant Professor of Nursing at Creighton University in Omaha, Nebraska. She holds a doctorate in Educational Studies. Email: aschoening@creighton.edu. 25.8% of tenured faculty are female and only 19.3% offull professors are women (West & Curtis, 2006). Uncovering the reasons why women lag behind men in rank and tenure requires a hard look at the career trajectory of female academics. Researchers at the University of California (UC Family-Friendly Edge, 2003;Wolfinger, Mason & Goulden, 2008) have compared the supply of women in academia to a leaky pipeline, with water rushing out at nearly every critical career juncture. A substantial number of female doctoral recipients exit the pipeline right at graduation, while others leak out year by year. Although the reasons for this exodus are complex, the literature suggests that the cracks in the female tenure track pipeline are the result of two factors: career choices based on marriage and family responsibilities and the inherent inequity of the tenure system itself."}, {"section_title": "Choosing the Tenure Track: Marriage and Family", "text": "Critics of the tenure system contend that it is an antiquated practice based on the traditional career paths and life events of men. The perceived difficulty of balancing work and family life on the tenure track and the ambiguous guidelines that accompany the tenure process in many institutions make the pre-tenure or probationary years a period of high stress, particularly for women (Ward & Wolf-Wendel, 2004;Van Ummersen, 2005;Armenti, 2004;American Council on Education, 2005). Because the average age of the female doctoral recipient is 34, tenure's intense probationary years often coincide with a woman's childbearing years (Marcus, 2007). Thus the decision to pursue a tenure-track faculty position must often be made at the same time as other critical decisions related to one's personal life, such as marriage and starting a family. For many women, the demands of earning tenure may mean giving up the dream of becoming a wife and mother (Armenti, 2004). According to the 2004 National Study of Postsecondary Faculty (NSOPF), female faculty are approximately twice as likely to be single and childless as their male colleagues (US. Department of Education, 2004). Mason and Goulden (2002) have explored the consequences of childbearing on the academic careers of men and women and have discovered significant differences between genders. In their analysis of the Survey of Doctorate Recipients (SDR), they found that childbirth has the greatest career impact on women in the immediate post-doctoral years. Focusing on the timing of childbirth, they reported that women who have \"early babies\" (defined as those born within five years of earning a doctoral degree) are more likely to leave academia or choose a part-time or adjunct faculty position (Mason & Goulden,p. 4). This early leak in the tenure pipeline creates a gender gap that is difficult to reverse. Across all academic disciplines, the overall tenure gap between men and women who have early babies is 24% (Wolfinger, Mason, & Goulden, 2008). Wolfinger, Mason, and Goulden (2008) found that women pay a higher price than men for marrying and having children early in their academic careers. In a subsequent analysis of the SDR, they reported that married women are 12% less likely than married men to obtain a tenure-track position after earning a doctoral degree. Having children under the age of six decreases the likelihood of entering a tenure-track appointment by as much as 22% when compared to men with children of the same age. Wolfinger et al. attributed these gender differences primarily to marriage and the presence of young children, as they found that single, childless women actually have a 16% higher chance of obtaining a tenure-track job than single, childless men. Furthermore, the presence of children over the age of six has no negative impact on the procurement of a tenure track job for either gender. Women with children between the age of six and eighteen actually have a greater chance of entering the tenure track upon graduation from a doctoral program when compared to men (Wolfinger et al.). In the scientific fields, Ginther & Kahn (2006) reported similar results. They analyzed SDR data to determine where women in the biologic sciences, physical sciences, and engineering exit the tenure track pipeline. They found that although the number of women who earn scientific doctorates continues to rise, the number of females in tenure-track science positions has not proportionately kept pace with this trend. They attributed this gap primarily to the age of one's children. Within five years of receiving a doctoral degree, the presence of preschool-age children lowered the likelihood of having a tenure track faculty appointment in science by 8.1 % for women, but it had no effect on men. The presence of school-aged children had no effect for women, but actually increased the likelihood of obtaining a tenure track job for men. Marriage early in one's career helped both men and women in their analysis, although it increased men's chances of getting a tenure track job by 22% vs. a mere 5% increase for women. Thus, the timing of marriage and family formation is critical to the career development of women in all academic disciplines. Having a baby early in one's academic career may pose more challenges to women than it does to men. In addition to the physical demands of pregnancy and childbirth, women still perform the majority of home and childcare tasks, even in two-income households (Ward & Wolf-Wendel, 2004;Williams, 2000). This arrangement results in male academics being more likely to have wives who can take primary responsibility for home and family maintenance. According to the National Science Foundation (NSF) (2007), 80% of females with doctorates in science and engineering have a husband who works full time; however, only 46% of their male coun-terparts have a spouse working full time outside the home. Taking primary responsibility for care of the home and family often causes a woman's job to be seen as secondary to their spouses and may decrease the likelihood that female faculty will be able to relocate or move up the academic ladder (Harper, Baldwin, Gansneder, & Chronister, 2001;Perna, 2001;Trower, 2001). In order to avoid such work/family conflicts, women who stay in academia often choose part-time or non-tenure track faculty appointments, which are generally the least secure and lowest paid (AAUP, 2005). According to the 2004 NSOPF, 62% of full-time faculty positions are filled by men. In public, doctoral-granting institutions men occupy nearly 70% of full time faculty positions (Cataldi, E., Fahimi, M., Bradburn, E. & Zimber, L. (2005).). For those women who do pursue a full-time appointment, less than half choose the tenure track (West & Curtis, 2006). This further contributes to the majority of women becoming caught in the lower ranks of academia, where they occupy more than half of all instructor and lecturer positions, a mere third of associate professor positions, and only one-fifth of full professorships (American Association of University Women [AAUW], 2004). Women who do choose the tenure track often face intense pressure to make choices between careers and family. Although women who have \"late babies\" (born more than five years post-doctorate) or no children earn tenure at nearly equal rates, they still lag behind their male counterparts (Mason & Goulden, 2002, p. 4). They are also more likely to have only one child (Mason & Goulden). The inherent difficulty in raising young children while building a record of scholarship and service has an impact on the choices that female academics make when planning their families and managing their personal lives. For example, a body of qualitative research suggests that women in academia view childbearing as a major threat to the success of their careers, particularly if they are on the tenure track (Armenti, 2004;Ward & Wolf-Wendel, 2004). Even though the Pregnancy Discrimination Act of 1978 was designed to protect women from such bias, females continue to report subtle and pervasive negative attitudes towards childbearing in the academic workplace (AAUW, 2004) and higher education lags far behind the private sector in terms of establishing equitable policies for maternity leave (AAUW, University of Michigan Center for the Education of Women, 2007). Armenti (2004) has described the \"May baby\" phenomenon (p. 211), which is a manifestation of higher education's negative attitude toward fertility. According to Armenti, many women in academia feel forced to time their pregnancies according to the academic calendar. A summer delivery can provide for time off without a family medical leave and prevents a subsequent gap in the tenure dossier. Some female academics may even go so far as to conceal a pregnancy from male colleagues for a few months, in fear \\ of being perceived as less than serious about their careers. Others may choose to delay childbearing until after they have achieved tenure (Armenti). This may lead to infertility problems later in life. After childbirth, research by Ward and Wolf-Wendel (2004) suggests that the occupational priorities of women often change. In order to meet the demands of career and family obligations, they found that women are more likely to alter their work habits to accommodate their family lives. This may mean choosing projects that do not entail long hours in a laboratory, pursuing the least time-intensive committee assignments, or using the autonomous workplace of the university to schedule their work around the lives of their children. The women in Ward and Wolf-Wendel's study acknowledged that their choices may eventually cost them tenure, but felt that they were not willing to sacrifice their families in the process."}, {"section_title": "Gender Inequity in the Academic Workplace", "text": "Although marriage and family formation early in the post-doctoral years appears to drive women away from accepting full-time tenure track positions, the reasons that they fail to achieve tenure at a later time may be unrelated to marriage and family. Wolfinger et al. (2008) have found that overall, women who do pursue the prize of tenure are 21 % less likely to achieve it than men, and that gender, marriage, and family do not have an affect on their likelihood of earning it. Rather, they suggest that women who come up for tenure \"are disadvantaged for reasons unrelated to family formation\" (p. 396). Although it is difficult to determine the reasons why women are either denied tenure or choose to depart from academia before their tenure review, there are negative aspects of the academic workplace that might lead to this \"disadvantage.\" These reasons include gender pay disparities in academia, differences in work habits, and lack of collegial support. Disparities in rank, tenure status, and pay are deeply ingrained in the American academic culture and have been slow to change, particularly at the most competitive and prestigious schools. According to West and Curtis (2006) of the American Association of University Professors (AAUP), full-time female faculty earn between 2% and 9% less than men holding the same rank, regardless of institutional type. At the pinnacle of academia, the doctoral-granting research institution, women earn 78% of the amount earned by men. At the rank of full professor, women earn 10% less than men. It is estimated that as much as 23% of the gender salary gap in academia is due to discrimination, rather than differences in productivity or other measurable employee characteristics (Barbezat & Hughes, 2005). It has also been suggested that the gender pay disparity may be partially due to the fact that women tend to teach in disciplines that earn less, such as education and the humanities (Cataldi, Fahimi, Bradburn, & Zimbler, 2005). However, statistical models that control for differences in disciplines, scholarly productivity, experience, and other professional characteristics demonstrate that full-time female faculty still earn 4.6% less than compara-ble male faculty, regardless of their professional field (Toutkoushian , Bellas, & Moore, 2007). In terms of productivity, the literature suggests that women's academic careers are simply different from those of men. Because the tenure system is based on the work habits of men in the early twentieth century, this model may unfairly discriminate against women. For example, there is some evidence that women prioritize their time differently than men in the academic setting. Harper et al (2001) analyzed data from the 1993 NSOPF, surveyed 89 postsecondary institutions, and interviewed more than 300 faculty. They found that women spend more hours a week on teaching (vs. scholarship) than men, and which may result in fewer publications. According to the 2004 NSOPF, male faculty at doctoral institutions publish an average of nine times every two years, while females publish only' six times during the same time period (U.S. Department of Education, 2004). In terms of research dollars, fewer women than men serve as princi-. pal investigators for funded research projects (Perna, 2001). These vari-. ances in work patterns and productivity contribute to lower salaries for women (Perna, 2001) and may negatively impact them upon tenure review, particularly at research institutions, where men are more heavily compensated for their scholarly productivity than women (Barbezat & Hughes, 2005). In addition to disparities in compensation and work patterns, women in academia report a lack of mentors hip and guidance in the academic work setting and low satisfaction with collegial relationships (Van Ummersen, 2005; The Collaborative on Academic Careers in Higher Education, 2007a). Because of the relative dearth of tenured female faculty, women who remain in the pipeline have few role models and colleagues who understand the daily conflicts and pressures that they feel, especially if they are working mothers (Trower, 2002a;Wolf-Wendel & Ward, 2006). This lack of support may contribute to women choosing careers outside of academia or leaving academic life before their tenure review. Although all ofthese workplace inequities may make life in the academy undesirable for female scholars, they are particularly pronounced in research institutions. As a result, women are seeking solace in less competitive academic environments, such as liberal arts colleges and associate degree institutions. Here, they may find a more supportive work environment, particularly during their childbearing years (Wolf-Wendel & Ward, : 2006; Collaborative on Academic Careers in Higher Education, 2007a). By' 2004, female full-time faculty actually outnumbered their male colleagues at associate degree colleges (AAUP, 2005) and gained tenure in largernumbers. According to West and Curtis (2006), women currently constitute, nearly half of all full professors and tenured faculty at associate degree.; institutions. j Women also enjoy greater pay equity outside of research institutions. In:, associate degree programs, women can expect to earn 94% of the salary 0(; their male counterparts (West & Curtis (2006), and there is evidence that salary structures in liberal arts schools focus less on research productivity (Barbezat and Hughes, 2005). However, because salaries in these colleges are lower overall this fact has done little to decrease the overall academic salary gap (AAUP, 2005). Thus, while associate degree and liberal arts institutions should be applauded for their more equitable policies, women still remain underrepresented in the highest echelons of the academic workforce. Advancement here is critical in order to close the existing tenure gap in the United States."}, {"section_title": "Strategies for Increasing the Number of Tenured Female Faculty", "text": "There are numerous strategies for increasing the number of tenured female faculty in American postsecondary institutions. Two recent publications, the AAUP (2001) Statement of Principles on Family Responsibilities and Academic Work and the American Council on Education's (ACE, 2005) An Agenda for Excellence: Creating Flexibility in Tenure-Track Faculty Careers recommend a number of workplace policies intended to \"enable the healthy integration of work responsibilities with family life in academe\" (AAUP, 2001, p. 220). The following strategies are recommended by both of these organizations and may provide useful guidelines for deans, department chairs, university presidents and provosts who are interested in creating an environment that enables women on the tenure track to balance work and family life. Additional sources are included as referenced below. It is of note that the AAUP recommends that these policies be enforced for both men and women, and be extended to domestic partners."}, {"section_title": "Increasing Family-Care and Disability Leaves", "text": "Although the federal Family and Medical Leave Act (FMLA), provides for a twelve-week leave in order to care for a newly born or adopted child (orto care for an ill child, spouse, or parent) (U.S. Department of Labor, 2007), the AAUP recommends that institutions offer options beyond this traditional twelve-week leave if at all possible. They also suggest that colleges and universities provide paid disability leaves for pregnancy (up to six or eight weeks), as they would for any other medical condition. In addition to this, they recommend that employers provide paid FMLA leave, as the current law only provides for unpaid time off. They encourage all institutions to develop innovative methods to fund extended family-care leaves, such as providing employees with the choice of using paid sick leave during their FMLA leave. The AAUP (2001) also advocates the implementation of \"emergency care\" short-term leaves. This policy would allow faculty to use paid sick leave in the event of short-term childhood illness not covered by FMLA and/or emergency situations, such as during school closings for inclement weather. The ACE panel (2005) recommends that institutions create opportunities for \"multiple-year leaves\" as needed for \"personal or professional reasons\" (p. 10)."}, {"section_title": "Stopping the Tenure Clock", "text": "The AAUP recommends that \"institutions should adopt (tenure) policies that do not create conflicts between having children and establishing an op. timal research record on the basis of which the tenure decision is to be made\" (AAUP, 2001, p. 222). Both the AAUP and the ACE panel recom. mend that faculty have the option to request the tenure clock to stop for one to two years for birth or adoption of children, regardless of the amount of formal leave taken during that time period. They also state that all faculty members should be clearly informed of the existence of such policies. The AAUP suggests that whenever a probationary period is extended university administration should provide the faculty member with written assurance that future tenure decisions will be made using established academic stan. dards."}, {"section_title": "Active Service with Modified Duties and Temporary Part-time Appointments", "text": "The creation of modified duties policies allow faculty release from a por. tion of their teaching or service obligations during childbearing and childrearing years while remaining on active service with the university. These policies allow for short-term modifications (i.e. one semester) of duties, but continuation of research commitments and maintenance of full-time status. In their 2001 policy statement, the AAUP cites a model of the policy implemented within the University of California system, which allows faculty partial or full release from teaching for one semester when . he or she \"has 'substantial responsibility' for care of a newborn or newly adopted child under the age of five\" (AAUP, 2001, p. 222). Other advocates for alternative employment arrangements suggest that allowing faculty members to move between part-time and full-time appointments (while still remaining on the tenure track) might better accommodate the childbearing and childrearing needs of female professors. Armenti (2004) suggests that faculty be allowed to reduce their teaching, research, and service commitments to one-quarter or one-halftime temporarily (with salary reduction), with an eventual return to full-time status. At the end of this temporary reduction in service, the probationary period would be extended by a corresponding length of time in order for the faculty member to adequately prepare for tenure review. She also suggests allowing two faculty members the option of job sharing a full-time tenure track appointment, with clear guidelines for each person related to job expectations. Williams (2000) advocates for the creation of a part time tenure track option, with a 50% expectation for scholarship, research, and service. In this plan, a faculty member would accept a salary of half the usual base pay, but have their probationary period doubled. The ACE panel (2005) endorses allowing faculty members to reduce their status to part-time for up to five years to tend to personal needs."}, {"section_title": "Childcare Policies", "text": "The AAUP (2001). and the ACE pan~l (20?5) both recommend that institutions provide qualIty, affordable onslte chlldcare for faculty and staff. Providing on-site facilities saves faculty time and money related to transportation issues and provides parents with peace of mind knowing that their children are in close proximity. Additionally, they recommend providing drop-in childcare support for school vacations or snow days. ACE suggests that such facilities have extended hours and weekend options, as faculty often work around the clock. The AAUP advocates for coordinating academic-year calendars with local public school calendars in order for faculty to be available to participate in their children's school activities."}, {"section_title": "Clear Standards", "text": "In order for any of these strategies to work, requirements for teaching, research, and service must be clearly specified (Armenti, 2004;Trower, 2002b). While the tenure system has been described as ambiguous for all faculty, women perceive a greater lack of clarity in standards than men (COACHE, 2007a) and report higher levels of stress related to the process (ACE, 2005). Clearly communicating standards to all faculty, and providing periodic pre-tenure dossier reviews may help to alleviate this stress (ACE, 2005). In addition to this, revising existing standards in order to better reward teaching and service may help to recognize the variance of feminine academic work patterns (Harper et al., 2001). The ACE panel (2005) recommends broadening traditional definitions of scholarship to include the scholarship of teaching and the scholarship of application, which includes service to society. They also suggest that individual schools or departments within a university be empowered to establish their own criteria for promotion and tenure. This strategy accommodates the changing occupational priorities that women experience after childbirth and acknowledges university-wide differences in workloads and student contact time."}, {"section_title": "Recommendations for University Administrators", "text": "Based on the findings of Mason and Goulden (2002), Ginther and Kahn (2006), and Wolfinger, et al. (2008), the biggest leak in the female tenure-track pipeline occurs when women marry and have children under the age of six soon after earning their doctoral degrees. Perhaps because they have witnessed the difficulty that women have in balancing an academic career and family while they were in graduate school and because they do not want to sacrifice their families for their careers (Ward & Wolf-Wendel, 2004) they simply leave. According to Mason and Goulden (2002), \"Raising children takes time and only accommodation to that basic fact can ultimately allow women to achieve their career goals\" (p. 6). In order to increase the number of women with tenure, the first step is to initiate policy changes that give women with young children the time they need to be successful in their personal and professional lives. The AAUP (2001) and ACE panel (2005) guidelines provide an important starting point, as all of these policies are ultimately designed to assist working parents. U sing these recommendations as a benchmark, university administrators should review existing policies across departments in order to determine what mechanisms are in place to help recruit and retain women at critical career junctures, such as the immediate post-doctoral period and the probationary years. Determining the numbers of female tenure track and tenured faculty within departments and tracking these over time may help determine where a university's own leaks occur in the pipeline. Administrators should also consider institution-wide surveys in order to identify what policies female faculty might find most helpful. Female respondents to a survey by the Collaborative on Academic Careers in Higher Education (COACHE, 2007a) rated the existence of stop the clock policies, personal unpaid leave, formal mentoring, and childcare availability as significantly more important to their success than male respondents did. Another critical element of a university-wide policy review should be identifying both formal and informal policies that exist and then comparing them against national trends, such as those reported in a recent survey by The Center for the Education of Women at the University of Michigan (2007). This survey of 225 institutions revealed that, although the number of \"family friendly\" policies has increased within many institutions, few schools offer a wide range of policies that allow for real flexibility in the workplace (p.3). Out of eleven possible family friendly practices, the survey found that the average number of institution-wide formal policies within a school was 3.8. The most commonly utilized formal policies were paid time off during the disability period for biological mothers, tenure clock extensions, phased retirement, and unpaid dependent care leave beyond the required FMLA period. There was considerable variance. however, in how these policies were actually implemented in differen types of institutions. For example, the survey found that while tenure clock extension is one 0 the most commonly utilized family friendly policies in higher education, i is more common in some types of institutions than others. A breakdown of survey respondents by Carnegie Class revealed that 92% of doctoral-extensive schools have a formal tenure clock stop policy, compared to a mere 44% of Master's I and II institutions. Many ofthe respondents who did not have formal policies reported that there were adhoc or unwritten policies in place which might allow for a tenure clock stop in certain circumstances. These circumstances varied greatly even within institutional types, with most institutions offering a tenure clock stop in the case of birth or adoption, and some of these institutions extending this benefit to same sex partners. Others allowed the clock to stop in the case of injury or disability, while others did not. Multiple stops were allowed in approximately half of all institutions (University of Michigan Center for the Education of Women, 2007). The report cautions against the use of adhoc or informal policies, which may be in violation ~f.the Pregnancy Discri~ination A.c~ of 1978 .if th~y are not equitable to pohcles used for other medIcal condItIons (Umverslty of Michigan Center for the Education of Women, 2007). The AAUW (2004) recommends that all school policies be regularly reviewed for compliance with antidiscrimination laws and that both faculty and administrators receive information related to their rights under these laws. In order to provide clear guidelines for tenure track faculty, the AAUW (2004) recommends requiring annual written evaluations of all faculty on the tenure track. These evaluations should provide the faculty member with explicit evaluations of objective performance criteria for research, service, and teaching. Faculty should be informed annually about their progress toward earning tenure and should be educated on the process early in their careers. One way to accomplish this is by conducting faculty forums on campus which provide practical and concrete information related to the process itself and preparing a dossier. In addition to factors which help women with young children, attention should be paid to possible inequities in the workplace environment. Institution-wide salary analyses may help to determine if there are significant pay discrepancies between similarly qualified men and women on campus. Salary analysis on the institutional level should control for factors such as discipline, seniority, and research productivity and should focus not only on correcting the inequity, but also on determining the root cause of it (Toutkoushian et aI., 2007). Lastly, university administrators should work to implement new faculty orientation and mentoring programs on their campuses. Such programs should provide incoming faculty with structured activities designed to educate them about departmental expectations and socialize them into the academic environment. Pairing tenure-track faculty with experienced, but enthusiastic tenured faculty mentors may help to ease some of the isolation that female faculty feel in their new work setting (Van Ummersen, 2005;COACHE, 2007a). According to Boice (2000), new faculty members who complete a formal mentoring program with an adequately matched mentor are able to meet or exceed standards for scholarly productivity and teaching within their first two years of employment. Mentoring programs should be formalized, but need not be overly time consuming. Boice contends that implementing a successful mentorship program requires a commitment of only one to two hours per week on the part of the mentors."}, {"section_title": "Recommendations for Female Facu Ity", "text": "Perhaps the most effective step that female academics can take to increase their chances of earning tenure is to be as well-informed as possible about the formal and informal expectations that they will face in a specific posi-tion. The AAUW (2004) recommends that women ask for written information about the university's promotion and tenure policies prior to accepting an academic appointment. It is also important to be aware of the existence of any unwritten or adhoc arrangements that are usually made in the event of a change in family status, although these will obviously be more difficult to determine. As always, faculty should be wary of unwritten policies, as there is a greater chance for inconsistent enforcement of these. The AAUW recommends that, whenever possible, these queries be made via email and kept for future reference. The AAUW (2004) also recommends that prospective faculty members meet with their future department chair and other tenured faculty in the department to determine service, teaching, and scholarship expectations and how these will be weighted in the final tenure decision. Specific examples, such as the weight given to particular journals vs. books and grants, will be the most helpful in determining whether the work expectations for the position are congruent with one's plans for balancing work and family. Once a position is accepted, the AAUW cautions female faculty to carefully learn the culture and politics of their department and institution, as the informal culture \"inevitably plays a role in hiring and promotional decisions\" (p. 81). Faculty of both genders can work to improve the tenure status of females by actively campaigning to improve life for working parents on their home campuses. This may begin by organizing into task forces concerned with improving childcare services on campus or forming focus groups to identify the needs of working parents. If not already in existence, committees can be formed to examine the status of women on campus. These committees or task forces should have full endorsement from university administration in order to be most effective. Trower (2002b) recommends that institutions of higher learning take an active role in measuring the satisfaction of women in the academic workplace. The Collaborative on Academic Careers in Higher Education (COACHE) began surveying colleges and universities in 2005 in order to determine the \"top academic workplaces\" in the United States. Auburn University and Davidson College in North Carolina topped the 2006 list of institutions considered exemplary in terms of tenure clarity and achieving work and family balance (COACHE, 2007b). Also in 2005, the Sloan Foundation (in partnership with ACE) began a grant program which awards up to $250,000 to institutions who demonstrate a commitment to developing workplace flexibility initiatives for tenure and tenure-track faculty (ACE, 2007, Sloan Foundation, n.d.). Both the University of California Berkeley and Davis campuses have received Sloan Foundation Grants to cover the cost of replacement faculty during extended maternity leaves and modified duties arrangements for new mothers on the tenure track (UC Davis News & Information, 2006). Other Sloan grant winners include Lehigh University, University of Florida, University of Washington, Iowa State University, and the University of Wisconsin, Madison (ACE, 2006). Beginning a campaign to be ranked as one of the \"top academic workplaces\" or to secure a Sloan Foundation grant may help to recruit desirable female faculty and at the same time improve the lives of women during their probationary years."}, {"section_title": "Conclusion", "text": "According to Smyth and Wetherald, \"Colleges and universities hold an exulted place in U.S. society, and tenured professors occupy an esteemed status within these institutions\" (AAUW, 2004, p. iv). They contend that because higher education serves as the passport to a better-paying job and higher social status, \"achieving diversity among the powerful ranks of tenured professors is an important issue for everyone\" (AAUW, p. v). Although female faculty continue to be underrepresented in the tenured ranks, there are realistic and achievable strategies available for reversing this trend. While successful implementation of these strategies will require investments of time and money, they are necessary in order to plug the leaks in the pipeline of American female scholars."}]