[{"section_title": "", "text": "In the last 50 years, ships have doubled in length, width, height, and depth. Ships built today draw up to 60 feet of water -the equivalent of a five-story building. When transiting a channel, ships may have only inches between their hulls, the channel bottom, and the underside of a bridge. The National Spatial Reference System gives pilots consistent reference points for safe navigation. Over 78 million boaters, using 18 million recreational boats, spend $39 billion a year. The U.S. fishing industry and its 110,000 fishing vessels contribute $35 billion annually to the U.S. economy. The U.S. Marine Transportation System (MTS) -an intricate network of navigable waterways, ports, and harbors -gives our nation competitive access to suppliers and markets around the world. Mariners rely on NOAA's nautical charts, accurate positioning services, marine forecasts, and information on tides, currents, and water levels to move safely and efficiently in and out of U.S. ports. NOAA's navigation services are also used by the growing cruise line industry, national defense agencies, thousands of commercial fishing vessels, and millions of recreational boaters."}, {"section_title": "Supporting Marine Transport and Navigation", "text": "Larger and faster vessels in increasingly crowded waterways are stretching the limits of the MTS. Approximately 3,800 commercial shipping accidents and 5,000 recreational boating accidents occur annually. An emerging issue is the increasing number of bridge strikes -which cost time and resources, and endanger marine environments. In addition to contributing to U.S. economic vitality, NOAA's accurate navigation, information, and positioning tools contribute to national security and environmental protection. The U.S. Coast Guard and the Navy rely on NOAA products and services. Ports and coastal managers use NOAA tools to conserve oceans and coasts, locate and remove harmful debris, and protect the environment."}, {"section_title": "Protecting Our Ports and Waterways", "text": ""}, {"section_title": "Supporting National Security", "text": "As gateways to our largest cities and industries, U.S. ports are strategic targets for terrorists and must be protected. NOAA's underwater surveying experts conduct port hydrographic surveys for navigation, military threat detection analysis, identifying vulnerabilities in infrastructure, and determining evacuation routes."}, {"section_title": "Locating and Removing Marine Debris", "text": "Marine debris -like lost fish nets, plastic bags and other human waste -interfere with navigation safety, hurt MTS shipping and coastal industries, and pose a threat to human health and marine life. Through surveying, research, removal, and outreach, NOAA is combating this growing problem."}, {"section_title": "Updating Vertical Control", "text": "Knowing the relationship of water levels to land features is critical in determining an area's susceptibility to rising seas, lakes, or rivers. Local sea level rise, which is a combination of local and regional oceanographic change, global sea level rise, and the vertical land movement of an area, threatens coastal communities. Storm surge -temporarily rising waters -results in damaging floods, which further add to the threats. NOAA provides the geospatial information to help coastal managers better understand the interface between water and land, allowing for better planning of port operations, flood control measures, emergency preparedness, evacuation routes, and other contingencies. Population growth, climate change, sea level rise, bigger ships, busier waterways, and aging coastal infrastructure are just a few of the challenges facing the marine transportation system. NOAA works with ports, coastal communities, and other constituencies to adapt to these challenges. With 3.4 million square nautical miles of constantly changing water, NOAA's work is more important than ever."}, {"section_title": "Meeting New Challenges", "text": "Exploring the Arctic Melting sea ice in the Arctic is creating longer ice-free seasons and opening new opportunities for shipping. With more human activity in the Arctic, accidents in marine environments present unique challenges for response, assessment, and restoration. Limited resources, challenging conditions, and the remote location of disasters reduce operational options. Considering current knowledge and past experience with Arctic spill conditions, responding to a major oil spill in Arctic waters is problematic."}, {"section_title": "Supporting Coastal Communities", "text": "Sea level rise caused by climate change will have significant impacts on coastal communities and habitats. NOAA's geodetic data, seafloor surveys, and tide information can be used to develop programs that protect coastal infrastructure and ecosystems. Coastal zone managers also use NOAA charts, water level and current information, and elevation and shoreline data to plan coastal protection projects."}, {"section_title": "Mapping and Charting the Coast", "text": "NOAA uses sonar, photogrammetry, and remote sensing technologies to survey waterways for depths and obstructions. This information is used to define the national shoreline and update NOAA's nautical charts. Much like road maps, the charts provide the basic information necessary for safe marine navigation. With charts becoming increasingly electronic, mariners are able to more efficiently plan routes and avoid dangerous or ecologically sensitive areas."}, {"section_title": "Pinpoint Positioning", "text": "NOAA's National Spatial Reference System and National Water Level Observation Network provide a highly accurate, precise, and consistent geographic reference framework throughout the U.S. The systems provide a foundation for determining land and water elevations. Precise positioning and accurate information on constantly changing water levels help mariners make the best decisions for safely maneuvering under a bridge or above an obstruction in our nation's busy waterways."}, {"section_title": "Providing Innovative Tools and Practical Assistance", "text": "Reporting Real-Time"}, {"section_title": "Data on Marine Conditions", "text": "Today's massive ships push the depth limit of many ports and harbors. To help mariners select the safest time to transit shallow waterways, NOAA delivers real-time tide, current, wind and bridge clearance data in a single, consistent coordinated system. Conversely, when marine winds push water into a port, shippers can decide to load extra cargo before heading to deep-water foreign destinations."}, {"section_title": "Responding to Disasters", "text": "NOAA's efforts speed the reopening of ports. Navigation response teams move into a coastal area after a storm moves out, and survey ports and channels, searching for submerged debris and finding alternative routes for commercial and military ships. NOAA aerial photography helps the public, decision makers, and insurance adjusters assess the extent of storm damage. Real-time data supports federal, state, and local decisions on post-storm response."}]