[{"section_title": "Abstract", "text": "Aim: This study aims to quantify longitudinal changes in waist circumference (WC) among adults aged 45-64 years in Germany. Methods: Data of 15,444 men and 17,207 women from one nationwide and six regional prospective German cohort studies were analyzed. The sexspecific mean change in WC per year of follow-up was assessed for each study separately. Findings from the cohort-by-cohort analysis were combined by applying meta-analytic methods. Progression to central obesity (WC ≥ 102 cm in men and ≥ 88 cm in women) within a standardized period of 10 years was described for each study. Results: The estimated mean change in WC per year of follow-up for all cohorts combined was 0.53 (95% confidence interval 0.29-0.76) cm/year for men and 0.63 (0.48-0.77) cm/year for women, but varied between the included studies. Within 10 years, about 20% of individuals with low WC (<94 cm in men; <80 cm in women) and about 50% of individuals with intermediate WC (94-102 cm in men; 80-88 cm in women) progressed to central obesity. Conclusion: The increase in mean WC with aging along with a profound increase of central adiposity is obviously and may have several adverse health effects. Obesity prevention programs should also focus on abdominal obesity."}, {"section_title": "Introduction", "text": "BMI categories according to the definition of the World Health Organization (WHO) [1] has often been used as a proxy for normal weight, overweight, and obesity. However, BMI does not reflect body fat distribution in the abdomen, which is thought to be primarily responsible for the deleterious associations of obesity with various disease risks. Waist circumference (WC), which is correlated with BMI and with abdominal fat accumulation [1] , is a simple anthropometric measure of central obesity [1, 2] and can be easily applied in large population-based surveys and studies. In comparison to BMI, WC appears to be more strongly associated with cardiovascular disease risk [3, 4] and type 2 diabetes mellitus [5, 6] . Therefore, measures of central obesity should be considered when evaluating the development of weight status in individuals in population-based studies over time.\nIn a recent analysis on changes in body weight among German adults aged 45-64 years, we found an average annual gain of body weight of 0.25 kg/year with aging accompanied by an increase in overweight (BMI ≥ 25 kg/m²) and obesity (BMI ≥ 30 kg/m²) during the past decade [7] . Until now, national data on changes in WC and central adiposity in adults based on prospective cohort studies in Germany are lacking. Therefore, the aim of the present analysis is to quantify changes in WC and central adiposity in German adults aged 45-64 years. This study combines the results of seven prospective German cohort studies conducted between 1994 and 2012."}, {"section_title": "Material and Methods", "text": ""}, {"section_title": "Study Populations", "text": "This analysis includes data from a national cohort from the German Health Interview and Examination Survey for Adults (DEGS) [8] and six regional cohort studies covering the control cohort of the PopGen bio-bank from Kiel (Northwest Germany) [9] , the Study of Health in Pomerania (SHIP, Northeast Germany) [10, 11] , the two German study sites from the European Prospective Investigation into Cancer and Nutrition (EPIC) in Potsdam (EPIC-P, Northeast Germany) and Heidelberg (EPIC-Hd, South Germany) [12] , the study of Cardiovascular Disease, Living and Ageing in Halle Saxony-Anhalt (CARLA, Southeast Germany) [13, 14] and the fourth Cooperative Health Research in the Augsburg Region survey and follow-up study (KORA, South Germany) [15] . Details of these studies are described elsewhere [8] [9] [10] [11] [12] [13] [14] [15] . These studies are involved in the EPI Germany Consortium of the German Competence Network Obesity and cooperate to study the magnitude, determinants, and consequences of weight and waist gain among adults in Germany.\nEach study was conducted conforming to the principles of the Helsinki Declaration. The study protocol of the nationwide DEGS was consented with the Federal and State Commissioners for Data Protection and approved by the Charité -University Medicine Berlin ethics committee in September 2008 (No. EA2/047/08). The regional studies were approved by the local ethic committees and the responsible public data protection offices. All participants provided a written informed consent prior to participation in each study. Figure 1 shows the time schedule of the included examinations of the involved studies. Baseline examinations were performed between 1994 and 2007. Follow-up durations varied between 4 and 12 years. To achieve similar follow-up periods, data of the baseline and the 3rd follow-up assessment from EPIC-Hd and data of the baseline and the 4th follow-up assessment from EPIC-P were analyzed. Baseline response rate was below 50% in the cohorts from PopGen (18%), EPIC-P (23%) and EPIC-Hd (38%), while baseline response rates varied between 61 and 69% in the remaining cohorts. At follow-up, participation rate was 75% or more in the regional cohorts, but only 47% in the nationwide cohort study. Data analysis was restricted to the population-based samples. Accordingly, a sample of voluntary blood donors, involved in the PopGen cohort, was excluded. Age at recruitment differed between studies. Consequently, the present analysis was restricted to individuals aged 45-64 years at baseline, which was covered by all studies. In addition, pregnant women and individuals with missing information on anthropometry at either baseline or follow-up assessment were excluded. In most studies, this affected less than 3% of participants, except in PopGen where almost 19% of the participants had missing information. In total, data of 15,444 men and 17,207 women aged 45-64 years were analyzed."}, {"section_title": "Anthropometry", "text": "In each study, baseline WC in cm was measured by trained staff according to standardized procedures [16, 17] . Measurements were conducted in standing position using a non-elastic flexible tape. Measurement procedures slightly differed between studies concerning measurement site and clothing instructions. Baseline WC was measured at the midpoint between the lowest rib and the superior border of the iliac crest over bare skin in the PopGen cohort and over underwear in the EPIC-P cohort [16] . In the other cohorts, the minimal waist was measured at the smallest site between the lowest rib and the superior border of the iliac crest [17] in participants wearing light clothing (DEGS and KORA) cohorts or underwear (SHIP, CARLA and EPIC-Hd). However, in obese participants from DEGS and in participants with no minimal waist visible from SHIP, WC was measured at the midpoint between the lowest rib and the superior border of the iliac crest. At follow-up, WC was measured in all cohorts, except in the EPIC cohorts where WC at follow-up was selfreported by the participants who received a brief written instruction. To reduce bias due to underreporting by self-reports, self-reported WC was corrected by equations previously applied in the EPIC study [18] . At the follow-up examination of DEGS, the measurement instructions were slightly modified: WC was measured in underwear instead of light clothing, and the staff was instructed to measure minimal waist in all partici- pants with visible waist and at the midpoint in participants with 'no minimal waist visible'. In KORA, the measurement site changed: At follow-up examination WC was measured at the midpoint, while minimal WC was measured at baseline examination. A detailed overview of the waist measurement procedures in each study is given in table 1 ."}, {"section_title": "Data Analysis", "text": "The main outcome of this analysis, change in WC (cm) per year, was calculated as the difference between follow-up and baseline WC divided by duration of follow-up (years). In addition, we evaluated to what extent the change in WC was accompanied by a change in the frequency of central adiposity over time. Since the follow-up duration differed between studies, we calculated the change in WC over a standardized period of 10 years. The 10-year WC was calculated as baseline WC + 10 × annual change in WC for each individual. Baseline and 10-year WC were classified by the waist action levels definition of Lean et al. [2] as: low WC (<94 cm in men; <80 cm in women), intermediate WC (94-102 in men; 80-88 cm in women) and central obesity ( ≥ 102 cm in men; ≥ 88 cm in women). This cut-offs apply to Caucasian populations, while deviating cut-offs are recommended for some populations, especially for Asian populations [16] . Since only a small percentage of the German population was not Caucasian [19] , ethnicity was not taken into account for determining WC cut-offs. The development of central obesity was evaluated by the proportion of subjects without central obesity at baseline, who increased their WC to central obesity within 10 years.\nThe statistical analyses were performed for each study site separately according to a common analysis plan. Data analyses were performed using SAS release 9.2 to 9.4 (SAS Institute, Cary, NC, USA) for DEGS, To reduce bias due to drop-out, a study-specific weighting factor was calculated by inverse probability weighting [20] . Therefore, the probability of re-participation was assessed in multivariable logistic regression models, with response at follow-up (yes/no) as the dependent variable and potential predictors of drop-out as independent variables. The potential predictors selected included sociodemographic variables (age, sex, education, and income), BMI and lifestyle factors (smoking, alcohol consumption, and physical activity) as long as they were assessed at the baseline examination in each study. Subjects, who died during the followup period, were not considered in the construction of the weighting factor. The weighting factor applied in DEGS additionally corrects deviations of the baseline sample with regard to age, sex, region, nationality, type of municipality, and education from the population structure at time of data collection (December 31, 1997).\nThe analysis of data from the nationwide study was additionally stratified by region. The classification by geographical region was based on residential state with 'North West' including Schleswig-Holstein, Hamburg, Bremen and Lower Saxony, 'North East' including Mecklenburg-West Pomerania, Brandenburg and Berlin, 'South East' including Thuringia, Saxony and Saxony-Anhalt, 'South West' including Bavaria and Baden-Württemberg and 'Central West' including North-Rhine-Westphalia, Hesse, Rhineland-Palatinate and Saarland.\nTo combine the results of the involved studies, meta-analytical methods were applied, since data pooling was not possible. The average increase of WC for men and women in Germany was estimated with a metaanalysis based on random effect models using the Review Manager Version 5.2 (Cochrane Collaboration, Oxford, UK). To explore the influence of study-specific characteristics, such as baseline WC, years of baseline examination and duration of follow-up, the relationships between mean WC change observed in each study and the respective study-specific characteristics were described by regression analysis."}, {"section_title": "Results", "text": "The mean baseline WC of participants aged 45-64 years in each cohort stratified by sex are shown in table 2 . Among men, the average baseline WC varied between 95.4 (95% confidence interval (CI) 95.1-95.6) cm in the EPIC-P cohort to 102.8 (101.7-103.9) cm in the CARLA cohort. Among women, lowest mean baseline WC was 82.6 (82.4-82.9) cm in the EPIC-P cohort, whereas the highest WC was 92.7 (91.3-94.1) cm in the CARLA cohort. Both men and women from the CARLA cohort had higher mean WC at baseline compared to their counterparts from all other cohorts. In contrast, men and women from the EPIC cohorts and the PopGen cohort had smaller mean baseline WC than men and women from most of the other cohorts. Figure 2 shows the mean changes in WC per year of follow-up in the cohorts for men and women aged 45-64 years. The estimated mean change in WC per year of follow-up for all cohorts combined was 0.53 (0.29-0.76) cm/year among men and 0.63 (0.48-0.77) cm/year among women. However, there were differences between studies. For men, the average gain in WC was smallest among participants from DEGS (0.18 (0.11-0.25) cm/year) and the CARLA cohort (0.21 (0.09-0.33) cm/year), whereas WC increased by more than 0.85 cm/year among men from the PopGen and EPIC-P cohorts. Among women from the CARLA cohort, mean WC declined by -0.17 (-0.32 to -0.02) cm/year, whereas WC increased in women from all other cohorts. The average increase in WC among women from the PopGen cohort exceeded 1 cm/ year, but also women from both EPIC cohorts and from the SHIP cohort exhibited relatively large increases of mean WC of about 0.8 cm/year. Despite the variation in change in WC between studies, no statistically significant differences in mean change in WC were observed between geographical regions in the nationwide study DEGS ( table 3 ). In addition, the distribution of change of WC within Germany in DEGS did not resemble the patterns of change in WC observed across the regional studies.\nThe analysis of the influence of study-specific characteristics on change in WC showed that the average gain in WC was higher in studies with small mean baseline compared to studies with high mean baseline WC ( fig. 3 ). The inverse relationships between mean baseline WC and change in WC were statistically significant for both men and women (β (95% CI) -0.10 (-0.17 to -0.03) for men and -0.11 (-0.19 to -0.04) for women). There were no statistically significant linear relationships of change in WC with period of baseline examination or with duration of follow-up (data in detail not shown).\nIn most studies, a considerable proportion of subjects, who were not centrally obese at baseline, progressed to central obesity within 10 years ( table 4 ) . Overall, about 20% of the individuals with low WC and more than 50% of the individuals with intermediate WC at baseline developed central obesity within a period of 10 years. There was, however, large variation between studies, which reflects the differences in average change in WC of the studies. For example, progression to central obesity was most frequently in the EPIC-P-and the PopGen cohorts, which also exhibit the highest gain in WC. In a further analysis, more than 85% of men and women who were centrally obese at baseline remained centrally obese after 10 years in most studies. With 70%, the proportion of subjects with central obesity at both baseline and after 10 years was considerably lower in the CARLA cohort (data in detail not shown)."}, {"section_title": "Discussion", "text": "Our analysis indicates a significant gain in WC among middle-aged men and women in Germany and a considerable proportion of subjects without central obesity at baseline progressing to central obesity over a 10-year period. When comparing our results on the change of body weight [7] and WC, the patterns of change across the cohort studies seem to be very similar, with the highest increase in body weight and WC in the cohorts of PopGen, SHIP and EPIC-P and the smallest increments in the DEGS and the CARLA cohorts. The proportion of participants without central obesity at baseline, who developed central obesity *Waist circumference >102 cm in men; > 88 cm in women after 10 years among men and women aged 45-64 years old without central obesity at baseline, classified by waist action level by Lean et al. [2] . within 10 years, was higher than the proportion of non-obese participants, who became obese.\nOverall, our finding of a gain in WC by 0.5-0.6 cm/year among women seems to be in line with results from other countries. For example, a study among middle-aged men and women (30-64 years) from France starting between 1994 and 1996 showed an increase in WC over a 9-year period by 0.33 cm/year among men and by 0.44 cm/year among women [21] , while in a sample from the general population in Scotland, 9- year increase in WC rose on average by 0.59 cm/year among men and 0.78 cm/year among women of 39 years of age and by 0.42 cm/year among men and 0.49 cm/year among women of 59 years of age between 1991 and 2000 [22] . In studies from the USA, such as the Framingham Offspring/Spouse Study, WC increased by 0.51 cm/year among men and by 1.37 cm/year among women aged 36-80 years at the first measurement of WC (between 1987 and 1990) during a period of 11 years [23] . In the Health Professional Study WC increased by 0.34 cm/year among men aged 40-75 years between 1987 and 10 years later [24] . In a sample of 45-to 64-year-olds from the Baltimore Longitudinal Study of Aging (USA) with baseline examinations between 1979 and 1982, the increase in WC over a period of 5 years was 0.56 cm/year among men and 0.20 cm/year among women [25] . In a study from the USA involving younger adults aged 18-30 years( Study on Coronary Artery Risk Development in young Adults) starting in 1985/1986, the average increase in WC over a period of 5 years was 0.79 cm/year among white men and 0.49 cm/year among white women [26] .\nSimilar to the above mentioned studies, we observed some variation in the change in WC between the cohorts involved in our analysis. However, since we did not find statistically significant differences in change in mean WC in the analysis stratified by regions in the nationwide study DEGS, study region does not seem to explain the observed variation between studies involved in our analysis. Furthermore, we did not find that study-specific characteristics, which might explain the variation between studies, were associated with study-specific means of change in WC. Dates of the baseline examinations and the varying durations of follow-up (4-12 years) did not consistently influence the change in WC. However, there was a significant inverse relationship between baseline WC and change in WC, as shown by the observation of higher mean waist gain in studies with smaller baseline WC. This suggests that the observed differences between studies might be due to differences in baseline WC in the populations.\nA few limitations should be considered. First, all studies were subject to some level of non-participation at baseline, and the study samples might deviate from the general or regional population despite intensive efforts to enhance study participation. In addition, nonparticipation at follow-up might have influenced our results. To reduce bias due to possible selective participation at follow-up, the analysis was weighted for drop-out. Overall, we cannot exclude that our results are subject to selection bias. In this context, one could notice that average waist gain was higher than average change among participants from studies with a baseline response rate below 50% (PopGen and the EPIC cohorts) compared to the cohort studies with higher response rates at baseline. However, we cannot exclude that these differences might also be due to slight differences in measurement protocols of WC between studies.\nSecond, we had to assume a stable waist gain over time since there were only two time points available for each study. However, we cannot exclude that risk factors and their impact on WC may vary with time.\nThird, previous cross-sectional studies showed significant differences in WC measured at different sites [27] [28] [29] [30] and a longitudinal study showed that the decrease in WC induced by a weight management intervention differed by the measured site [28] . These studies indicate that measurements at the midpoint are generally higher compared to measurements of the minimal waist, and changes in WC measured at the midpoint tends to be higher compared to measurements just beneath the lowest rib or just above the iliac [28] . Consistent with the above mentioned studies, we observed higher changes in the studies applying measurements at the midpoint at both examinations (PopGen) and smaller changes in the studies measuring at the smallest site (CARLA). However, it is difficult to quantify the effect of measurement protocols on our results. In addition, there were not only different measurement positions but also changes in the measurement protocol between baseline and follow-up examination in the DEGS and KORA cohorts. However, we were not able to estimate the consequences of the changes in clothing and the measurement instructions using data from DEGS. This underlines the need to unify the WC measurement procedures and to retain these procedures throughout studies over time. A further limitation was the use of corrected self-reports in the EPIC cohorts at follow-up. Previous studies indicated a reasonable validity of self-reports of WC [31, 32] . In prior analysis on behalf of the EPIC-PANACEA study [33] , the use of prediction equations showed to improve the accuracy of self-reported anthropometry and resulted in values for WC gain comparable to levels observed in the EPIC centers with measured anthropometry both at baseline and follow-up. Thus, the use of corrected selfreports seems reasonable.\nDespite these limitations, our study -including data of more than 30,000 adults from relevant population-based prospective studies -clearly showed a gain in WC resulting in a considerable increase of the proportion of subjects with central obesity among middle-aged adults from Germany."}, {"section_title": "Conclusion", "text": "This is the first study describing the dimension of WC change in the German population with aging based on seven population-based cohort studies during the past decade. The increase of WC and central obesity with aging is worrying since a central fat distribution enhances the risk of several chronic diseases such as cardiovascular disease [3, 4] or diabetes mellitus type 2 [5, 6] . Obesity prevention programs should also focus on abdominal obesity since more participants without central obesity developed central obesity within 10 years compared to the proportion of non-obese participants, who became obese."}]