[{"section_title": "", "text": "an intention to stay eventually left the United States. With the rising international mobility of the highly skilled SEH workforce, policymakers and researchers are interested in understanding the factors influencing their employment destination decisions (Auriol, Misu, and Freeman 2013). This InfoBrief combines data from the 2010 Survey of Doctorate Recipients (SDR), the 2010 Doctorate Records File (DRF), and the 2010 National Survey of College Graduates (NSCG) to define five distinct doctoral populations (table 1). With the recently expanded coverage of the SDR, four U.S.-earned doctorate groups can be identified by their U.S. citizenship status at the time of graduation (U.S. citizen or temporary visa holder) and their residency location in 2010 (United States or abroad). An additional group, foreign-earned doctorates living in the United States, is available from the NSCG, which provides coverage for the U.S.-residing, college-educated population only. These analysis groups will be compared in terms of employment outcomes and working conditions, and the associations between their employment characteristics and ratings of job factors will be examined to shed light on issues potentially influencing their employment decisions."}, {"section_title": "Employment Outcomes", "text": ""}, {"section_title": "Employment Sector", "text": "The choice of employment sector is generally related to degree field (see, e.g., NSF/NCSES 2014, table 12); however, residency location also impacts the choice of sector. For instance, the two U.S. citizen groups with U.S. doctorates-those living in the United States and those living abroad-share similar distributions of degree field but different distributions of employment sector, suggesting that employment opportunities by sector are likely related to their residency location (figure 2). The contrast is even greater among the two groups of temporary visa holders when controlled for broad degree field (table 2). In engineering, temporary visa holders living in the United States were more likely to work in private, for-profit industry (66.4%) than were those living abroad (30.5%). In the fields of computer and mathematical sciences, physical and related sciences, engineering, and health, temporary visa holders living abroad were more likely than those living in the United States to work in the academic sector."}, {"section_title": "Primary Work Activity", "text": "Primary work activities (i.e., activities occupying the most working hours during a typical work week) were classified into three categories: research and development (R&D activities include basic research, applied research, development, and design); teaching; and all other activities. The overall proportion of individuals working primarily in R&D differs across the five groups (figure 3). U.S. citizens living in the United States are the least likely group to work primarily in R&D (47.4%), whereas temporary visa holders living in the United States are the most likely group (67.5%) to work in R&D, excluding U.S. residents with foreign doctorates due to their small sample size. 3 Even after the analysis controlled for degree field, employment sector, sex, and degree year, the overall difference among the groups in their likelihood of working primarily in R&D remained statistically significant."}, {"section_title": "Job Satisfaction", "text": "Survey respondents were asked to rate their overall satisfaction with their principal job on a four-point scale, from \"very satisfied\" to \"very dissatisfied.\" The two groups of U.S. citizens had a higher proportion of \"very satisfied\" (48.3% and 51.9% for residing in the United States and abroad, respectively) than did the two groups of temporary visa holders (29.7% and 33.8% for residing in the United States and abroad, respectively). However, if both positive categories (\"very satisfied\" and \"somewhat satisfied\") are combined, the five groups are essentially the same at about 90%. Satisfaction ratings were also reported for each of the following nine job aspects: salary, benefits, job security,  job location, opportunities for advancement, intellectual challenge, level of responsibility, degree of independence, and contribution to society. For each job aspect, a comparison of the odds of being very satisfied with the aspect was made across the analysis groups while controlling for sex, broad degree field, degree year, and employment sector. The estimated odds ratios, which represent the odds of individuals in a category being very satisfied relative to those in the reference category (while holding other factors constant) are shown in table 3. Odds ratios differing significantly from the value of 1 indicate evidence of different odds of being very satisfied. An odds ratio greater than 1 indicates the specified level has higher odds of being very satisfied with the job aspect, whereas an odds ratio less than 1 has lower odds. Employment sector and analysis group are the two dominating factors. When other factors are held constant, people who work in the private and government sectors have lower odds than those who work in academia of being very satisfied with their job's level of responsibility. Those in all nonacademic sectors have lower odds of being very satisfied with their job's intellectual challenge and degree of independence, but they have higher odds of being very satisfied with salary. The two U.S. citizen groups and the foreign doctorate group, in general, have higher odds of being very satisfied with almost all job aspects when compared to the temporary visa holders living in the United States. Between the two groups of temporary visa holders, those living abroad have lower odds of being very satisfied with their job benefits but have higher odds regarding salary, job security, location, and opportunities for advancement."}, {"section_title": "Working Conditions", "text": ""}, {"section_title": "Job Benefits", "text": "The five analysis groups were compared with respect to whether their principal job offered four types of benefits: health insurance, employercontributed pension or retirement plan, profit-sharing plan, and paid vacation or sick days (table 4). The three groups residing in the United States were more likely to have been offered health insurance than were the two groups living abroad. After the analysis controlled for degree field, employment sector, sex, and degree year, the three U.S.-residing groups were still more likely to have been offered health insurance than the U.S. citizens living abroad. The analysis groups were also compared with regard to their attendance at professional meetings and conferences during the past 12 months.  citizens living abroad (81.5%), and temporary visa holders living abroad (80.5%). After the analysis controlled for employment sector, degree field, sex, and degree year, the differences were still significant."}, {"section_title": "Postdoctoral Positions", "text": "Among recent U.S. doctoral graduates who were employed full time, 15.9% were working in postdoctoral posi-tions (postdoc position). In the fields of biological and life sciences and of physical sciences, where postdoc positions are more common, those residing outside their region of origin (i.e., temporary visa holders living in the United States and U.S. citizens living abroad) were almost twice as likely as their counterparts within their native region to report working in a postdoc position. As shown in figure 4, a similar pattern was observed for the remaining fields of study. Among those holding postdoc positions as their principal jobs, about 30% selected the reason \"Postdoc generally expected for a career in this field,\" and 13% selected \"Other employment not available\" as their most important reason for taking a postdoc position (for further information on the reasons for accepting postdoc positions, see [NSB 2014:5-32, 5-34]). Other reasons selected as most important include \"Work with a specific person or in a specific place\" (18.2%), \"Additional training in PhD field\" (18.1%), \"Training in an area outside of PhD field\" (17.0%), and \"Some other reason\" (3.9%)."}, {"section_title": "Job Transitions", "text": "Among individuals working during both the week of 1 October 2008 and of 1 October 2010, 4 their report of changes in their principal jobs were compared across groups-excluding foreign doctorates, due to their small sample size (figure 5). U.S. citizens living abroad were most likely to have experienced a change in their job and/ or their employer between the two years (44.7%), compared with about 30% for the other three groups. When those who experienced a change were given a list of nine reasons for changing their employer or their job and were asked to select as many reasons that apply, the five most common reasons reported were \"pay, promotion opportunities\" (58.1%), followed by \"working conditions\" (32.3%), \"change in career or professional interests\" (32.3%), \"job location\" (29.0%), and \"laid off or job terminated\" (22.6%). When compared across groups, U.S. citizens living in the United States reported a higher proportion of \"pay, promotion opportunities\" and a lower proportion of \"change in career or professional interests\" than the two temporary visa holder groups. The two groups living abroad were more likely to report \"job location\" as a reason (42.9% and 35.3% for U.S. citizens and temporary visa holders, respectively) than were the two U.S.-residing groups (28.4% and 25.6% for U.S. citizens and temporary visa holders, respectively)."}, {"section_title": "Residency Location of Temporary Visa Holders", "text": "We examined the likelihood of living in the United States during the survey reference period in 2010 for full-time employed doctorate recipients who held a temporary visa at the time of their doctoral graduation. The analysis was performed using only the two temporary visa holder groups. Included in the analysis were factors describing their doctoral education characteristics (degree field, degree year, type of primary financial support, Carnegie classification of their doctoral institution); background (sex, marital status at time of doctoral graduation, region of citizenship origin); postgraduation plan (i.e., having a definite commitment of employment); and perceived importance of nine job aspects (using dichotomous indicators). 5 The estimated odds ratios, which represent the odds of living in the United States for individuals in one category relative to those in the reference category (while holding other factors constant), are shown in table 5. The following factors were statistically significant in predicting the likelihood of living in the United States: sex, degree field, source of financial support, region of origin, marital status, and postgraduation plan. Specifically, when holding other factors constant, temporary visa holders with the following characteristics had higher odds of living in the United States: • Females compared to males • Individuals with degrees outside of social sciences and health • Those whose doctoral education was primarily supported by research or teaching assistantships compared to those supported primarily by fellowships • Graduates with definite commitments for postgraduation employment at the time of their doctoral graduation • Individuals from Asia compared to those from Central or South America • Those who were married compared to those who were never married at the time of their doctoral graduation In addition, if temporary visa holders rated salary, benefits, or job security as very important, they had higher odds of residing in the United States. If, however, they rated intellectual challenge, level of responsibility, or independence as very important, they had higher odds of living abroad in 2010.   NOTES: An odds ratio greater than 1.00 indicates the specified level has higher odds of being very satisfied with a job aspect than the reference level. An odds ratio less than 1.00 indicates the specified level has lower odds of being very satisfied with a job aspect when compared to the reference level. Estimates of odds ratios were derived from logistic regression models. Due to space limitations, the estimated odds ratios for the factor of degree year are not presented. The logistic regression models were fitted using SAS 9.3 procedure SURVEYLOGISTIC; see SAS Institute Inc. 2011. SAS/STAT 9.3 user's guide. Cary, NC: Author.   4. Available job benefits, by doctoral degree origin, citizenship at time of graduation, and current residency: 2010 (Percent) and the 2010 NSCG. The DRF is essentially a complete inventory of research doctorate degrees awarded since the 1920s. Since the 1950s, it has been compiled from the Survey of Earned Doctorates (SED), an annual census of research doctorate recipients from accredited U.S. academic institutions. From the DRF, the SDR selects a sample of research doctorate recipients with degrees in SEH fields to follow over their careers. The SDR is conducted biennially, and the panel is refreshed each cycle with a sample from the DRF of recent SEH doctoral graduates."}, {"section_title": "SOURCES: National", "text": "The NSCG, in contrast, surveys individuals who received a bachelor's degree or higher and are living in the United States. Consequently, the NSCG includes college graduates who received their doctoral degree from a   foreign institution. Moreover, in the NSCG, respondents can self-report that they earned a \"doctorate (e.g., PhD, DSc, EdD).\" As such, foreign doctorate recipients from the NSCG likely represent a broader definition of doctoral graduates than do the research doctorates prescribed by the SED. Still, the sample size for the foreign doctoral population in the NSCG is limited, reflecting its proportionate representation in the more general, U.S. college-educated population. Due to the small sample size and lack of information on their U.S. citizenship status at the time of graduation, a single group of foreign doctorates was defined for the comparative analysis. Although these foreign doctorates provide an interesting analysis group, their small sample size precluded their inclusion in certain comparisons. Comparative terms in this report-such as differed, more or less likely, higher or lower, and odds ratio greater or less than one-are based on statistical tests for significant differences at the 95% level. Percentage comparisons in this report are based on unrounded counts.  5. Estimates of odds ratios of living in the United States during the 2010 survey reference period for full-time employed U.S. doctorate recipients who were temporary visa holders at the time of their doctoral graduation c Job factors are the sum of the listed dichotomous variables (e.g., a sum of 3 for job factor 1 indicates that salary, benefits, and job security are all very important; a sum of 2 indicates that two of these aspects are very important). NOTES: An odds ratio greater than 1.00 indicates that the specified level has higher odds of living in the United States than the reference level. An odds ratio less than 1.00 indicates that the specified level has lower odds of living in the United States compared to the reference level. Estimates of odds ratios are derived from logistic regression models. The logistic regression models were fitted using SAS 9.3 procedure SURVEYLOGISTIC; see SAS Institute Inc. 2011. SAS/STAT 9.3 user's guide. Cary, NC: Author. SOURCES: National Science Foundation, National Center for Science and Engineering Statistics, Survey of Doctorate Recipients, 2010, and National Survey of College Graduates, 2010. a Other sources include grants, traineeships, internships, loans, personal savings and earnings, savings and earnings from others, employer reimbursement, foreign support, sources not specified, and missing responses. b Other regions include Africa, the Caribbean, Oceania, and missing or unknown. 2. Of those who responded to the question, 89% reported an intent to stay in the United States. However, 7% did not respond. Because we are comparing expected stay rates across years and the missing data rate varies from year to year, we are reporting all rates adjusted for missing data. 3. The estimate from the small sample of foreign doctorate holders has a large standard error; hence, statistical comparisons between the foreign doctorates and other analysis groups are not significant. In order to make statistical comparative statements for the other groups, we had to exclude the foreign doctorates from the comparisons."}, {"section_title": "The week of 1 October 2008 and 1", "text": "October 2010 are the survey reference periods for the 2008 and 2010 SDR, respectively. 5. The data were reported on a fourpoint scale (from \"very important\" to \"not important at all\") but are practically dichotomous among the top two levels (\"very important\" and \"somewhat important\"). Hence, the original data were recoded into dichotomous variables, with \"1\" representing \"very important.\""}]