[{"section_title": "Abstract", "text": " The hippocampus, the sagittal stratum, the cingulum, the parahippocampal gyrus, the superior temporal white matter and the fusiform white matter are among the top ranked regions with memory impairment and microstructural changes in AD.  The hippocampus, the sagittal stratum left, the parahippocampal gyrus right and the cingulum (hippocampus) are significantly associated with clinical/cognitive traits as well as amyloid beta accumulation in AD.  Hippocampus right and sagittal stratum left are the two top regions shared in our ranking highly correlated with memory scores as well as AD-pathology endophenotypes.  Though fractional anisotropy (FA), mean diffusivity (MD), axial diffusivity (L1) and radial diffusivity (RD) features were highly correlated with clinical/cognitive/pathology endophenotypes, planarity of the tensor (PLA) and mode of the tensor (MOD) features are not informative to predict white matter changes in AD.  An immune response, interferon signaling and cytokine signaling enriched gene subnetwork derived from the matched blood gene expression data is most correlated with DTI features across all the brain regions.  CELF1, a GWAS AD risk gene, is significantly associated with white matter microstructural changes in the hippocampus.\nMicrostructural abnormalities in white matter (WM) are often reported in Alzheimer's disease (AD). However, it is unclear which brain regions have the strongest WM changes in presymptomatic AD and what biological processes underlie WM abnormality during disease progression.\nWe developed a systems biology framework to integrate matched diffusion tensor imaging (DTI), genetic and transcriptomic data to investigate regional vulnerability to AD and identify genetic risk factors and gene subnetworks underlying WM abnormality in AD.\nRESULTS We quantified regional WM abnormality and identified most vulnerable brain regions. A SNP rs2203712 in CELF1 was most significantly associated with several DTI-derived features in the hippocampus, the top ranked brain region. An immune response gene subnetwork in the blood was most correlated with DTI features across all the brain regions.\nIncorporation of image analysis with gene network analysis enhances our understanding of disease progression and facilitates identification of novel therapeutic strategies for AD."}, {"section_title": "Systems Modeling of White Matter Microstructural Abnormalities in Alzheimer's Disease", "text": "Emrin Horgusluoglu-Moloch, PhD. 1 † , Gaoyu Xiao PhD. 1 † , Minghui Wang PhD. 1 † , Qian Wang, PhD. 1 † , Xianxiao Zhou, PhD. 1 † , Kwangsik Nho PhD 2,3 , Andrew J. Saykin, PsyD. 2, 3 , Eric Schadt, PhD. 1 , the Alzheimer's Disease Neuroimaging Initiative (ADNI) € and Bin Zhang, PhD. 1 †"}, {"section_title": "INTRODUCTION", "text": "Alzheimer's Disease (AD) is the most common type of dementia, affecting 5.7 million people in the U.S. alone, with the number of new diagnoses increasing dramatically each year (Weiner, Veitch et al. 2015 , Alzheimer's 2016 , Weiner, Veitch et al. 2017 . AD patients display hippocampal atrophy, memory impairment, and other cognitive and axonal loss. The ultimate outcome of AD is neuronal loss and catastrophic memory deficits. While many studies have focused on amyloid and neurofibrillary pathology and cortical atrophy in the cortex and subcortical gray matter, less attention has been paid to the significant white matter (WM) abnormalities, such as demyelination, microglial activation, loss of oligodendrocytes and reactive astrocytosis, that have been characterized recently (Acosta-Cabronero and Nestor 2014, Dean, Hurley et al. 2017) .\nMagnetic resonance imaging (MRI) technology provides a path to more thoroughly explore associations between white matter abnormalities and AD related phenotypes. With increasingly high-resolution characterizations of brain structure, MRI now plays an important role in the diagnosis of AD (Knight, McCann et al. 2016 , Rathore, Habes et al. 2017 . Diffusion tensor imaging (DTI) detects abnormal changes in neuronal fibers at the microstructural level in mild cognitive impairment (MCI) and AD, and provides data on the integrity of brain circuitry (Rathore, Habes et al. 2017 , Shen, Finn et al. 2017 . DTI detects the 3-dimensional (3D) diffusion of water molecules along the main fiber directions (Alexander, Lee et al. 2007, Basser and Pierpaoli 2011) , giving rise to specific features such as mean diffusivity (MD) and fractional anisotropy (FA) in white matter regions that have been demonstrated to be strongly correlated WM damage and cognitive impairment (Naggara, Oppenheim et al. 2006 , Lee, Ryoo et al. 2017 ). However, despite the roles well-established AD biomarkers such as amyloid-β deposition and inflammation are known to play in disrupting WM integrity during the early stages of AD, only a small number of studies to date have focused on specific DTI features to identify associations between CSF-biomarkers and changes in WM integrity in AD (Bendlin, Carlsson et al. 2012 , Melah, Lu et al. 2016 . Given this lack of attention, several key questions remain to be explored regarding variations in WM associated with AD-related traits, including the identification of brain regions in which WM changes most strongly correlated with presymptomatic AD and the identification of molecular and biological processes that underlie WM abnormalities that develop as a result of disease progression.\nTo help address these critical questions, we systematically interrogated DTI, genetic, gene expression and clinical data generated on participants in the Alzheimer's Disease Neuroimaging Initiative (ADNI). Given amyloid beta depositions and neurofibrillary tangle pathology are associated with a range of pathophysiologic changes in the brain, including axonal degeneration, disruption of cytoskeletal equilibrium, and synaptic dysfunction (Mandelkow, Stamer et al. 2003 , Cardenas, Ardiles et al. 2012 , we sought to characterize covariation structures between DTI-derived features and AD-related traits such as CSF tau/p-tau and Abeta levels, episodic memory scores, and metabolic activity and amyloidosis (PET) during disease progression. Specifically, we employed a systems biology framework to organize, process, and integrate these data and then characterize the associations among the different dimensions (imaging, molecular, and clinical) of data. Our framework provided for a completely data driven approach to first rank-order all brain regions with respect to their ability, through DTI-derived features, to discriminate between AD cases and controls. Then, from the top ranked brain regions, we systematically modeled white matter microstructural abnormalities in AD to identify 1) regional differences in microstructural changes; 2) correlations between AD-pathology related endophenotypes and brain region specific DTI-features; 3) key biological processes underlying WM pathology by integrating DTI and gene expression data; and 4) AD susceptibility loci associated with microstructural changes in AD. From this integrative analysis, we identified several DTI-derived features that were not only strongly associated with AD-related traits, but that were associated with known genetic risk loci in known AD-risk genes such as CELF1. In addition we identified an immune-associated gene network in blood that was strongly associated with these DTI features across all brain regions, providing a complementary view of disease progression and therapeutic strategies for AD."}, {"section_title": "METHODS", "text": ""}, {"section_title": "Study Participants", "text": "We obtained the data used in this study from the ADNI database (adni.loni.usc.edu). ADNI was launched in 2003 by a public-private partnership led by Michael W. Weiner. Participants were recruited from more than 50 sites across the United States and Canada. ADNI participants consist of older individuals, aged 55-90, who are cognitively normal (CN), or who have significant memory concerns (SMC), mild cognitive impairment (MCI) or clinically diagnosed AD (http://www.adni-info.org/). The ADNI dataset includes structural MRI and PET scans, longitudinal CSF markers, and performance on neuropsychological and clinical assessments. In addition, the ADNI data include APOE and genome-wide genotyping generated on study participants. We analyzed diffusion tensor imaging scans from 269 individuals, including 57 CN older individuals, 33 individuals with SMC, 76 individuals diagnosed with EMCI, 27 individuals with LMCI, and 76 individuals diagnosed with AD. We note that not all individuals included in the analysis of the DTI data had matched clinical and pathological data ( Supplementary Table   S1 ). Clinical and neuroimaging procedures and the other information about the ADNI cohort can be found at http://www.adni-info.org/. "}, {"section_title": "Study participants for each analysis", "text": "Since not all participants in ADNI had clinical and cognitive information, we used different sample sizes for each analysis ( Supplementary Table S2 ). The largest set was comprised of 269 individuals. However, since only 255 or fewer individuals had their phenotype information such as memory scores, cerebrospinal fluid (CSF) amyloid beta and tau levels and CDR score (more information can be found in Supplementary Table S1 ), we opted to use all available samples (Table 2 and Supplementary Table S1 ) for the correlation analyses involving each DTI feature and the neuropathological traits. For the co-expression analysis we used 735 individuals (CN=258, EMCI=212, LMCI=225, AD=40) from gene expression profiling data in ADNI. For correlation analysis of co-expression network and DTI features we used 105 individuals (CN=34, MCI=56 and AD=15) who had matching blood expression and DTI data. For the genetic association analysis we used 225 individuals (CN=46, SMC=29, EMCI=62, LMCI=25, AD=63) from ADNIGO/2 who had both DTI scans and genotyping data. "}, {"section_title": "Acquisition of the Diffusion Weighted MRI Data", "text": ""}, {"section_title": "Diffusion Tensor Imaging Processing", "text": "The features based on regarding these two models are described below."}, {"section_title": "Single Tensor Model", "text": "In the single tensor model, an ellipsoid (tensor) for each 3D image voxel is computed to quantify the magnitude and anisotropy of water diffusion at the corresponding spatial location.\nEigenvalues are then computed from each 3D tensor and used to generate eight DTI features: 1) Fractional anisotropy (FA), 2) Mean diffusivity (MD), 3) Axial diffusivity (L1), 4)\nRadial diffusivity (RD), 5) Linearity of the tensor (LIN), 6) Sphericity of the tensor (SPH), 7)\nPlanarity of the tensor (PLA) and 8) Mode of the tensor (MOD) using FSL (https://fsl.fmrib.ox.ac.uk/fsl/fslwiki). These features are computed by the following formulae:\n1) Fractional anisotropy (FA), which indicates the degree of anisotropy of a diffusion process:\n2) Mean diffusivity (MD), which represents the average rate of diffusivity in all directions:"}, {"section_title": "〈 〉", "text": "3) Axial diffusivity (L1), which indicates diffusivity parallel to the majority of axonal fibers: 4) Radial diffusivity (RD), which captures the average diffusivity perpendicular to axial diffusivity: 5) Linearity of the tensor (LIN), which evaluates the uniformity of the diffusion direction along the main fiber direction (largest eigenvalue): 6) Sphericity of the tensor (SPH), which measures a less uniform isotropic diffusion process that implies more isotropic diffusion: 7) Planarity of the tensor (PLA), which indicates the existence of dispersed fibers along just two dimensions: 8) Mode of the tensor (MOD), which differentiates three types of anisotropy, including diffusion along a geometric plane, diffusion along a single direction, or isotropic diffusion:"}, {"section_title": "Neurite orientation dispersion and density imaging model (NODDI)", "text": "Although the single tensor model has been widely used to extract DTI image features, the single model based measures all rely on the assumption that there is only one axon orientation in each voxel. However, this may not be the case for all brain regions. For example, it has been reported that axonal bundles spread, bend, or cross one another in white matter between the cerebral cortex and nuclei (Zhang, Hubbard et al. 2011) . With the NODDI model, the dispersion in axon orientation can be explicitly represented. Therefore, in addition to the 8 DTI-based features, the orientation dispersion index (ODI) (Zhang, Schneider et al. 2012 ) was chosen as the NODDI-based features in our analysis for its ability to quantify angular variation of neurite orientation and the extent of orientation dispersion about the mean orientation. Higher ODI values indicate larger axonal dispersion."}, {"section_title": "Brain Region Parcellation", "text": "After all nine DWI features were computed for each subject, they were registered to a common template image so that the voxels in each image could be transformed into a common coordinate system. In our study, the image registration involves an affine registration step (FLIRT, https://fsl.fmrib.ox.ac.uk/fsl/fslwiki/FLIRT), followed by a non-linear registration step (FNIRT, https://fsl.fmrib.ox.ac.uk/fsl/fslwiki/FNIRT). We chose the FA image of John Hopkins University Eve atlas (https://www.mristudio.org/) as the common template image and registered the FA feature image of each subject to this template. Using the transformation parameters that had been thus obtained, the other 8 feature images were also transformed into the same coordinate system. In addition, we used the JHU-MNI SS Type-I Mori Atlas (https://www.slicer.org/wiki/Slicer3:Mori-Atlas_labels_JHU-MNI_SS_Type-I) to parcellate the whole brain of each subject into a total of 176 brain regions ( Supplementary Fig. S2 ), which were subsequently evaluated for relevance to AD severity."}, {"section_title": "Endophenotypes", "text": "All AD-related endophenotypes, including amyloid beta levels, Fluorodeoxyglucose ( MMSE and MOCA, which measure memory, recall, and attention, were used as cognitive screening tests (Trzepacz, Hochstetler et al. 2015) . For all score types, those scores determined closest in time to the diffusion MRI scan were chosen for our analyses. Since not all participants in ADNIGO/2 have cognitive and clinical recorded scores, Table 2 summarizes how many participants were included for each correlation-based analysis. "}, {"section_title": "A Systems Biology Framework for the Integrative Analysis", "text": "We developed a systems biology framework to integrate brain region specific DTI data with matched genetic and gene expression data to identify genetic risk factors and gene subnetworks underlying white matter abnormalities in AD (Figure 1) . to systematically rank order 176 brain regions by relevance to AD severity. (B) Multiscale gene coexpression network analysis was then performed on the gene expression data to identify coexpressed gene modules that were enriched for genes that are correlated with DTI features, providing insights into molecular processes associated with WM abnormalities. (C) Gene-and SNP-based association analyses were performed across 23 AD GWAS genes and nine DTIderived features to assess causal links between AD, AD-associated traits, gene expression traits, and DTI features."}, {"section_title": "Correlation analysis of brain region specific DTI-features and neuropathological traits", "text": "As described above, along with the DTI scans, a number of clinical/cognitive scores and AD pathology biomarkers (Aβ, glucose metabolism and CSF-tau) were measured as surrogates of AD status for the ADNI samples. We stratified the traits into two sets as clinical/cognitive scores (ADAS13, MMSE, MOCA, RAVLT, FAQ, Ecog scores, CDR) and AD-pathology (CSF-ABETA, CSF-TAU, FDG-PET and AV45-PET) that reflect different aspects of AD and investigate the relationship between DWI measures with them separately. We elucidated the correlation structure between the imaging feature endophenotypes and clinical/cognitive and pathology biomarker variables to investigate whether any brain region-specific imaging endophenotypes were predictive of clinical outcomes.\nSince DTI features are quantified at the unit of voxel, and given there are hundreds of thousands of voxels in each brain region, we first reduced the dimensionality of the data by computing principal components (PCs) from the voxel-level data for each region-specific DTI feature in each brain region. Principal component analysis (PCA) is a well-established method in neuroimage analysis to reduce data dimensionality. As a data-reduction algorithm, PCA generates a set of new variables or principal components (PCs) that are orthogonal linear combinations of a given dataset to maximally explain the variance of the dataset (Ghodadra, Alhilali et al. 2016, Jolliffe and Cadima 2016) . In this study, we performed principal component analysis with the voxel-level data for each DTI feature in each brain region, and took the first right-singular vector (i.e. the first principal component, PC1) of the standardized voxel-level data as the representative-voxel, called eigen-voxel in this paper. For each brain region, the voxelwise DTI measurements were treated as a two-dimensional matrix with samples in the rows and voxels in the columns. We consider the voxels as individual variables. PCA was performed on the two-dimensional data using the prcomp function in R program language. We then used a respective PC1 as the representative of each region-specific DTI feature. As a result of this dimensionality reduction, we computed 9 eigen-voxels for each brain region, corresponding to the 9 DTI features. We then computed Spearman's correlation coefficient between each clinical/cognitive (i) and each eigen-voxel (j) in each brain region (k). P value significance ( ) of the correlation coefficient was computed via the asymptotic t approximation. Significant correlations were defined as those with Bonferroni adjusted P value less than 0.05 (adjusted by the i*j*k number of correlations computed).\nIn addition to characterizing the correlation between DTI features and AD-related cognitive traits, we sought to prioritize the different brain regions with respect to their relevance to AD by comparing the magnitude of the correlations between the imaging features and cognitive/clinical measures. For this purpose, the various eigen-voxel and clinical/cognitive trait correlations for a brain region (k) were assembled into a composite importance score defined as ∑ ,\nwhere n denotes the number of correlation values (i.e. number of traits times 9 features). The importance score essentially computes the mean of the absolute value of the correlation coefficients across traits and DTI features. We have previously used this type of composite score to ranking the importance of key driver genes identified in gene networks across multiple brain regions (Zhang, Gaiteri et al. 2013 ). However, instead of ranking based on p values as was done in this previous work, we sought to use a quantitative sorting measure from the magnitude of the association in order to incorporate more information into this sorting measure.\nFinally, the composite importance scores ( ) were normalized by dividing by the maximum score, and the brain regions were subsequently rank ordered by this normalized importance score. The brain region with the highest composite importance score was ranked as the top one, while the brain region with the lowest composite importance score was ranked as the bottom one. In this analysis, we used all available clinical/cognitive traits to give an unbiased ranking of the brain regions as only few participants have AD-pathology variables. However, we tested whether each top ranked region was also highly correlated with AD-pathology endophenotypes to predict white matter changes in AD.\nROI analysis is a simple and effective means to investigate white matter changes in small, well defined regions on good quality data. In the ROI analysis, the average signal of all the voxels in a region is correlated with clinical outcomes. However, the previous studies have showed that this technique is prone to error and not suitable for the investigation of structures with complex boundaries or poorly defined changes in white matter microstructure (Hermoye, Saint-Martin et al. 2006 , Froeling M. 2016 Fig. S3 ."}, {"section_title": "Correlation analysis of gene co-expression network and DTI features", "text": "To further characterize the correlation structure between DTI features, clinical/cognitive traits, and biological processes, we constructed coexpression networks using the quality-controlled and normalized gene expression profiling data generated on the blood samples collected on ADNI participants (N=744). These data were downloaded from the ADNI LONI website (http://adni.loni.usc.edu) (Saykin, Shen et al. 2015) . These gene expression data were generated using the Affymetrix Human Genome U219 platform (Affymetrix, Santa Clara, CA).\nProbe sets defined on this platform that did not map to any gene or that mapped to multiple genes were excluded from further analyses. For genes represented by multiple probe sets, the probe set giving rise to the most expression variation across all samples was selected as the representative for the gene. The purpose of choosing the probe sets with most variation is to keep the probe sets with signals (e.g. differentially regulated) among individuals and conditions (low variation means no difference between different conditions). So, with highest variation we can retain genes/isoforms have difference between case and control and exclude those genes have little/no difference (Mancarci, Toker et al. 2017) . In total, 17,849 genes were included for the gene expression analysis. We excluded 9 samples that were not associated with gender and age information, given gender and age information are needed to appropriately adjust the gene expression data for our analyses. This resulted in 735 samples being used for the coexpression network analysis.\nA gene co-expression network for the ADNI blood expression data was constructed using\nMultiscale Embedded Gene co-Expression Network Analysis (MEGENA) (Song and Zhang 2015) . This process involves first constructing a planar filtered network in MEGENA from significantly correlated gene pairs. The output of this step is then input into a multiscale clustering analysis to identify co-expression modules using different scales of compactness of modular structures controlled by a resolution parameter. The modules identified from this step are then compared to random Planar Filtered Network (PFN) modules generated by shuffling the link weights of the parent cluster to calculate statistical significance. Finally, to elucidate the structure of the significant coexpression modules, a multiscale hub analysis is run to identify highly connected hub nodes (genes) for each significant module. MEGENA modules identified via this process containing less than 50 genes were excluded from further analysis. Principal component analysis was performed on the modules to obtain the principal component vectors (eigen-genes) used in the gene expression-DTI feature correlation analysis. In addition, gene ontology enrichment analysis (Wang, Zhou et al. 2012 ) was performed on the significant gene modules to identify representative biological processes associated with the modules. Pearson and Spearman correlation analyses were carried out on the module eigen-genes and the DTI features across the 176 brain regions. To control for multiple testing, we employed a Bonferroni correction procedure, and adjusted p values < 0.05 were considered statistically significant. "}, {"section_title": "Genotyping Data and Quality Control", "text": ""}, {"section_title": "Association analysis", "text": "For association analysis we used 225 individuals (CN=46, SMC=29, EMCI=62, LMCI=25, AD=63) from ADNIGO/2 who have both DTI scans and genotyping data. Set-based association tests were performed in an additive genetic model using PLINK (Purcell, Neale et al. 2007 determine if other SNPs were in linkage disequilibrium (LD; i.e., r 2 >0.5). For each SNP within each set a quantitative trait analysis (QT) was then performed, with age and sex included as covariates. Then, the top independent SNPs in each set were selected if their p-values were less than 0.05 in the QT analysis. From these subsets of SNPs, the statistic for each set was calculated as the mean of these single SNP statistics. Empirical p values for each set were calculated from 20,000 permutations. In ADNIGO/2, a conservative significance threshold (p < 0.00217) was used based on Bonferroni correction for 23 IGAP genes."}, {"section_title": "Construction of CELF1 centered co-expression gene network in AD", "text": "Previously, CUGBP Elav-Like Family Member 1 (CELF1) is identified as GWAS significant gene in AD (Hinney, Albayrak et al. 2014) . CELF1 co-localizes with other CELF proteins and regulates pre-mRNA alternative splicing, mRNA editing and translation (Dasgupta and Ladd 2012) . Since we identified that CELF1 was significantly associated with the establishment of WM integrity in the hippocampus, for further functional analysis we constructed CELF1 centered co-expression gene network and identified functional pathways enriched in the CELF1-centered subnetwork. We assembled 6 gene expression datasets from 6 different brain regions spanning 3 human postmortem brain cohorts, including the Mount Sinai Brain Bank (MSBB) AD RNA-seq (4 cortex regions) (Wang, Beckmann et al. 2018) , MSBB AD microarray (hippocampus region) (Haroutunian, Katsel et al. 2009 , Wang, Roussos et al. 2016 , and the Religious Order Study and Memory Aging Project (ROSMAP) RNA-seq (DLPFC) ). The number of subjects for each human postmortem brain cohort can be found in Supplementary Table S3 . The MSBB AD cohort contained brain specimens obtained from the Mount Sinai/JJ Peters VA Medical Center Brain Bank, which holds over 1,700 samples. This cohort was assembled after applying stringent inclusion/exclusion criteria and represents the full spectrum of disease severity ranging from cognitively normal to severe dementia. RNAsequencing gene expression profiles were generated across 4 cortex brain regions from approximately 360 brains (Wang, Beckmann et al. 2018 ). In addition, microarray gene expression data generated on 19 different cortical regions, including hippocampus, isolated from 55 brains from MSBB were also used (Wang, Roussos et al. 2016) . (Figure 2A ; Supplementary Table S4 ). The PHG, one top region identified, was recently identified as the most affected region with respect to transcriptomic changes among 19 brain regions in an independent AD cohort from the Mount Sinai Brain Bank (Wang, Roussos et al. 2016 ). Since AD-pathology endopenotypes were available for only few individuals, they were not used for ranking regions. Instead, we tested how AD-pathology traits were correlated with the DTIderived measurements of the top ranked regions ( Supplementary Table S5 ).\nFor the top 50 brain regions, we performed a more expansive correlation analysis between the first principal components of the 9 DTI-derived features in each region and various clinical/cognitive traits. Higher values of some clinical features such as CDR, ADAS13, Ecog memory scores were associated with poor outcomes while higher scores of the others clinical features such as MOCA, MMSE and RAVLT were associated with improved outcomes (Figure   2B ). Our results show that MD, RD and L1 features were all predictive of poor outcomes, and they were highly correlated with the clinical dimentia rating (CDR) score as well as composite memory scores, such as RAVLT, MMSE, MOCA, and ADAS 13, across all top 10 brain regions.\nIn contrast, the FA and LIN DTI-derived features were predictive of improved outcomes, although the correlations with AD endophenotypes in these instances were not consistent across the top 10 brain regions. FA score is highly associated with MOCA, FAQ and ECogSP scores in the hippocampus left, the saggital stratum and STWM regions. Informant Ecog memory score, are highly correlated with DTI-derived features except PLA and MOD across 10 brain regions (Figure 2B) . MOD and PLA are not informative of clinical/cognitive outcomes in AD.\nOur correlation analysis between the first principal components of the 9 DTI-derived features in top ten ranked regions and various AD pathology traits revealed that the hippocampus right and left, the sagittal stratum left, the parahippocampal gyrus right and the cingulum right and left were significantly associated with amyloid beta pathology while MD, RD and L1 features in the HIPPO right and left, the SS left, the PHG right, the CHIPP right and left were highly correlated with amyloid beta accumulation (AV45 PET) (corrected p-value < 0.05) (Figure 2B ; Supplementary Table S5 ). Given L1 (axial diffusivity) is associated with axonal injury (Acosta- A . "}, {"section_title": "Co-Expression-Diffusion Network Analysis establishes a link between DTI features and a blood transcriptional network associated with AD", "text": "To connect the imaging and clinical feature data with molecular data that can help elucidate the biological processes associated with variations in the DTI features, we constructed gene coexpression networks from molecular profiling data generated on the blood of ADNIGO/2 participants. Applying MEGENA (Song and Zhang 2015) to these data captured interactions among 17,849 genes and identified 150 gene co-expression modules ( Supplementary Table   S6 ) comprised of highly interconnected (coregulated) genes. A total of 105 ADNIGO/2 participants had DTI scans that were matched with blood gene expression data ( Supplementary Table S7 ). We correlated the eigengenes computed for each module with the 9 DTI features for each brain region ( Supplementary Table S8 ), identifying all significant correlations at a Bonferroni adjusted significance threshold of p < 3.7x10 -5 ( Table 2) . We also carried out gene ontology enrichment analysis to annotate the MEGENA modules with representative biological process categories ( Supplementary Table S9 ). Among the significant To further characterize the degree of association between the gene coexpression modules and DTI features, we rank-ordered the modules based on the degree of association between each module and the DTI features in all the regions ( Supplementary Table S10 ). Figure 3 depicts the correlation summary for all the modules. The module M30, which is associated with immune response pathways, is the module most associated with multiple brain regions and DTI features ( Figure 3B) . Figure 3C shows the network structure of M30 and highlights 7 highly connected (hub) genes including SERPING1, BATF2, PML, IRF7, IFI35, IFIT3 and RNF31."}, {"section_title": "Genetic links between DTI features and AD risk loci", "text": "While the gene coexpression network analysis provides a way to link coherent molecular interactions in blood with the brain imaging data, pleiotropic relationships between imaging data and genetic risk loci for AD reflect potentially more direct causal links. To identify such links we analyzed the DTI scans from the participants' most recent visits and their association with the genotyping data in the ADNIGO/2 dataset (N=225) ( Supplementary Table S11 ). Given that the hippocampus left was the first ranked region with clinical/cognitive outcomes and was most strongly related to AD-associated traits, we performed gene-based association analysis between twenty-three AD risk loci and the fractional anisotropy (FA) feature in the hippocampus.\nWe identified CELF1 (CUGBP Elav-Like Family Member 1) as the most significantly associated loci with the DTI-derived FA feature in the hippocampus (Bonferroni corrected p = 8X10 -4 ; Table 3 ). An intronic SNP (rs2203712) in the CELF1 gene was identified as the most significantly associated with FA, LIN, and the ODI DTI features in the hippocampus (p = 6.34X10 -4 , 1.4x10 -3 , 7X10 -4 , respectively; Table 4 ). At this loci, the participants with no copies of the minor allele (n = 78; TT genotype) had a smaller FA value in the hippocampus compared to those with one copy of the minor allele (n = 102; CT genotype) or two copies of minor allele (n = 45; CC genotype) (Figure 4) . Table 3 : Set-based association for 23 IGAP loci and the FA feature using all the common variants (MAF ≥ 0.05) in the neighborhood of the identified risk gene corresponding to each AD risk locus. Empirical p-values were calculated using 20,000 permutations in PLINK. We also examined the effect of the minor allele (rs2203712-C) on FA in both amyloid-negative and amyloid-positive participants classified as positive or negative by CSF Aβ 1-42 levels."}, {"section_title": "Gene", "text": ""}, {"section_title": "Number of SNPs in gene", "text": "Hippocampal FA values were significantly higher in Aβ positive participants carrying at least one minor allele (p = 0.004) (Figure 4) . participants. rs2203712 is significantly associated with FA in amyloid-positive participants (p = 0.004). Each participant was classified by their amyloid status (positive versus negative) at the last visit (determined by standard cutoffs on CSF amyloid levels)."}, {"section_title": "Constructing CELF1 centered co-expression gene network in AD", "text": "To understand the functional context of CELF1 operation in AD, we constructed a CELF1 centered network using 6 gene expression datasets from 6 different brain regions in three human postmortem brain cohorts, including Mount Sinai Brain Bank (MSBB) AD RNA-seq (4 cortex regions) (Wang, Beckmann et al. 2018) , MSBB AD microarray (hippocampus region) (Haroutunian, Katsel et al. 2009 , Wang, Roussos et al. 2016 , and ROSMAP RNA-seq (DLPFC) . The genes significantly correlated (positively or negatively) with CELF1 in all 6 datasets formed the consensus network ( Figure 5 and Supplementary Table S12 ). This subnetwork was enriched for a number of neuronal system related pathways such as synapse, neuron differentiation, synaptic signaling, synaptic transformation, myelin sheath, axonogenesis and neurogenesis ( Supplementary Table S13 ) ( Figure 6) . Moreover, the network harbors several well-known AD risk genes including MEF2C, PSEN1, CD2AP, PICALM, HLA-DRB1 and TREM2.\nA. represented by red circle nodes. In both network plots, the diamond nodes are AD risk genes. "}, {"section_title": "B.", "text": ""}, {"section_title": "DISCUSSION", "text": "Most previous studies involving imaging data in an AD context have focused on specific tensorbased metrics such as FA (a measurement of overall directionality of the diffusion of water molecules) and MD (a measurement of the average rate of diffusivity) features to maximize the power of diffusion MRI scans to identify disease related microstructural abnormalities in the WM of AD related regions (Kantarci, Senjem et al. 2011 , Maggipinto, Bellotti et al. 2017 , Nir, Jahanshad et al. 2017 . In this study, we employed a data driven approach to rank order 176 brain regions with respect to their correlation with region specific DTI features and disease severity. The hippocampus, the cingulum, the parahippocampal gyrus right, the sagittal stratum, the superior temporal white matter and the fusiform white matter (FWM) right were the most 0  2  4  6  8  10  12  14   GO_NEURON_PROJECTION  GO_NEURON_PART  GO_SYNAPSE  GO_SYNAPTIC_SIGNALING  GO_NEUROLOGICAL_SYSTEM_PROCESS  GO_CELL_CELL_SIGNALING  GO_DENDRITE  GO_REGULATION_OF_SYNAPTIC_PLASTICITY  GO_NEUROGENESIS  GO_REGULATION_OF_NEURON_DIFFERENTIATION  GO_AXON  GO_G_PROTEIN_COUPLED_RECEPTOR_SIGNALIN… GO_REGULATION_OF_AXONOGENESIS GO_MYELIN_SHEATH"}, {"section_title": "-log(P)", "text": "correlated with clinical/cognitive traits. Most of these regions have been previously shown to be associated with AD related phenotypes, with some well demonstrated to play a central role in AD pathogenesis and progression (Kuczynski, Targan et al. 2010 , Nir, Jahanshad et al. 2013 ).\nIn addition, we identified that the parahippocampal gyrus is highly associated with white matter microstructural changes in AD. The hippocampus plays an important role in the formation of episodic and spatial memory and is associated with many neurodegenerative diseases (Axmacher, Elger et al. 2008) . A pattern of increased MD has previously been found in the hippocampus of AD patients compared to normal individuals (Lin, Hsu et al. 2016) . The cingulum on the other hand is enriched for WM fibers and is known to play an important role in in construction of memory networks by carrying axons that project pyramidal neurons in CA1\nand CA3 sub-regions of the hippocampus (Kantarci, Senjem et al. 2011 , O'Dwyer, Lamberton et al. 2011 , Nowrangi, Lyketsos et al. 2013 , Sali, Verganelakis et al. 2013 , Nowrangi and Rosenberg 2015 . The WM microstructural changes and myelin specific pathology in the parahippocampal region have been identified in MCI and AD patients (Salat, Tuch et al. 2010 , Solodkin, Chen et al. 2013 . In another recent study carried out by our group, the parahippocampal gyrus was identified as the most affected region in the transcriptomic analysis of 19 brain regions in an independent AD cohort from the Mount Sinai Brain Bank (Wang, Roussos et al. 2016) . Fractional anisotropy reduces specifically in cingulum in hippocampus and sagittal tracts in AD patients, suggesting that disruption of WM tracts occur near the medial temporal lobe (Qiu, Oishi et al. 2010) . A three year follow-up study showed changes in WM in the cingulum fibers and hippocampus (Fu, Liu et al. 2014) , the top two regions by our study. We further discovered here that the L1, MD and RD DTI features were all highly correlated with amyloid beta pathology as well as memory composite scores in regions most affected by AD.\nFusiform gyrus plays a crucial role in facial recognition (Hargrave, Maddock et al. 2002) , and lower FA scores in fusiform gyrus were significantly associated with lower MoCA scores in the MCI group relative to normal controls (Cooley, Cabeen et al. 2015) . We also revealed a positive correlation between MoCA scores and myelination in the fusiform white matter right. Moreover, we found that the MMSE, MOCA, RAVLT, ADAS13, and CDRSB scores were all highly correlated with the L1, MD and RD DTI features, while informant everyday cognition (EcogSP) memory scores were highly correlated with all DTI-derived features in the parahippocampal gyrus right, the superior temporal white matter, and the fusiform white matter right.\nThese results demonstrate that our findings are in agreement with previous findings of impaired WM integrity in the hippocampus, the parahippocampal gyrus and the fusiform regions of the brains with MCI and AD. Most of the brain regions in our findings are more generic to cognitive impairment in general, and may not be specific for AD. However, our correlation analysis with AD-pathology biomarker variables revealed that L1, MD and RD features in the HIPPO-left, the HIPPO-right, the SS-left, the PHG-right, the CHIPP-left and the CHIPP-right are highly associated with amyloid burden but not any of CSF tau measurements. Previous studies showed that there was a sharp increase in λ1, which represents L1 measurement in AD (Acosta-Cabronero, Alley et al. 2012, Acosta-Cabronero and Nestor 2014). In AD patients, it has been observed that regions with significant increase of λ1 that were concordant to those of RD and MD had substantial anisotropy changes (Acosta-Cabronero, Williams et al. 2010). Since the degeneration leads to increase in λ1 or axial diffusivity, higher level of L1 is associated with worse memory scores and higher CDR score. The parahippocampal gyrus, the hippocampal cingulum and the sagittal stratum are the regions most impacted by axial degeneration and myelination during disease progression and thus they have the decreased white matter integrity (Liu, Spulber et al. 2011 , Sun, Salat et al. 2014 ). Further research is needed to explore the connectivity of the other top-ranked regions to confirm the disruption of WM integrity.\nThe integration of gene coexpression network analysis with the DTI data led to identification of an immune-response gene subnetwork that was significantly correlated with demyelination and axonal injury, especially in the fusiform WM, one of the top regions we identified. Many studies have showed that immune response including the activation of microglia, release of inflammatory cytokines/chemokines and enhanced oxidative stress, is associated with AD (Britschgi and Wyss-Coray 2007, Frank-Cannon, Alto et al. 2009 ). Microglia exhibit region specific patterns of gene expression as well as phenotypic diversity in different brain regions associated with neurogenesis, neuroinflammation and aging (Olah, Biber et al. 2011 , Grabert, Michoel et al. 2016 . Increased microglial activity was found mostly in WM regions relative to other brain regions in AD animal models (Raj, Yin et al. 2017) . The immune enriched subnetwork was also correlated with WM changes. Further studies related to imaging of glial cell activation and WM changes in specific brain regions could potentially reveal a mechanistic understanding of the role of microglia response in WM microstructural changes. After examining some of the structural features of the immune enriched subnetwork, we identified SERPING1, a gene known to regulate inflammatory processes (a C1 inhibitor) during inflammation (Glezer, Chernomoretz et al. 2007) , as one of the most highly connected nodes (hub nodes) in this subnetwork. SERPING1 is known to play a crucial role in cortical development (Gorelik, Sapir et al. 2017 ) and age-related macular degeneration (Ennis, Jomary et al. 2008) . We also identified another important gene, IRF7 which is interferon regulatory transcription factor, modulates immune responses against Herpes simplex virus type 1 by effecting IFN pathway in Alzheimer's Disease (Costa, Agostini et al. 2017) . Our other hub gene PML (Promyelocytic Leukemia) plays important role in plasticity, circadian rhythms (Manners, Roy et al. 2018 ) and polymorphism in this gene was significantly associated with neuroimaging biomarkers in hippocampus and insular cortex (Moon, Dinov et al. 2015) .\nIn addition to the characterization of gene expression and AD phenotypes associated with DTIderived features, we explored the genetics of DTI-derived features in the hippocampus with respect to the known AD susceptibility loci and identified CELF1, which is contained in a risk locus recently identified in a large-scale AD GWAS (Lambert, Ibrahim-Verbaas et al. 2013) , as a potential genetic regulator. CELF1 co-localizes with other CELF proteins and regulates pre-mRNA alternative splicing, mRNA editing and translation (Dasgupta and Ladd 2012) . We observed that CELF1 was significantly associated with the establishment of WM integrity in hippocampus. CELF1 may play important role in myelination process and axonal injury. Of particular note is that the most significantly AD-associated SNP in this locus, rs2203712, is highly associated with higher FA levels, a score that reflects fiber density and myelination in WM. In IGAP, the SNP rs10838725 in CELF1 is associated with the expression of MTCH2 and FNBP4 expression levels (Karch, Ezerskiy et al. 2016) , and more recently it was found to be associated with delayed AD onset and decreased expression of SPI1 in monocytes and macrophages. The SNP rs2203712 we identified, is contained in the same LD (Linkage Disequilibrium) block (97%) as the GWAS SNP rs10838725, and from the Brain eQTL Almanac (BRAINEAC) brain tissue microarray-based gene expression database (http://www.braineac.org/) and as with rs10838725, rs2203712 is significantly assciated with FNBP4 expression levels in the hippocampus (p-value = 8.9x10 -3 ).\nTo better understand the functional pathways underlying CELF1's regulation of AD pathogenesis, we identified a CELF1 centered consensus gene co-expression network based on three AD gene expression datasets including the Mount Sinai Brain Bank (MSBB) AD RNAseq data (4 brain regions) (Wang, Beckmann et al. 2018) , the MSBB AD microarray data in the hippocampus region (Wang, Roussos et al. 2016) , and ROSMAP RNA-seq data from the dorsolateral prefrontal cortex (DLPFC) (De Jager, Ma et al. 2018). The consensus network was associated with neuronal functions such as synaptic signaling, transformation, myelin sheath, axonogenesis and neurogenesis. In addition, this network contained known AD risk genes such as PSEN1 and TREM2. Given that the hippocampus is comprised mainly of grey matter and very sensitive to early changes in MCI and AD, our findings with respect to the hippocampus may represent secondary, indirect association effects. CELF1 and its associated gene network not only provide novel insights into disease pathophysiology, but they represent potential therapeutic targets. Interestingly, CELF1 was also contained in one of the top coexpression network modules associated with DTI-derived features from the inferior fronto occipital fasciculus right region.\nThe results from the DTI data and those from our previous transcriptomic data from 19 brain regions (Wang, Roussos et al. 2016) pinpointed the PHG as one of the most modified brain regions in AD. Therefore, PHG may serve as a potential important indicator for AD progression.\nMore focused imaging and multi-Omics studies of the PHG may unlock some key mechanisms with respect to AD pathogenesis. Our study not only quantifies the vulnerability of 176 human brain regions to AD but also reveals their potential upstream genetic regulators as well as downstream manifestation in blood. However, there are important limitations of our study. First, while ADNI still remains the best and largest cohort with matched multi-omics and DTI data, the study contains only a moderate number of subjects and a very limited number of subjects have longitudinal DTI data. Therefore this cohort is less suitable for causal inference. To overcome this limitation, we used quantitative traits (QT) as phenotypes to substantially increase the detection power of variant association analysis over a traditional case-control setup (Shen, Thompson et al. 2014) . Further, while our study involved a great many traits and many associations, we applied very rigorous processes to contain false discovery rates. As such, the most prominent findings reported here are statistically significant after rigorous corrections for multiple testing. Another limitation with this study is the lack of inference of trajectories or causal sequences as ADNI currently has a very limited number of subjects with longitudinal DTI data.\nMoreover, this study is the lack of replication in the gene-based analyses. Meta-analysis results would increase our detection power. Further studies are needed to explore functional evidence of the CELF1 SNP, which was found to be associated with DTI features and gene expression in AD. Notwithstanding these limitations, this study provides novel insights into the biological processes and key regulators related to white matter microstructural changes and the findings could lead to novel therapeutic strategies for AD as well as other neurodegenerative diseases."}]