[{"section_title": "Introduction", "text": "Scientists studying aging do so along two fronts. Physiologists, molecular biologists and biochemists aim to uncover the proximate mechanisms behind senescence and age-related diseases. Evolutionary biologists seek the ultimate causes of why aging exists per se (i.e. why organisms are not eternal) and for the variation in aging patterns across populations and species (Jones et al. 2014). While the unification of these two perspectives into a coherent framework is not yet complete (Stearns 2011), both agree on one thing: aging is a multisystem process involving multiple interrelated biochemical networks in the organism (Kirkwood 2005;Kirkwood 2011). On the one hand, evolutionary theories of senescence (e.g., Williams 1957;Kirkwood & Holliday 1979) predict a 'top-down' type of causality whereby natural selection on an organism's functions (growth, body maintenance, fertility, etc.) that engage multiple biochemical systems shapes aging rates and mortality schedules by trading-off biodemographic traits to optimize reproductive fitness (Kirkwood 2005). On the other hand, numerous genetic, molecular and cellular mechanisms modulating agerelated functional declines (e.g. in DNA repair, oxidative balance or cell division), disease risk and lifespan have been identified (Behl & Ziegler 2014). While this bloom of mechanistic studies demonstrates that aging should be studied from the perspective of complex adaptive systems (West & Bergman 2009), it has rather favoured a piecemeal and 'bottom-up' conception where aging is often reduced to the simple sum of damage accumulating in biomolecules (Medvedev 1990;Behl & Ziegler 2014). The homeostatic dysregulation hypothesis (McEwen 1998;Crimmins et al. 2003;Seplaki et al. 2006;Ramsay & Woods 2014) allows bridging these two perspectives. In agreement with the top-down evolutionary perspective, it contends that natural selection has organized biological networks into a number of key system-level regulatory processes and that aging is caused by their progressive breakdown and the loss of homeostasis (Cohen et al. 2012). This is thought to operate in a cascade fashion from primary mediators (e.g. Interleukin-6 and hormones such as IFG1 or cortisol) to secondary (e.g. metabolic syndrome) and tertiary (diseases) outcomes (Seplaki et al. 2006), with cumulative response to stress playing a key role in this process (McEwen 1998;Karlamangla et al. 2002;Taffett 2003;Gruenewald et al. 2009;Arbeev et al. 2011). Importantly, physiological dysregulation might be the mechanism underlying frailty, a clinically key syndrome in geriatrics (Fried et al. 2001;Fried et al. 2005) defined by Fülöp et al. (2010) as a \"nonspecific state of vulnerability, which reflects multisystem physiological change\". Since physiology can become dysregulated in various ways, this calls for multivariate statistical methods to assess the integration of large numbers of biological molecules as they change over time (de Magalhães & Toussaint 2004;Kirkwood 2011;Cohen et al. 2013). We recently introduced a method to measure general physiological dysregulation (PD) by applying Mahalanobis multivariate statistical distance (D M ; Mahalanobis 1936) to biomarker data (Cohen et al. 2013). D M measures how strange each individual's profile is with respect to the centroid of a reference population assumed to have a 'normal' or healthy physiology. We showed that it increases with age and predicts mortality in two human populations (Cohen et al. 2013;Cohen et al., in press), and that it is associated with body condition in birds (Milot et al. 2014). This holds even when D M is uncorrelated with its component biomarkers and whether or not the biomarkers are not chosen based on specific a priori hypotheses regarding their role in aging. We are further investigating the robustness of the PD signal to the number of biomarkers entering the D M calculation and the choice of the reference population (Li et al., in prep.). While these previous studies have validated D M as a measure of PD, nothing is yet known about the specifics of how dysregulation changes with age and affects health. In particular, since dysregulation is a time-oriented process, documenting PD trajectories and how they relate to health outcomes is fundamental to uncovering the mechanistic role that PD may play in aging. For instance, does PD increase linearly or non-linearly with age? We predict that positive feedback loops in dysregulation would cause non-linear, likely exponential, increases with age. Is there important variation among individuals in the rate of dysregulation? If so, individual rates of dysregulation would provide an important metric for assessing how genetic and/or environmental factors contribute to dysregulation-related aging. Is dysregulation the biological process underlying and leading to clinical frailty? Is dysregulation causing or caused by chronic diseases? Addressing these questions requires documentation of the association between PD trajectories and outcomes. Because of its generality, we expect PD to show a positive association with a broad range of undesirable aging-related health outcomes. Nonetheless, not all these associations are likely to be equally strong, and understanding which outcomes are most closely associated with dysregulation may provide important insights into the underlying pathology of these outcomes. Here, we provide a big-picture overview of the answers to these questions. Using data from three longitudinal cohort studies of aging -one European and two American -we calculate D M based on two different biomarker suites selected using markedly different criteria. We apply Bayesian mixed models to estimate population and individual trajectories of PD with age. Next, we apply the parameters characterizing individual trajectories to predict mortality, clinical frailty, and incidence/prevalence of cancer, cardiovascular disease, and diabetes. We show that PD accelerates with age and is strongly associated with increased risk of various health outcomes after controlling for age."}, {"section_title": "Materials and Methods", "text": ""}, {"section_title": "Data", "text": "Analyses were conducted on three longitudinal cohort population-based studies. Invecchiare in Chianti (InCHIANTI) is a prospective study with 1445 participants randomly selected from two towns in the Chianti area, Italia, using multistage stratified sampling (1156 adults aged 65-102 and 299 aged 20-64) (Ferrucci et al. 2000). The first visit occurred between 1998 and 2000 with subsequent follow-ups in 2001-03, 2005-06 and 2007-08. A total of 1310 individuals with measurements at up to four visits were available for this study. The Women's Health and Aging Study (WHAS) I & II are complementary prospective studies of community-dwelling elderly women from eastern Baltimore City and Baltimore County in Maryland (Fried et al. 1995;Fried et al. 2000). WHAS I was composed of 1002 women aged ≥65 among the one-third most disabled in the community; WHAS II included 436 women aged 70-79 among the two-thirds least disabled. Baseline assessment for WHAS I and II occurred in 1992-95 and in 1994-96, respectively, with follow-up visits conducted approximately 1.5, 3, 6, 7.5, and 9 years later. A total of 1159 women with measurements at up to seven visits were available for this study. The Baltimore Longitudinal Study of Aging (BLSA) started in 1958 and is one of the longest longitudinal studies of aging (Ferrucci 2009). Participants are 21-96 years old, mostly middle-to upper-class individuals drawn from the Baltimore and Washington DC areas and followed approximately every two years. A modification of the study design in 2003 increased by manifold the number of biomarker available (Ferrucci 2009). Thus a total of 1249 individuals having a baseline visit year ≥2003 and with measurements at up to eight visits were available for this study."}, {"section_title": "Biomarker selection", "text": "The homeostatic dysregulation hypothesis predicts that the loss of physiological integration should be detectable in different systems and across different biomarker sets (Cohen et al. 2013). To assess how robust to marker selection our results are, we chose two suites of biomarkers using markedly different criteria. The first one, the \"statistical suite\", comprises 14 markers that were selected from a pool of 63 markers in our previous study of WHAS II, based on the significant increase with age of their deviation from the population average at baseline (Cohen et al. 2013; Table 1). Point measurements of D M calculated from these markers or subsets of them was found to predict age and mortality in WHAS, InCHIANTI and the National Health and Nutrition Examination Survey (NHANES), a continuous crosssectional survey in the US (Cohen et al. 2013;Cohen et al. in press). Two of the markers (osteocalcin, direct bilirubin) were not available for InCHIANTI, hence here we used only the remaining 12 with that dataset. The second set of markers are those 14, among 43, that were most strongly associated to the first axis of variation in a principal component analysis conducted on InCHIANTI, WHAS and BLSA in a study unrelated to physiological dysregulation (Cohen et al., in prep.). The stability of this axis among the three populations suggests that it measures a previously undetected biological process. Thus, we call this set the \"biological suite\". The two biomarker sets partially overlap (Table 1)."}, {"section_title": "Statistical distance and reference populations", "text": "Mahalanobis distance (D M ; Mahalanobis 1936) was used to measure how aberrant a physiological observation is relative to a reference population (RP) assumed to have a healthy physiology (see Cohen et al. 2013 for details). Validation analysis on InCHIANTI, WHAS and NHANES suggests that a sample can be used as its own RP in most cases, although a subset of younger healthier individuals may perform better (Li et al., in prep.). In particular, using individuals younger than 70 as the RP can substantially increase the strength of the dysregulation signal detected. We thus selected this threshold for all data sets. For WHAS, this implied that only women aged 65-70 were used as RP. Although this greatly reduces the sample size available to estimate the covariance matrix, the latter seems quite robust to this parameter (Li et al., in prep.). However, since the women aged 65-70 were all from WHAS I, thus among the most disable third of their community, we also replicated analyses using the whole SP (i.e. WHAS I + II) as the RP. Since the results were not qualitatively different, here we present only those for the RP of women aged ≤70."}, {"section_title": "Mortality and health outcomes", "text": "For InCHIANTI and WHAS the censoring time of each individual, and whether or not he/she was alive at that time, were available. This allowed determination of the age at death for individuals who passed away during the study period and the minimal lifespan for those who did not. For BLSA, the date and age at death of individuals who passed away during the study period was known but we had no censoring time for others. Thus, we used the date at last visit as the censoring time for the latter and accounted for the selection bias that may ensue from this procedure in the interpretation of the results. Health outcome analyses were restricted to individuals who were free of the outcome at baseline. Chronic disease status was available at each visit for InCHIANTI but only at baseline for WHAS. The reverse was true for frailty. Thus, outcomes available only at baseline for a particular data set were not analysed for that data set. No health outcome data were available for BLSA. Outcomes were coded as 0 (no disease) or 1 (presence of disease). Uncertain diagnostics were reported for some outcomes (coded as 0.5). In those cases analyses were conducted twice by treating scores of 0.5 either as 0 or 1 in separate analyses. Clinical frailty was defined as the fulfilment of at least three of Fried's criteria: unintentional weight loss, fatigue, reduced grip strength, reduced physical activity and low gait speed (Fried et al. 2001). Cancer was defined as the presence of self-reported malignant neoplasm (ICD-9 codes 140 -208 inclusively, except 173). Diabetes was diagnosed when fasting plasma glucose level was ≥126 mg/dL (following the American Diabetes Association 2003 criteria) or when the subject took drugs for this disease such as insulin and oral hypoglycemics."}, {"section_title": "Longitudinal trajectory analysis", "text": "To estimate PD trajectories we performed random regression analysis by fitting Bayesian generalized linear mixed-effect models to our data. These models allowed us to assess population-level trajectories by fitting appropriate fixed effects as well as individual deviations from the population by fitting random effects. Specifically, the general model structure was: where β 0 is the population mean (independent of age), β 1 and β 2 the population coefficients for respectively linear and quadratic effects of age, b 0,i the random intercept of individual i and b 1,i the deviation of individual i from β 1 , corresponding to random deviation from the population trajectory in the slope of dysregulation with age; ε i is a residual error term. Estimating the random quadratic term requires much data and preliminary analyses suggested that, for many individuals, we lacked the sufficient number of visits to properly estimate this parameter. Thus, we did not include it in our models. We fitted an unstructured matrix for random terms, which allows non-zero covariances between them. In a second set of analyses we fixed covariances to zero, which improved much convergence for reasons discussed later (see Results). A Markov Chain Monte Carlo (MCMC) procedure was used to sample the joint posterior distribution of parameters. Prior distributions were chosen to be within the non-informative range as much as possible. This was done by selecting small values for the prior variance in random terms (10 −5 and 10 −7 for b 0,i and b 1,I , respectively, to scale them with age and age 2 ) and by setting the prior residual variance at one, i.e. ~100% of the total variance. We also selected the smallest degree of belief under which a model could numerically converge (≤ 1 per parameter to be estimated). For each analysis a suitable burn-in period was set by determining visually whether the Markov chain had escaped its initial conditions. The number of iterations and sampling interval (thin) were selected to obtain ~1000 effective MCMC samples (i.e. showing low temporal autocorrelation (< 0.05) between MCMC samples). All random regression analyses were conducted in the MCMCglmm package (Hadfield 2010) for R (R Development Core Team 2012). The magnitude of variance components varies greatly between the types of random effects because they are on different scales (i.e. scale of 1 for intercept and inversely proportional to age for random slope). Therefore, we report them in the form of coefficients of variation relative to their mean given by the corresponding fixed effect."}, {"section_title": "Survival analyses", "text": "We used D M measurements as predictors in counting process Cox regression models for mortality and health outcomes. Age served as the timescale (Lamarca et al. 1998;Thiébaut & Bénichou 2004). We hypothesize that physiological dysregulation is intermediate in causal pathways leading from covariates, such as socio-economic status, to health outcomes. Therefore, we did not control for these because we wished to assess the dysregulation level of an individual notwithstanding underlying causes. For the sake of comparison, we first ran all analyses using raw point measurements at each visit as predictors instead of PD trajectory parameters in Cox regressions. We then used the estimates of individual trajectory parameters (b 0,i and b 1,i ) as predictors. Before, we standardized these parameters by dividing them by their standard deviation in order to make effect sizes directly comparable across parameters and analyses (by definition the average of a random effect = 0). Cox models were fitted in the Survival package for R (R Development Core Team 2012)."}, {"section_title": "Results", "text": ""}, {"section_title": "Survival analysis with point D M measurements", "text": "A greater physiological dysregulation predicted higher mortality risk in all populations and with both biomarker suites (relative risk (RR) ranging from 1.21 to 1.41; Table 2). To make RR more interpretable given the continuous scale of D M , RR difference over 95% of the observed D M distribution (RR 95% ) was calculated by taking the RR of being in the 97.5 th percentile of D M relative to the 2.5 th percentile; RR 95% =RR (DM97.5 -DM2.5) . Values and ranged from 2.19 to 4.10. Cancer and CVDs (InCHIANTI) showed a similar pattern: all RRs were above one and significant, except for a marginally significant trend for cancer with the biological suite (Table 2). D M was not predictive of diabetes risk in InCHIANTI, albeit the trend was positive. For CVDs and diabetes, treating scores of 0.5 as 1 instead of 0 did not qualitatively change the results except that the RR for CVDs and the biological suite became non-significant. Results for frailty in WHAS are more contrasted. D M was respectively not predictive and very predictive of this outcome when calculated from the biological and statistical suites (Table 2). In the latter case, RR 95% was more than three times higher (13.98) than the highest value (4.10) obtained across outcomes, biomarker suites and data sets."}, {"section_title": "Longitudinal physiological dysregulation trajectories", "text": "Population trajectories of dysregulation showed an increasing trend with age (Fig. 1). Coefficient estimates for the linear effect of age were significantly different from zero across data sets and biomarker suites (Table 3). There was also a quadratic effect of age (accelerating dysregulation) in InCHIANTI and BLSA models supporting the prediction of a non-linear increase in PD with age. No such effect was evidenced for WHAS, hence we dropped the quadratic term and present the results for the model without it (Table 3). Individual variation around the population intercept (i.e. in b 0,i ) was negligible across analyses (CV~0 in all cases; Table 3). As a consequence, Bayesian models fitting a covariance between random intercepts and slopes converged poorly (not shown). Therefore, we present the results for models fixing this covariance to zero. There was a substantial individual variation around the population slope describing the linear association between D M and age (i.e. variation in b 1,i , CV ranging from 0.11 to 0.42; Table 3)."}, {"section_title": "Survival analysis with PD trajectories", "text": "Because individual intercepts (b 0,i ) contributed a negligible fraction of the variation in D M , we fitted Cox models only with the individual slope (b 1,i ) as covariate. Overall, RR associated with this parameter were remarkably similar to those obtained with point D M measurements, especially for mortality (i.e. RR in the range ~1.2 -1.4; Table 4). RR estimated for the BLSA mortality were not significant (as opposed to those from point measurements) although they showed a positive trend, with confidence intervals shifted towards values >1. RRs for cancer, CVD and diabetes associated with individual slopes were generally lower than those for point D M measurements (Table 4). In two cases RRs were not significant anymore (cancer with statistical suite and CVDs with biological suite) while the opposite was true for another case (diabetes with statistical suite). Yet, most RRs showed confidence intervals shifted towards values >1. Again, treating scores of 0.5 as 1 instead of 0 did not qualitatively change the results for CVDs and diabetes. A contrasting result was observed for frailty. Slope models showed more significant RRs than point measurement models and the difference between RR associated with the two biomarker suites was much smaller (0.12 instead of 0.82; Tables 2 & 4)."}, {"section_title": "Discussion", "text": "In this study we show that 1) physiological dysregulation increases with age at an accelerating rate; 2) individual variation in PD trajectories is substantial; and 3) PD trajectories are strongly predictive of mortality and frailty and predictive to various degrees of chronic diseases (cancer, CVD, diabetes). Moreover, comparable results were obtained across three data sets from two continents and for two biomarker suites selected on very different criteria. Our results further illustrate that D M is a powerful yet easy-to-use method to reduce a high-dimensional biomarker space into a single measure conveying essential information about dysregulation."}, {"section_title": "PD trajectories", "text": "Both InCHIANTI and BLSA data show non-linear population trajectories, which agree with a hypothesis of feedback loops contributing to acceleration of PD with age. This is consistent with the view that PD involves the loss of integration of the physiology of an organism, hence decreasing homeostasis and the capacity to respond to stress (McEwen 1998;Yashin et al. 2007;Cohen et al. 2012;Costantini, Monaghan & Metcalfe 2013). For WHAS, the non-significant quadratic term can be explained by the fact that this data set covers only ages ≥65 (mostly ≥70), a period where dysregulation is faster and increases in a more linear manner so that a non-linear signal should be harder to detect (Fig. 1). For the three data sets, the population trajectories are qualitatively similar with both suites of biomarkers. This is an important detail as it validates that we recover a signal of dysregulation that is not specific to a given system or biological process that would drive the patterns observed in the data. We found that individuals differ markedly in their trajectories of physiological dysregulation, specifically in their rate of increase with age (slope). The contrast between respectively negligible and high CVs for random intercepts and slopes can be explained by the tendency for individual trajectories to diverge with age, associated with the fact that measurements began at mid-life or later for most individuals. This makes the assessment of fine differences in intercepts (i.e. projection of D M at birth) more difficult. Had the time scale not been age but rather time elapsed since the beginning of the study, part of the D M variation attributed to individual slopes would probably have been transferred to random intercepts. However, this would have likely provided a biased picture of among-individual differences in basal physiology because random intercepts would then largely reflect the state of an individual at (or near) entrance in the study. As most subjects entered these longitudinal surveys after their fifties, their initial physiological state at that moment depended on their past \"accumulation\" of dysregulation up to that time and should thus strongly reflect their rate of dysregulation. Individual slopes of dysregulation predicted health outcomes in a remarkably consistent manner. The predictive performance of slopes was, overall, very similar to that of point D M measurements. A probable explanation for this observation is that the results for D M point measurements taken at the ages covered by our cohorts largely reflect inter-individual differences in dysregulation trajectories, specifically rates. For our purpose, this is a desirable property because we wished to relate an age-oriented process, physiological dysregulation, to mortality and disease risk. Importantly, without a comparison with models fitting random slopes, we would not have suspected the likely major contribution of the inter-individual variation in dysregulation rate to variation in point measurements. In other words, an important part of the variance in health outcomes is due to the fact that some individuals become dysregulated more quickly than others."}, {"section_title": "PD trajectories and mortality", "text": "In previous studies using WHAS and InCHIANTI data we uncovered a relationship between point D M measurements and mortality (Cohen et al. 2013;Cohen et al. in press). The current study shows that this relationship is driven by trajectories of dysregulation, namely at what pace PD changes with age. The results are consistent in three distinct populations, one Italian and two American, with presumably different environmental and/or genetic backgrounds, supporting the hypothesis that the positive relationship between PD trajectories and mortality is a general phenomenon found across populations. Even though two populations are from the same area (Baltimore), they differ markedly in their composition: WHAS comprises only elderly women (mostly aged 70-79) while BLSA covers ages 20-96 and both sexes; BLSA is also richer and whiter. Remarkably, relative risks of mortality associated with dysregulation were comparable in spite of quite variable sample sizes and age composition for the reference populations used in D M calculation. Expressed on the observed scale of D M variation, the difference in RR for individuals at the 2.5 th vs. 97.5 th percentiles of the distribution are substantial (RR 95% up to 4.10)."}, {"section_title": "PD trajectories and frailty", "text": "Frailty has become an important index of the general condition of an aging individual and of his/her susceptibility to suffer from age-related functional declines and diseases (Fried et al. 2001;Mitnitski et al. 2002;Fülöp et al. 2010). The frailty phenotype index we use consists of diverse variables such as weight loss, fatigue, grip strength, physical activity and gait speed (Fried et al. 2001). We have shown that metabolic performance and an inflammatory disease are associated with PD in birds (Milot et al. 2014). Likewise, it is plausible that dysregulation is the biological process underlying condition and performance variables used to assess clinical frailty. This is supported by our finding of a consistent pattern of very strong RRs for frailty with high D M slope. In contrast to PD trajectories, point D M measurements predicted frailty only with the biological suite of biomarkers. A possible explanation for the discrepancy between the two analyses is that the frailty signal may be more sensitive to recent changes in physiological state rather than long-term trends, and that different biomarker suites show different patterns in that regard. However, replication of this difference would be required before drawing any conclusions."}, {"section_title": "Dysregulation and diseases", "text": "D M predicts cancer, cardiovascular diseases and diabetes in InCHIANTI. However, the results appear more sensitive than mortality to which suite of biomarkers is used and to whether the regression predictors are point D M measurements or individual trajectories (slopes). This variation may have to do with the ambiguity in the direction of causality in the chronic disease-dysregulation relationship. On the one hand, PD may increase the risk of diseases; on the other hand, diseases can increase PD and perhaps accelerate feedback loops in dysregulation. Moreover, diseases might have a disproportionate impact on point measurements of specific biomarkers that could change D M values. Therefore, point D M measurements in sick people may reflect to various extents the confounded effects of disease and of intrinsic PD trajectories (independent of diseases). This could explain the greater sensitivity of the result to the biomarker choice or the type of predictors entered in the regression models. Nonetheless, all significant relative risks associated with either D M measurements or slopes are comprised within a narrow range of values (RR ~1.25 to ~1.45). This suggests that D M is a consistent indicator of health."}, {"section_title": "Limitations of the study", "text": "In spite of clear evidence for D M 's capacity to predict mortality and health outcomes, this study has some limitations. First, the significance level of the D M -mortality relationship is high for InCHIANTI and WHAS (P<0.001) and somewhat lower with BLSA (0.05>P>0.01). This may partly result from the fact that censoring time was based on the date of last visit for this particular data set. One bias that may potentially arise from this situation is the underestimation of survival for people who did not die during the study period relative to those who did. Therefore, our analyses likely suffer from a lack of power to properly assess the D M -mortality relationship with BLSA data. Second, available disease data varied greatly among data sets. In addition, our strict filter requiring an absence of an outcome at the first visit further limited outcomes usable in our analyses. Therefore, although D M appears to predict age-related and chronic diseases well in general, future studies on additional data sets will be needed to evaluate whether this holds more for some specific diseases than others. Third, estimates of individual slopes have Bayesian confidence intervals (more strictly, highest posterior density intervals) associated with them and this uncertainty is not accounted for in Cox regressions. This could bias P-values in directions difficult to anticipate (Hadfield et al. 2010). One way to overcome this problem would be to fit models allowing characterization of the joint distribution of longitudinal and time-to-event parameters (Rizopoulos 2012). Exploration of the applicability of these methods to the data used here is currently ongoing in our lab."}, {"section_title": "Prospects", "text": "In this study, we estimated a modest number of parameters (i.e. two) describing individual dysregulation trajectories, yet we obtained clear-cut results with respect to risks of outcomes. With more data for earlier ages, it would be possible not only to better estimate random intercepts but also to include additional parameters that are likely important. Thus, fitting a random quadratic term would account for inter-individual differences in the acceleration of dysregulation with age. In addition, there is no reason to think that intercept, slope and quadratic terms do not covary. For instance, exposure to poor early developmental conditions could increase both the basal level of dysregulation and its acceleration with age through feedback effects between allostatic load and response to stress (e.g., see the stochastic process models in Yashin et al. 2007 andArbeev et al. 2011). Covariance between random terms can be estimated provided a sufficient amount of data are available, leading to more accurate trajectory estimation and a more refined comprehension of the mechanisms of aging through dysregulation. Finally, it is important to note that the same level of physiological dysregulation (i.e., the same value of D M ) could induce a larger increase in mortality risk at old ages than it does at younger ages, underlying the necessity to model trajectories rather than just point measurements. A major interest for working with physiological trajectories is the possibility to study how they covary with trajectories in other factors such as lifestyle (nutrition, exercise, etc.), socio-economic status, diseases or health care (hospitalisation, drug treatments, etc.) during the aging process. Thus, trajectory analysis has the potential to refine our understanding of the complex relationships between the physiology of aging and these factors. In conclusion, this study shows that physiological dysregulation as measured by D M accelerates with age and is a strong predictor of a wide variety of health outcomes controlling for age. This supports an interpretation of physiological dysregulation as a process that accelerates through feedback effects, and potentially as the physiological basis of frailty. Replication across data sets and biomarker suites confirms the generality of the signal, as previously reported (Cohen et al. 2013;Cohen et al., in press); together these findings support an interpretation of dysregulation not just as a downstream manifestation of other aging processes, but as an important driver of aging in its own right. Population (solid black line) and individual (dotted lines) predicted trajectories of Mahalanobis distance with age for each data set and biomarker suite. Lines are shown for ten individuals randomly selected in each data set as an example. Biomarker suites used in this study. Markers found in both suites are in bold. Those from the biological suite are presented in decreasing order of the strength of their association (% variance explained) with the first axis of a principal component analysis reported in Cohen et al. (in prep.), while those of the statistical suite are in alphabetical order.   Table 3 Longitudinal D M models fitted in this study and estimates for the parameters describing trajectories of dysregulation and their Bayesian 95% highest density interval (HPD).  Table 4 Cox survival models measuring the effect of random slopes on the relative risk of outcomes. "}]