[{"section_title": "Abstract", "text": "Objective To identify potential predictors for outcome in individuals with mild cognitive impairment (MCI) who have reverted to normal cognition (NC).\nWe selected individuals with MCI, who reverted at follow-up to NC, with follow-up after reversion from Alzheimer's Disease Neuroimaging Initiative. Common clinical markers, Alzheimer disease (AD) biomarkers, and neurodegeneration imaging markers were used to compare MCI reverters based on subsequent clinical outcome (i.e., subsequent decline or stable reversion). For independent comparison, findings of the clinical Amsterdam Dementia Cohort are presented.\nSeventy-seven (10%) out of 757 individuals with MCI reverted to NC and 61 of these individuals had follow-up data available. After 3.2 ± 2.2 years, 16 (24%) progressed to MCI, and 3 (5%) to dementia. Those who declined were older and had a higher amyloid PET burden and higher CSF tau levels.\nIn MCI reverters, abnormal biomarkers for AD pathology are associated with subsequent decline. AD biomarkers may aid in the prognosis of reverting MCI."}, {"section_title": "", "text": "Individuals with mild cognitive impairment (MCI) are at increased risk to develop dementia. 1 Yet, up to 25% of individuals with MCI revert to normal cognition (NC). 2, 3 Although improved cognition seems to be a positive event, individuals reverting from MCI remain at increased risk to develop dementia compared to NC individuals. 1, 4, 5 Timely identification of individuals with a higher risk will increase prognostic certainty for patients and be useful for health care planning.\nIn individuals with NC and MCI, low memory function, abnormal biomarkers for Alzheimer disease (AD), and neurodegeneration predict dementia. 6, 7 While MCI reverters deviate from the common clinical trajectory, the same disease processes may be underlying. Our aim was to investigate whether MCI reverters who subsequently showed clinical decline have more abnormal AD markers than MCI reverters who remain stable."}, {"section_title": "Methods", "text": "Participants Data analyzed were obtained from the Alzheimer's Disease Neuroimaging Initiative (ADNI) database (adni.loni.usc.edu, downloaded on August 9, 2017) . From the individuals with at least 2 years clinical follow-up, we selected all individuals with prevalent and incident MCI reverting to NC with additional follow-up after reversion. 8 The ADNI was launched in 2003 as a public-private partnership, led by Principal Investigator Michael W. Weiner, MD. The goal of ADNI has been to test whether serial MRI, PET, other biological markers, and clinical and neuropsychological assessment can measure progression to MCI and early AD. Next to the primary analyses in ADNI, we selected from the Amsterdam Dementia Cohort (ADC) all MCI reverters with follow-up after reversion. Similar clinical and biomarker assessments are presented for this small, independent clinical sample for illustration purposes only (for cohort and biomarker methods 9 ).\nStandard protocol approvals, registrations, and participant consents All protocols were approved by an ethical review board and participants signed informed consent. ) and amyloid PET (florbetapir and Pittsburgh compound B [PiB]) as markers for AD pathology. PiB scans were harmonized to florbetapir by new value = PiB standard uptake value ratio (SUVr) * 0.67 + 0.15. 13 For imaging markers of neurodegeneration, we studied FDG-PET, hippocampal volume (HV; UCSF in Freesurfer v4.4/v5.1), normalized to total intracranial volume, and white matter hyperintensity volume."}, {"section_title": "Clinical markers and APOE", "text": "14 Cut points for abnormality for dichotomized analysis in ADNI were as follows: CSF Aβ 1-42 < 192 pg/mL, CSF t-tau > 93 pg/mL, amyloid PET SUVr > 1.10, FDG-PET SUVr METAROI < 1.21, and raw HV < 6,732 mm 3 (see references 11, 12, 15, and 16 for procedures and processing). Data collected within 1 year before or after MCI diagnosis were included."}, {"section_title": "Statistical analysis", "text": "MCI reverters with NC at last follow-up and MCI reverters with subsequent decline were compared on clinical and biomarkers using χ 2 , Wilcoxon, and t tests when appropriate. We report results unadjusted and adjusted for age, sex, education, and APOE e4 genotype with univariate linear regression models, and scaling of continuous outcomes, to facilitate comparability of effects."}, {"section_title": "Data-sharing statement", "text": "Data used for this study are available from the corresponding author, upon reasonable request."}, {"section_title": "Results", "text": "In ADNI, 757 individuals with prevalent or incident MCI had been followed for at least 2 years (figure 1). Of these, 77 (10%) reverted to NC, and 61 (79%) had additional follow-up available. After 3.2 ± 2.2 years (mean ± SD), 16 (24%) had converted to MCI, and 3 (5%) to dementia. One individual was excluded, due to missing data.\nMCI reverters who showed subsequent clinical decline were on average 5 years older than reverters remaining NC, and had, adjusted for age, sex, education, and APOE, higher and more often abnormal AD biomarkers (amyloid PET and CSF t-tau), less impaired memory, and higher GDS scores Glossary Aβ 1-42 = β-amyloid 1-42; AD = Alzheimer disease; ADC = Amsterdam Dementia Cohort; ADNI = Alzheimer's Disease Neuroimaging Initiative; GDS = Geriatric Depression Scale; HV = hippocampal volume; MCI = mild cognitive impairment; NC = normal cognition; PiB = Pittsburgh compound B; SUVr = standard uptake value ratio; t-tau = total tau.\n(table and figure 2 ). Follow-up after reversion seemed slightly shorter for stable MCI reverters (p = 0.11). Repeating analyses including this covariate did not essentially change the results (table e-1, doi.org/10.5061/dryad. 04n8502).\nPost hoc analyses further showed that biomarkers of MCI reverters were on average more similar to NC than nonreverting MCI, except for amyloid, which was more often abnormal in MCI reverters than in NC (table e-2, doi.org/10. 5061/dryad.04n8502). Still, MCI reverters showed higher clinical progression rates (110/1,000 person-years) compared to baseline NC (52/1,000 person-years, hazard ratio [95% confidence interval] 2.3 [1.4-4.0], p = 0.002) (table e-3 and figure e-1, doi.org/10.5061/dryad.04n8502). The biomarker associations with progression were similar for NC and MCI reverters, whereas associations with progression and cognitive test scores were less consistent (table e-4 and figure e-2, doi. org/10.5061/dryad.04n8502)."}, {"section_title": "Outcome of MCI reverters in clinical ADC cohort", "text": "In the ADC, of 735 patients with MCI and a follow-up visit, 75 (10%) reverted to NC. Twenty-six (35%) patients had 1.6 ± 0.8 years (mean ± SD) follow-up available after reversion, after which 24 (92%) remained NC and 2 (8%) had dementia. Small group size precluded formal statistical testing. The 2 decliners had abnormal CSF Aβ 1-42 and t-tau (table) . The majority of individuals remaining NC had normal CSF Aβ (80%) and t-tau (85%). Thirty-two percent of the stable reverters showed baseline subthreshold depression."}, {"section_title": "Discussion", "text": "Age and AD biomarkers are associated with decline in patients with MCI who initially reverted to normal cognition. MCI reverters showed higher clinical progression rates than NC individuals, which is in line with previous reports.\n1,4 MCI reverters with subsequent decline had an increased amyloid PET burden and CSF tau compared to reverters remaining normal. Between amyloid markers, amyloid PET showed a significant association with the subsequent decline group in MCI reverters, while this association was significant for CSF Aβ in NC. Although previous research suggests that CSF amyloid becomes abnormal before PET, 17, 18 the findings are in line with other reports that this may not apply to all individuals, 19, 20 which contributes to the notion that CSF Aβ 1-42 and amyloid PET may represent different AD-related processes.\nAn outstanding question is why individuals with underlying AD temporarily improved. Our results suggest that at baseline, MCI reverters were more similar to NC than nonreverting MCI. Furthermore, biomarker values associated with subsequent decline were similar for reverting MCI and NC, while cognitive measures were less consistent. Possibly, reverters with decline received an MCI diagnosis very early in their clinical disease course, as their biomarker profiles were like the nonreverting MCI. A modest improvement, for example, due to learning effects, resolving of (subthreshold) depressive symptoms, or measurement error, may have contributed to reclassification as normal. Here we observed that when AD is present, such improvement is often not lasting. "}, {"section_title": "Continued", "text": "Furthermore, it remains unclear as to why individuals who reverted and remained NC over time were initially diagnosed with MCI. Aside neurodegenerative diseases, depressive symptoms are a common cause of MCI. Low depressive symptoms scores in ADNI reflect inclusion criteria. In the ADC, subthreshold depression was more common. Another possibility is that distress or insecurity led to a suboptimal performance. The question remains how to deal with the classification of these individuals in the context of AD progression research, when MCI is often regarded as an intermediate disease stage. A practical implementation could be to classify reverting MCI with normal biomarkers as NC. Alternatively, including stability of the diagnosis in the classification has been suggested. 4 A limitation of this study is the relatively short follow-up time, and so we cannot exclude the possibility that some individuals in the stable group may progress again. Compared to populationbased studies, reversion rates in both cohorts were low. 3 Possibly, this reflects that clinicians will not easily reverse a known diagnosis. Reversion rates may even be lower, because we based reversion rates on individuals with MCI who met our inclusion criteria. Individuals with MCI excluded from these analyses as they were lost to follow-up were somewhat older and more cognitively impaired, which are characteristics that associate with decline 1 (table e-5, doi.org/10.5061/dryad.04n8502). Although further replication in large population-based studies is necessary, our results suggest that AD biomarkers aid in the prognosis of MCI reverters, and could help to identify those with a good short term prognosis and those likely to decline again in the longer term."}, {"section_title": "Acknowledgment", "text": "The authors thank the participants and patients for their contributions, as well as staff involved at ADNI and the Amsterdam Dementia Cohort for data collection and data sharing. "}, {"section_title": "Study funding", "text": ""}]