[{"section_title": "Introduction", "text": "When high-impact weather threatens, the primary goal of weather forecast and warning communication is to help populations at risk take protective actions. One mechanism for improving forecast and warning communication is revising the content of messages. Many efforts to improve weather forecast and warning messages focus on conveying risk, for example, by providing information about the geophysical hazards that people may experience [1][2][3][4][5][6] or their potential personal and societal impacts [7][8][9][10][11]. In some cases, weather messages describe potential impacts using dramatic or threatening language designed to try to persuade people to take protective action [11][12][13][14]; such messages are commonly called \"fear appeals\" [15][16][17][18]. This article explores how members of the public respond to variations in these types of messages, for hurricanes in the USA. Without forecast and warning messages, it is unlikely that people would know about a specific weather threat until it arrived. Thus, messages are a critical component of weather-related protective decision making. Moreover, the content of these messages is one of the few aspects of people's weather-related decisions over which forecasters and public officials usually have some control. Indeed, prior research shows that people's protective decisions when hazards threaten are also influenced by many factors other than risk messages, including the characteristics, experiences, perceptions, and beliefs that people bring into the situation [2,[19][20][21]. Therefore, we examine the influence of forecast and warning messages in the context of these individual differences that also influence decision making. when surge threatens [12,[22][23][24][25][26][27][28]. Thus, one current emphasis in U.S. hurricane forecast and warning messaging is conveying the potential risks associated with storm surge as well as wind risks [4,27]. To help improve U.S. National Weather Service (NWS) storm surge risk communication, recent studies have examined people's preferences for storm surge information and the effectiveness of different elements of storm surge potential maps [4,29,30]. Several recent U.S. hurricanes, including Irene (2011), Matthew (2016), and Harvey (2017), have also illustrated the challenges of communicating about the potential for heavy rainfall to cause flooding. Yet there is little work investigating how people perceive and respond to messages about storm surge compared to messages about wind or more general flood threats. To investigate these issues, we use data collected from an online survey implemented in the USA in 2015. As part of the survey, respondents were randomly assigned to receive experimentally manipulated messages about a hypothetical hurricane approaching their region. The 1716 survey respondents were sampled from coastal areas of the USA that were affected by Hurricane Sandy 1 in 2012 (Fig. 1). The experimental messages focused on conveying 1) the geophysical hazards posed by the storm (e.g., strong winds, flooding, storm surge), 2) the storm's expected impacts, and 3) the storm's potential threat to human life using fear-appeal language. We refer to these as hazardbased, impact-based, and fear-based messages, respectively. The content of the test messages was adapted from text used in recent NWS forecast and warning products and public officials' hurricane risk messages. The individual differences investigated here include respondents' actual and perceived geographical exposure to hurricane-related risks, past evacuation planning, and experiences with prior flooding and Sandy. Because evacuation is an important, potentially life-saving protective action when a hurricane approaches, the primary dependent variable examined here is respondents' evacuation intentions in the hurricane scenario. However, even within our coastal U.S. sample, respondents live in areas with different exposures to hurricane risks, and so evacuation is (from an emergency management perspective) the desired decision for some, but not all, respondents. Thus, we also examine whether the message variations tested can help motivate evacuation among people in areas at high risk, without increasing evacuation from lower-risk areas (called \"shadow evacuation\") [31][32][33][34][35][36]. In addition, to understand the effects of the messages in greater depth, we investigate how the message manipulations influence other dependent variables, including respondents' perceived understanding of the information, their risk perceptions and efficacy beliefs related to the scenario, and their perceptions of the information and its source. Using the survey data, this article addresses three research questions: • RQ1: How do variations in hazard-based, impact-based, and fearbased messaging influence people's a) behavioral and b) attitudinal and affective responses to an approaching hurricane? • RQ2: To what extent do the message variations tested motivate evacuation intentions among populations in areas at highest risk, without increasing unnecessary evacuations from lower-risk areas? • RQ3: How do individual differences that people bring into a hazardous weather situation influence their evacuation intentions, and how do the effects of these factors compare to the message effects? This research was conducted using scenarios that described a hurricane approaching the mainland U.S.; so, the specific results may not be generalizable to other hazards and populations. However, by investigating these questions in a simplified experimental context, we aim to develop new knowledge about hazard risk communication more generally. Section 2 provides an overview of relevant background literature and its use in the study and test message design. Section 3 describes the study methodology, including the survey measures. Section 4 presents results examining RQ1 and RQ2, and Section 5 examines RQ3. Section 6 summarizes the study's key findings and discusses their potential implications for weather communication practice and research. 1 Sandy transitioned from a hurricane to a post-tropical cyclone near the time of landfall. For simplicity, however, we refer to the storm as Hurricane Sandy or simply, Sandy."}, {"section_title": "Background literature and study framing", "text": "This study examines hazardous weather decision making using data collected from at-risk members of the U.S. public about their anticipated responses to specific, experimentally manipulated weather risk messages. The decision scenario presented here differs from real-world U.S. hurricane decision contexts in multiple ways. For example, when a real hurricane threatens the USA, people receive multiple pieces of risk information from a variety of sources [26,32,[37][38][39][40][41]. People also interpret risks and make decisions through both social and individual processes [23,31,[40][41][42], and they are influenced by communication processes (including factors such as trust and credibility) as well as information content [43][44][45][46][47][48][49][50][51][52]. As described in the remainder in this section, here we integrate understanding from multiple fields to design a study that investigates several current issues in hazardous weather risk communication in a simplified context. In doing so, we aim to develop knowledge that can help understand and improve hurricane risk communication in more complex social, informational, and communication contexts."}, {"section_title": "Message content and responses", "text": "Although weather risk messages can contain a variety of content, most messages about approaching hazardous weather include information about the geophysical hazard(s) that people may experience. In the USA, for example, current weather warning messaging typically focuses around the type of weather phenomenon, e.g., a \"winter storm,\" \"tornado,\" or \"flood\" warning. Weather risk communicators often view information about hazard type as important for helping recipients understand what is predicted to happen and who should take which types of protective action, where, when, and why. Recipients' interpretations of and responses to hazard-based messaging depend on how well the language triggers appropriate schemas; for example, whether a message about a \"tornado\" evokes a rapid-onset, local-scale high wind threat rather than a longer-term, larger-scale threat such as a hurricane [53]. Some weather events can produce multiple types of geophysical hazards, which means that different people (with different vulnerabilities and/or in different geographical areas) may need to take different types of protective actions. Landfalling tropical cyclones, for example, can produce strong winds, tornadoes, and flooding due to heavy rain and/or storm surge. Although all of these hazards contribute to negative impacts, coastal flooding due to storm surge inundation is responsible for the greatest loss of life from hurricanes in the USA, and thus is the primary motivation for evacuating U.S. coastal populations before a hurricane arrives [4,27]. Despite this, several recent studies have found that many U.S. coastal residents at risk are more concerned about hurricane winds than storm surge or flooding more generally [4,12,23,32,[54][55][56][57][58]. The U.S. hurricane forecast and warning community has therefore recently engaged in multiple efforts to improve storm surge prediction and risk messaging [4,27,29,30,59]. A related recent theme in weather risk communication (in the USA and internationally) is improving prediction and communication of the potential impacts of hazardous weather along with the hazard itself [7]. For example, the UK Met Office implemented a new \"impact-based warning service\" operationally in 2011 ( [60], p. 564), and the U.S. NWS is also shifting \"to an impact-based decision support services approach\" ( [8], p. 6). The World Weather Research Program recently developed the High Impact Weather (HIWeather) Project, which includes \"a focus on the interface between the physical hazard and the human impact … [and] high impact weather communication methods\" ( [9], p. 4). The goal of such efforts is typically to improve audiences' understanding of the potential impacts of approaching hazardous weather and, in doing so, to enhance protective decision making. Fig. 2 shows three examples of messaging used by the NWS and public officials to convey the potential impacts for recent hurricanes approaching the USA, along with information about the hurricane and its potential geophysical hazards (see also [11]). Similar language is being used by the NWS in U.S. severe thunderstorm and tornado warnings, as part of the NWS Impact Based Warnings program [10,13,61]. As these examples illustrate, some of the weather risk messaging currently being employed in the USA emphasizes the lifethreatening nature of the hazard using strong, personalized language. In the risk communication literature, such messages are referred to as \"fear appeals\", defined as \"persuasive messages designed to scare people by describing the terrible things that will happen to them if they do not do what the message recommends\" ( [15], p. 329; see also [18]) or, more briefly, \"threatening or fear-arousing persuasive messages\" ( [17], p. S9). Past research in weather and other risk contexts finds that fear-appeal messages may help motivate protective action under some circumstances. However, such messages can also have unintended negative effects, in the short term and over the longer term [12][13][14][15]17,18,[62][63][64]. For example, theories such as the Extended Parallel Process Model [15,65] predict that fear-based messages can, in some circumstances, induce people to manage their fear through defensive coping responses, such as perceiving the message as misleading or overblown (called negative reactance) and discrediting the message or its source. To inform discussions about the advantages and disadvantages of these types of messaging approaches, we included in the survey an experimental message manipulation in which respondents received different combinations of hazard, impact, and fear-oriented messages for the same hurricane threat (RQ1, RQ2). As the examples in Fig. 2 illustrate, these approaches are often used together in U.S. weather risk messages. To test them experimentally, we therefore designed simplified textual messages that extracted key aspects of each approach, in the context of a hypothetical hurricane predicted to make landfall in the USA in two days (Fig. 3). The hazard message manipulation included four variations, and the impact and fear message manipulations each included two variations. The hazard-based messaging began with the message introduction, which included information about an approaching hurricane and its potential wind speeds at landfall. Along with this information about wind hazards, some respondents also received a message about potential \"flooding\" or \"storm surge flooding\" in evacuation zones. These message variations aimed to test the effects of describing the hurricanerelated flooding as storm surge compared to describing it more generally. To test targeting the flooding and storm surge messages towards populations living in areas at highest risk from these hazards (see [36] and Section 2.2), these messages said that the (surge) flooding was predicted \"in evacuation zones.\" Because past research indicates that some members of the public may not be familiar with the risks posed by storm surge, we also tested an additional variation of the storm surge message, in which a brief description of storm surge was added at the end of the message (Fig. 3). Impact-based messages are not clearly distinguished from fear-appeal messages in the meteorology or risk communication literatures. For this study, we characterize fear-based messages as those that use strong, personalized language to convey the threats that the hazard poses to human life, especially for people who do not take the recommended protective action (in this case, evacuation). We characterize impact-based messages as also conveying potential impacts of the storm, but using less personalized language that focuses on the impacts in general and/or to homes, neighborhoods, and personal property. Drawing from the fear appeals literature, examples such as those in Fig. 2, and prior work by [14], we designed a \"fear\" and a \"high impact\" message representing key elements of each approach (Fig. 3). To serve as controls for examining the effects of the fear and high-impact messages, respectively, we also designed \"neutral\" and \"low impact\" messages. Overall, the emphasis of these experimentally manipulated messages is on improving people's understanding of what may happen as the hurricane makes landfall, in other words, on motivating protective behavior largely by influencing risk perceptions. Prior research indicates that perceived efficacy can also have important influences on protective decision making in response to a variety of types of risks, and that including efficacy statements can be important for enhancing the effectiveness of fear-appeal messages [14][15][16][17][18][63][64][65][66][67]. Thus, all respondents received a closing message that conveyed information about the effectiveness of evacuation and ways to evacuate (Fig. 3). For hurricanes, moving out of harm's way prior to landfall is considered the most effective way for people at high risk to protect themselves; thus, the primary dependent measure examined here is respondents' reported likelihood of evacuating in the hurricane scenario (their evacuation intentions). A number of studies, both theoretical and empirical, find that people's behavioral responses to risk information are influenced by their risk perceptions as well as their efficacy beliefs [15,16,45,63,65,[67][68][69][70][71]. Thus, we also investigate how the experimental message manipulations influence these perceptual responses. Based on the previous work discussed in [14,72], we examine people's cognitive risk perceptions (e.g., perceived susceptibility to and severity of the hurricane threat), affective risk perceptions (e.g., worry or fear related to the hurricane), response efficacy (beliefs about the effectiveness of evacuation in reducing risk) and self-efficacy (beliefs about their ability to evacuate). As discussed above, fear-appeal messages can sometimes have undesired or maladaptive effects. More generally, information and source perceptions can have important influences on how people interpret and respond to risk messages related to the current hazard, and in the future. Thus, we also examine how the message manipulations influence people's perceptions of the information and its source, including their perceptions that the information is overblown or misleading, that the source is reliable, and their future trust in the source. We hypothesized that respondents who received either of the storm surge messages would have higher risk perceptions and evacuation intentions than those who received the wind-only and flood messages, with the storm surge with descriptor message having the largest effects. We also hypothesized that both the high-impact and fear messages would increase risk perceptions and evacuation intentions, with the fear message having a larger effect on negative affect. And, we hypothesized that the fear message, but not the high-impact message, would have some of the unintended negative effects that are sometimes reported with fear appeal messages."}, {"section_title": "Individual differences: actual and perceived geographical exposure, evacuation planning, experiences, and shadow evacuation", "text": "People bring into hazardous weather situations a variety of characteristics, perceptions, and beliefs that influence how they interpret information and make protective decisions. Thus, we investigate people's responses to weather risk messaging in the context of these nonmessage factors, which we refer to as \"individual differences\". Although a variety of situational and non-situational factors influence protective decisions, here we focus on three types of individual differences: people's actual and perceived geographical exposure to flooding and storm surge, prior evacuation planning, and flood and hurricane experiences. Because some previous research has found that sociodemographic characteristics can help explain hurricane evacuation decisions (see, e.g., reviews in [19,20], these are included as control variables in the analyses. A number of previous studies have found that people's actual or perceived geographical exposure 2 to hurricane risks (i.e., based on the location of their residence) can influence their protective decisions when a hurricane approaches [20,31,73,74]. Actual geographic exposure, as examined here, is similar to the concept of hazard proximity (geographical proximity to the source of a hazard) discussed in [75,76]. For studies of hurricane evacuation decision making, geographical exposure is often measured in terms of people's residence in an officially designated hurricane risk area or coastal evacuation zone. These are typically designated based primarily on areas at risk of storm surge (such as the data we use in Section 3.1). However, as discussed in [36], many of the areas sampled did not have officially designated hurricane evacuation zones at the time of our survey, and so terminology such as \"flood prone areas\" or \"areas susceptible to flooding\" is sometimes used by public officials in this region of the USA to describe hurricane evacuation areas (see their Fig. 1). Thus, following [36,77], we use areas at risk of flooding (defined using officially designated floodplains) as another measure of geographical exposure to hurricane hazards. Previous research finds that many people cannot correctly identify whether they live in a hurricane evacuation zone or risk area [19,78,79] or a designated floodplain [21,36,77]. Some people overestimate their geographical exposure, some underestimate their exposure, and others say they do not know. Thus, we examine the effects of respondents' perceived geographical exposure to hurricane-related and flood risks (using measures from the survey) as well as their actual geographical exposure (using mapping of their residence locations). Another variable that can be predictive of decisions to take protective action when hazardous weather threatens is having planned for evacuation or other forms of protective action [19,21,38,80,81]. Here, we examine the predictive power of respondents' self-reports of whether they have an evacuation plan. Past experiences with a hazard can influence how people recognize, assess, and respond to future risks (see reviews in [50,82,83]). Thus, a number of studies have examined the role of prior experience in hurricane evacuation decision making [19,20,72,84,85]. However, Fig. 3. Hurricane scenario and messages presented. Respondents were randomly assigned to receive one of the messages within each message condition. 2 In this article, we use the term exposure as it is typically used in the natural hazards and weather communities, to mean conditions of the natural and built environment that position a person or system to be affected by a hazard (see, e.g., [104]). In other fields (such as public health or epidemiology), this potential to be affected in the future would be better described as risk of exposure. findings are inconsistent across these studies, with experience sometimes having a positive, negative, or no significant effect. As discussed in [72], this may be because experience with a hazard such as a hurricane encompasses multiple aspects that can influence protective decisions in different ways. Here, following [14,72], we investigate the predictive power of several different hurricane-related experiences. Because the areas sampled had recently experienced impacts from Hurricane Sandy, we examine the influence of a general experience measure (past flooding at one's home) as well as several experience measures related to Sandy (tangible protective actions, tangible impacts, and intangible impacts [72]). Finally, although the primary intent of weather warning messages is to motivate people to take protective actions, not everyone in harm's way needs to engage in the same protective behaviors. In particular, as discussed in [36], it is desirable for hurricane risk messages to encourage evacuation among people living in areas at highest risk, while not increasing (or even suppressing) evacuations from areas at low risk. As demonstrated by Hurricane Rita in the Houston area of Texas (USA) and the May 31, 2013, El Reno, Oklahoma (USA) tornado, unnecessary evacuations can make it more difficult for those at high risk to evacuate, and some people who evacuate unnecessarily can place themselves at higher risk [31,32,86,87]. Thus, we also investigate the influence of the message manipulations on people at higher risk from a landfalling hurricane compared to those at lower risk. Because people's perceived exposure does not always coincide with their actual exposure (discussed above), we ask whether the messages have different effects on respondents with different levels of perceived exposure as well as actual exposure. We hypothesized that evacuation intentions would be higher for respondents who had evacuation plans and that different types of hurricane experiences would have different effects. We also hypothesized that evacuation intentions would be higher among respondents who lived and those who thought they lived in areas with greater exposure to flood or surge risks, with perceived exposure having a larger effect. Related to the hypotheses in Section 2.1, we hypothesized that the storm surge hazard messages would increase evacuation intentions primarily among respondents who perceived that they lived in hurricane evacuation zones; for those who perceived that they lived in other areas (at lower risk from storm surge), we hypothesized that the storm surge messages would not influence or would decrease evacuation intentions. In addition, we hypothesized that both the high-impact and fear messages would produce larger increases in evacuation intentions among respondents who perceive that they live in areas at risk from flooding or storm surge."}, {"section_title": "Methodology", "text": ""}, {"section_title": "Survey implementation and sample", "text": "In this section, we provide an overview of the survey implementation and sample. Additional details can be found in [36]. The survey was implemented online, with survey data collection and sampling managed by GfK Custom Research. The survey data were collected during April and May 2015. The median time to complete the survey was 15 min. The survey sample targeted adult residents of coastal areas in three U.S. states (Connecticut, New York, and New Jersey; Fig. 1) that were affected by Hurricane Sandy in 2012. The sample was recruited in two ways: 1) GfK's KnowledgePanel ® (203 respondents, 66.2% cooperation rate), and 2) an \"opt-in\" panel (1513 respondents, 8.8% cooperation rate). KnowledgePanel ® is a probability-based online panel with a sampling frame that covers approximately 97% of the U.S. population (including people who did not have computers and internet prior to joining the panel). Because KnowledgePanel ® did not have a sufficient sample in the targeted geographic areas, survey respondents were also recruited online by GfK as part of a non-probability opt-in panel for this study. All respondents received financial incentives for participating in the survey. For both samples, respondents were recruited based on the ZIP code of their primary residence. ZIP codes were selected for sampling based on their risk of storm surge flooding, using MOM (Maximum of MEOW (Maximum Envelopes of Water)) data provided by the U.S. National Weather Service [59]. 3 As described by [59], the MOMs \"estimate the near-worst-case scenario of flooding [from storm surge] for each hurricane category\" (p. 110) at a particular location; they are designed to assess and communicate the \"worst case high water value at a particular location for hurricane evacuation planning\" [88]. Here, we refer to areas that, according to the MOM data, could be inundated for a category 2 hurricane as \"surge risk zone 2″ (called \"SLOSH zone 2\" in [36]). In New Jersey and New York, respondents were sampled from ZIP codes where GIS analysis indicated that 40% or more of the landmass is located within MOM surge risk zone 2. In Connecticut, due to the different topography, respondents were sampled from ZIP codes with 1% or more of the landmass located within surge risk zone 2. Using this approach, the study sampled residents of 116 ZIP codes in New Jersey, 70 in New York, and 54 in Connecticut, shown in Fig. 1. The final sample included 567 respondents (33%) from New Jersey, 698 (41%) from New York, and 451 (27%) from Connecticut. The sample was 56.6% female and had a mean age of 54.8 years (range: 18-86). More than half (60.4%) of the sample had earned a Bachelor's degree or higher, and 81.6% of participants were white non-Hispanic (5.7% black non-Hispanic, 5.5% Hispanic, 7.2% multiracial or other). GIS analysis based on respondents' home addresses indicated that 40.6% of respondents reside in surge risk zones 1 or 2 (i.e., are at highest risk from storm surge flooding according to the MOM data) and 21.0% reside in surge risk zones 3 or 4 (i.e., are likely to experience storm surge flooding only for major hurricanes). The remaining respondents (38.4%) live outside of the surge risk zones, indicating that they are (according to the MOMs) at lower risk of storm surge flooding."}, {"section_title": "Survey measures and experimental design", "text": "The survey included four modules, each of which contained a between-subjects experiment with a hypothetical scenario about an approaching hurricane or coastal storm. Each respondent received all four modules, presented in randomized order. Within each module, respondents were randomly assigned to different experimental conditions in which they were presented with different combinations of messages about the storm. They were then asked a set of questions to measure their responses to the messages provided in that module. Prior to receiving the modules, respondents for whom sociodemographic data were not available as part of GfK's existing panels were asked a set of questions about their sociodemographic characteristics, other characteristics relevant for the survey, and their home address. As described in [36], these questions were asked at the beginning of the survey to screen appropriate respondents and ensure that GfK had an accurate street address, municipality, and state to use in the subsequent experimental messages. After these initial questions, respondents were asked about their perceived exposure, evacuation planning, and relevant experiences, including the measures shown in Table 1. The perceived exposure measures included questions about whether respondents thought they lived in an officially designated flood zone or a hurricane evacuation zone. The prior experience measures included questions about past flooding at the respondents' current home, the protective actions they took for Hurricane Sandy, and the Sandy-related impacts they experienced (see Table 1). This set of questions (along with the sociodemographics) provides data about the individual differences that each respondent brings to the hypothetical scenarios presented in the modules (Section 2.2). At the time of the survey, many of the areas sampled did not have official hurricane evacuation zones. Nevertheless, only 20.9% of respondents said that they did not know whether they lived in a hurricane evacuation zone. We use this measure in the analysis, in addition to the perceived flood zone measure used in [36], because it is similar to the \"in evacuation zones\" wording that was used in the flood and storm surge hazard messages (Fig. 3). Respondents were then presented with the four modules, one at a time. Only one of the modules is examined in this article. (For results from two of the other modules, see [36].) Fig. 3 shows the hurricane scenario and experimental messages presented in the module, which were designed as discussed in Section 2.1. First, all respondents were given the same information that a hurricane approaching their state was predicted to make landfall in two days, with winds of up to 130 miles per hour (209 km per hour, equivalent to a weak Category 4 hurricane). This message introduction also stated that the information presented was provided by the NWS, to reduce potential variability in respondents' message interpretations and information perceptions based on different assumptions about the information source. Some respondents received only this hazard message (wind only, N = 431). Others also received a hazard message about predicted flooding (N = 444), storm surge flooding (N = 411), or storm surge flooding with an accompanying brief description of storm surge (N = 430), all with wording geographically targeted towards evacuation zones. After the hazard message, respondents then received one of two impact messages (low-impact (N = 819) or high-impact (N = 897)) and one of two fear messages (neutral (N = 874) or fear (N = 842)), in that order. The message conditions were fully crossed, meaning that all possible combinations were shown, in approximately the same numbers. The scenario closed with information about evacuation that was received by all respondents. Most of the content in the hazard, high-impact, and fear messages was adapted from elements of messages used in real time in the USA by the NWS and public officials to communicate risks associated with past tropical cyclone and other hazardous weather threats (see, e.g., Fig. 2 and Section 2.1). The storm surge descriptor was adapted from descriptions of storm surge provided in such messages and on NWS and other web sites. The message closing was adapted from information about protective actions included in public officials' evacuation messages for past U.S. hurricanes (e.g., Fig. 2 here and Fig. 1 in [36]). After receiving the information in Fig. 3, respondents received a set of questions (presented in randomized order) to measure their responses to the scenario and messages received. As discussed in Section 2.1 and shown in Table 2, these included questions about their perceived understanding of the messages; evacuation intentions, cognitive and affective risk perceptions, and efficacy beliefs related to the scenario; and perceptions of the information and the source. Note that the target of all of the risk perception measures in this study is the respondent or his/her home, in the context of the storm scenario presented. This differs from risk perception measures that are more general or refer to different risk targets (e.g., other people or places), which are used in some other studies (e.g., [19,89,90])."}, {"section_title": "Data analysis", "text": "After the survey was completed, GIS software was used to map respondents' home addresses and analyze whether they lived in the surge risk zones used for sampling (defined using the MOM data described in Section 3.1). GIS was also used to analyze whether respondents lived in a 100-year floodplain, using the National Flood Hazard Layer from FEMA [91]. As discussed in [36], 19.5% of respondents lived in a 100year floodplain (see their Table 2), and the remainder did not. A larger percentage of respondents, 61.6%, lived in a surge risk zone. 4 To investigate the research questions, we performed one-way and multi-way ANOVAs and additional statistical analyses as described in the remainder of the article. As in [36], we used four sociodemographic characteristics (age, gender, race/ethnicity, and level of formal education) as controls in the multivariate analyses. In the ANOVAs, age is represented as a categorical variable with seven categories, race/ethnicity is represented as white non-Hispanic or not (all other categories combined), and education is a categorical variable with three levels (high school graduate or less, some college, Bachelor's degree or higher). For all ANOVAs that showed statistically significant differences, post hoc comparisons were conducted to analyze differences among groups, using the Least Significant Differences (LSD) test. To reduce the family-wise Type I error rate (the likelihood of incorrectly rejecting a null hypothesis when conducting multiple statistical tests), we use a Bonferroni correction [92,93]. For the investigation of the influences of messages (Section 4), given the three message conditions we use α = .0167 (.05/3) as the criterion for statistical significance. For the investigation of individual differences (Section 5), to be conservative, we use α = .01. All statistical analyses were conducted using SPSS (IBM SPSS Statistics for Windows, version 23). As described in Section 3.2, the survey included four experimental message modules, only one of which is examined in this article. A oneway ANOVA indicates that the order in which the module examined here appeared on the survey does have a significant effect on evacuation intentions in this module (F(3,1698) = 18.1, p < .001, η 2 = .031). Post hoc tests indicate that respondents who received the module first had lower evacuation intentions (M = 4.43) than those who received it second, third, or fourth (M = 5.12, 5.10, 5.35); no other differences were significant at the p < .05 level. The effect size (η 2 ) indicates that module order explains approximately 3.1% of the variance in evacuation intentions in the fear appeal module. We tested including module order as an explanatory variable in the other analyses conducted for this article, and it does not affect any of the results discussed, nor does it interact with any of the message conditions. Thus, we have not included it in the analyses in the remainder of the article."}, {"section_title": "Influence of hazard, impact, and fear-based messages", "text": "We start by examining respondents' perceived understanding of the experimentally manipulated messages. Overall, respondents' self-reported understanding of the messages they received was high (M = 6.55 on a 7-point scale; see Table 2). One-way ANOVAs indicate no significant differences in reported understanding within any of the message conditions (hazard: F(3,1701) = .2, p = .90; impact: F (1,1703) = 1.0, p = .33; fear: F(1,1703) = 1.3, p = .25). In other words, perceived understanding was similarly high across all of the experimental messages. This suggests that the results presented in the remainder of this section are not significantly influenced by differences in ease of understanding across the message variations."}, {"section_title": "Influence of messages on evacuation intentions", "text": "Next, we examine the effects of the experimentally manipulated messages on respondents' evacuation intentions (RQ1a). Table 3 shows results from an ANOVA testing the effects of the three message conditions on evacuation intentions (measured on a 1-to-7 scale), controlling for four sociodemographic characteristics. In this analysis, none of the sociodemographic characteristics had a statistically significant effect. The impact and fear message conditions each had a significant effect on evacuation intentions. Post hoc tests indicate that evacuation intentions were higher among respondents who received the high-impact (M = 5.16) message than those who received the low-impact (M = 4.84) message, and that they were higher for the fear (M = 5.15) than the neutral (M = 4.87) message. The effect sizes for these message manipulations are small (< 1%), however, and the model explains only 1.6% of the variance in evacuation intentions. There are no significant differences in evacuation intentions among the hazard message variations. Because all respondents live in or near a coastal area at risk of storm surge flooding, we anticipated that the storm surge messages would increase evacuation intentions for this sample (Section 2.1). However, as we will discuss further in Section 4.2, the pattern of evacuation intentions for the hazard messages does not show this effect: evacuation intentions were not significantly higher for those who received the storm surge (M = 5.02) or storm surge with descriptor (M = 4.86) messages than for those who received the wind only (M = 5.01) or flood (M = 5.14) messages. We tested for two-way interaction effects between all pairs of message conditions and found no significant effects. There were also no significant interactions between the message conditions and the sociodemographic characteristics. Although all of the respondents live in coastal U.S. ZIP codes, they live in areas with different levels of exposure to hurricane-related hazards. The flood and storm surge hazard messages, in particular, used wording that targeted residents of evacuation zones, which we hypothesized would have different effects on respondents in and out of those zones. These effects could cancel when message effects are analyzed across the overall sample. Thus, as discussed in Section 2.2, we also examined whether the message manipulations had different effects on populations with different levels of actual or perceived geographical exposure to hurricane-related hazards (RQ2). We examined this by testing for interactions between the message conditions and four different measures of hurricane-related exposure: two measures of actual exposure (whether respondents' residences are located in a surge risk zone or 100-year floodplain; Section 3.3) and two measures of perceived exposure (whether respondents think their residence is located in a hurricane evacuation zone or an officially designated flood zone; Table 1). Actual surge risk zone and perceived hurricane evacuation zone are used because they are the measures of actual and perceived geographic exposure that are most relevant to hurricane evacuation and the wording in the messages (Section 2.2). However, many members of the public are not familiar with surge risk zones indicated by the MOM data, and as discussed in Section 2.2, many of the areas sampled do not have officially designated hurricane evacuation zones. Thus, we also tested interactions between the message conditions and actual/perceived exposure to flooding. To conduct these tests, we added each of these four exposure measures to the ANOVA shown in Table 3, separately in four different ANOVAs. Along with a term for the main effect of one of the exposure measures, we added terms for the interactions between that exposure measure and each of the three message conditions. The results showed no significant interaction effects between any of the message conditions and exposure measures (p = .066-.91 for the interaction terms, across the different analyses 5 ). In other words, counter to our hypotheses, the hazard messages (which said that flooding or storm surge flooding was predicted in evacuation zones) did not increase evacuation intentions among respondents who thought they lived in a hurricane evacuation zone, when compared to the wind-only message (which was not geographically targeted). These analyses did show, however, that some of the exposure measures have significant main effectseffects that are larger than those of the message variations. This will be explored further in Section 5."}, {"section_title": "Influence of messages on risk perceptions, efficacy beliefs, and information and source perceptions", "text": "To investigate people's responses to the messages in greater depth, now we examine how the message manipulations influence variables other than evacuation intentions (RQ1b). The dependent variables examined include respondents' cognitive and affective risk perceptions, efficacy beliefs, and perceptions of the risk information received and its source (including maladaptive or unintended responses such as those discussed in Section 2.1). To do so, we performed ANOVAs parallel to those in Table 3, replacing evacuation intentions as the dependent variable with each of the other measures in Table 2 (other than message understanding). The results are summarized in Table 4 by showing the p-values and effect sizes (η 2 p ) for each of the three message conditions from each of the 14 ANOVAs. As in Table 3, each of the ANOVAs includes four sociodemographic characteristics as control variables, but here we focus on presenting and discussing results only for the experimental messages. Table 4 reveals that for many of the risk perception and efficacy variablesseverity, susceptibility, worry, fear, and response efficacy the effects of the message manipulations are similar to those for evacuation intentions (Table 3): the impact and fear message conditions had statistically significant effects, but the hazard message condition did not. Post hoc tests indicate that, as for evacuation intentions, the high-impact and fear messages produced higher values of these dependent variables than the low-impact and neutral messages, respectively. As for evacuation intentions, the sizes of the message effects in these analyses were small (typically explaining less than 1% of the variance in the dependent variable). One difference from this overall pattern is that the hazard message condition had a significant effect on respondents' perceptions that they could be hurt by the storm. Post hoc tests indicate that respondents who received the flood message (M = 4.51) perceived that they were more likely to be hurt than those who received the storm surge with descriptor message (M = 4.12); neither the wind-only message (M = 4.38) nor the storm surge message (M = 4.21) were significantly different from any of the other messages. Interactions between the message conditions and actual and perceived exposure were tested as in Section 4.1, and none were significant. In other words, the storm surge messages did not increase respondents' perceptions that they could be hurt, across the sample or among respondents who actually live or who think they live in areas at high risk. This is counter to our hypotheses. Instead, the storm surge message with descriptor had the opposite effect across the sample (compared to the flood message), although the effect size was small. Another interesting result, also counter to our hypotheses, is that the high-impact message increased affective risk perceptions (worry and fear) more than the fear message did. The influence of fear messaging on recipients' fear is often considered a manipulation check. However, as discussed in Section 2.1 and below, some recipients of fear appeals may use maladaptive responses (such as message rejection) to manage their fear. These fear-management processes may help explain why the fear-based messaging does not significantly increase fear. The high-impact and fear-based messages also had a stronger effect on worry than on fear, which suggests that worry may serve as a better measure of the messages' influence on negative affect. Because the fear message emphasized the threat of personal injury and death for those who stay, respondents' perceptions that they could be hurt by the storm provide another manipulation check for the fear message. For this dependent variable, the fear message did have a significant (but small) effect. None of the message manipulations significantly influenced respondents' perceptions that strong winds, flooding due to storm surge, or flooding due to heavy rains was a threat to their home from the hurricane. This is surprising for the flood and storm surge hazard messages, which were designed to convey that these hazards were threats. Both the flood and storm surge messages stated that the hazard was predicted in evacuation zones, but as in Section 4.1, there were no significant interactions between the message conditions and any of the four measures of actual or perceived exposure. These results indicate that overall, respondents' perceptions of whether their home would experience flooding due to rain or storm surge from the hypothetical storm were determined by factors other than the experimentally manipulated messages. Respondents' self-efficacy was also not significantly affected by any of the message manipulations. We suspect that this is because respondents' beliefs about their ability to evacuate in the hurricane scenario are more strongly influenced by factors other than risk messages, such as evacuation barriers and constraints, general efficacy, other vulnerabilities, or their past hurricane experiences [72]. Because all respondents were given the same closing message, we do not know to what extent this information influenced efficacy compared to the beliefs that each respondent brought into the hurricane scenario. Regarding the information and source perception measures, Table 4 shows that the fear message condition (but not the hazard or impact message condition) had a significant effect on respondent's perceptions that the information provided about the storm was overblown. Post hoc tests indicate that respondents who received the fear message perceived the information to be more overblown (M = 3.35) than those who received the neutral message (M = 3.17). This is consistent with our hypotheses and the findings in [14] as well as much of the fear appeals literature discussed in Section 2.1, which indicates that fear-based messaging can lead to negative reactance and message rejection among some recipients. These results indicate that impact-based messages such as those we tested may have advantages over fear-based messages, by increasing risk perceptions, efficacy beliefs, and evacuation intentions without increasing negative reactance. However, the effect sizes are small. In addition, none of the message conditions had an effect on the survey's other measure of negative reactance (perceptions that the information is misleading), or on perceptions that the information source is reliable. And, neither the impact nor the fear message condition influenced perceived future trust in the information source. The hazard message condition did have a significant influence on respondents' perceived future trust in the source. Post hoc tests indicate that respondents who received the flood message (M = 5.58) or the storm surge with descriptor message (M = 5.60) reported higher future trust than those who received the wind-only message (M = 5.32). Future trust reported by those who received the storm surge message (M = 5.47) was not significantly different from that reported by respondents who received any of the other messages. One possible explanation is that many respondents were aware from their experiences with prior hurricanes (such as Irene and Sandy) that such storms cause coastal storm surge and flooding as well as winds. This could lead them to perceive messages that had this information as more realistic and potentially more trustworthy. As with the other message effects, however, these effect sizes are small."}, {"section_title": "Influence of individual differences: geographical exposure, evacuation planning, and experiences", "text": "Next we examine how the individual differences that people bring into a hazard situation influence their evacuation intentions (RQ3). Here we focus on the individual difference measures discussed in Section 2.2, including respondents' actual and perceived geographic exposure, evacuation planning, and hurricane-related experiences. First, we investigate the independent explanatory power of each individual difference measure, compared to the messages. Then, we investigate the explanatory power of the individual difference measures compared to each other, by including them all in the same analysis. To investigate the explanatory power of each individual difference measure separately, we add them to the ANOVA in Table 3 one at a time, in different analyses. Results are summarized in Table 5 in Models 1-10, which show the effect sizes for the independent variables in each of the ANOVAs along with the adjusted R 2 for each model. Results from the corresponding post hoc tests for the individual difference variables are shown in Table 6. The sociodemographic characteristics and message conditions have effects that are similar across nearly all of the models in Table 5 (and similar to those in Table 3). The only differences are that in Models 3 and 4, gender is statistically significant. Post hoc tests indicate that females (M = 5.09) have higher evacuation intentions than males (M = 4.90), which is consistent with some other studies [19,20]. The message effects in all of the models in Table 5 are similar to those discussed in Section 4.1; this consistency provides further evidence that the results for the message manipulations are robust. Regarding geographical exposure to hurricane-related risks, Models 1-4 in Table 5 examine the four measures discussed in Sections 2.2 and 4.1. Three of these four measures (actual flood zone, perceived flood zone, perceived hurricane evacuation zone) were significant predictors of evacuation intentions, when tested on their own. For the two perceived exposure measures, Table 6 indicates that respondents who said that they lived in an at-risk zone had (on average) higher evacuation intentions than those who said they did not, with intermediate values for those who said they did not know. In addition, respondents who actually lived in a flood risk zone had higher evacuation intentions than those who did not. Actual storm surge risk zone, on the other hand, was not a significant predictor. As discussed in Section 4.1, there were no significant interactions between the messages and any of the exposure measures. Model 5 in Table 5 indicates that evacuation planning was also a significant predictor, with higher evacuation intentions among respondents who reported having an evacuation plan (Table 6). This result is consistent with our hypotheses and with the results of several previous studies (Section 2.2). As discussed in [19], this relationship may reflect some respondents' propensity toward evacuation, or it may suggest that the process of protective action planning can help increase the likelihood of taking protective action in response to a threat. The experience measures examined include respondents' flood experience at their home, two measures of their protective behaviors for Sandy, and two measures of the impacts they experienced due to Sandy (Section 2.2). Model 6 in Table 5 indicates that past flooding at one's home was a significant predictor; evacuation intentions were lower for respondents who said that their home had not previously flooded than for those who said that their home had flooded or were not sure ( Table 6). This suggests that at least in this situation, it is believing that one's home has not previously flooded (rather than believing that one's home has previously flooded) that is predictive of evacuation decisions. This is consistent with other research findings that perceived safety in one's home can be an important predictor of not evacuating for a hurricane [19,31,73,[94][95][96][97]. For the two measures of protective actions taken for Hurricane Sandy (Models 7-8 in Table 5), having evacuated for Hurricane Sandy prior to landfall was a significant predictor of evacuation intentions, but having prepared one's residence for Sandy was not. Consistent with previous research [14,19,38,72,94,98,99], respondents who evacuated for Sandy had higher evacuation intentions than those who did not (Table 6). Both measures of the impacts that respondents experienced from Sandy (reported property damage and emotional distress) were also significant predictors (Models 9-10 in Table 5). Greater damage or distress from Sandy was associated with higher evacuation intentions (Table 6). This differs from results in [14,72], where past emotional impacts from a hurricane had no overall effect on evacuation intentions, and past property damage had a negative effect. The measures used in those studies, however, were for experiences from any prior hurricane, in an area (Miami-Dade County, FL, USA) that had not experienced a landfalling hurricane in a number of years. Here, we asked about experiences related to Sandy, which was a salient recent event in the region sampled. To further explore the relative explanatory power of the individual difference variables, Model 11 in Table 5 shows results from an ANOVA that includes all of the independent variables as predictors of evacuation intentions (together in the same analysis). Similar to a multiple linear regression analysis, this multi-way ANOVA allows us to explore the relative explanatory power of the individual difference variables in predicting evacuation intentions. 6 The results show that evacuation prior to Sandy's landfall is the strongest predictor of evacuation intentions in these data, followed by emotional distress due to Sandy and perceived flood zone. Having an evacuation plan and past flooding in one's home are also statistically significant predictors, with these last two variables having effect sizes similar to the message conditions (< 1%). Once the other individual difference variables are included, actual flood zone, perceived hurricane evacuation zone, and property damage due to Sandy are no longer significant predictors of evacuation intentions. Model 11's adjusted R 2 is 15.4%, indicating that it explains a reasonable amount of the variance in evacuation intentions for this type of analysis. The independent variables tested here are interrelated, and it is difficult to disentangle their effects. Nevertheless, these results suggest that of the variables investigated in this study, reporting having evacuated prior to Sandy's landfall was the strongest predictor of evacuation intentions in the hurricane scenario. This result is consistent with several previous studies that have found that past evacuation for a hurricane is one of the stronger predictors of future evacuation [14,38,94]. Overall, Table 5 indicates that several of the individual difference variables investigated have a stronger influence on evacuation intentions than the message variations. In addition, evacuation intentions were fairly high on average (mean of 5.0 on a 1-to-7 scale; Table 2). Together, these results suggest that the content in the message introduction in Fig. 3 (including the wind-only hazard message), on its own or in combination with the low-impact, neutral, and closing messages, was sufficient to motivate many respondents who are inclined to evacuate to say that they would do so."}, {"section_title": "Summary and discussion", "text": "This study investigates how people's responses to a hypothetical hurricane threat are influenced by different types of risk messages and non-message factors, using data from an online survey. The survey sampled residents of coastal areas of the mainland USA that were affected by Hurricane Sandy several years earlier. Respondents were randomly assigned to receive different combinations of hazard-based, impact-based, and fear-based messages about a hypothetical approaching hurricane; all respondents received the same information about potential strong winds and evacuation. Along with evacuation intentions, the dependent variables examined include respondents' cognitive and affective risk perceptions, efficacy beliefs, and perceptions of the information and its source. In this section, we summarize the study's main results and discuss their potential implications for weather forecast and warning messaging, the risk communication literature, and future research. Specific findings from this study may not generalize to other hazards, regions, or populations. Thus, when discussing the potential implications of the results, we emphasize broader aspects of the study's findings and interpret them in the context of other relevant research. As hypothesized, the high-impact and fear messages tested increased evacuation intentions and risk perceptions, compared to the low-impact and neutral messages, respectively. However, the fear message also increased perceptions that the information provided was overblown, whereas the high-impact message did not. Together with the fear appeals literature, these results suggest that weather risk messaging that focuses on conveying impacts without using fear-appeal language may be advantageous because it can help motivate protective actions without increasing maladaptive responses such as negative reactance to the message. However, the effects of these two message manipulations were small in this study, explaining less than 1% of the variance in the dependent variables. The hazard message manipulations tested, which augmented the information about strong winds with information about predicted flooding or storm surge flooding, did not influence evacuation intentions or most of the other dependent variables examined. In fact, respondents who received the storm surge message with a brief description of surge had lower perceptions that they would be hurt if they stayed home, which was the opposite of the intended effect. In addition, neither the flooding nor storm surge flooding messages increased respondents' perceived risk of rain-or surge-induced flooding at their home from the hurricane, overall or among those with higher actual or Table 6 Results from post hoc tests for effects of individual differences on evacuation intentions (Models 1-10 in Table 5). N.S. indicates that the individual difference variable was not a significant predictor of evacuation intentions (see Table 5), and so post hoc tests were not conducted. Within each row, means with different superscripted letters (a, b, c) are significantly different (p≤.01)."}, {"section_title": "Individual difference measure", "text": "Mean evacuation intentions perceived exposure. These results illustrate the importance of testing messages prior to implementation. They also indicate that for multihazard weather events such as hurricanes, additional research is needed to understand what hazardous conditions people perceive as risky, why, and how different messages influence those perceptions (or not). Several of the messages tested included geographically targeted wording, such as the \"in evacuation zones\" text in the hazard messages, the coastal focus in the storm surge descriptor, and the \"in at-risk areas\" in the fear messages. However, in this study, none of the message manipulations tested helped target evacuation responses towards people who lived (or thought they lived) in higher-risk areas. This suggests that, unless other strategies are used to target messaging towards people at highest risk (see, e.g., [36]), impact-based and fearbased messaging have potential to increase shadow evacuations along with evacuations by high-risk populations. The non-message factors investigated included respondents' sociodemographic characteristics along with their actual and perceived flood and storm surge exposure, evacuation planning, and experiences (including those related to Hurricane Sandy). The results show that evacuation for Sandy prior to landfall was the strongest predictor of evacuation intentions in the hurricane scenario presented. 7 Emotional distress due to Sandy, perceived residence in a flood zone, having an evacuation plan, and believing that one's home had not previously flooded were also significant predictors of evacuation intentions in these data. All of these variables had effect sizes similar to or greater than any of the message manipulations. These findings raise questions about how the weather and emergency management communities can most effectively direct their efforts to improve forecast and warning messaging. It is often believed that providing members of the public with more accurate or more detailed information about which locations will experience which specific hazards or impacts is (or should be) sufficient to raise awareness about the risk and to motivate protective actions. Compared to no message, the messages we tested must have had a strong effect, because without any information about the threat, people would have no reason to evacuate. However, in these experiments, modifying information about the geophysical hazards or the potential personal and societal impacts had, at most, a small effect on people's risk perceptions and evacuation decisions. The message variations may have had larger effects if we had used different control messages. It is also possible that flood and surge hazard messages that provide more specific information about the magnitude or location of those threats (e.g., depth of flooding, where) or that use visuals in addition to text would help convince additional people that they might be at risk from these hazards and should evacuate. Nevertheless, these results indicate that one cannot assume, a priori, that additional hazard or impact-based messaging will increase risk perceptions and motivate additional people at high risk to take protective actions. A further challenge for effective hurricane risk messaging in the USA is that even with the best modern forecasting technology, it is difficult to accurately predict coastal or inland flooding at specific locations far enough in advance of a hurricane's landfall to help the large numbers of people in many coastal U.S. regions evacuate safely [4,100,101]. Moreover, when a hurricane approaches, most people in the USA now have access to and receive a large volume of information about the threat, often beginning days in advance [26]. Together with our results, this suggests that it is important to design and evaluate hazard forecast and warning messages in the context of the potential hazard forecast skill, the other messages people are receiving, and the other factors that influence protective decision making. Another contribution of this research is that it reveals potentially important differences between messages that convey the potential impacts of a threat and messages that employ strong language about impacts to try to scare people into taking the recommended protective action. Impact-oriented and fear-oriented language can overlap, but our study and other literature suggest that they may affect recipients differently. Thus, we recommend that risk message developers and communicators differentiate between content designed to convey impacts and that designed to induce fear, and that they consider which is most appropriate given the specific situation and the potential unintended consequences of the messaging in both the near and long term. We also found that the \"fear\" message we tested (which was modeled after real weather risk messages being used to try to convince members of the public to take recommended protective actions) increased cognitive risk perceptions and worry compared to the neutral message, but it did not increase fear. Fear and worry are forms of negative affect that are often examined together. However, our results suggest that at least in some situations, worry may be a more important motivating lever than fear. These results point to the importance of further explicating how impact-based and fear-based messages work (see also [16]) and what roles fear, worry, and other forms of affect or emotion play in motivating protective behaviors [102,103]. Overall, respondents in our study did not alter their perceptions of which hazards would threaten their home based on the message manipulations tested, nor did they find the storm surge messages more frightening than the other hazard messages. This indicates that more indepth analyses are needed to understand why the types of messages and other factors tested here do or do not influence protective behaviors under different circumstances . More generally, additional work is needed to understand what moves people to take protective actions or not and to understand the mechanisms behind that motivation. Understanding these influencing factors and pathways can help forecasters and public officials communicate in ways that help people know what risks they face when hazardous weather threatens and which actions they can and should take to protect themselves."}]