[{"section_title": "", "text": "autoimmune disease, chronic kidney disease or malignancy (Artz andThirman 2011, Price, et al 2011). Older adults frequently have low grade chronic inflammation, independent of chronic disease or infection. We tested the hypothesis that unexplained anaemia in the elderly (UAE) shares features of anaemia of inflammation (Weiss and Goodnough 2005). Serum or plasma samples were collected from control subjects participating in the Baltimore Longitudinal Study of Aging (BLSA) (Shock, et al 1984) or from older adults with unexplained anaemia of the elderly (UAE) evaluated in the University of Chicago anaemia referral clinic. UAE was determined by prospectively excluding known anaemia aetiologies, as described by Artz and Thirman (2011). All UAE patients were rigorously evaluated to exclude any active or prior history of chronic inflammatory disease. All subjects provided written informed consent and all procedures were approved by the local institutional review boards. Haemoglobin deficit was calculated as the difference between the individual patient's haemoglobin concentration and the Beutler criteria for the lower limit of normal haemoglobin concentration of an individual of the same age, sex, and race (Beutler and Waalen 2006). The thresholds were: 127 g/l (black men); 132 g/l (white men); 115 g/l (black women); 122 g/l (white women). We compared features of anaemia, iron handling, and inflammation in the UAE cohort to age-, race-and gender-matched non-anaemic controls from the BLSA (Table I). P values were based on two-sample t-test, assuming unequal variance for continuous variables and Fisher's exact test for categorical variables. Interleukin (IL) 6, IL8, Interferon gamma (IFNγ), neopterin and serum ferritin were normalized with log transformed values. As previously reported, the UAE group exhibited a normocytic anaemia. Although the estimated glomerular filtration rate (eGFR) for UAE was significantly lower than control subjects, by definition, eGFR was at least 30 ml/min/1.73 m 2 body surface area by Modification of Diet and Renal Disease Study Group (Levey, et al 1999) for this group. Erythropoietin concentration did not differ. Next, we investigated markers of systemic iron handling. We found significantly lower serum iron and significantly higher serum ferritin levels in the UAE cohort. By definition, UAE lacked iron deficiency based on a serum ferritin of at least 50 μg/l (112.35 pmol/l), or a diagnostic iron trial. Decreased serum iron and increased serum ferritin suggest iron restriction in UAE subjects relative to controls. To test for the presence of inflammation in a cohort of individuals without evidence of infections or autoimmune disease, we measured serum or plasma markers of inflammation. Aliquots of serum or plasma were thawed once and then analysed. We measured IL6 and IL8, which are induced by the transcriptional activator Nuclear Factor Kappa B (NFκB); IFNγ and neopterin. Neopterin is a pteridine produced by macrophages chronically activated by IFNγ (Sucher, et al 2010). Neopterin was quantified using a competitive enzyme-linked immunosorbent assay (ELISA; ALPCO Diagnostics; Salem, NH, USA). IFNγ, IL6 and IL8 were measured by MesoScale Discovery ELISA kits. IL6, IL8, IFNγ and neopterin were all significantly increased in the serum and plasma of individuals with UAE. Recognizing the limitations of the small sample size, we determined the Pearson correlation coefficient between haemoglobin deficit and each of the four markers of inflammation for the UAE or BLSA groups. Only neopterin correlated significantly with haemoglobin deficit in UAE subjects (Figure 1). These results demonstrated that a small, but well-characterized cohort of older adults with no known cause for anaemia, has features of anaemia associated with inflammation. The findings of normocytic anaemia, iron restriction, blunted erythropoietin production, and elevated inflammatory markers in this UAE study group suggest that UAE shares clinical features of the anaemia of inflammation. Prior studies have not reproducibly found an association of inflammatory markers with UAE, but the majority of these studies were hampered by lack of clinically and prospectively defined UAE. The relationship of lower haemoglobin and greater inflammation in the UAE group may be confounded by greater renal insufficiency relative to controls. However, data from the InCHIANTI study of community-dwelling adults 65 years of age or older indicated that only participants with creatinine clearance of 30 ml/min/1.73 m 2 or lower had a higher prevalence of anaemia (Ble, et al 2005). Furthermore, the Third National Health and Nutrition Examination Survey (1988)(1989)(1990)(1991)(1992)(1993)(1994) in the United States predicted the median haemoglobin level for people with an eGFR of 60 ml/min/1.73 m 2 (the approximate geometric mean of our UAE cohort) to be 149 g/l for men and 135 g/l for women (Astor, et al 2002). Thus, the anaemia in the UAE cohort cannot be explained by renal insufficiency alone. The significant correlation between neopterin and haemoglobin deficit suggests neopterin is a sensitive indicator of the pathophysiology that underlies anaemia in the UAE cohort. Neopterin is produced by activated macrophages and currently viewed as a prognostic marker for certain cancers (Sucher, et al 2010) and cardiovascular disease (De Rosa, et al 2011). We postulate that elevated neopterin in our UAE cohort implicates peripheral tissue damage resulting from chronic disease or a pathogenic process in the bone marrow compartment that promotes UAE. The strength of our study rests in two well-characterized cohorts of UAE and healthy, wellmatched controls. However, the conclusions from our study are limited by the small sample size. Larger studies in well-defined UAE and control groups would be invaluable. Future studies focused on biomarkers of UAE should include non-anaemic older adults with a similar burden of comorbidities and older adults with anaemia related to other etiologies. Our findings have implications for the treatment of anaemia in older adults. Traditionally, anaemia associated with inflammation resolves when the underlying infection or autoimmune disorder is successfully treated. However, individuals with UAE lack an underlying disease to target for treatment and therefore may suffer prolonged chronic anaemia. In light of the strong associations between increased morbidity or mortality and mild to moderate anaemia in older adults, it seems interventional trials employing antiinflammatory agents, such as non-acetylated salicylates or immunomodulatory drugs, for the treatment of UAE subjects are warranted."}, {"section_title": "Figure 1. Correlation of inflammatory markers with haemoglobin deficit", "text": "The haemoglobin deficit was determined by calculating the difference of an individual subject's haemoglobin with the lower limit of normal haemoglobin based on age, sex and race (see methods section for details). Haemoglobin deficit was plotted versus IL6 (panel A), IL8 (panel B), IFNγ (panel C) and neopterin (panel D) concentrations. Please note the log scale for inflammatory markers. Haemoglobin deficit only correlated significantly with neopterin in UAE subjects. No significant correlations were observed for the BLSA control group. Trend lines were fit as a smooth spline with either 3 or 4 degrees of freedom. The smooth spline accounts for global and local trends in the data set. "}]