[{"section_title": "Abstract", "text": "There is a paucity of data regarding trends in dementia and its subtype prevalence in Japan. Our aims in the current paper are to: (1) summarize epidemiological studies of dementia in Japan including relevant details of study protocol and diagnostic criteria, (2) compare the age-specific prevalence of all-cause dementia among studies, and (3) assess the trends in Alzheimer's disease (AD) versus vascular dementia (VaD) over time. We reviewed diagnostic criteria, all-cause dementia prevalence, and the AD/VaD ratio from 8 large population studies of dementia in Japan. Compared with the Okinawa 1992 study, studies conducted in 1994, 1998, 2005, and 2008 had a higher prevalence of all-cause dementia using Poisson regression models, after controlling for age and sex. In contrast to the US and some European countries, all-cause dementia prevalence is increasing in Japan. The prevalence of AD as opposed to VaD seems to be increasing over time, but large variability in diagnostic criteria, possible regional variability, and differences in prevalence of subtypes of dementia between men and women make it difficult to draw a conclusion about this trend at the national level. Further studies, for example, comparing the population attributable risk of vascular diseases to the prevalence and incidence of dementia could help to clarify the regional variations in etiological subtypes."}, {"section_title": "Introduction", "text": "It has been reported that the prevalence and incidence of dementia in the United States have been either stable or even declining over the last 2 decades of the 1990s [1] . An important question is what the dementia trends are in other countries. This question is particularly relevant to the case of Japan which is an economically advanced country like the US, but is believed to have a different level of vascular disease risk [2] . Studies conducted in the late 1980s and early 1990s reported that vascular dementia (VaD) was more prevalent than Alzheimer's disease (AD) in Japan, compared with the US and other western countries where AD is more prevalent than VaD [3] . In studies among Japanese Americans conducted in the early 1990s [4, 5] , the prevalence ratio of AD to VaD was higher than that reported among Japanese in Japan and more closely resembled that found in the Caucasian population. This suggests that there might have been environmental factors that changed the risks of developing subtypes of dementia after Japanese immigrated to the US. On the other hand, more recent studies conducted in the late 1990s suggest that the cross-national differences found in the past may have been due to differences in the diagnostic methods used [6, 7] . Standardization of diagnosis is one of the challenges of cross-national comparisons of dementia prevalence. There is an ongoing debate as to whether: (1) the higher proportion of VaD found in the past studies in Japan could be due to differences in diagnostic criteria used in Japan and the US, (2) the similar AD/VaD ratio with that of the US found in recent Japanese studies could be due to decreased cerebrovascular disease incidence over the past decades in Japan, or (3) there is no systematic time trend in AD/VaD ratio in Japan and the observed variation is due to regional differences within Japan. Despite a growing interest in the influence of vascular disease and its risk factors on Alzheimer's disease (AD) [8] [9] [10] [11] [12] , there is a paucity of data regarding dementia prevalence trends in Japan. Our aims in the current study are to: (1) summarize epidemiological studies of dementia in Japan including relevant details of study protocols and diagnostic criteria, (2) compare age-specific prevalence of all-cause dementia among studies, and (3) assess the trends in AD versus VaD over time. Previous studies which concluded an increase in AD/VaD over time in Japan [13] [14] [15] did not examine the diagnostic criteria used, nor did they examine age-specific AD/VaD ratios."}, {"section_title": "Methods", "text": ""}, {"section_title": "Study Design and Sample.", "text": "We selected dementia prevalence studies in Japan that were designed to be representative of specific communities or prefectures with at least 500 study participants aged 65 and older, and whose age-specific prevalence (for either 5-or 10-year age intervals) for AD and VaD was published between 1990 and 2009 in international journals, using MEDLINE with the search words \"Japan,\" \"dementia,\" and \"prevalence.\" We used the former criterion (n ≥ 500) in order to have a large enough sample size to allow meaningful between-cohort comparisons of dementia prevalence. Eight studies met these criteria: the Hisayama study [16, 17] conducted at four time points, the Okinawa study [18] , the Radiation Effect Research Foundation Adult Health Survey (RERF-AHS, a.k.a Hiroshima study) [7] , the Tajiri Project [6] , and the Ama-cho study [14] . Brief descriptions of each study cohort follow (See also Table 1 for further summary)."}, {"section_title": "Hisayama Study.", "text": "Hisayama is a rural community adjacent to the city of Fukuoka, a major city of Kyushu Island. An epidemiological study of stroke has been carried out prospectively there since 1961. Cross-sectional dementia prevalence was estimated 4 times, in 1985, 1992, 1998, and 2005 [16, 17] ."}, {"section_title": "Okinawa Study.", "text": "Okinawa is the southernmost island in Japan. Random sampling was conducted to recruit study participants in the selected sites between 1991 and 1992 [18] ."}, {"section_title": "Radiation Effect Research Foundation Adult Health Survey (RERF-AHS) (Hiroshima Study).", "text": "In 1958, the Atomic Bomb Casualty Commission began the Adult Health Study (AHS) to survey the occurrence of illnesses and changes in physiological and biochemical function resulting from exposure to atomicbomb radiation. The original AHS cohort consisted of atomicbomb survivors and their controls, selected from residents in Hiroshima and Nagasaki. Between 1992 and 1996, those aged 60 and older who were residents of Hiroshima and members of the AHS were examined [7] ."}, {"section_title": "Tajiri Project.", "text": "The Tajiri project is a communitybased study started in 1988 for the prevention of stroke, dementia, and bed-confinement in Tajiri, an agricultural area in northern Japan. In 1998, all residents 65 years and older were targeted for the dementia prevalence study [6, 20] ."}, {"section_title": "Ama-cho Study.", "text": "This study was conducted in the municipality of Ama-cho, a rural island town in the northwestern part of Japan. All residents as of the prevalence day of March 1, 2008 were requested to participate in the dementia prevalence study [14] ."}, {"section_title": "Statistical Analysis.", "text": "Differences in overall dementia prevalence among 8 studies were examined using Poisson regression models based on the number of dementia cases (weighted numbers of cases for Okinawa studies) and the number of participants by 10 year age groups (except the youngest age group where 5-year ages were used: 65-69, 70-79, 80-89, and 90+) to provide large enough sample sizes in each group for meaningful statistical comparisons, yet controlling for changing age composition over time. The Okinawa 1992 study sample was used as a reference group because it was the largest and was conducted at the mid-point of assessment years among the 8 studies. Table 1 gives a brief description of each study and the criteria used to define dementia and dementia subtypes. All assessments, except in the Tajiri study, were based on multistage assessments, during which all participants were screened in Phase 1 (screening phase), and selected participants and controls from Phase 1 received final diagnoses from physicians in Phase 2 (clinical assessment phase). The Tajiri study determined dementia diagnoses for all participants. The dementia diagnostic criteria used in Japanese studies were either DSM-III [21] , DSM-III-R [22] , or DSM-IV [23] . The diagnostic criteria used to define subtypes of dementia varied among the studies in Japan. The following criteria were used to define VaD: Hachinski ischemic scores [24] , NINDS-AIREN [25] , DSM-IV [23] , and the Alzheimer's Disease Diagnostic and Treatment Centers (ADDTC) [26] criteria. For AD, DSM-III-R [22] , DSM-IV [23] , and NINCDS-ADRDA [27] were used."}, {"section_title": "Results", "text": ""}, {"section_title": "Diagnostic Criteria.", "text": ""}, {"section_title": "Comparisons of Prevalence of Dementia among Studies.", "text": "The overall prevalence of dementia among those aged 65 and older ranged from 5.6% (Hisayama 1992) to 11.3% (Amacho 2008) ( Table 1) . Poisson regression models for dementia prevalence showed that compared with the Okinawa 1992 study, Hiroshima 1996 (P = 0.0002), Tajiri 1998 (P < 0.0001), Hisayama 2005 (P < 0.0001), and Ama-cho 2008 (P = 0.007) had a higher prevalence of all-cause dementia, controlling for sex and age groups ( Table 2 ). There were no difference between the Okinawa 1992 study and Hisayama studies conducted in 1985, 1992, and 1998 . No difference was found between men and women. The difference between (a) and (b) above is due to diagnostic differences between assessors As a post hoc analysis, we also ran Poisson regression models using only the Hisayama studies (4 time points). The results showed that compared with the all-cause dementia prevalence in 1985, that of 2005 was higher (coefficient: 0.32, 95% CI: 0.01-0.64, P = 0.04) controlling for sex and age groups (not shown in Table 1 )."}, {"section_title": "AD/VaD", "text": "Ratios. AD/VaD ratios among those aged 65 and older are listed in the last column of Table 1 . The Okinawa (1992), Hiroshima (1996) , Tajiri (1998), and Amacho (2008) studies used the same criteria for diagnoses of AD (NINCDS-ADRDA) and the AD/VaD ratio among those aged 65 and older was 1.85, 1.85, 3.33, and 4.12 for the above studies, respectively. The Hisayama studies which conducted 4 cross-sectional studies using the same diagnostic criteria for subtypes of dementia also showed the increasing trend in the ratio of AD/VaD, ranging from 0.52 in 1985 to 1.96 in 1998, and 1.92 in 2005. The Tajiri project, which conducted an MRI substudy to identify dementia etiologies, showed that the proportion of AD among total dementia cases differed largely depending on the criteria used: 62.5% (AD/VaD = 3.3) using NINDS-AIREN criteria, and 40.6% (AD/VaD = 1.0) or 56.2% (AD/VaD = 2.3) depending on assessors using DSM-IV criteria.\nEven though we selected studies with relatively large sample sizes (n ≥ 500), the number of cases was too small to conduct meaningful comparisons of age-specific AD/VaD ratios for the age group 65-70 (<5 for each case). Therefore, we list age-specific prevalence of dementia and AD/VaD ratios for the age groups 70-79, 80-89, and 90 and older in 1985, 1992, 1998 , and 2005), we also found that the prevalence in 2005 was higher than that in 1985, after controlling for age groups and sex. Thus, the dementia prevalence seems to be increasing in Japan, in contrast to the US where decreasing or stable prevalence of all-cause dementia has been reported [1] ."}, {"section_title": "Discussion", "text": "A number of reasons may explain the observed trends. Two diseases that could have high impact on the prevalence of dementia at national levels are cerebrovascular disease and type 2 diabetes, as shown by their relatively high population attributable risk % (PAR%) of dementia in the United States [12, 28] . According to the National Nutrition Survey in Japan, those with hemoglobin A1C values ≥ 6.0% (possible type 2 diabetes) were estimated to be 22.8%, 37.4%, and 40.9% among men aged 70 and older in year 1997, 2002 and 2007, respectively, and the comparative figures among women were 27.2%, 28.2%, and 34.6% [29] . On the other hand, the decline in stroke incidence reached plateaus around the late 1990s after a continuous sharp decline beginning in 1960 [30] , thus further declines in dementia due to stroke would not be expected after the 1990s. However, it is possible that the prevalence of small vessel cerebrovascular disease with resultant microinfarcts that would not be accounted for in these vascular disease statistics could play a latent or underappreciated role in causing or contributing to dementia. The increase in type 2 diabetes, the metabolic syndrome and its associated vascular complications (risk factors for AD [31] ), with a plateau in declining trends in major stroke incidence, could have lead to an increase in dementia prevalence in recent years in Japan. It is also possible that increasing public awareness of dementia in recent years is resulting in enhanced recognition of functional and cognitive declines that might previously have been dismissed as \"normal aging.\" Longer survival of those who suffered from stroke/TIA due to advanced medical treatment could also increase the prevalence of dementia to some extent. Unfortunately, autopsy confirmation in large proportions of the participants in these epidemiologic studies is not available, thus limiting conclusions as to more specific underlying etiologies. Our finding could be also partly due to regional variability in prevalence of dementia. We found that Okinawa had a lower overall prevalence of dementia compared with other cohorts except Hisayama studies in 1985, 1992, and 1998. These two regions (Okinawa and Hisayama) have had lower incidence of cerebrovascular diseases in comparison with other regions studied here. For example, the rate of cerebrovascular mortality, as a proxy of cerebrovascular disease incidence, declined sharply between 1975 and 2000 by over 65% in all regions and declined further between 2000 and 2005 by over 10% in all regions (Table 4) , with the above two regions constantly having lower rates than other regions. Historically, salt consumption has been high in the northern part of Japan because vegetables and marine products are cured with salt to preserve them during the longer winter months and consumed with processed white rice. This dietary pattern is believed to be one of the reasons of the higher prevalence of hypertension and large vessel cerebrovascular disease in the northern prefectures in Japan [32] . The low dementia prevalence in Okinawa and Hisayama (except 2008), which is located in the southern part of Japan, could not only be due to a lower rate of VaD resulting from lower cerebrovascular disease incidence, but also due to lower AD prevalence resulting from reduced vascular injuries [8, 12, 33, 34] ."}, {"section_title": "AD versus VaD.", "text": "Vascular dementia (VaD) was believed to be more prevalent than Alzheimer's disease (AD) in Japan in the 1980s, in contrast to the US or other western countries, but studies conducted in the late 1990s and after showed patterns that were more similar to the US [13, 15, 35] . This \"westernization\" of the dementia prevalence pattern could be partly due to the declining stoke incidence observed during the 1980s as described above. However, it could also be due to changes in diagnostic criteria used in Japan. For example, in the Tajiri study, patients received a diagnosis of \"possible AD with CVD\" by means of the NINDS-AIREN criteria, provided that the vascular effect on dementia was considered to be too ambiguous to diagnose as VaD [6] , which lead to relatively high proportion of AD out of all dementia cases (over 62%). The study also demonstrated the difficulty of obtaining consensus on the definition of VaD, even for experienced neurologists using the same criteria; two neurologists blinded to each other's diagnosis did not agree when diagnosing VaD versus AD under DSM-IV criteria: the proportion of VaD out of total dementia cases ranged from 40.6% to 56.2%, depending on assessors. We expect that lack of imaging data may result in underdiagnosis of subcortical vascular brain injury (e.g., white matter hyperintensity, and silent brain infarcts, etc.) and thus lead to underestimation of VaD. However, more recent studies including the Tajiri, Hisayama (1998; 2005), Hiroshima and Ama-cho studies used imaging data, and these tend to show higher AD/VaD ratios (i.e., not higher VaD prevalence) compared with earlier studies. Therefore, it is likely that changes in diagnostic criteria at least partly explain the higher proportion of diagnosed AD in recent years.\nIn all studies except more recent studies conducted after 2000, as age increased, the proportion of AD among the total dementia cases increased: the youngest age group examined (age 70-79) had a prevalence of VaD that was consistently higher than that of AD in Japan (i.e., AD/VaD < 1). On the other hand, among the older age groups, AD had been more prevalent. In fact, among the oldest age group (age ≥ 90), AD/VaD ratios in Japan were not necessarily lower than the US figures even among studies conducted in the early 1990s, ranging from 2.5 (Hisayama 1985) to 6.0 (Hisayama 1992). In the Aging, Demographics, and Memory Study (ADAMS) [36, 37] , which is the first study in the US to calculate a nationally representative dementia prevalence, the agespecific AD/VaD ratios were found to be 2.36, 4.43, and 4.79 for age group 71-79, 80-89, 90 and older, respectively, using DSM-III-R [22] and DSM-IV [23] criteria for dementia and NINCDS-ADRDA criteria for AD, that is, the age-associated increase in AD prevalence seems to be more evident in Japan than in the US. This could be partly due to the fact that the gender gap in life expectancy is larger in Japan compared with US and the proportion of women increases more steeply as age increases in Japan. For example, in 1990, the life expectancy at age 65 was 18.9 years for women and 15.1 years for men in the US, that is, a gender gap of 3.8 years, while the comparative figure in Japan was 20.0 years and 16.2 years, with the gender gap of 4.8 years. Similarly, in 2008, the life expectancy at age 65 was 19.8 years for women and 17.1 years for men in the US, with the gender gap of 2.7 years, while the comparative figure in Japan was 23.6 years and 18.6 years, with the gender gap of 5.0 years. Cerebrovascular disease is more common among men than women, and we expect a higher proportion of VaD among men than women. A steeper age-associated increase in AD prevalence found in Japan, therefore, could be due to a higher proportion of women among the older old age groups in Japan. Comparisons of age-specific AD/VaD ratios between men and women could clarify this issue, but we were unable to do so due to the small sample size once we stratify prevalence by sex and age groups, especially among those aged 90 and older. However, at least among the younger two age groups (ages 70-79; 80-89), we see an increasing trend in the proportion of AD cases as age group goes up in both men and women (data not shown). These results also suggest that it is important to consider the age/sex structure of samples when we compare the AD/VaD ratio among different cohorts. The comparison of aggregated ratios could be misleading."}, {"section_title": "Incidence of Dementia.", "text": "Although incidence of dementia and its subtype would give a more accurate picture regarding the trend, there is a paucity of dementia incidence studies in Japan. To our knowledge, only three incidence studies have been reported thus far: (1) the Hisayama cohort, following their 1985 cohort for 7 years [38] ; (2) the Tajiri project, following a sub-sample of their 1998 cohort [39] for up to 7 years; (3) the Hiroshima study (Radiation Effects Research Foundation adult health study), following their 1992-1996 prevalence cohort until the year 2003 [40] . The incidence of all-cause dementia was 19.3 per 1000 person-years for men and 20.9 for women in the Hisayama study, 33.9 for men and 44.0 for women in the Tajiri study, and 12.0 for men and 16.6 for women in the Hiroshima study. The Hisayama and Hisorhisma studies reported significant gender differences in subtypes of dementia incidence: Hisayama reported that the incidence of VaD increased with age and was consistently higher than that of AD for men, while the incidence of AD was higher than that of VaD for women age 75 years or older. The incidence of AD markedly increased after the age of 80 in either sex, but overall, VaD was more common in the Hisayama study. The Hiroshima study also reported that probable AD showed the most remarkable increase with age, and probable VaD was significantly lower among women. Overall, AD was more common in this study, possibly because the Hiroshima study was conducted later than the Hisayama study, after a further decline in stroke incidence had occurred. In all 3 incidence studies, NINCDS-ADRDA criteria were used for AD and NINDS-AIREN for VaD. In Japan, AD incidence and prevalence tend to increase with age more than VaD and older old women predominantly have AD rather than VaD. Therefore, when aggregated, the overall prevalence of AD may become higher as more women survive in the oldest old age group. As we mentioned earlier, it is important to consider the age/sex structure of samples when examining trends in the AD/VaD ratio."}, {"section_title": "Conclusion.", "text": "In conclusion, our systematic review shows that (1) there is an increasing trend in overall dementia in Japan. Although we cannot confirm definitively from the current study, the possible explanation of the increase could be a shift in health conditions among the elderly in Japan including the increase in diabetes mellitus in more recent years despite the plateau in decline in stroke incidence during the late 1990s; (2) the similar AD/VaD ratio found in recent studies in Japan with that of the US could be due to a combination of at least 3 factors: (a) shifting diagnostic criteria (more in line with US consensus diagnosis), (b) possible shifting in health conditions among the elderly in Japan (decline in stroke incidence, but increase in metabolic disease e.g., type 2 diabetes, hyperlipidemia, and atherosclerosis), (c) an increase in the proportion of the oldest old who had an historically higher prevalence of AD (as opposed to VaD) in Japan, and (d) regional variations (i.e., a north-to-south gradient in VaD) possibly due to large difference in dietary patterns.\nThe study limitations include relatively small sample sizes, especially for the oldest old group. The Okinawa study took into account the potential dementia cases among those who were screened at Phase 1 (screening phase), but did not participate in Phase 2 (clinical assessment phase), using weights generated from Phase 1. However, as with most other epidemiological studies of dementia, there was no way of precisely estimating the frequency of dementia among those who did not participate in the screening phase. Four Japanese prevalence studies [15, [41] [42] [43] were not included in this study because the age-specific prevalence of AD and VaD were not provided in the published articles. Although it would be interesting to deconstruct the changes in all-causedementia prevalence and AD/VaD ratios into the potential explanatory factors, different criteria used to define subtypes of dementia would not allow this type of quantitative assessment. One of the strengths of our study is that we could ascertain the detailed screening procedures and diagnostic criteria by contacting the investigators of the original studies."}, {"section_title": "Future Directions.", "text": "Future studies could aid in monitoring changing prevalence patterns and their causes by including some of the following elements. First, as with Hisayama studies, it would be ideal for studies to examine the prevalence of dementia and its subtypes repeatedly at the same locations using the same criteria. Second, it would be helpful if future epidemiology studies would recruit more participants aged 90 and older (e.g., through aggressive age-stratified sampling protocols) to improve estimates of prevalence in this age group. Third, more comprehensive diagnostic criteria should be used for inter-cohort comparisons: as suggested by Viswanathan and colleagues [8] , AD and VaD exist in a continuum of disease. It might be more meaningful if we could apply, for example, more specific clinicopathological criteria for mixed dementia [44] [45] [46] [47] [48] [49] [50] than those currently used. Increased use of standardized neuroimaging such as the Alzheimer's Disease Neuroimaging Initiative (ADNI) [51] might aid in the development of more specific and comparable criteria for the diagnosis of VaD. Finally, autopsy confirmation of the underlying potential causes of dementia in epidemiological studies would go a long way to help resolve these important uncertainties in the shifting patterns over time of the dementias."}]