[{"section_title": "Abstract", "text": "We develop a spatial modeling framework for count data that is efficient to implement in highdimensional prediction problems. We consider spectral parameterizations for the spatially varying mean of a Poisson model. The spectral parameterization of the spatial process is very computationally efficient, enabling effective estimation and prediction in large problems using Markov chain Monte Carlo techniques. We apply this model to creating avian relative abundance maps from North American Breeding Bird Survey (BBS) data. Variation in the ability of observers to count birds is modeled as spatially independent noise, resulting in overdispersion relative to the Poisson assumption. This approach represents an improvement over existing approaches used for spatial modeling of BBS data which are either inefficient for continental scale modeling and prediction or fail to accommodate important distributional features of count data thus leading to inaccurate accounting of prediction uncertainty."}, {"section_title": "Introduction", "text": "The North American Breeding Bird Survey (BBS; Robbins et al., 1986 ) is conducted during the breeding season of each year by volunteer observers. The sampling unit in the BBS is a roadside route 24.5 miles (39.2 km) in length, containing 50 stops. At each stop along a route, birds are counted by sight and sound for a period of 3 min. Over 4000 routes have been surveyed in North America. Data from the BBS are widely used by ecologists to investigate problems in theoretical ecology, management, and conservation. Data are often used for estimation of temporal trends (Link and Sauer, 1997a, b) , and describing spatial variation in relative abundance (Sauer et al., 1995; Flather and Sauer, 1996) , for example, to map the relative abundance of a species across its range. Although much effort has been directed toward rigorous statistical modeling of temporal structure, little has been done to develop a similar and consistent framework for assessing questions of spatial variation.\nIn particular, various procedures have been employed for spatial modeling in BBS investigations including splines (Yang et al., 1995) and kriging (Villard and Maurer, 1996) . Inverse-distance interpolation (Sauer et al., 1995) is the current approach used to produce relative abundance maps on the BBS analysis website (see http:// www.mbr-pwrc.usgs.gov/bbs/). However, we feel that spatial modeling of these data is best carried out within a model-based context which properly exploits the properties of count data, and facilitates characterization of uncertainty associated with the resulting maps. For example, BBS data exhibit distinct mean-variance structure such as might be explained by a Poisson assumption and a formal model-based framework for prediction allows maps to be qualified with estimates of uncertainty that are consistent with the mean-variance linkage. This seems especially relevant for BBS data as resulting maps are often used as ''data'' in further analysis, such as in the assessment of landscape and habitat influences on bird abundance.\nSpatial modeling using the Poisson distribution is common in disease mapping (Best et al., 1998) , and the geostatistical framework was laid out by Diggle et al. (1998) . Royle et al. (2001) investigated this approach for creating relative abundance maps from BBS data. Although this general modeling approach is appealing and relatively straightforward to implement in moderately sized problems, it is limiting in high-dimensional problems. For example, continental-scale mapping of data from a large number of BBS routes, requiring prediction at a relatively fine resolution is not practically feasible, let alone in an operational context carried out for all species detected by the BBS. Recent developments of so-called spectral approaches for modeling spatial processes (Higdon, 1998 , Wikle and Cressie, 1999 , Wikle et al., 2001 , Fuentes, 2001 , Nychka et al., 2002 have been successfully applied in Gaussian settings, and lead to great efficiencies in estimation and prediction in large problems. The goal of this paper is to exploit spectral representations to develop a framework for spatial modeling of count data that is practical to implement in large problems, such as for the BBS data.\nIn Section 2, we describe a spatial Poisson model which is suitable for mapping data collected from the BBS. In Section 3 we develop the basic ideas behind the spectral representation of Gaussian spatial processes. In Section 4 we describe how to incorporate the spectral parameterization within the Poisson modeling framework, thus enabling rigorous modeling in large problems. A brief description of estimation using Markov chain Monte Carlo (MCMC) techniques is given in Section 5, and the model is applied to BBS counts in Section 6. Conclusions and discussion of some key advantages and limitations are given in Section 7."}, {"section_title": "The Model for BBS Counts", "text": "Let y(s) be the count of birds made on a sample route centered at location s. We assume that y(s) has a Poisson distribution with mean k(s), denoted as: yðsÞjkðsÞ $ PoissonðkðsÞÞ Thus, two observations, say y(s) and y(s¢), are independent conditional on their means k(s) and k(s¢). Dependence among the observations will be parameterized as a random spatial effect in the mean. This was the key idea behind the generalized linear prediction approach proposed by Diggle et al. (1998) . We model variation in the mean count on the log-scale. Assume that:\nHere, l is a constant, and z(s) and g(s) are random effects. Generally, l could be replaced with an arbitrary regression function such as lðsÞ ¼ P p j¼1 b j x j ðsÞ where the x j (s) are spatially indexed covariates, such as habitat. This model is more generally useful, but the added generality is not necessary in our development.\nWe assume that z(s) is a spatially correlated random variable,\nwith CorrðzðsÞ; zðs 0 ÞÞ ¼ c h ðjjs À s 0 jjÞ being the correlation between the random effect at locations s and s¢. Many correlation functions are possible. For example, the Mate´rn class of correlation models has gained widespread popularity (Stein, 1999, p. 48) . We focus on this class of models in Section 3. See Cressie (1991) for other common choices. An important aspect of this model is that the route effects are assumed to be correlated, allowing for prediction of z(s) (and k(s)) at arbitrary, unsampled, locations.\nA critical consideration in modeling BBS data is that observer abilities differ substantially and it is important to accommodate variation in observer bias in modeling BBS data (Sauer et al., 1994) . The important consequence of observer variation is that it leads to over-dispersion in the data relative to the Poisson assumption. Failure to adequately model important sources of over-dispersion will yield improper estimates of uncertainty for model parameters, and in a spatial setting, inadequate prediction variances. Link and Sauer (1997a) address modeling over-dispersion that arises as a consequence of observer variation in the context of estimating temporal trends.\nIn (1), g(s) represents these observer biases, which are assumed to be independent Normalð0; r 2 g Þ random variables. The independence assumption may be justified on the grounds that each route has a different observer. Unfortunately, this is not universally so -some observers run multiple routes. However, more detailed information is not generally available. One consequence of the spatial aspect of this problem is that g(s) also contains ''small-scale'' spatial variation, i.e., from uncorrelated processes, analogous to the nugget effect in geostatistics. Here, observer error is only one source of this small-scale variation, but likely the most important source. The measurement error effectively serves as an over-dispersion term and is commonly employed in disease mapping (e.g., Best et al., 1998) .\nTo reduce clutter in formulae given below, we will define uðsÞ logðkðsÞÞ. Let u be the n · 1 vector of observed counts. We may therefore express (1) as:\nwhere vectors and matrices are of dimension n · 1 and n · n.\nEfficient statistical mapping of avian count data"}, {"section_title": "Gridding the data", "text": "As expressed in (3), the spatial process z(s) is assumed to be a continuous space process defined for all s in the sampling domain. It is useful to consider a subtle generalization of the model which allows for the spatial process to be discrete. For example, defined by counties or other geopolitical strata as is common in disease mapping applications, or physiographic strata in ecological applications. Data might therefore correspond to areal totals over the strata, or perhaps one or more point observations within each stratum.\nTo accommodate this possibility, we express the model for the n-vector u as\nwhere 1 is n · 1, z is the N · 1 spatial process, g is an n · 1 vector of iid normal noise, and K is an n · N matrix describing the association between data and process. Each row of K relates the observation at s to one or more of the elements of z.\nThere is great flexibility in the choice of models for z and specification of K. Note that (3) is the case where K ¼ I with N=n and we may retain the continuousspace Gaussian parameterization as specified by (2). Alternatively, z may have discrete support and assumed to be a spatial autoregressive process (He and Sun, 2000) , or general Markov random field. In contrast to modeling spatial structure in z, one may incorporate complicated spatial structure into K and assume relatively simple structure on z. For example, Higdon (1998) describes process convolution models where columns of K are weights chosen according to some class of convolution kernels and z are assumed to be white noise -that is, uncorrelated in space.\nEstimation and prediction under this model can be carried out using MCMC techniques as described by Diggle et al. (1998) . The practical limitation is that updating the random spatial effects requires manipulation of the variance-covariance matrix of zðs 1 Þ; zðs 2 Þ; . . . ; zðs N Þ. Moreover, for prediction, one requires the N · n covariance matrix between z at the prediction and data locations. Within the MCMC framework, this is especially problematic since computations involving these matrices must be carried out at each step of the algorithm, often for many thousands of iterations. However, the multivariate normal representation (2) may be replaced by a much more economical representation, known as a spectral representation. This allows for efficient computation under such models. We now turn to development of spectral representations for the spatial process z."}, {"section_title": "Spectral representations", "text": "The basis of many statistical procedures, including the one outlined above, is a multivariate normal distribution. For illustration, consider some spatial process z(s i ) for i ¼ 1; . . . ; N . Assume z ½zðs 1 Þ; . . . ; zðs N Þ 0 has multivariate normal (MVN) distribution:\nThe key to efficient spatial modeling in large problems is parameterization of this multivariate normal in an efficient manner. Rewrite z in terms of a spectral decomposition,\nwhere W is an N · N matrix of basis functions W ½w 1 ; . . . w N , where w i ½w i ðs 1 Þ; . . . ; w i ðs N Þ 0 , and a is an N · 1 vector of spectral coefficients (projections of the process z onto the basis functions), with distribution,\nIf the basis functions are orthogonal, then\nand\nThus, in place of explicitly making assumption (4), we make use of the spectral parameterization (5) and (6).\nThere are several advantages to writing the spatial process z in terms of the spectral process a. First, the spectral operator often acts as a decorrelator so that R a is relatively sparse, as compared to R z . For example, if W represents the eigenvectors of the singular-value decomposition of R z (e.g., as in principal components analysis (PCA), or empirical orthogonal function (EOF) (e.g., see Obled and Creutin, 1986) analysis in spatial statistics), then R a is diagonal with the diagonal elements proportional to the variance of the spectral component. Similarly, as described in the Appendix, when W represents Fourier basis functions (sines and cosines in twodimensions), then R a is approximately diagonal (see results on the distribution of discrete Fourier transform coefficients, e.g., Shumway and Stoffer, 2000, Section T3.12) .\nAnother benefit of the spectral representation is its efficient computation. As discussed in Section 5, this is critical for the implementation of large spatial fields in Bayesian models. At this point, we note that (5) and (7) are matrix representations of the inverse spectral transform and spectral transform, respectively. For example, if W is the Fourier basis set, then (7) may be computed using a Fast Fourier Transform (FFT) rather than performing the matrix multiplication; in fact, one need not ever construct W in this case. Similarly, (5) corresponds to the inverse FFT in this case. The Appendix contains more detail on the implementation of the FFT in this context. One can also use fast spectral transform algorithms for other basis functions such as wavelets.\nFinally, although not used explicitly here, one can truncate the basis formulation in some cases to achieve dimension reduction. For example, in the case of PCA or EOF basis functions, many (if not most) of the spectral coefficients are negligible and thus one can truncate the matrix W to N · m by discarding the last N ) m columns of W, in which case a is an m · 1 vector, where m<N. One may need to include an error term in (5) to account for this truncation. For an example, see Wikle and Cressie (1999) .\nIn a Bayesian implementation, one pays particular attention to the prior distribution on the spectral process, a. In this example, this process is assumed to be multivariate normal (6). Thus, the specification of the covariance matrix R a is critical. We note that if the original process covariance matrix is parameterized in terms of parameters h, R z ðhÞ, then so must the spectral process, R a ðhÞ. In some physical and biological settings, one may have scientific justification for specifying prior distributions for h. For example, in atmospheric science applications one might know a priori that there should be a scaling behavior in the variance at different spatial scales (e.g., Wikle et al., 2001) . Alternatively, without strong scientific guidance on the covariance structure, one might choose a parametric family for R z ðhÞ and thus R a ðhÞ. That is, if we choose a family of spatial covariance functions for z in terms of parameters h then for specific basis functions we can express the covariance function for a explicitly in terms of the same parameters h. For example, consider the Mate´rn class of covariance functions,\nwhere K m is the modified Bessel function, m is related to the degree of smoothness of the spatial process, a is related to the correlation range, and / is proportional to the variance of the process (e.g., Stein, 1999, p. 48) . The corresponding spectral density function at frequency x is,\nwhere d is the dimensionality of the spatial process (e.g., Stein 1999, p. 49) . Thus, if one chooses W to be Fourier basis functions, then (9) suggests the form of R a ðhÞ (diagonal, with the diagonal element corresponding to frequency x given by (9)) as discussed in the Appendix."}, {"section_title": "Spectral representation of the Poisson Model", "text": "For implementation of the spectral model we have nested the sample region into a grid consisting of 6800 equal-area cells with spacing of approximately 20 miles. The grid was generated using the Lambert-Azimuthal equal area projection, but maps presented subsequently have been projected back to longitude/latitude coordinates. For BBS data, it is important to keep in mind that the sample ''sites'' actually consist of the centers of 24.5 mile roadside routes. Thus, in some sense, there is a fairly coarse canonical resolution to these data. The present grid size was chosen so as to approximate the resolution of the sample route. We will index the prediction grid cells as fr 1 ; r 2 ; . . . ; r N g where r j is the center point of cell j. We assume that a count made at any particular route located within grid-cell r j (determined by proximity from the center of the route) has a mean associated with that grid-cell. The grid-cell mean and route-specific deviations from this mean are assumed additive on the log scale. We modify our notation slightly to acknowledge the discrete model grid and association of each observation with grid-cells, letting y ij be the observer count on route i, located within grid-cell j. Thus, y ij $ Poissonðk ij Þ. As before, u ij ¼ logðk ij Þ, and u is the n-vector of observed log-means. As in Section 2, we specify a normal prior distribution for u:\nwhere z is the 6800 · 1 grid process, K is an n · 6800 incidence matrix. Thus, the ith row of K, say k i contains a single 1 corresponding to the grid cell which observation i is associated. For BBS routes, a better choice of K might be based on an allocation of the length of the BBS route into grid-cells that the route traverses so that rows of K are weights that sum to 1. However accurate digitized route information is not presently available. The scale parameter c is incorporated here to facilitate estimation of the variance components, as described below. We parameterize the spatial process according to the discussion of Section 3:\nNote that due to the discretization, there may be multiple observations within a gridcell. Consequently, r 2 is uncorrelated small-scale ''among grid-cell'' variance -analogous to a nugget effect in classical geostatistics. On the other hand, r 2 g represents within grid-cell variation which is primarily that among observers. Both variance components are identifiable as long as there are some replicate (within grid-cell) samples, though the posterior correlation between the variance components is likely to be high if there are few replicate observations. For the spectral coefficients, we assume a $ MVNð0; R a ðhÞÞ;\nwhere R a ðhÞ is the spectral correlation matrix implied by assuming that the spatial process follows an exponential covariance with spatial dependence parameter h. Note, the exponential covariance function is a special case of the Mate´rn class with m ¼ 1=2. Thus, the correlation parameter h is univariate (h=a) from (8). Note that because of the scaling parameter c in (10), diagonal elements of R a ðhÞ are determined by the spectral density in (9), which depends on h. Thus, there is no scale parameter associated with R a ðhÞ (i.e. /=1). This scaling of z leads to more stability in estimation of the variance components by MCMC (described in the following section).\nOf the remaining parameters, r 2 and r 2 g were assigned inverse-gamma priors: IG(1,10) and IG(.5,2), respectively, and l was assigned a diffuse normal prior. The prior distribution for h merits some discussion because the use of certain ostensibly ''non-informative'' priors for h can yield improper posterior distributions (Berger et al., 2001) . The solution suggested by Berger et al. (2001) , in the Gaussian random field case, is to use the reference prior. In the present context, calculation of the marginal likelihood necessary to obtain the reference prior seems prohibitive, because the likelihood is Poisson and the spatial process model is nested one level lower in the hierarchy. Consequently, we made the pragmatic decision to adopt the reference prior given by Berger et al. (2001) , recognizing that this is not the reference prior for the Poisson-Gaussian spatial model under consideration, but that it seems a sensible solution in the present context because it is proper and does arise under the Gaussian random field model described in Section 3."}, {"section_title": "Prediction", "text": "Our primary goal is prediction of several of the spatially indexed quantities in the model. Of course, the primary benefit of a statistical approach to spatial modeling is that measures of uncertainty (e.g., prediction variances) are useful to quantify map precision. For these purposes, we obtain estimates of posterior means and corresponding posterior variances. Using MCMC methods as discussed in the following section.\nSince the spatial structure in this model is contained in the spatial process z, a map of this quantity provides a suitable summary of the spatial structure in the data. Note however that prediction of z in grid-cells containing data may include a nonzero contribution from the uncorrelated noise component due to r 2 . Alternatively, one might consider predicting the ''noiseless'' version of z j , i.e. just the mean Wa.\nIt is also useful to predict the expected mean count for a single hypothetical route within each grid-cell (whether containing data, or not), i.e. k j . Clearly, interest is in an estimate of this quantity free of observer effects. Thus for grid-cells containing data we do not wish to predict the u ij corresponding to a particular route, i. (in other words, we want the mean of a ''typical'' observation made within the grid-cell). Since the distribution of the logarithm of the conditional mean of a single count made within grid-cell j is\nthe mean of y j , unconditional on the observer effect, is:\nwhich is the mean averaged over the normal mixing distribution of observer effectsi.e. the usual log-normal result. This quantity, and its variance, are easily estimated using MCMC, as described in the following Section, by generating a Markov chain sequence for a single unobserved u for each grid-cell, and exponentiating those simulated values."}, {"section_title": "Model fitting by Markov Chain Monte Carlo", "text": "Posterior analysis of non-normal models containing random effects is relatively straightforward using MCMC techniques. Given the Bayesian formulation in Section 4, our goal is to draw samples from the posterior distribution of unknown quantities (parameters and predictands) in the model. To do this, we set up a sequence of fullconditional distributions for each of the unknowns, and sample repeatedly from these.\nTo be brief, we neglect discussion of this and MCMC in general, instead focusing on the most relevant components of the MCMC algorithm. Gilks et al. (1995) and Gelman et al. (1995) provide general descriptions of MCMC. Clayton (1996) is a good reference on Bayesian analysis of Generalized Linear Mixed Models, and Diggle et al. (1998) provide the formulation of generalized linear prediction in a spatial context."}, {"section_title": "Full-conditional for u", "text": "The full-conditional for a particular u ij (route i within grid-cell j) is the product of the Poisson likelihood and the normal prior for u ij :\n½u ij jÁ / ½y ij ju ij ½u ij jl; c; z j ; r 2 g which may be conveniently sampled using Metropolis-Hastings algorithm. Because the u's are conditionally independent of one another, sampling the whole collection of u's may be vectorized. For prediction free of observer effects, it is necessary to sample a single u for each grid-cell from the prior distribution (i.e. without the likelihood component), under the current parameter values."}, {"section_title": "Full-conditional for z", "text": "Since the model components for both u and z are normal distributions, the fullconditional for z is multivariate normal:\nwhere\nThe benefit of parameterizing the model such that K is an incidence matrix and the z's independent, conditional on a (implied by (11)) is evident. In this case, K¢K is diagonal. Consequently, V is diagonal and so the z's may be sampled directly from univariate normal full-conditional distributions. Note grid-cells that do not contain data correspond to all-zero columns in K which serve here to zero-out the likelihood contribution in the full-conditional, causing those z's to be sampled directly from the prior distribution."}, {"section_title": "Full-conditional for a", "text": "The full-conditional for a is also multivariate normal with V and f in (13) replaced by:\nThe simplification from (14) to (15) is due to the orthogonality of the spectral basis functions W. Similarly, (16) is computed by taking the Fourier transform of z=r which is a fast operation. Thus, if the prior covariance R a ðhÞ is diagonal, then the full-conditional distribution of a is updated trivially as independent univariate normal distributions."}, {"section_title": "Full-conditionals for remaining parameters", "text": "The remaining parameters l, r 2 , and r 2 g may be sampled from the usual Normal and Gamma full-conditional distributions. Samples of logðhÞ were drawn using a Metropolis-Hastings algorithm with a normal proposal distribution for logðhÞ with standard-deviation 0.25.\nThe MCMC algorithm is run for a large number of iterations, say M, generating a sequence of values for each unknown in the model (parameter, or predictand) from the posterior distribution once the Markov chain has converged (this is discussed in the following Section). For example, to quantify features of the posterior predictive distribution of u j , a hypothetical value in grid cell j, the MCMC output is fu "}, {"section_title": "Application", "text": "We illustrate application of the spectral model using Carolina Wren counts from the BBS during 1998. The 921 BBS routes used in this analysis are shown in Fig. 1 . For these data, eight Markov chains of length 520,000 were generated using the MCMC algorithm described in the previous Section, with the first 20,000 samples used for ''burn-in''. We retained every 50th sample for analysis (10,000 samples per chain). Each chain was initialized with random draws of the prior parameters (l, c, h, s g , s ) from uniform distributions. Convergence was assessed using the Gelman-Rubin diagnostic (Gelman and Rubin, 1992) . Convergence was indicated for all parameters, the ''potential scale rediction'' was near 1 for all parameters (1.0037, 1.0027, 1.0031, 1.0004, 1.0034 for l, c, etc.). Post-burnin samples from all eight chains were used in computing posterior summaries (80,000 samples total). The MCMC history for the parameter h is shown in Fig. 2 a which, although indicating high autocorrelation, does appear stable and well-mixing.\nPosterior means and standard deviations for the model parameters are given in Table 1 . The salient points of interest are the high indicated spatial correlation -the range parameter of the exponential correlation function was estimated to be approximately 600 (miles) and its posterior distribution (Fig. 2(b) ) is concentrated away from 0. Under the parameterization described in Section 4, the variance among grid-cells is equal to c 2 r 2 and the within grid-cell variance (i.e. observer) is r 2 g . Due to the replication at this grid resolution, both variance components should be well-identified; their estimated posterior correlation was )0.506. We see from the summaries of Table 1 that the within grid-cell variance (that taken to represent observer effects) is considerably larger than the among grid-cell variance component, consistent with our belief that variation among observers is a dominant source of over-dispersion in BBS counts.\nThe important predictable spatial structure in the model was parameterized rather arbitrarily at the resolution of the grid imposed over the survey region. Ideally, observations within grid cells are not correlated beyond that implied by the spectral model, which would be indicated by a small r 2 variance component. From the estimated variance components we can characterize the intra-grid correlation, say q, which is the ratio of the measurement error variance c 2 r 2 to the sum of that and the observer variance r 2 g . The posterior distribution of q is also summarized in Table 1 . The posterior mean of 0.283 does suggest the presence of some within-grid structure not modeled as ''process'' which is a consequence of the discretization. We are primarily interested in characterizing spatial structure in the counts. Point-wise posterior means of the log-scale Z process (Fig. 3) are useful in this regard, but the expected route count free of observer effects, i.e. the posterior means of k(s) in (12), is more directly interpretable. This is shown in Fig. 4 ."}, {"section_title": "Conclusions and discussion", "text": "Spectral representations of spatial processes provide a computationally efficient means for spatial modeling in high dimensional problems. We have combined this idea with the generalized linear prediction framework of Diggle et al. (1998) to yield an effective method of producing relative abundance maps from the North American Breeding Bird Survey. Figs. 3 and 4 illustrate the very prominent spatial structure in BBS count data indicative of underlying structure in habitat and other processes dictating variation in the distribution of the species within its range. Thus, the notion of improving spatially explicit estimation by combining data within the context of a spatial model appears to be well founded. The possibility exists to explicitly account for certain factors responsible for spatial variation in relative abundance of a species, such as habitat. However, habitat is not static, and development of suitable resolution data in both space and time is difficult. Nevertheless, such information is easily incorporated into our modeling framework. Even conditional on such information, biogeographic and population dynamic considerations in addition to a host of other factors (climate, weather, etc.) will induce substantial spatial structure beyond that which one is able to control for. Consequently, we believe the ability to model this residual spatial structure at the continental scale will prove beneficial in ecological investigations involving BBS data. We believe that a statistical approach to mapping is preferred to more common interpolation procedures such as inverse-distance weighting, spline smoothing, and (Gaussian) kriging which ignore structure inherent in count data, because the assessment of uncertainty is based on a sensible model for count data, one that admits the positive, integer-valued support of counts data, and the inherent meanvariance relationship that is evident in survey data of organisms. Importantly, statistical approaches permit characterization of predictive uncertainty. For the BBS data analyzed here, the relative posterior standard deviation is shown in Fig. 5 where we note the strong relationship between predictive precision and station density. In regions of low sample density, relative precision is much lower, as expected. The ability to characterize predictive uncertainty can be useful for guiding decisions regarding survey design as is commonly done in many environmental and atmospheric science monitoring contexts (e.g., Haas, 1992; Cox et al., 1996; Oehlert, 1996; Bueso et al., 1998; Nychka and Saltzman, 1998; Berliner et al., 1999) . Wikle and Royle (2004) consider the problem of model-based design for a waterfowl survey under a spatial Poisson model similar to that considered here. While the spectral model was implemented in discrete space, at a fairly coarse spatial resolution, the efficiency of spectral models enables prediction at an arbitrarily fine resolution. However, the nature of any particular application may suggest otherwise. In our case, BBS counts are not point observations, but rather some illdefined spatial aggregation. Thus, we have chosen a rather coarse model grid. One consequence of this is that it induces replication, or multiple observations within a grid-cell. In doing so, there is some loss of ability to model variation due to small-scale spatial processes. There is a trade-off between modeling this variation as process, by imposing an arbitrarily small grid such that each grid-cell contains a single observation, and the reality that the support of BBS counts is not arbitrarily small. Because implementation of the spectral Poisson model is very efficient, the framework may be implemented on a larger scale, even in an operational context. Moreover, useful generalizations may be considered including development of a space-time model that unifies the existing trend assessment (Link and Sauer, 1997a) with a model for spatial structure."}, {"section_title": "Appendix Modeling spatial processes in the spectral domain", "text": "It is well-known that efficient simulation of spatial processes can be obtained by spectral methods (e.g., Shinozuka and Jan, 1972; Mejia and Rodriguez-Iturbe, 1974) . However, such methods have not seen extensive use in the modeling of spatial random effects in the lower stages of a hierarchical model for spatial data. The essence of this approach is described below, with particular focus on the case with Fourier spectral basis functions.\nConsider a Guassian spatial process z(s i ) for i ¼ 1; . . . ; N . Thus, z ½zðs 1 Þ; . . . ; zðs N Þ 0 has a multivariate normal (MVN) distribution z $ MVNð0; R z Þ. We can rewrite this process in terms of a spectral decomposition, z ¼ Wa, where W is an N · N matrix of basis functions W ½w 1 ; . . . w N , where w i ½w i ðs 1 Þ; . . . ; w i ðs N Þ 0 , and a is an N · 1 vector of spectral coefficients. We assume that the spectral basis functions are complete and orthonormal (i.e., W 0 W ¼ WW 0 ¼ I). It then follows that a has the distribution a $ MVNð0; R a Þ, where R a ¼ W 0 R z W. Consider the case where we expand the z(s) process in terms of Fourier basis functions (i.e., sines and cosines). Furthermore, we assume that the spatial process is defined on a regular lattice and, for simplicity of illustration, that the spatial domain is defined in one-dimension (analogous results hold for higher spatial dimensions). Then, for locations s i , i=1,...,N and spatial frequencies x k =k/N for k=0,...,N/2 (N even) we have It is well-known that for second-order stationary random processes, the a coefficients are nearly uncorrelated and their variances at a given frequency are approximately equal to one-half the power spectral density at that frequency (except for frequency x 0 and x N/2 at which the variance is equal to the associated power spectral density) (e.g., Shumway, 1988) . Thus, assuming z is second-order stationary with covariance matrix R ¼ r 2 R, where R is the correlation matrix, then covðaÞ % r 2 D, where D is a diagonal matrix with the diagonal elements given by ½f ðx 0 Þ; 1=2f ðx 1 Þ; . . . ; 1=2f ðx N =2 Þ; 1=2f ðx 1 Þ; . . . ; 1=2f ðx N =2À1 Þ 0 , where f(x k ) is the spectral density at frequency x k corresponding to the correlation function used to construct R.\nIn our case, we parameterize the correlation matrix R(h) in terms of a spatial dependence parameter h. Thus, the diagonal matrix D(h) is also a function of h. In the analysis presented here, we specified a Mate´rn covariance matrix with the associated spectral density given by (9).\nAlthough one could create the N · N basis function matrix W, it is not practical computationally for large n. Rather, we recognize that the operation W 0 z is simply the discrete Fourier transform operation (and Wa is the inverse discrete transform operation.) Such operations are traditionally implemented very efficiently via the Fast Fourier Transform (FFT), in which case one never need actually construct the matrix W. The use of such an efficient transform algorithm is the key to the implementation of the hierarchical spatial model on very large domains. One complicating issue is that most statistical software packages implement the FFT in its complex representation (e.g., see Shumway, 1988) . To follow the matrix notation used in the model development, it is convenient to covert the FFT results to a vector of real numbers. Such a conversion is simply a matter of bookeeping and is fairly simple to implement. We have made available our code (in R and Matlab) to implement the spectral FFT with Mate´rn correlation matrices on the second author's website: http://www.stat.missouri.edu/ $ wikle under the link ''Spatial Spectral Code''. Finally, as discussed in Dietrich and Newsam (1993) the spatial approach to simulating spectral random fields for a given correlation function is approximate. Recall that the assumption that the covariance matrix for the spectral coefficients is diagonal is based on approximate results. However, although the correlation implied by the spectral approach may not be exactly that of the functional form on which it was based, the differences are typically minor in practice and, regardless, the implied correlation function is a valid correlation model."}]