[{"section_title": "Abstract", "text": "Objectives: Many local communities in Kentucky, a state with one of the highest smoking prevalence rates in the United States, have enacted smoke-free ordinances that prohibit smoking in workplaces and enclosed buildings open to the public. Research has shown that such ordinances are clearly beneficial for public health, but their influence on smoking prevalence in the populations they cover remains unclear. This study explores the effect of local smoke-free ordinances on smoking prevalence in Kentucky.\nWe used a database of smoke-free ordinances maintained by the Kentucky Center for Smoke-Free Policy, Kentucky Behavioral Risk Factor Surveillance System survey data, and US Census data. We estimated the proportion of Kentucky adults living in counties with smoke-free ordinances of varying strength; examined bivariate associations between smoke-free ordinances and smoking prevalence; and fit regression models that adjusted for various county-level demographic, socioeconomic, and geographic factors.\nResults: Smoking prevalence was approximately 5% lower in counties with smoke-free ordinances, even after adjusting for other relevant factors, including a trend in decreasing prevalence throughout the study region. There was a slight dose-response effect related to the strength of smoke-free ordinances after adjustment for these covariates. Smoke-free ordinances appear to have a modest effect on smoking prevalence across the span of several years.\nConclusions: Findings demonstrate that although smoking prevalence fell throughout the state during the study period, counties with smokefree ordinances experienced a greater decline. Future research should examine the strength of smoke-free ordinances in greater detail to better understand their influence on smoking prevalence.\nKey Words: Kentucky, policy, smoke-free, smoking, tobacco T obacco use is the most preventable cause of death in the United States. It is linked to >480,000 deaths each year, including 41,000 associated with exposure to secondhand smoke (SHS).\n1 Cigarette smoking has decreased steadily nationwide during the past several decades, from approximately 42% in 1965 (the year after the Surgeon General's report on smoking was released) to 15.1% in 2016.\n2 The benefits of this change are evident in lower rates of lung cancer, chronic obstructive pulmonary disease, ischemic heart disease, and cerebrovascular disease. 3, 4 In Kentucky, however, >25% of the adult population still smokes cigarettes (25.9%), and 20% of all deaths are attributed to smoking. 1, [5] [6] [7] [8] Furthermore, smoking-related deaths cost Kentucky an estimated $5.6 billion/year from lost productivity caused by premature death and poor health, as well as personal medical care expenditures.\nAs much as reducing smoking is important for individual health, reducing SHS exposure is imperative for public health. The risk of poor coronary circulation and coronary heart disease is almost as high among nonsmokers exposed to SHS as it is for current smokers.\n11,12 SHS has long been known to increase cancer and asthma rates among both children and adults.\n11-21 The risk of diabetes mellitus is elevated among nonsmokers exposed to SHS when compared with nonsmokers who are not exposed to SHS. 20 SHS also has been shown to influence the risk of major depression and suicidal ideation, 22 and it increases the risk for\n• Smoking prevalence was approximately 5% to 6% lower in counties with smoke-free ordinances.\n• This trend was evident even after adjusting for demographic, socioeconomic, and geographic factors, as well as the general trend of decreasing prevalence throughout the study region and period.\n• We also observed a dose-response effect related to the strength of the smoking ordinance, which, although weak, persisted after adjustment for significant covariates."}, {"section_title": "", "text": "T obacco use is the most preventable cause of death in the United States. It is linked to >480,000 deaths each year, including 41,000 associated with exposure to secondhand smoke (SHS). 1 Cigarette smoking has decreased steadily nationwide during the past several decades, from approximately 42% in 1965 (the year after the Surgeon General's report on smoking was released) to 15 .1% in 2016. 2 The benefits of this change are evident in lower rates of lung cancer, chronic obstructive pulmonary disease, ischemic heart disease, and cerebrovascular disease. 3, 4 In Kentucky, however, >25% of the adult population still smokes cigarettes (25.9%), and 20% of all deaths are attributed to smoking. 1, [5] [6] [7] [8] Furthermore, smoking-related deaths cost Kentucky an estimated $5.6 billion/year from lost productivity caused by premature death and poor health, as well as personal medical care expenditures. 9, 10 As much as reducing smoking is important for individual health, reducing SHS exposure is imperative for public health. The risk of poor coronary circulation and coronary heart disease is almost as high among nonsmokers exposed to SHS as it is for current smokers. 11, 12 SHS has long been known to increase cancer and asthma rates among both children and adults. [11] [12] [13] [14] [15] [16] [17] [18] [19] [20] [21] The risk of diabetes mellitus is elevated among nonsmokers exposed to SHS when compared with nonsmokers who are not exposed to SHS. 20 SHS also has been shown to influence the risk of major depression and suicidal ideation, 22 and it increases the risk for"}, {"section_title": "Key Points", "text": "• Smoking prevalence was approximately 5% to 6% lower in counties with smoke-free ordinances.\n• This trend was evident even after adjusting for demographic, socioeconomic, and geographic factors, as well as the general trend of decreasing prevalence throughout the study region and period.\n• We also observed a dose-response effect related to the strength of the smoking ordinance, which, although weak, persisted after adjustment for significant covariates.\nsudden infant death syndrome. 23 The Institute of Medicine and others have found that smoke-free ordinances reduce the risk of heart attacks, and other research has demonstrated reductions in asthma-related emergency department visits. 7, 21, 24, 25 For these reasons, smoke-free ordinances inarguably and unequivocally benefit public health. 26 Despite the persistence of high smoking rates throughout the state, many local communities (both cities and counties) in Kentucky have enacted smoke-free ordinances that prohibit smoking in workplaces and/or enclosed buildings open to the public. Although some of these laws vary in strengthfor example, some smoke-free ordinances do not include all indoor workplaces, and others have exemptions for bars, restaurants, or other exstablishments open to the public-there were 23 counties (of 120) with at least a portion of their residents covered by a smoke-free ordinance as of December 2009.\nSome public health authorities and advocates, including some from Kentucky, also have promoted smoke-free ordinances as a means to decrease smoking prevalence in the population. This relation, however, has not been consistently demonstrated. 27, 28 In one instance, Hahn et al explored the impact of smoke-free ordinances in Lexington-Fayette County as compared with 30 other counties in Kentucky that had not implemented these laws. 29 Using Behavioral Risk Factor Surveillance System (BRFSS) data from 2001-2005, they compared smoking rates before and after Lexington-Fayette County implemented its smoke-free ordinance in April 2004 and compared the prevalence with counties matched on income, education, and smoking prevalence. They found that smoking rates decreased after a peak in May-August 2005, demonstrating a significant short-term effect. Another US study using Pregnancy Nutritional Surveillance System data explored changes in smoking prevalence among women enrolled in the Special Supplemental Nutrition Program for Women, Infants, and Children in Ohio. Women self-reported at their initial clinic visit if they had smoked in any of the previous 3 months. Klein 30 Other studies investigating the long-term effects of smoke-free laws on smoking cessation found, however, that a decrease in smoking prevalence was not sustained, even if there was an initial decrease in prevalence or quit attempts. 31, 32 Even studies examining the same smoke-free law have disagreed in their conclusions about its effectiveness with regard to decreasing smoking prevalence, as in the case of the national smoke-free law implemented in Italy in 2003. [33] [34] [35] Although the importance of such laws for other public health outcomes is undeniable, our study addresses their effectiveness in affecting the prevalence of smoking within the population to which they apply. Specifically, this study explores the effect of local smoke-free ordinances on smoking prevalence in Kentucky using survey data from the BRFSS. The primary objective was to discern any medium-to long-term differences in smoking prevalence among residents who lived in counties that had smoke-free ordinances, using data from a period during which many such laws or policies were implemented by Kentucky cities and counties, and controlling for socioeconomic, demographic, and geographic variables that are associated with smoking prevalence. A secondary objective was to determine whether the strength of smoke-free ordinances influenced smoking prevalence."}, {"section_title": "Methods", "text": ""}, {"section_title": "Data Sources and Coding", "text": ""}, {"section_title": "Kentucky BRFSS Survey", "text": "The BRFSS is a nationwide telephone survey that asks about health behaviors and conditions among noninstitutionalized adults (ages 18 years and older), but is implemented by each state individually. Because the public use data available from the Centers for Disease Control and Prevention omit county identifiers for BRFSS respondents from counties with <50 total respondents, we obtained BRFSS survey data for Kentucky directly from the state program during the study time period, 2002-2009. County of residence was necessary to determine whether each individual respondent lived in a county with a smoke-free ordinance. With regard to smoking, we used responses from the following questions to assess smoking prevalence: For analysis of smoking prevalence, those who responded \"yes\" to smoking at least 100 cigarettes in their entire life, and responded that they currently smoked \"every day\" or \"some days\" made up the current smokers group. Former smokers were those who had smoked 100 cigarettes, but reported no current smoking. Never-smokers, those who had not smoked 100 cigarettes in their lifetime, made up the non-smokers group. We combined data from "}, {"section_title": "Smoke-Free Ordinances", "text": "We obtained information regarding smoke-free ordinances passed by county and city governments, including date of implementation, from the Kentucky Center for Smoke-Free Policy, which maintains a regularly updated database of these laws in Kentucky. The Kentucky Center for Smoke-Free Policy further categorizes the strength of all smoke-free ordinances as \"none,\" \"weak/moderate\" (smoke-free with significant exemptions), or \"comprehensive\" (smoke-free workplaces and enclosed public places); previous studies have used these categories for similar research. 36, 37 For counties in which only a city had a smokefree ordinance but there was no countywide ordinance, we used the category for the largest city to represent the whole county. In one county, there were multiple cities with ordinances, but no countywide ordinance; in this instance, we used the earliest date of implementation and included the county among those with an ordinance implemented by December 2009. We matched the smoke-free ordinance classifications to the first year of the 3-year running estimates of BRFSS data on smoking prevalence described above (eg, BRFSS index year 2003 was matched to the smoke-free ordinance classification in 2002) to allow at least 1 full year for the potential effects of the ordinance to manifest in the population."}, {"section_title": "Geographic Factors", "text": "Geographic factors included Appalachian status, as derived from the Appalachian Regional Commission, and metropolitan status, which identifies counties classified based on their US Department of Agriculture rural-urban continuum codes."}, {"section_title": "38,39", "text": "We created a binary metropolitan/nonmetropolitan variable for counties with rural-urban continuum codes 1 through 3 (metropolitan) versus codes 4 through 9 (nonmetropolitan).\nCombining BRFSS, smoke-free, and geographic data resulted in a dataset of 960 records: 120 in each year (Kentucky has 120 counties) for 8 years, 2002-2009 . To this we added US Census data to serve as a population denominator for further calculations and to control for some covariates."}, {"section_title": "US Census Data", "text": "We obtained population counts for individuals ages 18 and older from the 2000 and 2010 US Census for each county in Kentucky, and estimated counts for the years between 2000 and 2010 through linear interpolation. To estimate the count of smokers in each county, we multiplied county-level smoking prevalence rates (as percentages) from BRFSS by the estimated population of the county ages 18 and older. This yielded an estimated count of adult smokers in each county to serve as the outcome of interest in the statistical analysis.\nThe US Census also provided data to control for demographic and socioeconomic factors at the county level, including the percentage of residents: older than 65 years, male, white, without a high school diploma, and living below the poverty line. Because these figures were only available for 2000 and 2010, we again used linear interpolation to calculate the estimates of these measures between 2000 and 2010."}, {"section_title": "Statistical Analysis", "text": "To estimate the proportion of adults (ages 18 years and older) covered by smoke-free ordinances statewide, we summed the number of smokers in counties that had no, weak/moderate, or comprehensive ordinances for each year. We then created a stacked area graph to visualize this trend during the study period.\nWe used STATA version 15 (StataCorp, College Station, TX) for all of the subsequent data management and statistical analyses. As described above, the outcome was a count of the total number of smokers in each county, and the primary exposure of interest was the type of smoke-free ordinance-none, weak/moderate, or comprehensive. For each of the socioeconomic and demographic factors, we classified counties by tertileslabeled \"low,\" \"medium,\" and \"high\"-for statistical analysis, which consisted of bivariate analysis and multivariable regression at the county level. Because smoking rates were not normally distributed, we used the Kruskal-Wallis statistic to discern significant differences in county-level smoking prevalence by demographic, socioeconomic, and geographic factors. For the multivariable regression analysis, we fit two random effects negative binomial models with county population as the offset to estimate prevalence rate ratios (PRRs). Model 1 examined the relation between current smoking and smoke-free ordinance type, while adjusting only for year. Model 2 adjusted for additional geographic, demographic, and socioeconomic factors that remained significant in a preliminary model containing all of the variables that were significant in the bivariate analysis. The institutional review board at the University of Kentucky evaluated the study and determined that it was exempt, because the data obtained from the state were deidentified. , however, there were 23 counties or larger cities that had implemented some level of smoke-free ordinance-13 had comprehensive ordinances, and 10 had weak/moderate ordinances-so that almost half of Kentucky adults lived in counties in which the county itself or an important municipality in the county had weak/moderate (11.3%) or comprehensive smoke-free ordinances (36.2%). Table 1 shows county-level current smoking prevalence by demographic, socioeconomic, and geographic factors during the 2002-2009 study period. Table 2 shows median and interquartile range values for smoking prevalence among Kentuckians living in counties with no smoke-free ordinances, counties with weak/moderate ordinances, and counties with comprehensive ordinances, as well as smoking prevalence for all of the years of the study period.\nThe relation between demographic characteristics and smoking trends is evident across most of the covariates displayed in Table 1 , in which all relations were significantly different in regard to smoking prevalence. There were slightly higher prevalence rates of smoking in non-metropolitan and Appalachian counties, as well in counties with relatively more males and white, non-Hispanic residents. Counties with lower educational attainment and higher rates of poverty also had higher smoking prevalence rates. Table 2 presents information on current smoking by smoke-free ordinance type and year. Smoking rates were highest in counties without smoke-free ordinances, but they were progressively lower among counties with weak/moderate and comprehensive ordinances. Also notable is the decrease in county-level median smoking prevalence in every year from 2002 to 2009. Overall, counties in Kentucky experienced a 5.5% median decline in smoking prevalence among adults, from 32.4% in 2002 to 26.9% in 2009. Table 3 presents results from the random effects negative binomial regression models for smoking prevalence. In model 1, both weak/moderate and strong smoke-free ordinances were associated with significantly lower prevalence of smoking (PRR 0.94 and 0.93, respectively), whereas the results for year (PRR 0.98) reflected the general trend of decreasing smoking prevalence throughout the state.\nIn the preliminary multivariate model, most variables maintained a statistically significant relation to smoking prevalence, except for metropolitan/nonmetropolitan status, percent poverty, and percent white. We therefore dropped these variables from the final model. Ultimately, adjustment for geographic, demographic, and socioeconomic factors-percent >65, percent male, percent with less than a high school education, and Appalachian status-did not eliminate or substantially attenuate the association we observed between smoke-free ordinances and current smoking prevalence. Furthermore, this association was still robust to continued adjustment for the significant temporal trend of decreasing smoking prevalence during the study period. In model 2, the prevalence ratio for current smokers was 0.95 for counties with weak/moderate ordinances and 0.94 for counties with comprehensive smoke-free ordinances. Counties with a medium percentage of residents older than age 65 years had significantly higher smoking rates. In addition, smoking rates were progressively higher in counties with more male residents and lower high school graduation rates."}, {"section_title": "Discussion", "text": "This study explored the effect of local smoke-free ordinances on current smoking prevalence in Kentucky for several years. We were able to discern differences in current smoking prevalence among counties during a time period in Kentucky when smokefree laws were enacted by local governments. Our findings demonstrate that smoking prevalence was approximately 5% to 6% lower in counties with smoke-free ordinances, even after adjusting for demographic, socioeconomic, and geographic factors, as well as the general trend of decreasing prevalence throughout the study region and period. We also observed a dose-response effect related to strength of smoking ordinance, which, although weak, persisted after adjustment for significant covariates.\nThese findings suggest that smoke-free ordinances exert a significant effect on individuals' likelihood of being current smokers. This also has been noted in other time-series analyses, such as Taylor and colleagues' investigation of smoking prevalence in El Paso, Texas for several years after the implementation of a smoke-free ordinance. 40 Their study found that the adult smoking prevalence in El Paso decreased by a significant amount compared with two similar metropolitan statistical areas (MSAs) that did not have smoke-free ordinances. The two comparison MSAs did not have a significant reduction. This is somewhat similar to our design, because we also examined current smoking by smoke-free ordinance coverage over time. Taylor and colleagues even reported a similar measure of association-a prevalence ratio of approximately 0.94-for El Paso compared with the comparison MSAs.\nNguyen and colleagues found that a longer duration of smoke-free ordinance coverage was negatively associated with pregnancy-related smoking, but only in municipalities where an ordinance was in effect for >2 years. 41 Their findings highlight the importance of analyzing data for several years after implementation. The greatest strength of the study reported here is this medium-to long-term perspective, which was previously lacking from some published reports on the efficacy of smoke-free ordinances, particularly in a state that has consistently ranked among the highest for smoking prevalence.\nMost covariates were associated with smoking prevalence as expected in the final regression analysis, given demographic and socioeconomic correlates of cigarette smoking noted in the literature. 42 Our findings with regard to age, however, merit additional discussion. It is unclear why counties with a medium percentage of residents older than 65 years had a lower prevalence of current smoking than counties with higher or lower percentages of older adult residents. It is possible that counties in the medium range simply tend to have the largest proportion of adults who are likely smokers, because many older adult residents are likely to have quit for health reasons, and adolescent and young adult smoking had generally decreased since the late 1990s. 43, 44 This study is limited in some important ways that merit careful consideration. We were not able to use data from 2011 or later, given the important changes to the sampling and weighting protocols of the BRFSS. 45 Although there were sufficient years of data available to discern statistically significant differences during the study period, additional years of data, or even additional data from counties in adjacent states, may improve the precision and accuracy of the estimated measures of association. Beyond these concerns, however, this limitation should not substantially alter the findings of our analysis. Another limitation of this study was our reliance on only 3 years of BRFSS data for county-level running estimates. This decision introduced a considerable amount of variation, but it was necessary given the temporal constraints of the dataset mentioned above. Regardless, we were nonetheless able to discern significant relations among Strength of ordinance: \"none\" means no smoke-free ordinance in place, \"weak/ moderate\" means smoke-free ordinances have significant exemptions, and \"comprehensive\" means smoke-free ordinances include all workplaces and enclosed public places.\nthe outcome (smoking rate) and exposure (smoke-free ordinance classification) of interest. Limitations such as these likely influenced the accuracy and precision of our estimates, but they are unlikely to alter our overall interpretation."}, {"section_title": "Conclusions", "text": "Although limited in some ways, our study nevertheless provides additional evidence that smoke-free laws can help to reduce smoking prevalence in covered populations. This finding is particularly encouraging given the context of this research-Kentucky, a state widely known for high rates of cigarette smoking and smoking-related diseases. Future research must consider the components, exemptions, and enforcement of smoke-free ordinances in greater detail to examine how these factors influence the prevalence of cigarette smoking in populations. Strength of ordinance: \"none\" means no smoke-free ordinance in place, \"weak/moderate\" means smoke-free ordinances have significant exemptions, and \"comprehensive\" means smoke-free ordinances include all workplaces and enclosed public places."}]