[{"section_title": "Introduction", "text": "The Caribbean reef shark (Carcharhinus perezi) is a medium-bodied (maximum total length, 295 cm [1] ) carcharhinid found across the tropical and subtropical western Atlantic, with a range extending from North Carolina to southern Brazil [2] . Individuals primarily associate with shallow neritic habitats, such as coral reefs and lagoons; however, they also perform extended vertical excursions into deeper water (greater than 200 m) around continental drop-offs and escarpments [3, 4] . This species also exhibits high site fidelity and philopatry, with limited annual horizontal displacement [4] [5] [6] [7] . Caribbean reef sharks are considered one of the major top predators on coral reefs throughout the wider Caribbean and are pivotal to the health, and subsequent resources provided by these ecosystems [4, 7] . In addition to their ecological role as top predators, common sightings on recreational shark dives, especially within the great Caribbean, create a significant economic reliance upon healthy Caribbean reef shark populations [8, 9] .\nAcross the Caribbean, concern has grown over the health and vitality of shark populations as considerable declines have been observed in recent decades [10, 11] . High human population density has been strongly associated with the increasing absence of sharks in highly fished systems such as coral reefs, and localized species extinctions have been observed in some locations [10] . Although Caribbean reef sharks show high relative abundance compared with other predators across their range [11] , artisanal [12] and commercial fishing [13] , as well as coastal development [12, 14] , threaten their populations. This is probably exacerbated by their tendency to move across relatively large spatial scales through a multitude of ecosystems including coastal reefs, open-ocean and deep-water habitats (greater than 200 m) [4] . These concerns have resulted in the listing designation of the Caribbean reef shark as 'Near Threatened' by the International Union for the Conservation of Nature (IUCN) [2] , highlighting a critical need for greater study and conservation action for this species.\nA common strategy employed by conservation managers to protect, maintain and regenerate the diversity and health of marine ecosystems worldwide is through the creation of marine protected areas (MPAs) [15] [16] [17] [18] . Despite their potential benefits, the effectiveness of MPAs in protecting highly mobile fishes, such as sharks, remains poorly quantified, as many management areas are situated across sparsely populated areas away from human settlement [19, 20] . The high mobility of sharks often precludes their effective management within a single jurisdictional boundary, and for species that migrate large distances to facilitate important aspects of their life history, efficient protection often requires significant transboundary cooperation across multiple exclusive economic zones (EEZs) [21] [22] [23] . However, such cooperation may be inhibited by marine protection measures that vary across jurisdictional boundaries [23, 24] . In 2011, The Bahamas became the fourth nation to declare its entire EEZ (611 151.9 km 2 ) a shark sanctuary outlawing commercial fishing and landing of any shark species [22, 25] . Commercial longlining, which can have negative impacts on shark populations through incidental bycatch and subsequent stress-induced mortality [26, 27] , is therefore illegal in The Bahamas [22] . Such approaches have proved successful in protecting shark populations in some regions. For example, Robbins et al. [28] observed that shark abundance was an order of magnitude higher in no-entry management zones, compared with fished-reefs on the Great Barrier Reef, Australia. The Bahamas, therefore, offers a unique opportunity to quantify the movements and interactions of an apex predatory shark, which resides fully, or for part of its life history, within a single marine management zone [22, 23] .\nAlthough the abundance, ecological and economic importance of Caribbean reef sharks in The Bahamas has been noted [18, 27, 29] , their broader movement in relation to the Bahamian EEZ, and vertical habitat use in this region, remains poorly understood. Therefore, the degree to which these animals may travel outside of this MPA, and thus become vulnerable to exploitation elsewhere, is unknown. Here, we used pop-up satellite archival tags (PSATs), which have proved valuable in assessing shark movements [22, [30] [31] [32] , to examine horizontal and vertical movements exhibited by Caribbean reef sharks in The Bahamas."}, {"section_title": "Pop-up satellite archival tag deployment", "text": "Sharks were tagged with X-Tags (Microwave Telemetry, Inc., Columbia, MD, USA). A small pilot hole was made through the leading (anterior) edge of the dorsal fin using a sterile, stainless steel scalpel prior to tag attachment. Tags were then attached with a monofilament bridle (2 mm diameter) equipped with a heat-shrink chafe protector, which passed through the leading edge of the dorsal fin. Bridles were secured under the trailing edge using a copper crimp covered with surgical rubber insulation (figure 1). X-Tags recorded time-series depth (0.3-5.4 m resolution), temperature (0.16-0.23°C resolution) and lightlevel data. After the tag's predetermined deployment duration, it detached from the animal and floated to the surface. A subset of archived data was transmitted to the Argos-equipped satellite system. The release may be initiated prematurely if the constant pressure or maximum-depth emergency release mechanism is triggered. X-Tags can have high rate (HR) or standard rate (SR) programming. HR tags in this study were programmed for short deployments (30 days), providing a relatively high sampling rate (approx. 5 min intervals) but no location estimates. Unlike HR tags, SR tags provide daily light-based geolocation estimates with a best-possible error of ±1°for latitude and ±0.5°for longitude. Additionally, SR tags collect data at 2 min intervals, but only a subset of records is selected for transmission through the Argos system; the temporal resolution of the transmitted dataset (15-60 min) depends on the deployment duration. Transmitted SR depth and temperature data may contain delta limited records which do not capture the full range of vertical movement or temperature variations; however, all delta limited records were included in the analysis. In the event that a SR or HR X-Tag is recovered, the entire archived dataset (2 min records in SR tags and 5 min records in HR tags) may be extracted (http://www. microwavetelemetry.com/fish/)."}, {"section_title": "Statistical analysis 2.3.1. Horizontal movements", "text": "Daily geolocations obtained from SR X-Tags were processed with a state-space unscented Kalman filter with sea surface temperature (UKFSST) [36] . Daily sea surface temperatures (SSTs) recorded by the tag were estimated by daily maximum temperature values [37] , and the NOAA Optimum Interpolation Sea Surface Temperature V2 dataset ( [38] ; http://www.esrl.noaa.gov/psd/) was used as the reference SST field. A post hoc bathymetric correction was applied to the filtered tracks [39] and implemented with the 'analyzepsat' package in R [37, 40] ."}, {"section_title": "General vertical habitat use", "text": "Visual assessment of time-series depth records suggested that individuals occupy consistent narrow regions of the water column, varying among individuals. Therefore, to further investigate individual depth occurrence, the density function in R was applied to the time-series depth records to identify high-use vertical depth bands, specifying a density threshold of 0.01 [41] .\nWe employed generalized linear mixed-effect models (GLMM) to determine factors affecting the vertical habitat use of the Caribbean reef shark. Specifically, two models were constructed to predict the response variables of mean depth and count of depth records below 50 m. The 50 m isobaths was identified as a significant departure from shallow-water habitat as the edge of the bank in the Exuma Sound is typically marked by a near-vertical escarpment originating at 20-30 m depth. Consequently, a depth record of 50 m would indicate a 20-30 m departure from this well-defined bathymetric feature. Furthermore, the depth data generated by Chapman et al. [4] indicated that Caribbean reef sharks primarily resided at depths of less than 40 m. Prior to analysis, both the mean depth and deep dive counts were log-transformed because they were both right skewed (for mean depth, the log[x + 1] transformation was applied to simplify interpretation of results). GLMM fixed effects included moon phase, diel period, season, sex, stretched total length (centimetres) and location of tagging (southwest Eleuthera or the Bridge). Moon phase data were acquired from the USA Naval Observatory (http://aa. usno.navy.mil/data/docs/MoonFraction.php), and the lunar illumination values were partitioned into five illumination factor levels (based on 20% increments). Daily sunrise and sunset times were estimated from UKFSST-filtered locations for SR tags and from the deployment locations for HR tags, allowing the assignment of diel period to each record. Dawn was defined as the 2 h period centred on sunrise, and dusk was defined as the 2 h period centred on sunset. Individual sharks were included as a random effect [42] . Because we investigated responses to cyclical patterns of moon phase, only individuals that had deployment durations greater than two times the length of a moon phase were included (i.e. 59 days; n = 5 individuals) (table 3) .\nGLMMs were implemented with the 'lme4' package in R [43] . We employed a backward elimination of non-significant effects to determine if a reduced model may better explain variation in depth, using the 'lmertest' package in R [44] . The fit of the full and reduced models was assessed by evaluating the corrected Akaike information criterion (AICc) and Bayesian information criterion (BIC) values. Model residuals were visually assessed to confirm the normal distribution and homoscedasticity of model residuals. Finally, we conducted family-wise Tukey comparisons to compare factor levels of significant fixed effects with the 'multcomp' package in R [45, 46] .\nIndividuals occupied narrow vertical bands, typically positioned in the top 50 m of the water column (table 2). The lower limit of high-use density depth bands from all individuals consistently corresponded to the bathymetric depth limitation of the steep drop-off on the edge of shelf bank. However, frequent excursions from the high-density depth bands were observed (figures 3 and 4), as all individuals recorded depths greater than 100 m. One individual (49969) exhibited a bimodal depth distribution, occupying a shallow vertical band and a deeper band below 50 m (figure 3 and table 2). The reduced mean depth model had lower AICc and BIC values compared with the full model, suggesting a more parsimonious and significant fit (table 3) . Specifically, the mean depth within each period of the day was explained by the random effect of each individual and fixed effects of moon phase, diel period and season (table 3) . However, post hoc analysis revealed that moon phase had no significant effect on depth occupied by individuals. For diel period, individuals occupied shallower mean depths during the day compared with any other period (p < 0.05). Additionally, individuals occupied shallower mean depths during the winter season compared with all other seasons (p < 0.001). Autumn and summer mean depth was greater than that observed during the spring season (p < 0.001). Finally, no difference between mean depths in the autumn and summer seasons was detected. The reduced GLMM predicting the number of deep depth records (i.e. greater than 50 m) had lower AICc and BIC values compared with the full model (table 3) . The number of deep depth records within each diel period was explained by the random effect of each individual, and fixed effects of tagging location, sex, total length, diel period and season (table 3) . Sharks recorded more deep records if individuals were either male or tagged at the Bridge (p < 0.001). Depth records greater than 50 m were more common at night than any other diel period and were more common during the day compared with dawn (p < 0.001). Finally, more deep records occurred during the winter than the summer (p < 0.05). However, a larger sample size is required to assess seasonal effects. "}, {"section_title": "Off-bank excursion analysis", "text": "To investigate behaviour off the Great Bahama Bank (greater than 50 m), individual off-bank excursions were extracted. Only the tags providing depth data at a temporal resolution of less than or equal to 5 min (n = 7) were considered for this analysis. An excursion (or dive event) was defined as a sequence of consecutive (greater than or equal to 1) depth records below the 50 m threshold. The beginning of the excursion was specified as the last record above 50 m immediately before the dive event, and the end of the excursion was the first record above 50 m immediately after the dive event [47] . A dive event was not accepted for the analysis if it contained temporal gaps (i.e. missing data). Given considerable variability observed in depth-versus-time profile shapes, dives were classified based on characteristic variables instead of shape. Specifically, five dive variables were selected: dive maximum depth (metre), duration of dive event (minutes), switch count (the number of times that the vertical direction changed over the course of a dive event), mean vertical descent rate (m s −1 ) and mean vertical ascent rate (m s −1 ). Within each excursion, descents and ascents were defined as all pairs of consecutive depth records exhibiting an increase and decrease in depth, respectively. Prior to clustering dive events based on similar characteristics, principal component analysis (PCA) was applied to the five log-transformed, scaled and centred dive variables in order to generate orthogonal components better suited for clustering procedures [48] . Components explaining the majority of variance and satisfying the latent root criterion were retained for k-means clustering [48, 49] . To determine the optimal number of clusters, we considered R 2 versus cluster number [50] [51] [52] . Spearman's rank correlation (r s ) was used for reported correlations, and we specified a significance level of 0.05 for all statistical analyses.\n"}, {"section_title": "Results", "text": "Eleven X-Tags (five HR, six SR) were deployed on mature Caribbean reef sharks (male = 5; female = 6) across the two sampling regions (table 1 and figure 2). Data were obtained from all tags, and five tags (three SR tags and two HR tags) were physically recovered, allowing for the extraction of their complete archived datasets (table 1). Data from tag 115972 implied post-release mortality by an unknown predator and was excluded from all further analyses. For this tag, a steady descent to approximately 1035 m was recorded immediately after release; the tag remained at this depth for approximately 18 h prior to vertical oscillations between approximately 400 m and depths of greater than 650 m beginning on a diel cycle. The time-paired depth and temperature records indicated a temperature delay with respect to the depth profile, supporting tag consumption [53] . The remaining 10 X-Tags provided 337 728 depth records (3068-173 861 records per individual), of which only 13 records were identified as delta limited values. Depth records ranged from the surface to 436.1 m, and all tags registered depth records greater than 100 m. Additionally, tags provided 336 625 temperature records (3068-173 861 records per individual). Temperature records ranged from 17.78 to 31.26°C, and only four records were identified as delta limited values."}, {"section_title": "Horizontal movements", "text": "The initial Argos-estimated position ranged between 1.1 and 71.6 km from the initial tagging site (figure 2). Tags released in the months of July, August, October and December. While most tags reported within 10 km of the tagging site, two tags (115971 and 115974) reported in the central Exuma Sound after drifting for seven days prior to reporting through the Argos system. Therefore, the net displacements of these two individuals are unconfirmed; however, it is likely these also popped-off adjacent to South Eleuthera which is directly down-current from the first Argos location. All other tags reported within one day of surfacing. The five SR tags provided 1065 light-based geolocations (145-243 daily locations per individual). The UKFSST-filtered tracks of four individuals indicated movement from Eleuthera to the northern side of Cuba below the Great Bahama Bank (maximum displacement of approx. 3°latitude) during the summer and autumn months. However, the UKFSST-estimated latitude standard deviation for these four tracks ranged between 1.48 and 4.13°N, and, therefore, filtered tracks confirmed that reef sharks did not embark on long-distance migrations extending beyond the error bounds of light-based geolocations."}, {"section_title": "Discussion", "text": "The Exuma Sound and its neighbouring mosaic of coastal ecosystems allowed examination of the horizontal and vertical behaviour of a mobile predator, occurring at the interface between the narrow near-shore shelf and open-ocean/deep-water habitats. Sharks tagged off Eleuthera did not embark on long-distance migrations and remained mostly resident within the protective boundaries of the Bahamian EEZ. The close proximity between deployment and pop-off locations after varying deployment durations, and at different times of year, suggests that individuals did not travel far from their initial tagging locations, potentially remaining resident to the waters off South Eleuthera. This is further supported by observations at other locales, such as Chapman et al. [4] , where a single individual was tracked approximately 30 km over 150 days. Yet, the possibility of small-scale migrations should not be discounted, and although the direction of movement away from Eleuthera remains inconclusive, the general timing of this behaviour (indicated by UKFSST-filtered tracks) may be relevant, as it coincides with reproductive activity of Caribbean reef sharks at other Bahamian locales [8] . Although light-based geolocation estimates proved somewhat limited in their ability to discern finer-scale movements in relation to the EEZ boundary, this could be achieved in future studies through the use of passive telemetry [54] , or chemical tracer approaches such as stable isotope analysis [55] .\nHealthy, less-impacted reefs tend to have larger proportions of biomass occupying higher trophic guilds; therefore, the presence of sharks is a good indicator of overall reef health [56, 57] . In The Bahamas, a protected population of Caribbean reef sharks can contribute to both ecological and economic sustainability by encouraging ecosystem diversity and sustaining ecotourism vital to the Bahamian economy (i.e. shark diving). However, the relatively localized movements, if uniform across subpopulations, may have greater implications for individuals in unprotected regions. For example, the bottom longline fisheries of Columbia target Caribbean reef sharks for their skin, oil and fins [2] and may be contributing to significant population declines within unprotected subpopulations. Although this was beyond the scope of this study, assessing Caribbean reef shark movements across multiple locations will help identify and facilitate more appropriate management strategies within and between nations.\nCaribbean reef sharks occupied narrow depth bands, typically in the top 50 m of the water column, with the bottom edge of the bands corresponding to the depth of edge of the bank. Vertical habitat use appeared variable among individuals, suggesting that depth-use may be governed by high site fidelity to a specific location, habitat or bathymetric feature. Brooks et al. [7] previously observed minimal horizontal displacement (approx. 1.7 km) in recaptured individuals from the Exuma Sound, suggesting that Caribbean reef sharks may remain extremely resident to a small area of reef. One individual (49969) demonstrated a bimodal distribution occupying two vertical bands, one in the top 50 m and another between 66 and 92 m. Because this pattern was only observed in one individual, we do not believe the bimodal distribution represents depth-mediated sexual behaviour, and more likely indicates habitat use across two distinct bathymetric features along the drop-off. Individuals resided shallowest during the day compared to any other diel period and could reflect movement of individuals between the shallow mosaic of coastal habitats (oolitic banks, coral reefs, seagrass beds, etc.) surrounding the sampling location, which may offer suitable protection from predators throughout the day [4] . Seasonally, individuals inhabited shallowest mean depths during the winter, which could reflect behavioural thermoregulation, as assumed in other ectothermic elasmobranchs [22, 32, 58] .\nCaribbean reef sharks exhibited frequent, yet sporadic, off-bank excursions (every few hours) beyond the high-use vertical bands, and particularly, beyond 50 m. These vertical excursions occurred more frequently during the night, when sharks may forage more actively [59] . The diet of Caribbean reef sharks is reportedly broad (teleosts and cephalopods [60] ); therefore, individuals could be exploiting a diverse prey pool on mesophotic reefs (approx. 50-130 m) extending down the drop-off, as seen in the closely related Galapagos shark (Carcharhinus galapagensis, [61] ). Sharks may then make even deeper excursions (greater than 130 m) to exploit meso-and bathypelagic prey, which move to more accessible depths during the night [62] . The increased frequency of vertical excursions during the winter, compared to summer, could relate to food pulses associated with deepening of the mixed layer. Alternative hypotheses explaining the functionality of large vertical movements have been postulated for highly mobile sharks [47] , such as navigation [63] , energy conservation [64] and interactive behaviour [65] . Although such explanations cannot be discounted in this study, evidence for foraging-based movements appears most plausible, certainly for coastal shark species, and therefore alternative solutions are discussed no further. The maximum time between off-bank excursions (greater than 50 m) varied among conspecifics, where one individual (49969, female) did not spend any longer than 12 consecutive hours in shallow waters (less than 50 m), yet another (107800, female) spent over two consecutive weeks (17 days) in shallow waters (less than 50 m). Again, this suggests an association of each individual with a unique locale, and preference for a specific bathymetric feature or section of reef.\nOff-bank excursions were further classified into three clusters: transitory, extended and directed excursions; however, the functionality of these profiles was difficult to determine given variability in individual behaviour and low sample size. Transitory excursions represent short forays below the 50 m isobar that possibly indicate frequent off-bank excursions without directly exploiting deeper waters. The characteristics of directed excursions (i.e. high vertical velocity and deep depths) suggest that these behaviours are deliberate movements into the deeper waters, potentially representing active preyfollowing behaviour [66] , which would be required to exploit deeper prey pools. Extended excursions, primarily demonstrated by two females tagged at southwest Eleuthera, showed that reef sharks can make prolonged use of deeper waters near 100 m. This may reflect use of specific mesophotic coral reef habitats, which represent important prey resource pools for coastal requiem sharks in tropical and subtropical locales [61] . The strong association of Caribbean reef sharks with neritic environments and its typically opportunistic, broad diet [60] suggest that individuals exhibit foraging plasticity, whereby energetic requirements are fulfilled by feeding across multiple ecosystems (i.e. coral reefs and open ocean/deep-water). McCauley et al. [67] observed this behaviour in grey reef (Carcharhinus amblyrhynchos) and blacktip reef sharks (Carcharhinus melanopterus) at Palymyra Atoll, Pacific Ocean, where individuals relied on both coastal and pelagic prey items. It is likely Caribbean reef sharks may behave similarly. Such observations, therefore, have vital implications for holistic management approaches, as Caribbean reef sharks probably facilitate vital connectivity between coastal, mesopelagic and bathyal habitats.\nIn conclusion, the limited movements of Caribbean reef sharks suggest reduced interactions of this subpopulation with extrinsic fishing pressure, possibly sustaining ecological and economic vitality in The Bahamas. The highly variable off-bank excursions observed among individuals highlight the inherent complexities associated with vertical habitat use of coastal shark species, whereby deep-water ecosystems may serve as an important prey pool with Caribbean reef sharks serving as an important vector facilitating connectivity between shallow neritic and mesophotic (50- "}]