[{"section_title": "", "text": "The Fair and Equitable Tobacco Reform Act of 2004, commonly referred to as the ''tobacco quota buyout'' was signed into law on October 22, 2004, as part of the Jobs Creation Act of 2004, ending the 66-year-old federal tobacco program, and providing approximately $10 billion in privately funded compensatory and transition payments to quota owners and active tobacco growers (Womack, 2004) . In just 1 year, tobacco growers had to transition from a federally regulated market to a free market system wherein they could no longer rely on the federal government for price support. The legislation marks a rapid and radical shift in U.S. tobacco policy (Tiller et al., 2006) .\nThe federal tobacco program was ended because tobacco farming was in a crisis of sustained loss of market shares and farm revenues that resulted, in part, from a steady decline of the demand for domestic tobacco in both the global and domestic markets. This crisis occurred because the federal tobacco program had maintained artificially high tobacco leaf prices, creating intangible quota asset values, which significantly increased tobacco production costs and entry costs and perpetuated inefficiency in the production segment of the tobacco industry. The rise of U.S. tobacco prices to a 50% premium over the foreign tobacco leaf led to a decrease in domestic cigarette manufacturers' utilization of domestically grown tobacco and an increase in the use of imported tobacco leaf (Beach et al., 2008) . It also led to a decrease in the volume of U.S. tobacco exports and an increase in the volume of exports by other countries such as Brazil, Argentina, Malawi, and Thailand (Womack, 2003) . The increase in the volume of exports by other counties was due not only to the relatively lower price but also an improvement in the quality of the tobacco leaf. As a result, U.S. tobacco growers have sustained a substantial loss in production and market shares since the late 1970s. From the early 1980s to the end of the 1990s, U.S. tobacco production fell by 48%, from 1.59 billion lbs in 1980-1982 to 1.07 billion lbs in 1997-1999, resulting in a drop of the U.S.'s share of the world's total production from 15% to 9% (FAO, 2003) . Over the same period, U.S. tobacco exports decreased by 20%, from 530.8 million lbs to 423 million lbs, whereas U.S. imports increased by 17%, from 451.6 million lbs to 529.8 million lbs. In terms of the U.S.'s share of the world's total exports and imports, U.S. exports decreased by 9 percentage points (from 19% to 10%) and U.S. imports decreased by 4 percentage points (from 17% to 13%). The decrease in the U.S.'s share of the world's total imports was due to the significant increase in the volume of imports by other countries. Whereas U.S. imports increased by 17%, imports by other countries increased by 65% over the same period.\nThe decline of U.S. tobacco production and exports continued into the 2000s as the price of the U.S. tobacco leaf continued to rise significantly higher than that of the foreign tobacco leaf. The Presidential Commission on Improving Economic Opportunity in Communities Dependent on Tobacco Production while Protecting Public Health (2001) concluded that tobacco growers were in an unfavorable economic situation that resulted in large part from the confines of the federal tobacco program, calling for a comprehensive overhaul of the tobacco production and marketing system.\nThe end of the federal program in 2004 slowed the downtrend by bringing the U.S. price for tobacco leaf closer to the world price and making domestic tobacco more competitive in the global market (Beach et al., 2008) . Furthermore, it allowed several quota owners and growers to exit the tobacco industry and release resources for others to consolidate farms and make the necessary organizational changes in search of scale economies and production efficiencies.\nThe present study explores the relationship between family/farm characteristics and the probability of exiting burley tobacco farming and assesses the relative importance of the characteristics in explaining the variation in the exit probability. A better understanding of the empirical relationship between farm/family characteristics and exit decision of tobacco farming would help to make well-informed and coherent policy decisions within the tobacco industry.\nA discrete choice model (i.e., binary logistic model) is applied based on a proxy decision variable indicating whether or not the household was still growing burley tobacco in 2006, 2 years after the termination of the federal program. Data for this study come from a mail survey of 813 burley tobacco growers conducted in Tennessee, Virginia, and North Carolina in May 2006."}, {"section_title": "Literature Review and Hypothesis Development", "text": ""}, {"section_title": "Studies on Tobacco", "text": "Several studies have addressed the potential and actual effects of the end of the federal tobacco program (Beach et al., 2006 (Beach et al., , 2008 Brown et al., 2007; Serletis and Fetzer, 2008; Snell, 2005; Tiller and Brown, 2003) . One of the findings from a longitudinal survey conducted in North Carolina from 1997 through 2004 was the shift of tobacco growers' attitudes toward the future of tobacco farming (Beach et al., 2006) . The survey results indicated that over two thirds of tobacco growers in 1997 reported that they would advise their children to grow tobacco in the future; by 2004, however, that figure had changed to just 21%. The uncertainty surrounding the economic viability of tobacco production in the future had also prompted many growers to heighten their interest in diversifying household income. However, they had less success in identifying ways to accomplish that goal with alternative enterprises on the farm (Beach et al., 2008) .\nAs the federal tobacco program came to an end, it was predicted that the number of tobacco growers would decline significantly, but that the scale of tobacco production would increase through consolidation into substantially fewer but larger farms and geographical expansion of production into new, nontraditional tobacco-growing regions (Beach et al., 2006; Snell, 2005; Tiller and Brown, 2003) . Many senior tobacco growers with smaller tobacco farm operations were expected to exit the market following the quota buyout.\nIn spite of a significant exit of growers, Brown et al. (2007) predicted that the end of the program would result in a producer surplus large enough to induce increased flue-cured production across the country, with North Carolina (the largest flue-cured tobacco growing state in the U.S.) experiencing the largest increases. In the case of burley tobacco, however, Snell (2005) pointed out that labor and curing structure constraints and limited economies of scale in tobacco production would impede the expansion of the scale of burley tobacco production.\nIt was also predicted that the end of the federal program would bring the U.S. tobacco leaf price closer to the world price, thus making domestic tobacco more competitive in the global market. Assuming that supply is highly elastic, Serletis and Fetzer (2008) predicted that market prices for U.S.-grown tobacco would fall by about 20-23%, whereas market prices for foreign-produced tobacco would fall by less than 1%. Consequently, shipments of both domestic burley and fluecured tobacco would increase to both domestic and foreign tobacco markets, whereas shipment of foreign-grown tobacco to both markets would decrease.\nThe latest Census of Agriculture data (USDA, 2007) corroborates the prediction with regard to the reduction in the number of tobacco farms. The number of tobacco farms decreased by 72% from 56,977 in 2002 to 16,234 in 2007. The number of exiting tobacco farms over the period between 2002 and 2007 was almost twice the number of exiting tobacco farms over the previous 5-year period between 1997 and 2002 (39%) . Given that many growers appeared to remain in production the last few years before the buyout-hoping to be eligible for buyout benefits but ready to exit the industry after a buyout (Tiller, 2005) -it is fair to say that the temporal distribution of the exit rates was not uniform across the 5-year period between the last two consecutive census years (2002 and 2007) . It was more likely that the exit rates were skewed toward the period after the end of the federal program in 2004.\nThe Census of Agriculture data also corroborate the prediction on consolidation of farms, concentration of production, and geographical expansion of production into new, nontraditional tobacco-growing regions. Between 2002 and , the number of tobacco farms with fewer than 25 acres had decreased by 13 percentage points (from 93% in 2002 to 80% in 2007) , whereas the number of farms with more than 100 acres had increased by 4 percentage points (from less than 1% in 2002 to more than 5% in 2007), resulting in the shift of concentration of production from small farms to large farms. In 2002, 42% of U.S. tobacco was produced on small farms (i.e., those with fewer than 25 acres), whereas about 19% came from large farms (i.e., those with more than 100 acres). By 2007, that figure had changed, with just 23% coming from small farms but 43% coming from large farms. Furthermore, there has been an increase in post-buyout tobacco production. The total tobacco production increased from its lowest level of 645.0 million lbs in 2005, to 800.5 million lbs in 2008. However, it has not yet got to the pre-buyout level, which was 881.9 million lbs in 2004.\nThe geographical expansion of production into new areas is evident in the fact that new tobacco farms are being established in Pennsylvania after the end of the federal program. USDA reports indicate that Pennsylvania producers who had previously planted cigar and Maryland leaf types are now growing burley for the first time. Between 2002 and 2007, the number of tobacco farms in Pennsylvania increased by 28% (USDA, 2007) .\nMuch of the tobacco research described above focused on the change in attitude toward the future of tobacco production, interest in diversifying household income, the decrease in the number of tobacco farms, consolidation and expansion of farms, concentration of production, economic and welfare consequences of the tobacco buyout legislation. The present study builds upon these contributions and proceeds to explore the empirical relationship between farm/family characteristics and the probability of exiting burley tobacco farming following the deregulatory policy reform of 2004."}, {"section_title": "Hypothesis Development", "text": "A review of past firm/farm exit studies was used to develop a set of hypotheses about the relationship between farm-and family-specific characteristics and the probability of exiting burley tobacco farming. A growing number of studies have examined the determinants of the survival and exit of firms in the industrial sector (Baggs, 2005; Kranenburg et al., 2002; Perez et al., 2004) as well as in the agricultural sector (Glauben et al., 2006; Hoppe and Korb, 2006; Kimhi and Bollman, 1999) . These studies emphasize the fact that the underlying factors responsible for the survival or exit of firms/farms are related to firm-, farm-, and industry-specific characteristics, including the size and age of the firm, technology, organizational features, human capital, market changes, policy changes, and regional and macroeconomic-wide characteristics. In their investigation of the determinants of the survival of Spanish manufacturing firms, Perez et al. (2004) found that survival probability was related to the age and size of firms. The risk of failure is significantly higher among both young and old firms. It is also higher among small firms than among large firms. A similar result was found in the agricultural sector regarding the relationship between size, age, and exits. Canadian and U.S. farm exit rates are inversely related to farm size (Hoppe and Korb, 2006; Kimhi and Bollman, 1999) . The relationship between U.S. farm exit rates and age is nonlinear-that is, the exit rate initially declines with age until it reaches 8-9% among farmers between 45 and 54 years old, then increases and peaks at 12-13% among farmers who are at least 65 years old.\nRegarding the effect of off-farm participation on farm exits, Kimhi and Bollman (1999) found that the farm exit probability in both Israel and Canada decreased with the number of days of off-farm work, suggesting that off-farm work is complementary for farm work. Nehring et al. (2005) also found that farm inefficiency of U.S. farms was much higher in the absence of off-farm work. In contrast, Smith (2002) noted that off-farm participation could inhibit adoption of management-intensive agricultural innovations, leading to less efficient farming. Several other studies have also demonstrated that higher supply of off-farm labor is significantly related to lower farm-level efficiency (Fernandez-Cornejo, 2007; Goodwin and Mishra, 2004) . Another argument for the higher exit propensity among households with offfarm participation is the lower transaction costs associated with the transition from on-farm to off-farm employment. Goetz and Debertin (2001) note that part-time farming would accelerate farm exits by reducing transaction costs for those seeking to exit farming.\nFinally, policy changes in both the agricultural and industrial sectors were found to have an impact on the probability of survival. Baggs (2005) demonstrated that tariff reductions mandated by the Canada-U.S. Free Trade Agreement helped increase the survival probability of Canadian manufacturing firms. In the agricultural sector, Breustedt and Glauben (2007) demonstrated that exit rates were lower in regions with high subsidy payments and programs supporting high relative price of agricultural outputs.\nAge. Age of the household head (primary decision maker), as a proxy for length of experience in farm business organization and management, can be used to explain the variation in households' ability to adjust to new institutional environments such as new market structure. Because young (<45 years old) heads of the household may lack experience and organizational capability, they may not be able to adjust to the new market structure. By contrast, middle-aged (45-64 years old) and senior (³65 years old) heads of the household may have relatively more experience than young ones, and thus may fare better. However, seniors are often conservative and hesitant to make changes fast enough to adjust to new institutional environments.\nHypothesis: The exit propensity of burley tobacco farming is high at young age, decreases at middle age, then increases again as the head of the household approaches retirement.\nEducation. Educational attainment increases the level of human capital, raising the productivity and opportunity of off-farm work, thus expediting farm exit (Goddard et al., 1993 ). Farm operators with higher level of education are more likely to exit tobacco farming and enter the off-farm employment sector (Beach et al., 2008) .\nHypothesis: The exit propensity of burley tobacco farming increases with educational attainment.\nHousehold Size. Household size as measured by the number of family members in the household can be used to represent the availability of low-cost source of labor. Because burley tobacco production is a highly labor-intensive activity, larger households are in a better position than small households to profitably sustain their tobacco farms.\nHypothesis: The exit propensity of burley tobacco farming decreases with household size.\nOff-Farm Employment. Off-farm employment provides additional investment needed for purchase of inputs, thereby improving the productivity and efficiency of tobacco farms. This is consistent with the findings in Kimhi and Bollman (1999) and Nehring et al. (2005) . In this context, off-farm employment could be complementary to tobacco farm operations. However, because burley tobacco farming is highly labor-intensive, off-farm employment could become more of a substitute rather than a complement to tobacco farm operations. This hypothesis can be supported by the arguments in Goetz and Debertin (2001) , Smith (2002) , Goodwin and Mishra (2004), and Fernandez-Cornejo (2007) .\nHypothesis: Exit propensity of burley tobacco farming increases with working off the farm.\nTobacco Cash Receipts. Tobacco cash receipt measures the relative importance of tobacco as measured by the percent of income derived from tobacco versus other farm enterprises. The higher the percent of tobacco receipts to total farm receipts, the higher the degree of specialization in tobacco production.\nFarmers earn the larger proportion of farm receipts from the enterprise in which they are more invested and specialized, suggesting that a farm with a relatively higher ratio of tobacco receipts to total farm receipts (50%) can have a relatively higher probability of survival.\nHypothesis: Farms that generate tobacco cash receipts constituting more than 50% of the total farm income endure lower exit propensity of burley tobacco farming.\nJoint Operation of Tobacco with Other Crop Farms. Considering the potential cost savings arising from sharing of inputs between tobacco and other crop farms (i.e., economies of scope), farms operating tobacco together with other crop farms are less inclined to exit tobacco farming. Scope economies may arise from sharing of imperfectly divisible quasifixed inputs and managerial expertise in the production of different goods (FernandezCornejo et al., 1992) .\nHypothesis: Farms operating tobacco together with other crop farms are less inclined to exit tobacco farming.\nJoint Operation of Tobacco with Livestock Farms. Given that most livestock farms often have more flexible labor requirements than other enterprises (Hoppe, 1996) they may fit well with burley tobacco production, which is highly labor-intensive. Hoppe and Korb (2006) found that exit probabilities differed by specialization, with beef farms less likely to exit than cash grain farms.\nHypothesis: Farms operating tobacco together with livestock farms are less inclined to exit tobacco farming.\nTobacco Yield. Yield delineates the efficiency category in the context of production technology (Bragg and Dalton, 2004) . As a proxy for technology and measure of productivity, a difference in yield largely reflects a difference in technical efficiency, with higher yield associated with higher efficiency. Snell et al. (2008) predicts that burley tobacco farms averaging a yield of less than 2,000 lbs per acre will find it difficult to survive in the post-buyout cost/price environment. For post-buyout tobacco growers to survive, they must realize yields greater than the 2,000 lbs per acre and/or reduce costs.\nHypothesis: The propensity to exit burley tobacco farming will decrease with yield.\nFarm Size. Because farm size delineates the efficiency category in the context of scale economy (Bragg and Dalton, 2004) reflecting the structure of the average cost curve, with unit cost decreasing with the increase in farm size, medium-size and large farms can exploit scale economies and cope with external shocks.\nHypothesis: The propensity to exit burley tobacco farming will decrease with farm size.\nTobacco Price. Farmers are assumed to have expectations about future prices based on the previous year's price distribution. A farmer expecting a price above the average level is less likely to exit.\nHypothesis: The propensity to exit burley tobacco farming will decrease with tobacco price.\nState. Tennessee, Virginia, and North Carolina differ from one another in many aspects. Some of the variations in exit propensity of burley tobacco farming not explained by the observed farm and family characteristics could be explained by regional characteristics.\nHypothesis: The regional characteristics of the study states explain some of the variation in tobacco farm exit propensities that is not accounted for by the above observed independent variables."}, {"section_title": "Model and Data", "text": "Following the random utility theory in Greene (2003) , a household's decision to exit burley tobacco farming can be modeled as a discrete choice variable. Defining the utility of household i associated with exiting (U ij ) and not exiting (U ik ) burley tobacco farming as U ij 5 P j X ij b j 1 e ij and U ik 5 P k X ik b k 1 e ik , respectively, where P j X ij b j and P k X ik b k are systematic utilities (i.e., non-stochastic functions of independent variables X ij and unknown parameters, b j ) and e ij and e ik are unobservable random utility components, a utility maximizing household i chooses exiting burley tobacco farming over not exiting burley tobacco farming only if the random utility associated with exiting is greater than that associated with not exiting. Because these utilities are unobservable, it is assumed that the observed choice between exiting and not exiting burley tobacco farming would reveal which choice provides greater utility.\nAssuming that the qualitative variable Y i indexes the choice to exit/not to exit for household i where Y i 5 1 if household i exits; otherwise Y i 5 0, the probability of exiting burley tobacco farming is equal to the probability that the utility of exiting burley tobacco farming is greater than the utility of not exiting.\n(1)\nwhere L is the distribution function of w i 5 e ik 2 e ij . Making a suitable assumption on the distribution of the random error term enables us to compute the probability that the decision to exit burley tobacco farming has higher utility than the decision not to exit. Assuming a logistic distribution for w i 5 e ik 2 e ij in Equation (1) and continuing to follow Greene (2003) , the propensity (expressed in logit scale) of exiting burley tobacco farming for household i can be given as (2)\nwhere Z i is the log odds of exit of burley tobacco farms defined as\nEXIT is exiting burley tobacco farming after the end of the federal tobacco program; AGE 2 is the age of the primary decision maker (between 45 and 64 years); AGE 3 is the age of the primary decision maker (³65); EDUC 2 is educational level of the primary decision maker (high school education); EDUC 3 is educational level of the primary decision maker (college education); HHSIZ is household size measured by the number of family members in the household; FT_OFFARM is full-time offfarm employment for the primary decision maker; PT_OFFARM is part-time off-farm employment for the primary decision maker; RETIRED is retirement of the primary decision maker; T_INCOME is tobacco receipts as measured by the percent of farm income derived from tobacco; CROP is operating other crop farms; LVSTK is operating livestock farms; T_YIELD is average burley tobacco yield as measured by whether the household is producing above the state level (2,000 lbs/acre); FARMSIZ 2 is medium-size farms (between 100 and 250 acres); FARMSIZ 3 is large-size farms (>250 acres); T_PRICE is average burley tobacco price as measured by whether the household is receiving above the State level ($1.60/ lb); TN is Tennessee; and VA is Virginia. In selecting sample respondents, the sample was weighted among the three states, proportionate to the state's percentage of the threestate total harvested acreage, averaged over 2002-2004. We chose harvested acreage over total production because we were trying to reach actual producers, and that neutralized a disproportionate influence of yield differences. Finally, a stratified sample of 6,000 burley tobacco growers was selected, of whom 813 completed and returned the questionnaires, representing a 13.5% response rate.\nConsidering the low response rate, we evaluated the level of matching between the sample distribution and the state level population distribution to make sure that the sample distribution is close enough to be representative. For instance, 20.3%, 50.2%, and 29.6% of the respondents in the sample were <45, 45-64, and ³65 years of age, respectively. On the other hand, the Census of Agriculture data before the tobacco buyout indicate that 24%, 51%, and 25% of the population in the three study states (Tennessee, Virginia, and North Carolina) are in the corresponding age group. Using the chi square test statistic, we determined that the observed frequency is not statistically different from the expected frequency (c 2 5 1.67; p 5 0.43), thus concluding that the age distribution in the sample is the same as that in the state level age distribution (population). Similar analysis done on a state-by-state basis resulted in the same conclusion. Table 2 presents a priori expected signs of the parameter estimates of the independent variables included in the model relative to the reference category (control level) of the respective variable. The reference category is the level of the variable not included in the model. For instance, AGE 1 (age >45 years) is the reference category for the variable, AGE. The sign of the parameter estimate b 1 , which predicts the exit propensity (measured in log odds) of middleaged tobacco growers, would be negative, whereas that of b 2 , which predicts the exit propensity of senior tobacco growers (age ³65 Notes: The contradiction between being identified as retired and also work as a farm operator is due to the fact that the definition of a farm operator is independent of labor force concepts. Under the official farm definition, $1,000 worth of farm product sales is enough to qualify as a farm (Hoppe, 1996) . Retired households earn revenue from on-farm operations as well as from participation in programs (for example, conservation) that generate government payments."}, {"section_title": "A Priori Expected Signs", "text": "size (b 13 and b 14 ), and price (b 15 ) are expected to be negative. The parameter estimates of the STATE dummies (b 16 and b 17 ) that represent the regional characteristics of the study areas could take either positive or negative signs."}, {"section_title": "Empirical Results", "text": ""}, {"section_title": "Descriptive Results", "text": "Fifty-four percent of the sample households reported to have exited burley tobacco farming by 2006. The significance of the exit rate can be attributed to the fact that many growers appeared to have remained in production in the last few years before the buyout, hoping to be eligible for buyout benefits, but ready to exit the industry after the buyout (Tiller, 2005) . Table 3 presents a summary of the characteristics of the exiting and surviving households as well as the whole sample of households. The majority of the sample household heads are middle-aged (50%), high school-educated (49%), full-time farmers (33%) with three or fewer family members (84%), owning less than 100 acres of farm holdings (44%), earning less than 50% of total farm income from tobacco (77%), operating tobacco farms that yield fewer than 2,000 lbs/acre (69%) and fetch a price of less than $1.60/lb (77%). Table 3 also presents results of a bivariate analysis, conducted to test if the distributions of the household characteristics between the two categories-exiting and surviving-was statistically significant. The result indicates that the decision to exit burley tobacco farming is systematically associated with most of the farm and family characteristics."}, {"section_title": "Model Results", "text": "The joint effect of the independent variables on the log odds of the exit of burley tobacco farms was tested using the likelihood ratio statistic and was found to be highly significant (p < 0.01) with 17 degrees of freedom, suggesting that highly significant differences do exist in exit propensities among the burley tobacco farms for many of the independent variables included in the model. The maximum likelihood parameter estimates of the model (Equation (2)) are presented in Table 4 , showing the change in the predicted log odds of the exit of burley tobacco farms for a one-unit change in the independent variables. For discrete independent variables, the one-unit change compares the predicted log odds of the exit of the indicator group of interest and the reference group, holding all other factors constant.\nOf the seventeen independent variables included in the model, nine variables (FARMSIZ 2 , FARMSIZ 3 , T_INCOME, T_PRICE, T_ YIELD, LVSTK, RETIRED, PT_OFFARM, and FT_OFFARM) were identified to have a statistically significant effect on the exit propensity of burley tobacco farming. The intercept, which is the estimated log odds of exit for the reference category of households, is also significant, providing an exit probability of 72%. It represents the exit probability of farmers characterized by the reference category of the model variables. It is higher than the exit \nNotes: The abbreviation ''ref'' refers to the reference category of the respective variable. The reference category is the dummy variable not included in the model.\nprobability for the whole sample (54%) that was obtained without differentiating the sample by household characteristics (i.e., without including variables in the model). The Wald chi square statistic, used as an indicator of the relative importance of variables in contributing to the overall goodness of fit of the model (Ratner, 2003) , indicated that tobacco yield, tobacco receipts, tobacco price, off-farm employment and farm size are the most dominant variables discriminating between exiting and surviving burley tobacco farms.\nAll other things being equal, on average, farms yielding above-average production (2,000 lb/acre) are five times less likely to exit burley tobacco production (Table 5 ). Farms receiving above-average price ($1.60/lb) and earning more than one half of total farm receipts from tobacco, respectively, are four and six times less likely to exit burley tobacco production.\nAfter controlling for all other factors, households working part-time or full-time off the farm are two to three times more likely than households working full-time on the farm to exit burley tobacco farming. This is consistent with our expectation.\nContrary to our expectation, households operating tobacco farms together with livestock farms are 73% more likely to exit burley tobacco farming. This may be explained by the limited possibility of sharing of inputs, offering no significant cost savings. It is important to note that households exiting burley tobacco production are not necessarily exiting out of agriculture completely. They may stop growing tobacco and focus on livestock farming.\nAll other things being equal, farm size has a negative and statistically significant effect on the exit propensity of burley tobacco farming, which is consistent with pre-buyout prediction and our hypothesis. The estimated odds in favor of exiting burley tobacco farming decrease by a factor of 0.648 and 0.602 among medium-size and large farms compared with small farms. This can be explained by the fact that opportunity costs for exiting farming are higher in larger farms (Kimhi and Bollman, 1999) . There was no statistically significant difference in exit propensity between medium-size and large farms."}, {"section_title": "Predictive Efficacy of the Model", "text": "The sensitivity of the model (i.e., the ability of the model to predict the propensity to exit burley farming correctly) is 83.8%, whereas the specificity of the model (i.e., the ability of the model to predict the propensity not to exit burley farming correctly) is 73.5%. This indicates that the model better predicts the propensity to exit burley farming than the propensity not to exit burley farming. The estimated area under the receiver operator characteristic-which provides the model's ability to discriminate between the propensity to exit and not to exit burley tobacco farming-is 87%, indicating adequate predictive efficacy. Also, based on the Hosmer-Lemeshow goodness-of-fit test, the model shows no evidence of lack of fit ðc 2 8 5 10.89; p 5 0.21Þ. In addition, the model variables were tested for multicollinearity based on the variance inflation factor (VIF) and condition index (CI) values. The VIF and CI computed for all the independent variables in the model using a weighted least square method of linear regression are <10, which is well within the acceptable range, suggesting a lack of multicollinearity. The problem of multicollinearity is present if the value of VIF is >10 (Myer and Montgomery, 1995) and the CI is ³30 (Belsley et al., 1980) . Table 6 presents the change in predicted probability, measuring the predicted effect of the change in the level of the major determinants on the exit propensity of burley tobacco farming. Because the relationship between the probability of an event (exit) and the predictors in the logistic model used in the present study is nonlinear and nonadditive, the effect of an individual predictor cannot be determined independently of all other predictors in the model. Therefore, a representative (BASE) group, sharing the characteristics of the majority of the households, was selected to be a control group. Recall that the majority of households are characterized as middle-aged (AGE 2 ), full-time farmers (FT_FARMER) with a high school education (EDUC 2 ) who have three or fewer family members (HHSIZ 5 0), own a small farm (FARMSIZ 1 ), operate a tobacco farm averaging a yield of less than 2,000 lbs/acre (T_YIELD 5 0), fetch an average price of more than $1.60/lb (T_PRICE 5 0), and generate tobacco receipts below 50% of total farm income (T_INCOME 5 0). The exit probability for the representative group of households is determined to be 62% (Table 6) . In other words, given the above characteristics, 62 out of 100 households would exit burley tobacco farming. Using 62% as a baseline, we calculated the change in exit probability due to a change in the level of individual determinants. For example, the exit probability of a household that shares all the characteristics of the representative group (i.e., the majority of households) except for the percent of tobacco cash receipts (T_INCOME) decreases from 62% to 21%; in other words, the change of the level of the tobacco cash receipts from less than 50% (T_INCOME 5 0) to more than 50% (T_ INCOME 5 1) would decrease the exit probability of burley tobacco farming by 41 percentage points. Similarly, the exit probability of a household that shares all the characteristics of the representative group except for the yield level (T_YIELD) decreases from 62% to 25%. That is, the change of yield level from less than 2,000 lbs/acre (T_YIELD 5 0) to more than 2,000 lbs/acre (T_YIELD 5 1) would decrease the exit probability of burley tobacco farming by 37 percentage points. This is consistent with the prediction by Snell et al. (2008) that burley tobacco farms averaging a yield of less than 2,000 lbs/acre will find it difficult to survive in the post-buyout cost/price environment. Also, the change of price levels (T_PRICE) from below the average level (<$1.60/lb) to above the average level (>$1.60/lb) would decrease the exit probability of burley tobacco farming by 34 percentage points. The combined effect of the change in the levels of yield and price would result in decreasing the exit probability of burley tobacco farming to 7%, suggesting that the variation among farms in terms of farm productivity and price was pivotal in determining the exit/survival outcomes. Notes: BASE includes middle-aged (AGE 2 ), high school-educated (EDUC 2 ), full-time farmers (FT_FARMER) with small household size (HHSIZ 5 0) in Tennessee (TN) owning farms of less than 100 acres (FARMSIZ 1 ), operating a tobacco farm averaging a yield of less than 2,000 lbs/acre (T_YIELD 5 0), fetching an average price of more than $1.60/lb (T_PRICE 5 0), and generating tobacco receipts below 50% of total farm income (T_INCOME 5 0). The exit probability for the BASE is 0.62."}, {"section_title": "Predicted Effects of the Change in the Level of Determinants", "text": ""}, {"section_title": "Conclusion", "text": "This study examined the empirical relationship between farm/family characteristics and burley tobacco farm exits in Tennessee, North Carolina, and Virginia. Our results indicate that more than one half of the sample burley tobacco farms (54%) in these three states exited burley tobacco farming by 2006, demonstrating the impact of the termination of the federal tobacco program in 2004. The results also indicate that burley tobacco farm exits are strongly related to family and farm characteristics, including tobacco yield, tobacco receipts, tobacco price, off-farm employment, and farm size. These characteristics are indentified as discriminating between exiting and surviving tobacco farms. Exiting tobacco farmers were more likely to have part-time, full-time off-farm employment, small farm operations, an average yield of less than 2,000 lbs/acre, an average price of more than $1.60/ lb, and tobacco cash receipts below 50% of total farm income. In contrast, the surviving tobacco farmers were more likely to have fulltime, on-farm employment, large farm operations, an average yield of more than 2,000 lbs/ acre, an average price of more than $1.60/lb, and tobacco cash receipts more than 50% of total farm income. Although the present study has explored the empirical relationship between farm/family characteristics and the probability of tobacco farm exits, it has not conclusively determined whether the exiting farms are less efficient. For example, in light of the inverse association between the level of off-farm participation and on-farm efficiency (Goodwin and Mishra, 2004) , the finding of direct association between off-farm participation and burley tobacco farm exits in the present study suggests that the exiting farms are less efficient (or that less efficient farms exited tobacco farming). In contrast, in light of the empirical evidence in Nehring et al. (2005) that farm inefficiency of U.S. farms was much larger in the absence of off-farm work, the same finding in the present study suggests that the surviving farms are less efficient (or that less efficient farms did not exit tobacco farming). Because economic theory does not provide a well-established theoretical model of the determinants of efficiency, further research is warranted to explicitly account for the role of on-farm efficiency in farm exit models and conclusively determine the underlying force driving farm exits. In the industrial sector, few studies have looked into whether technical efficiency indeed affects the exit of firms in a significant way and, if so, whether the effect is quantitatively important (Tsionas and Papadogonas, 2006) . This was done by estimating a firm exit model that allows efficiency to be a determinant of firm exit. Because efficiency is unobserved, it was determined endogenously by estimating a stochastic production frontier.\nFinally, given the lack of data on the characteristics of the population of burley tobacco farmers and lack of state level data corresponding to the specific level of the variables used in the model, the present study did not evaluate the level of matching between the sample distribution and the population distribution for the model variables except for the variable representing the age of the household head. The age distribution in the sample was found to be the same as that in the state level age distribution (population). Although low response rates are acknowledged to be of some concern, several empirical studies found little relationship between response rates and bias (Curtin et al., 2000; Keeter et al., 2000) ."}]