[{"section_title": "Abstract", "text": "Introduction: Neurofilament light chain (NfL) is a promising blood biomarker to detect neurodegeneration in Alzheimer's disease (AD) and other brain disorders. However, there are limited reports of how longitudinal NfL relates to imaging biomarkers. We herein investigated the relationship between blood NfL and brain metabolism in AD.\nMethods: Voxelwise regression models tested the cross-sectional association between [ 18 F]fluorodeoxyglucose ([ 18 F]FDG) and both plasma and cerebrospinal fluid NfL in cognitively impaired and unimpaired subjects. Linear mixed models were also used to test the longitudinal association between NfL and [ 18 F]FDG in amyloid positive (Ab1) and negative (Ab2) subjects. Results: Higher concentrations of plasma and cerebrospinal fluid NfL were associated with reduced [ 18 F]FDG uptake in correspondent brain regions. In Ab1 participants, NfL associates with hypometabolism in AD-vulnerable regions. Longitudinal changes in the association [ 18 F] 1 These authors contributed equally to this work. 2 Data used in the preparation of this article were obtained from the Alzheimer's Disease Neuroimaging Initiative (ADNI) database (adni.loni.usc.edu). As such, the investigators within the ADNI contributed to the design and implementation of ADNI and/or provided data but did not participate in analysis or writing of this report. A complete listing of ADNI investigators can be found at"}, {"section_title": "Introduction", "text": "Blood-based biomarkers that can predict the clinical onset of Alzheimer's disease (AD) and monitor disease progression via the identification of the underlying pathology are urgently needed. These would greatly assist therapeutic trial stratification and the clinical management of patients, particularly when disease-modifying drugs become available. Blood-based biomarkers for neurodegeneration can also be used to identify downstream effects on neurodegeneration in clinical trials on drugs with disease-modifying potential [1, 2] . In AD phase I-II trials, for example, these biomarkers may be valuable for decision-making on whether to continue phase III drug development. Both molecular imaging (e.g., amyloid beta [Ab], tau, and glucose metabolism using positron emission tomography [PET]) and cerebrospinal fluid (CSF; Ab, total tau [T-tau], and phosphorylated tau at 181 (P-tau)) based biomarkers accurately identify and track AD pathophysiology [3] . Nonetheless, PET imaging is costly, and access is restricted to specialized centers and implausible to be implemented widely in a general routine assessment of cognitive complaints. CSF sampling is becoming more accepted in clinical routine, but a lumbar puncture may still be regarded as an invasive procedure. Therefore, a blood-based measure would have substantial practical advantages for both clinicians and patients.\nRecent advancements in proteomic assays have demonstrated the potential use of plasma Ab to identify brain Abpositive individuals with moderate-to-high accuracy [4] [5] [6] [7] [8] .\nThe measurement of T-tau in plasma has limited diagnostic value, albeit being slightly but significantly increased in patients with AD [9] but promising data are emerging on P-tau [10] . The most replicated blood biomarker for AD is neurofilament light chain (NfL). NfL is abundantly expressed in large myelinated axons and is promptly released into the CSF and blood under axonal distress and degeneration. Indeed, concentrations of NfL are higher in patients with AD compared with age-matched control subjects [11] . Furthermore, in familial AD studies, NfL appears to be altered around one decade before symptom onset [12, 13] . However, NfL is a disease-unspecific marker, as elevations are observed in other neurodegenerative disorders [14, 15] , inflammatory conditions [16] , and in acute traumatic brain injury [17] . Although the diagnostic specificity of NfL is lacking, the semiautomated measurement of NfL in blood offers the possibility of multiple sample collections to monitor disease progression and potentially treatment response.\nThere are limited studies evaluating longitudinal measures of blood NfL in sporadic AD [18, 19] . Furthermore, associations between blood NfL, particularly longitudinal measurements, and established imaging biomarkers for AD are few [11, [19] [20] [21] with no detailed investigation of the association between blood NfL and glucose hypometabolism as measured by [ 18 F]fluorodeoxyglucose ([ 18 F]FDG) PET. The decreased uptake of [ 18 F]FDG is understood to largely reflect neurodegeneration, more specifically, synaptic damage [22] , and has become an essential tool in the evaluation of suspected AD and related disorders [23, 24] . AD exhibits a characteristic pattern of glucose hypometabolism, involving the precuneus/posterior cingulate, inferior parietal lobule as well as posterolateral and medial aspects of the temporal lobe, including the hippocampus and entorhinal cortex [25, 26] . This metabolic signature has been shown to predict the progression from mild cognitive impairment (MCI) to AD dementia [27] .\nIn this study, we have investigated the cross-sectional and longitudinal associations of plasma NfL with glucose metabolism as measured by [ 18 F]FDG PET in cognitively impaired (CI) and cognitively unimpaired (CU) participants enrolled in the Alzheimer's Disease Neuroimaging Initiative (ADNI). We hypothesized that higher levels of plasma NfL would be associated with greater brain hypometabolism, mainly in those Ab positive, reflecting the underlying physiological and neurodegenerative processes."}, {"section_title": "Materials and methods", "text": ""}, {"section_title": "Study participants", "text": "This study uses data obtained from the ADNI database (adni.loni.usc.edu), which was launched in 2003 as a public-private partnership, led by Principal Investigator Michael W. Weiner, MD. The primary goal of ADNI has been to test whether serial magnetic resonance imaging (MRI), PET, other biological markers, and clinical and neuropsychological assessments can be combined to measure the progression of MCI and early AD. AD subjects had a Mini-Mental State Examination (MMSE) ranging between 20 and 26 (inclusively), Clinical Dementia Rating equals 0 or 1, and met criteria for probable AD according to the National Institute of Neurological and Communicative Disorders and Stroke-Alzheimer's Disease and Related Disorders Association [28] . Participants were classified as MCI if MMSE ranged between 24 and 30, Clinical Dementia Rating 0.5 (with the memory box score being 0.5 or greater), largely intact general cognition and functional performance, and could not meet criteria for dementia according to the National Institute of Neurological and Communicative Disorders and Stroke-Alzheimer's Disease and Related Disorders Association (for further details see [29] ).\nOur study population was derived from two data sets. The first data set was used for cross-sectional analyses and included participants that had measures of plasma NfL, CSF NfL, and [ 18 F]FDG PET. The second data set comprised participants who had longitudinal plasma NfL (0-24 months) and [ 18 F]FDG PET (for detailed description see Supplementary Fig. 1 ). The population was divided in two groups: CU (n cross 5 81, n longit 5 302) and CI (n cross 5 162, n longit 5 713). The CI group consists of individuals clinically defined as having MCI or AD dementia. For the classification of the longitudinal data, the most recent diagnosis assigned to a participant was used. For the cross-sectional analysis, group classification was based on the diagnosis given at the time of plasma or CSF collection. The ADNI inclusion/exclusion criteria are described in detail at www. adni-info.org (accessed October 2018). All enrolled participants or authorized representatives provided informed consent, approved by ADNI center's respective Institutional Review Boards."}, {"section_title": "Plasma measurements", "text": "Plasma NfL concentration was measured at the Clinical Neurochemistry Laboratory, University of Gothenburg, M€ olndal, Sweden, by board-certified laboratory technicians with the data here included generated using a single batch of reagents. An in-house immunoassay on the single-molecule array (Simoa) platform, with a fourfold dilution, as previously described [16] . For cross-sectional data, data acquisition spanned 14 analytical runs and all the samples ranged between the limits of quantification (LOQs; lower limit 5 2.2 ng/L, upper limit 5 1620 ng/L). For the lowconcentration control sample (14 ng/L), the intra-assay coefficient of variation was 11.0% and the interassay coefficient of variation was 11.1%, whereas for the high-concentration quality control sample (137 ng/L), the corresponding coefficients of variation were 8.8% and 9.6%, respectively. For longitudinal data, the LOQs were 6.7 ng/L and 1620 ng/L. The low-concentration control sample was 11.0 ng/L and the high-concentration quality control sample was 173.9 ng/L, with the respective intra-assay coefficients of variation being 6.2% and 4.9%. A single sample was excluded because it was not within the LOQ."}, {"section_title": "CSF measurements", "text": "CSF was sampled by lumbar puncture and NfL levels were quantified in a subset of the participants, at a single time point, using a commercial enzyme-linked immunosorbent assay following the protocol provided by the manufacturer (NF-light; UmanDiagnostics). Samples were run in singlicates and using one batch of reagents. Each enzymelinked immunosorbent assay plate included internal quality control samples with high and low CSF NfL concentrations placed in duplicate both in the beginning and end of the plate. The calibration curve acceptance followed strict criteria as described elsewhere [30] . Intra-assay coefficients of variation were ,10%."}, {"section_title": "MRI/PET", "text": "MRI and PET acquisitions followed the ADNI protocols (http://adni.loni.usc.edu/methods). The MRI T1weighted images underwent initial preprocessing with intensity normalization and gradient unwarping. They were then processed using the CIVET image-processing pipeline and registered using a nine-parameter affine transformation and nonlinearly spatially normalized to the MNI152 template. [ 18 F]FDG PET images were preprocessed to have an effective point spread function of full-width at half-maximum of 8 mm. Subsequently, linear registration and nonlinear normalization to the MNI152 template were performed with the linear and nonlinear transformation derived from the automatic PET to MRI transformation and the individual's anatomic MRI coregistration. [ 18 F]FDG standardized uptake value ratio (SUVR) maps were generated using pons as the reference region [31] . More details regarding the image-processing pipeline can be found elsewhere [31, 32] . Here, we used the [ 18 F]FDG scan with the closest acquisition date to the plasma collection.\nTo classify subjects as Ab positive (1) or negative (2), brain amyloid burden was estimated using [ 18 F]florbetapir PET. The global SUVR values were obtained from the ADNI and the detailed protocols on PET acquisition and processing are available online (http://adni.loni.ucs.edu). The cutoff used here was .1.11, as suggested in the ADNI protocol."}, {"section_title": "Statistical analysis", "text": "The R programming language (version 3.4.3) [33] was used to perform all nonimaging statistical analyses. Linear models and Spearman's rank correlation coefficients were used for demographic comparisons and for cross-sectional analyses, adjusting for age, sex, and group (CU ! CI), where appropriate. We performed linear mixed effect (LME) regression models, using the nlme package, to compare the progression in plasma NfL between groups: (1) CU versus CI and (2) CU Ab2 versus CU Ab1, CI Ab2, and CI Ab1. The LME included plasma NfL as the dependent variable, the interaction between the independent variables time and group, the covariates sex and age at baseline NfL, and a random intercept. The 95% confidence intervals were estimated based on the estimated fitted value across the distribution from thousand simulations of the model that includes all variations except theta. All tests mentioned previously were two-sided with a significance level of P , .05. LME was also performed at the voxel level to check the association between plasma NfL and [ 18 F]FDG. Two models were applied using VoxelStats [34] . First, the model tested the association between [ 18 F]FDG and plasma NfL, adjusting for baseline age, sex, collection time point and time difference between the plasma measurement, and the [ 18 F]FDG acquisition, with a random intercept and accounting for the repeated measures of the longitudinal data. In the second model, we examined the longitudinal association between the interaction of plasma NfL with time in relation to [ 18 F]FDG, also adjusting for age, sex, and time difference between NfL and [ 18 F]FDG. Here, time was treated as a categorical variable. Both models were performed in the CU and CI groups. Voxel-based linear models were also used to examine the cross-sectional association of both plasma NfL and CSF NfL with [ 18 F]FDG. The models were corrected for age at biofluid collection, sex, and time interval between biofluid and PET acquisition. These analyses were also performed within the CU and CI groups. Random field theory [35] was used to correct the resulting T parametric maps for multiple comparisons, as this method considers the resolution of the imaging data and the spatial correlation between voxels. Hypothesizing that [ 18 F]FDG and NfL (plasma or CSF) [36] would show a negative association, we performed one-tailed hypothesis tests with a type I error a 5 0.05. Degrees of freedom are indicated in the text Section 3."}, {"section_title": "Results", "text": ""}, {"section_title": "Demographics characteristics", "text": "Demographic and clinical characteristics are summarized in Table 1 . A total of 243 participants were included in the cross-sectional analysis, from whom 62% were males and the average age was 75.0 (standard deviation [SD] 5 6.6) years old. This population included 81 CU and 162 CI subjects, with no difference in age (t 5 1.06; P 5 .28), sex (c 2 5 2.11; P 5 .14), or education (t 5 0.09; P 5 .92) found between groups. As expected, the CI group had more apolipoprotein E (APOE)-ε4 carriers (c 2 5 28.27; P ,.001) and lower MMSE scores (t 5 10.59; P , .001), compared with the CU group. In addition, CI subjects showed higher levels of NfL, adjusted for age and sex, using both CSF (t 5 4.80; P , .001; Fig. 1A and plasma (t 5 4.98; P , .001), but not with sex, education, or APOE-ε4 status. Plasma NfL was associated with age (t 5 5.39; P , .001) but not with sex (t 5 0.29; P 5 .77). On the contrary, CSF NfL was associated with both age (t 5 5.05; P , .001) and sex (t 5 2.21; P 5 .02). Sex differences in CSF NfL were because of higher NfL concentrations in females, specifically in the CU group (t 5 2.70; P 5 .008). There was no difference in CSF NfL levels between sex groups in CI.\nThe longitudinal component of the analysis consisted of 1015 participants (average follow-up time 5 9.2 months), and there was no bias toward sex (% males 5 54.9%), although males were older (M (males) 5 74.9; SD 5 7.4; t 5 5.47; P , .001). The CU group consisted of 302 subjects (42.3%) whereas the CI group had 713 subjects. There was no difference in age between the groups (t 5 0.83; P 5 .40), but the CU group had more females (c 2 5 12.4; P 5 .001) and more years of education Fig. 1 . Comparison between CSF and plasma NfL. Differences in NfL levels are seen between cognitively impaired (CI) and cognitively unimpaired (CU) subjects measured in the CSF (A) and plasma (B). NfL showed a good correlation between plasma and CSF measurements (C). T-statistical parametric maps superimposed on average structural MRI show brain regions where higher NfL levels are associated with lower [ 18 F]FDG standard uptake value ratios in the CI (D) and CU (E) groups. T-values that are significant after random field theory correction for multiple comparisons are indicated in the text. Abbreviations: CSF, Cerebrospinal fluid; FDG, fluorodeoxyglucose; NfL, neurofilament light chain.\n(t 5 3.56; P , .001), compared with the CI group. As expected, the CI group had more APOE-ε4 carriers (c 2 5 42.89; P , .001), more Ab1 subjects (c 2 5 104.95; P , .001), lower MMSE (t 5 12.03; P , .001) scores, and higher levels of plasma NfL (t (1010) 5 5.03; P , .001) at baseline ( Fig. 2A) . Plasma NfL was highly associated with age in the whole population and within groups (t all 5 17.98; t CU 5 10.19; t CI 5 14.99; P , .001), but was not associated with sex (t 5 0.88; P 5 .37), education (t 5 1.08; P 5 .27), or APOE-ε4 status (t 5 1.11; P 5 .26) when adjusting for diagnosis and covariates. The LME showed a significant difference between CI and CU groups (t 5 4.93; P , .001) but no difference in the slopes (t 5 1.43; P 5 .15; Fig. 2B ). When segregating the groups according to Ab status (Fig. 2C) , there was a significant difference in Fig. 2 . Longitudinal plasma NfL. Differences in plasma NfL levels are seen between cognitively impaired (CI) and cognitively unimpaired (CU) subjects at baseline (A). Longitudinal changes are seen between CI and CU groups over time (B); differences were more pronounced when groups were segregated according to Ab status. (C) T-statistical parametric maps superimposed on average structural MRI show brain regions where higher plasma NfL levels are associated with lower [ 18 F]FDG standard uptake value ratios in the CI (D) and CU (E) groups classified as Ab1 and Ab2. T values that are significant after random field theory correction for multiple comparisons are indicated in the text. Abbreviations: Ab, Amyloid beta; FDG, fluorodeoxyglucose; MRI, magnetic resonance imaging; NfL, neurofilament light chain. the slope between the reference group (CU Ab2) and both CU Ab1 (t 5 2.36; P 5 .01) and CI Ab1 subjects (t 5 2.34; P 5 .01)."}, {"section_title": "Plasma and CSF NfL show similar association with brain glucose metabolism", "text": "Cross-sectionally, plasma NfL showed correlation with CSF NfL (Spearman r 5 0.57, P , .001; Fig. 2C) , which remained significant (t 5 6.43, P , .001) after adjusting for age, sex, and diagnosis. As expected, CSF-plasma correlation was present within both groups (r (CU) 5 0.50, P , .001; r (CI) 5 0.53, P , .001). Voxelwise analysis in the CI group revealed a significant association between plasma NfL and [ 18 F]FDG SUVR (t (154) , 23.14; P , .05) in the hippocampus and insula, bilaterally (Fig. 1D) . Similarly to plasma NfL, CSF NfL was associated with glucose hypometabolism in the hippocampus and insula, although predominantly in the right hemisphere (t (156) , 23.14; P ,.05). CSF NfL also showed a diffuse association with [ 18 F]FDG in the frontal regions of the brain, which did not present a good overlap with what was observed with plasma NfL. In the CU group, the topography of the hypometabolism associated with CSF and plasma NfL was very similar (Fig. 1E) , being restricted to the right hippocampus. These results, however, did not survive multiple comparison correction."}, {"section_title": "Plasma NfL is more associated with glucose metabolism in Ab-positive individuals", "text": "The voxelwise LME revealed a link between high plasma NfL levels and reduced [ 18 F]FDG uptake in the frontal and temporal regions, as well as in the posterior cingulate cortices and occipital regions among CI Ab1 subjects (t (572) , 23.10; P , .05; Fig. 2D ). Within the CI Ab2 group, these associations were substantially reduced (t (305) , 23.11; P , .05). In the CU Ab1 group, NfL and [ 18 F]FDG were significantly associated (t (117) , 23.16; P , .05) in small focal cortical clusters in the posterior cingulate, parietal, and temporal lobes. Among CU Ab2 individuals, this association was reduced and more localized in the parietal cortices (t (286) , 23.11; P , .05; Fig. 2E )."}, {"section_title": "The longitudinal association of plasma NfL with brain metabolic changes over 24 months is only present in Abpositive individuals", "text": "When testing the interaction between plasma NfL and time in the CI Ab1 group, NfL associations with [ 18 F] FDG were higher over 24 months than at the baseline (t (566) , 23.09; P .05) in the posterior cingulate, frontal, and temporal cortices (Fig. 3) . However, the associations between plasma NfL and [ 18 F]FDG SUVR did not differ between time points in the CI Ab2, CU Ab1, or CU Ab2 groups."}, {"section_title": "Discussion", "text": "The main findings from this study are threefold: (1) plasma and CSF NfL demonstrate a similar pattern of association with glucose metabolism in CI individuals, (2) higher concentrations of plasma NfL are associated with lower glucose metabolism more strongly in Ab1 individuals, and (3) the association of plasma NfL tracks metabolic decline over time only in Ab1 CI subjects.\nThere has been an increasing focus on blood NfL (plasma or serum) because of the potential prognostic and diagnostic value in AD. Although their ubiquitous and unspecific increase in many neurologic conditions limit their diagnostic value, they have potential as a biomarker of disease progression. Therefore, associations between NfL with established biomarkers of AD (e.g., [ 18 F]FDG) are fundamentally important to interpret NfL plasma levels. Unlike other potential blood biomarkers, the correlation of NfL in blood and CSF has been consistently high across various studies [14, 16, 37] . Likewise, in this study we found an excellent correlation between NfL quantified in the plasma and CSF compartments. Remarkably, using a voxelwise approach, we have shown that the association between regional glucose metabolism with either plasma or CSF NfL levels converge to the same regions. The fact that these associations were present in both CI and CU groups further reinforces the potential use of plasma NfL as a surrogate measure for CSF NfL or neurodegeneration.\nLongitudinally, we have shown that there is a group effect of NfL progression, in which CI participants displayed higher concentrations of plasma NfL over 24 months compared with CU participants. However, the NfL rate of change was not statistically different between these two groups. In line with a recent report [19] , group stratification based on Ab status showed that Ab1 subjects present greater changes in plasma NfL over time compared with CU Ab2 subjects. This finding suggests that increases in plasma NfL are able to detect Ab-related neuronal injury at an early stage. This is also supported by previous studies in familial AD [12, 13] , Down syndrome [38] [39] [40] , and unbiased proteomics in CU Ab1 individuals [41] .\nRegarding the anatomic distribution, to our knowledge, this is the first study at the voxel level showing that within both CU Ab1 and CI Ab1 subjects metabolic abnormalities occur in AD-related cortical regions. This supports a framework in which NfL combined with a biomarker of Ab might convey AD-related neurodegeneration. Indeed, among Ab2 subjects, the association between plasma NfL and [ 18 F]FDG did not conform to patterns seen in AD, suggesting that neuronal injury was because of other causes than AD.\nThe present findings also revealed that increases in the association between plasma NfL and glucose metabolism over 24 months were only detected in Ab1 CI subjects. This result is in line with a previous study that demonstrated that the presence of both Ab and neurofibrillary tangle pathology is necessary to increase brain hypometabolism over a 2-year period [42] . Although we did not have access to tau-related data in our study, it is very likely that most Ab1 participants are also tau positive (T1, i.e., neurofibrillary tangle positive). This was evidenced by postmortem studies showing that over 80% of MCI and AD subjects pathologically classified as probable or definite AD-according to the Consortium to Establish a Registry for Alzheimer's disease criteriaalso showed Braak stage 3 [43, 44] . In fact, we have previously shown that plasma NfLs are highest in postmortem cases with Braak stage V/VI [18] . Thus, it is important to highlight that plasma NfL may be able to track neurodegenerative changes that do not necessarily reflect detectable clinical decline in the same period of time.\nCertain methodological aspects limit the interpretation of our findings. It is relevant to mention that the period of biofluid collection and PET imaging acquisition was not invariably the same, although models accounted for the time difference between measurements. The reduced sample size of some of the groups could also have an impact on the results as not all the subjects included in the LME models had longitudinal data. In addition, other important biomarkers of neuronal function/dysfunction such as neurogranin, T-tau, and P-tau were not assessed in the present study. Finally, certain demographic differences were found between the groups; these, however, were accounted for in our statistical models.\nIn conclusion, this study adds further evidence that plasma NfL is reflective of CSF NfL but more importantly reflects longitudinal neurodegeneration, indexed by FDG PET. In the ADNI cohort, increased plasma NfL in Ab1 participants was associated with advanced glucose hypometabolism, with longitudinal changes confined to CI Ab1 individuals."}]