[{"section_title": "", "text": "(NELS:88) data to determine if educational process variables, teacher emphasis, student selfconcept, and socio-economic status can account for variance in student mathematical achievement. A model that includes seven independent variables accounted for 25% of the variance in student mathematical achievement test score. The primary objective of this study was not to explain mathematics achievement, but provide educational researchers with a functional and viable model for panel data analyses. Data that embodies time series and cross section units have not been commonplace in the research community until the last 25 years (Tieslau, 1999). In fact, the U.S. Department of Education's National Center for Education Statistics (NCES) was not mandated to \"collect and disseminate statistics and other data related to education in the United States\" until the Education Amendments of 1974 (Public Law 93-380, Title V, Section 501, amending Part A of the General Education Provisions Act). Researchers commonly have termed data that contains time series and cross section units to be panel or longitudinal data. In this study, these terms are used interchangeable. Essentially, panel data is a set of individuals who are repeatedly sampled at different intervals in time, across a multitude of cross sectional variables. The term \"individual\" might be used loosely to imply a person, a household, a school, school districts, firms, or a geographical region. Figure 1 provides a typical structure for a panel data set. Schools have been used to represent the different \"individuals\". (Note: the individual unit could just as well have been different schools within a particular district, school districts within a state, or an aggregate representation by state). Researchers who are interested in understanding, explaining, or predicting variation within longitudinal data are faced with some complex stochastic specifications. The problem that occurs when realizations exhibit two-dimensional variationvariation across time and cross section, is model specification. In other words, researchers need to specify a model that can capture individual differences in behavior across individuals and/or through time for estimation and inference purposes (Greene, 1997). into postsecondary institutions or the work force. The National Education Longitudinal Study of 1988 (NELS:88) contains data about educational processes and outcomes pertaining to student learning, predictors of dropping out, and school effects on students' access to programs and equal opportunities to learn. The first follow-up was conducted with the same students, their teachers, and principals in 1990. The second follow up survey was conducted in 1992, and the third in 1994. Data from NELS:88 will be used in this study to determine if student perception of educational process variables can account for the variance in mathematical achievement."}, {"section_title": "Model Specification", "text": "When should a fixed effects or random effects model be utilized? The answer to this question is often debated. Some believe that it is dependent upon the underlying cause in the BEST COPY AVAILABLE"}, {"section_title": "5", "text": "Fixed Effects Panel Data Model 5 model. For example, if the individual effects are the result of a large number of non-observable stochastic variables, then the random effect interpretation is demanded. Others think the decision rest on the nature of the sample that is when the sample is comprehensive or exhaustive, then fixed effects models is the natural choice to enhance the generalizability. On the contrary, if the sample does not contain a large percent of the population then the random effect model would be the model of choice. According to Hasiao (1985), it is ultimately, \" up to the investigator to decide whether he wants to make an inference with respect to population characteristics or only with respect to effects that are in the sample\" (pg. 131). It is unlikely that this debate will ever be resolved per se, however, if the choice between the two underlying causes is clear, then the estimation method should be chosen accordingly. However, if the choice is not clear, then the decision should be based on the nature of the sample and statistical evidence. For example, if the t-stats on the individual effects are mostly significant then this is clearly a sign that a significant component of the model is accounted for by the individual effect parameter and so FE might be preferred to RE. The \"i\" indexes cross-section realizations so that i = 1,2,3, ..., N and \"t\" indexes timeseries realizations so that t = 1, 2,3, . . . ,T. The individual effect ai, is regarding to be constant over time (t) and specific to the individual cross-sectional unit W. The terrnai is presumed to captures the unobservable, and non-measurable characteristics that differentiate individual units. Basically, this implies that all behavioral differences between individuals (e.g., schools in Figure   1) are fixed over time and are represented as parametric shifts of the regression function. Matayas and Sevestre (1996, p. 34) state, \"the intercept is allowed to vary from individual to individual while the slope parameters are assumed to be constants in both the individual and time dimensions\". The fundamental assumptions of the fixed effects model are: (1) Ekil] = 0, (2) cov(e,Eit )= 0, The \"i\" indexes cross-section realizations so that i=1,2,3,..., N and \"t\" indexes time-series realizations so that t = 1,2,3,..., T. The term \"ui\" is a stochastic variable that embodies the unobservable or non-measurable disturbances that accounts for individual differences. Essentially, the effect is thought to be a random individual effect rather that fixed parameter. For example, a researcher might try to discern whether there is difference in achievement between districts in the State of Texas. Instead of including every school district in the equation (as we would have in the fixed effects model using dummy variables) one can randomly sample school districts and assumes that the effect is random distributed across \"individuals\" but is constant through time. Fixed Effects Panel Data Model 8 The fundamental assumptions of the random effects model are as such: Assuming normality u, N (0, 6.2 ),E-N (0,a: ), both \"u,\" and \"E\" are stochastic variables, but form one composite error term-called omega (u, + E)-CO. The error term now consist of two components: (1) the error disturbance Eil, and (2) the individual specific disturbance u,. The RE model now takes the form of Yit=a + p 1 x + /3 2 X 2 it + + Kxx + co , or in matrix notation Yi = a + Xitt + wit . The error term in the model now exhibits the following characteristics: var (coi, )= 6E aeul."}, {"section_title": "au ,E au", "text": "As it stands, the original least squares estimator may not be applied to equation 6 because the error term not longer possess ideal properties (constant variance and zero covariance) thus the estimate would be inefficient and, hence generalized least squares (GLS) is appropriate. However, the nature of data in behavioral sciences does not permit the variance components sCr, and a to be known, therefore, alternative estimation methods must be utilized. One common estimation method that can deal with the unknown variance components feasible generalized least squares (FGLS). Essential, FGLS takes an estimate of the variance components and then estimates the equation. After correcting the error term (co) the t and F-test are reliable, thus inference can be regarded as valid. Base on statistical evidence, a FE model will be use estimated and will discussed later in the this paper.."}, {"section_title": "National Education Longitudinal Data Set:88", "text": "The NELS:88 database is divided into two sections: (1) N2P, and (2) N4P. In this study, data were extracted from N2P. A representative sample of students (N=16,749) enrolled in tenth grade in the spring of 1990 who completed a questionnaire in both the first follow-up and second follow-up were identified and used in the analysis. Seven independent variables are included in the specified model. They are listed as entered into the model: "}, {"section_title": "Empirical Results", "text": "The FE model below was specified and estimated.    Note the moderate correlation between the two exogenous variables, Copy Notes and Listen Lecture (p = .540) is indicative of multicolinearity. This correlation gives reason to question the inference drawn from the t-stats on these two variables. However, the parameter estimates for CopyNotes and ListenLecture are still BLUE. Fixed Six out of the seven independent variables were statistically significant at the 0.000 alpha level accounting for 25% of the variance in the dependent variable (mathematics achievement score). See The variable ReviewWork is statistically significant (t= 3.27, p > .001). As ReviewWork increases by one unit, MathScore increases by 0.234 points, c.p.. In other words, as students increase the frequency in which they review their work, holding all else constant, their math score increases by 0.234 points. The variable ListenLecture is statistically significant (t= 3.924, p > .000). As ListenLecture increases by one unit, MathScore increases by 0.370 points. Or put differently, the more attentive the student is to the teacher's lecture, their math score increases by 0.370 points, c.p.. The variable Copy Notes is not statistically significant (t= -1.488, p > .1367). The variable Calculators is statistically significant (t=11.10, p>.000). As Calculators increases by one unit, MathScore increase by 0.667 points, c.p.. Essentially, this estimate is showing that students math score will increase with the use of a calculator. The variable ThinkProblem is statistically significantly (t= 14.304, p >.000). Recall, this variable measures student perception of teachers emphases on mathematical objectives and is scaled, (0) none, (1) minor emphasis, (2) moderate emphasis, (3) major emphasis. As ThinkProblm increases by 1 unit, MathScofe increases by 1.387 point. Abstracted differently, the more teachers emphasis \"thinking about what a problem means and ways it might be solve\", holding all else constant, students math score increase by 1.387 points. The variable SES is statistically significant (t = 47.333, p > 0.000). As SES increases by 1 unit, holding all else constant, MathScore increases by 4.937 points. Recall SES is a continuous variable indicating sample member's socioeconomic status. This measure is based on Duncan's 1961 socioeconomic Index for all Occupations. The variable SelfConcept is statistically significant (t=10.071, p>0.000). As SelfConcept increases by 1 unit, MathScore increases by 1.137 points, c.p.. Essentially, students who have a more positive self perception, are scoring higher on the standardized math test."}, {"section_title": "Conclusions", "text": "In this study, a fixed effects panel data model were applied to the National Education Longitudinal Study of 1988 (NELS:88). The empirical evidence presented here suggests that student mathematics test score is influence by educational process variables, teacher emphasis, student self-concept, and socio-economic status. Specifically, a model that includes seven BEST COPY AVAILABLE"}, {"section_title": "16", "text": "Fixed Effects Panel Data Model 16 independent variables accounted for 25% of the variance in student mathematical achievement test score. The primary objective of this study was not to explain mathematics achievement, but provide educational researchers with a functional and viable model for panel data analyses."}, {"section_title": "Recommendation", "text": "The NELS:88 data set does not have a means of extracting the time component of the data. Although, the models for analyzing time effects were not discussed in the study, it is an important aspect of panel data that should be code when the data file is constructed. In addition, the time series unit should be measured in smaller periods of time. Further analysis should be peformed on the error term (es, ). That is, the error term should be analyzed for hetroskedascity and autocorrelation and problems. "}]