[{"section_title": "Abstract", "text": "Background: Health systems may play an important role in identification of patients at-risk of opioid medication overdose. However, standard measures for identifying overdose risk in administrative data do not exist."}, {"section_title": "", "text": "P rescription opioid overdose (poisonings) and mortality have risen at alarming rates since 2000, 1 with fatal overdoses now at 44 per day. 2 This epidemic has spurred a national call to action, with the White House urging health systems to invest in surveillance, prevention, and treatment. 3, 4 Opioid surveillance and overdose prevention efforts, such as prescription monitoring and lock-in programs, rely on the ability of payers and health care systems to accurately identify patients at-risk of opioid overdose. Commonly used measures in opioid medication use and overdose surveillance include indicators of exposure, such as morphine milligram equivalents (MME). [5] [6] [7] [8] [9] [10] [11] [12] Yet, MME does not differentiate patient from prescribing behavior. There are, unfortunately, no standard indicators for measuring overdose risk in administrative data routinely available to these stakeholders. 13 Researchers and health systems have used various conceptual and operational definitions to measure nonmedical use of prescription opioids [13] [14] [15] that could be beneficial for identifying overdose risk. The definition of nonmedical use often hinges on motivation for use, whether the drug was prescribed for those using it, or opioid use disorder symptoms. 14 One promising operational definition identifies nonmedical use based on addiction diagnoses. White et al 16 and Rice et al 17 developed and demonstrated criterion validity 13 for a diagnosis-based measure of what they labeled \"abuse\" constituted by individuals receiving an opioid prescription while simultaneously having an opioid use disorder or poisoning diagnosis. Other researchers have identified opioid utilization patterns consistent with what is labeled \"misuse.\" Sullivan et al 18 developed and demonstrated criterion validity 13 for a utilization-based measure of misuse that combines numbers of prescribers from which patients received opioid prescriptions, numbers of pharmacies where prescriptions were filled, and days-supplied of short-acting and long-acting opioid medications.\nIt is unknown whether these tools designed for defining nonmedical use predict risk of overdose. We sought to determine whether these measures, which rely on diagnoses and prescription fill behaviors, were associated with overdose. Using Pennsylvania (PA) Medicaid data, we constructed a heterogenous cohort of patients initiating prescription opioid treatment. Although claims data do not permit us to capture care for which cash was paid [16] [17] [18] medication diversion outside of prescriber/pharmacy reimbursement systems 19 and likely underestimate the prevalence of nonmedical use of opioids-our findings provide an important advancement to the field by testing these relationships and informing data-driven health system efforts to target prevention and intervention for individuals with overdose risk. Moreover, some systems have recently implemented policies restricting access to opioids based on dosage or number of prescription fills. 20, 21 The measures we examine could offer valuable information that may augment existing approaches."}, {"section_title": "METHODS", "text": ""}, {"section_title": "Design and Cohort", "text": "This investigation was a longitudinal retrospective cohort study using PA Medicaid data from 2007 to 2012, a state with the eighth highest overdose rate in the United States and opioid prescribing above national averages. 1, 22 We obtained study data from the PA Department of Human Services. On the basis of Medicaid enrollment data, we excluded individuals from our cohort who were non-PA residents, were below 18, or were dual-eligible for Medicare (due to age above 64 or disability) because of inability to capture medication use. Using pharmacy claims, we then identified all individuals with a new prescription fill for Z1 oral, transdermal, or submucosal opioid medication. Using medical claims, we excluded patients with any cancer diagnosis and individuals receiving long-term care for Z90 days and/or hospice services (Fig. 1 , Supplemental Digital Content 1, http://links.lww.com/MLR/B318).\nGiven our goal was to identify whether the diagnosisbased abuse measure and/or utilization-based misuse measure predicted overdose, we constructed opioid treatment episodes based on initiation of opioid use rather than including all prevalent users. The index event was an opioid fill preceded by a 6-month period wherein patients had continuous enrollment in Medicaid. We also excluded those having any medical claims for opioid medication fills, diagnoses of opioid use disorders, or overdose during the 6 months before the index opioid prescription. We determined episodes would end when there was a 6-month gap between fills. A 6-month gap in fills to end episodes was selected given this timing follows previous conventions in behavioral health literature. 23 Furthermore, because our key independent variables (described below) require at least 6 months to accrue necessary opioid-related behaviors to begin to construct, a 6-month gap demarcates a reasonable end of the opioid exposure that could be used to identify these risks of interest. 24 Some enrollees had multiple opioid treatment episodes, and we included all episodes in our analyses meeting criteria (Fig. 2 , Supplemental Digital Content 1, http://links.lww.com/MLR/B318). This study was designated exempt by the University of Pittsburgh Institutional Review Board."}, {"section_title": "Variables", "text": "Our overdose outcome followed previously published methods for identifying prescription opioid overdose using International Classification of Disease, ninth edition (ICD-9) 25 codes in health claims data. 26 26 These codes were dichotomized, indicating patients had experienced an overdose or not (no overdose = 0, overdose = 1) during opioid treatment. Within the Medicaid claims data analyzed for this project, these codes capture: (1) nonfatal overdoses resulting in emergency department visits, hospitalization, or other medical care and (2) fatal overdoses resulting in emergency department visits or hospitalization. We do not, however, capture overdoses occurring outside of hospitals or other health care settings. Although evidence suggests for every fatal overdose there are 20-30 nonfatal events, 27 we cannot assess what proportion of overdose events are captured in our data.\nOur indicators of opioid overdose risk followed previously published conceptualizations. [16] [17] [18] The diagnosisbased indicator of abuse, called \"abuse\" hereafter, followed the White et al 16 Table 1 , Supplemental Digital Content 1, http://links.lww.com/MLR/ B318 for ICD-10 crosswalk) while possessing a prescription opioid medication were classified as positive for abuse (no abuse = 0, abuse = 1). Our use of the term \"abuse\" is not necessarily consistent with a clinical diagnosis using established criteria in the Diagnostic and Statistical Manual of Mental Disorders (DSM) but rather a construct used in the literature that can be discretely measured in administrative data. This current operationalization of abuse was modified slightly from the previously published in that poisoning codes were not included given their presence in the overdose outcome indicator (ie, ICD-9 965.00, 965.02, 965.09). To avoid including diagnoses of opioid use disorder recorded during an overdose event, we required opioid use disorder claims to be present Z7 days preceding overdose events (mean days between first abuse event and first overdose event was 297, SD = 293.2, results not shown).\nThe utilization-based misuse indicator, called \"misuse\" hereafter, followed Sullivan et al's 18 operationalization. This indicator is calculated by coding number of opioid prescribers (r2 prescribers = 0, 3-4 prescribers = 1,Z5 prescribers = 2), number of pharmacies used for medication filling (r2 pharmacies = 0, 3-4 pharmacies = 1,Z5 pharmacies = 2), days supplied of short-acting opioids, and days of supply of long-acting opioids (r185 d = 0, 186-240 d = 1, > 240 d = 2) over 6-month periods. Six-month periods were subsequently summated into 1-year periods, as in the previous study. 18 Total scores were divided into 3 categories: no misuse (0-1), possible misuse (2-4), and probable misuse (Z5). Our longitudinal design contains some episodes spanning multiple years and some patients having varying levels of no, possible, and probable misuse within a single continuous opioid treatment episode. Therefore, we assigned patients' highest individual misuse score within analyses for those with multiple misuse categorizations withinepisode. In addition, a quarter (n = 147,057) of patient records in our dataset had missing prescriber identification numbers for pharmacy claims. Therefore, we could not calculate the misuse indicator for these individuals (see Analysis section for methods of handling missing data).\nCategorical daily MME was included to compare its association with overdose to abuse and misuse given its prevalent use within the opioid medication overdose and nonmedical use literature. 5-12 MME was constructed by converting total within-episode opioid supply into morphine equivalents, dividing by days supplied, and coding into 4 levels (Z100 MME/d, 50-< 100 MME/d, 20-< 50 MME/d, < 20 MME/d). 28 Level of MME/day varied by individual across episodes.\nCovariates were measured in each person-episode's baseline period (ie, 6 mo before the index opioid fill) and included age (18-29, 30-39, 40-49, 50 -64 y), sex, race/ ethnicity (white, minority), initial Medicaid eligibility category (General Assistance, Supplemental Security Income, Temporary Assistance for Needy Families, Waiver) with some enrollees changing type within episode, Medicaid plan type (fee-for-service, managed care organization), and urban/ rural living location (Rural-Urban Continuum Codes 29, 30 ). We included measures of comorbidity as covariates ( Table 2 , Supplemental Digital Content 1, http://links.lww.com/MLR/ B318), including alcohol use disorders (abuse/dependence), nonopioid drug use disorders (abuse/dependence), individual mental health disorders (adjustment, anxiety, mood, personality, miscellaneous), individual pain diagnoses (back, neck, arthritis/joint, headache/migraine), and HIV/AIDS. 31 We likewise included a modified Elixhauser comorbidity index with conditions removed that were included as separate covariates. We also included methadone maintenance (procedure codes H0020/J1230), buprenorphine use (forms approved for opioid use disorder), benzodiazepine use, and muscle relaxant use. Methadone maintenance and buprenorphine use were captured in the periods following the index fill but before the overdose. We included having Z1 emergency department visits as a health services indicator. All covariates were categorical except the comorbidity index, which was a count measure, and age and length of episodes were ordinal."}, {"section_title": "Analyses", "text": "To summarize individual demographic and health indicators within our cohort, we calculated unduplicated patient-level univariable statistics. To report overdose, abuse, misuse, and MME/day, we calculated episode-level univariable statistics. To assess the relationship between overdose and (a) abuse, (b) misuse, and (c) MME/day, we estimated an episode-level generalized linear model with general estimating equation using log link function and Poisson distribution where follow-up time was treated as an offset term. 32 Overdose events were modeled as the dependent variable across time and abuse, misuse, and MME/day were included as independent variables-each occurring in time order before overdose. The general estimating equation allowed us to cluster episodes within patient, accounting for within person correlation. The exchangeable correlation matrix was used to account for SE correlation. To ease interpretation, we also report adjusted predicted rate of overdose events per person days for abuse, misuse, and MME/ day from the model. Analyses were conducted using SAS 9.4. 33 Mentioned above, prescriber identification number was missing for some cohort members not allowing us to create the misuse variable for these individuals. To account for this missing information and reduce bias associated therewith, we used the inverse probability weighting method. In the inverse probability weighting method, we first built a logistic regression model of nonmissing/missing prescriber identification number as the outcome variable, and abuse, misuse, and all other demographic/health indicators (listed above) as predicting covariates. For each patient with nonmissing prescriber identification number, a weight was then calculated as the inverse of the estimated probability from the fitted logistic regression. These weights were incorporated into the main overdose model. A nonweighted main overdose model (complete case analysis) was also fit for comparison. The results using these approaches were consistent. Table 1 displays cohort demographics measured at the patient-level (Table 3 , Supplemental Digital Content 1, http://links.lww.com/MLR/B318 for comorbid health condition summary statistics). A total of 372,347 Medicaid enrollees were included in our cohort. Individuals in the cohort had a mean of 1.6 (SD = 0.9) episodes, and the average follow-up days for individuals within episode was 488.5 (SD = 388.8. Table 3 , Supplemental Digital Content 1, http:// links.lww.com/MLR/B318). Table 2 displays episode-level results (N = 583,013) and unadjusted overdose prevalence. We detected 1270 (0.2%) total opioid overdose events across all opioid treatment episodes. Figure 1 displays the rate of overdose among patients by number of opioid treatment episodes, which ranged from 0.17% for patients with 1 episode up to 0.92% for those with Z7 episodes. Table 2 also displays unadjusted frequencies of abuse, misuse, and MME/day by overdose. We detected a total of 19,019 (3.3%) instances of abuse before overdose. The rate of opioid overdose was significantly higher among those with abuse (1.5%) compared with those without (0.2%, P < 0.001). A relatively small share of opioid treatment episodes were marked by misuse before overdose, with 2,880 (0.5%) having probable misuse and 20,893 (3.6%) with possible misuse (results not shown). Overdose was significantly higher among those with probable (1.8%) and possible (0.9%) misuse compared with those without (0.2%, P < 0.001)."}, {"section_title": "RESULTS", "text": ""}, {"section_title": "Descriptive and Univariable Results", "text": ""}, {"section_title": "Multivariable Results", "text": "In the multivariable model (Table 3) , the strongest opioid consumption overdose indicators were probable misuse [adjusted rate ratio (ARR), 1.98; 95%confidence interval (CI), 1.46-2.67) and possible misuse (ARR, 1.76; 95% CI, 1.48-2.09), compared with no misuse. Individuals who had opioid medication abuse had a 52% higher rate overdose (95% CI, 1.10-2.10) compared with those without. Consuming Z100 MME/day was associated with higher a rate overdose compared with those with <20 MME/day (ARR, 1.96; 95% CI, 1.36-2.83). Figure 2 reports adjusted rates for overdose per average person days (where 488.5 was the average number of follow-up days for subjects in the cohort). The predicted number of overdose events based on the multivariable results was 0.46 per average person days among those with abuse compared with 0.30 with no abuse. The rate of overdose was 0.48 among those with probable misuse and 0.43 among those with possible misuse, compared with 0.24 among those with no misuse. Individuals withZ100 MME/day had a predicted overdose rate of 0.59 compared with 0.29-0.37 for those at lower doses.\nIn addition, methadone agonist therapy claims (ARR, 1.89; 95% CI, 1.40-2.56) and having Z1 emergency department visits were associated with higher rates for overdose (ARR, 1.64; 95% CI, 1.40-1.92). Alcohol use disorders (ARR, 1.54; 95% CI, 1.22-1.94) and nonopioid drug use disorders (ARR, 1.52; 95% CI, 1.22-1.89) were associated with higher rates of overdose. Any benzodiazepine use (ARR, 1.42; 95% CI, 1.17-1.73), mood disorders (ARR, 1.31; 95% CI, 1.11-1.54), anxiety disorders (ARR, 1.28; 95% CI, 1.07-1.54), and any muscle relaxant use (ARR, 1.25; 95% CI, 1.02-1.53) were also associated with overdose."}, {"section_title": "DISCUSSION", "text": "Our results show these claims-based measures of nonmedical use of prescription opioids, abuse and misuse, were associated with some of the highest rates of overdoseeven when adjusted for exposure of daily opioid dosages (MME/day). No previous studies, to our knowledge, have examined abuse and misuse indicators as predictors of overdose, particularly in a longitudinal cohort. These potential risk factors constructed with claims data can be measured by payers to identify individuals at-risk for opioid overdose and potentially better differentiate patient from prescribing behavior compared with other measures, such as daily dosages."}, {"section_title": "Diagnosis-based Abuse and Utilization-based Misuse", "text": "One of the strongest indicators associated with overdose was abuse. Active management of opioid prescriptions among patients with opioid use disorders must be a continual priority for practitioners. [34] [35] [36] Health systems should actively identify these patients for intervention and referral.\nFurthermore, this measure requires less data to construct and is conceptually simpler than the misuse indicator and could be amenable to plan/programs seeking to use more easily implemented validated metrics of overdose risk.\nMisuse was also associated with overdose and has the potential to be valuable for health systems to monitor potentially modifiable behaviors and/or filling patterns. This indicator encompasses patient prescription seeking behaviors (eg, \"shopping\"), including number of prescribers and pharmacies where opioids were filled and long-acting and short-acting opioids. Prescription claims do not necessarily lead to consumption, and certainly, absence of a fill does not necessarily reflect lack of use. 19 Nevertheless, health systems (such as payers, prescription monitoring programs, which are active in nearly all US states) and pharmacy benefits managers could direct interventions at the components of the misuse indicator to reduce overdose risk. For example, systems could reduce or cap numbers of prescribers from whom patients receive medications or limit patients to filling prescriptions at a particular pharmacy through \"lock-in\" programs. 37 Promising data show success for these programs in reducing volume of medication prescribed, lowering costs, and increasing medication adherence. 38 Lock-in programs are recommended by the Centers for Medicare and Medicaid Services as possible tools for improving monitoring and reducing diversion. 39 Despite concerns in the field regarding restricting access to opioids for pain management, 40 recent research has documented most heroin users engaged in nonmedical use of prescription opioids before initiating heroin. 41, 42 This fact underscores the importance of better managing access to these medications to mitigate risk for transitioning from prescription opioids to heroin. It is important to note that despite the relationships evident between overdose and abuse and misuse, many opioid treatment episodes with overdose events did not have these conditions present. On a population level, these indicators can be important tools for health systems to identify overdose risk. Nevertheless, some individuals will not be identified using these metrics because, for instance, they obtain opioids outside the healthcare system, they have not been recognized as suffering from an opioid use disorder, or other reasons. To complement claims-based measures such as those we examine, additional data sources from electronic health record systems and other sources could be explored as this research continues. Given lags in claims submission ( > 6 mo for some health care providers), more \"real-time\" data from electronic health records and other sources could be examined to facilitate more rapid risk identification."}, {"section_title": "Other Risk Factors", "text": "Additional risk factors were identified in our analyses. The larger the number of opioid treatment episodes was associated with higher overdose rates. Health systems have the capability to monitor patients regularly going on and off of opioid medications. Moreover, concomitant prescriptions of other psychoactive/high abuse potential medications were associated with some of the highest odds for overdose compared with other covariates. Such prescribing practices should be the target of formulary management tools that, if triggered, would initiate system warnings, prior authorization, and/or medication review. We recognize, however, our design intentionally excluded previous overdose to create a clean baseline period. Given evidence showing that nonfatal overdose is a risk factor for subsequent overdose, 43 health systems may consider incorporating this information into surveillance systems.\nA number of other mental, behavioral, and physical health conditions were related to increased risk for overdose. The relationship between cooccurring health conditions and overdose has been documented previously 8, 44, 45 and calls for multidimensional monitoring by health systems."}, {"section_title": "Limitations", "text": "Our study has some important limitations. Despite advantages in our study, which include PA having high opioid use and overdose rates, 1,22 the PA Medicaid program being among the largest in the country, and these analyses containing both fee-for-service and managed care claims-46-48 the results herein represent 1 state in the northeastern US. Furthermore, Medicaid populations tend to predominantly consist of Temporary Assistance to Needy Families recipients. Thus, our findings may not generalize to other regions or populations. We note specifically that we lack prescription data on the elderly dually enrolled in Medicare. Furthermore, our overdose measure was based on ICD-9 codes from inpatient or emergency department claims. Therefore, we do not capture overdoses occurring outside of hospital. We also may both underestimate and overestimate misuse of prescription opioids using claims data because we are unable to measure diversion of opioid medications. Yet, the constellation of factors constituting the abuse and misuse indicators have been generally documented to be associated with unhealthy and problematic consumption patterns 5, 7, 8, [16] [17] [18] and warrant observation and possible scrutiny. We also recognize opioid use disorders are likely underdiagnosed and under-coded within claims. 49 Our claimsbased measures of medication use and diagnoses may have poor sensitivity and specificity due to the nature of substance abuse coding and prescription opioid diversion. Nevertheless, our findings show strong associations between several claims-based risk factors and overdose-a first step in establishing a paramount line of scientific inquiry. Prospective research should seek to further develop and refine overdose risk prediction tools. Finally, we acknowledge the association between overdose and methadone maintenance therapy in our findings (ARR, 1.89; 95% CI, 1.40-2.56). To examine the contribution methadone maintenance makes within the overdose outcome model, we removed this indicator and reestimated the model. The only substantive difference was the ARR between abuse and overdose increased from 1.52 (95% CI, 1.10-2.10) to 1.86 (95% CI, 1.38-2.50), suggesting some variance accounted for by abuse is shared by methadone maintenance. These results do not indicate engaging in methadone treatment is in itself a risk for overdose but may contribute to some degree. Our future research will seek to better understand this relationship to provide recommendations to the field on how to maximize safety and benefit for these individuals."}, {"section_title": "CONCLUSIONS", "text": "Health systems possess rich data resources with the potential to be used for enhancing national efforts in monitoring and targeting interventions against opioid overdose. Our findings indicate the importance of systems identifying those at-risk of overdose and working to implement policies and programs to protect patient health. Our findings should be replicated within other Medicaid and commercial plans, as well as they should be prospectively examined. Confirming these results would provide added support for systems to respond to urging from the White House to work and invest in integrating surveillance infrastructure into claims management systems. Indeed, the same technologies that pharmacists utilize to verify insurance benefits could be programmed with abuse and misuse indicators that would alert pharmacists at point of service. If patients' cumulative behaviors triggered misuse alerts, for instance, these could be followed with patient-focused medication therapy management interventions 50 and naloxone referrals. Payers similarly could regularly run abuse and misuse algorithms that once triggered would initiate system-level interventions (eg, lockin, prior authorization). Such efforts could help curb these behaviors and safeguard patient health."}]