[{"section_title": "Introduction", "text": "Today's agricultural borrower is anything but 'run of the mill'; farms differ in size, commodities produced, types of inputs used, etc. Often overlooked when characterizing a farm, is one important characteristic: the structure of the farm household itself. These characteristics are critical to understanding the customer base, segmenting the market, and tailoring different financial product and service offerings to different market segments. It is difficult for a lender to be \"all things to all people.\" Attempting to provide a wide variety of products and services to any and all potential buyers, in essence, forces the lender to compete with all potential providers and negates any competitive advantage the lender may have. Therefore, agricultural lenders increasingly recognize the importance of developing a marketing strategy that recognizes differences in customers and targets specific customer segments that can be efficiently and profitably served. Developing a customer-driven marketing strategy requires answering two fundamental questions: 1) who are our customers and what do they need? 2) do we want them? Question 2 is very lender specific and must be answered by each individual lender. Thus, we aim to outline who are today's agricultural lenders and their credit needs. Answering these questions requires more than just a general awareness of how to anticipate and respond to customers' needs. It requires an assessment of the different kinds of customers that might be served -the market segments that might be pursued. Historically, agricultural lenders have segmented the market based on location, farm enterprise, size, and/or risk of borrower. Moss et al. (1997) use other criteria to identify three potential market segments: (1) large, commercial-scale farms; (2) small, part-time, or recreational farms; (3) larger industrialized units involved in some degree of vertical coordination. Wheaton (2000) proposed a life cycle view of bank customers that focuses on the attrition rate of bank customers and the different products they demand based on their attrition rate. While these approaches are informative, agricultural lenders would further benefit from a typology of today's farm household that accounts for the resources available to the farm household. Through this typology, agricultural lenders will have a way to identify potentially overlooked customers because they did not meet the lenders' preconceived notion of who their customers are and/or should be. Therefore, the objective of this paper is to present and discuss the implications of a new classification system of agricultural borrowers that accounts for the resources and decisions made at the household level rather than the more commonplace methods of classifying farm households (e.g. farm sales). A dynamic household utility model serves as the foundation for this new typology. Using the 2003 Agricultural Resource Management Survey (ARMS), Briggeman (2006) used cluster analysis to identify six mutually exclusive groups of U.S. farm households. The six mutually exclusive groups are: Single Income Ruralpolitan, Double Income Ruralpolitan, Active Seniors, Farm Operator with Spouse Working Off Farm, Traditional Farms, and Commercial Farms. Single and Double Income Ruralpolitan operators primarily work off the farm. Spouses also work off the farm for Double Income Ruralpolitans. Operators in the Active Seniors group are the oldest among all groups and they still work on the farm. The next group, Farm Operator with Spouse Working Off Farm, has the operator working on the farm and spouse working off the farm. Both operator and spouse work on the farm for Traditional Farms. Commercial Farms has the largest value of farm assets with the operator working on the farm. These six groups comprise the U.S. Farm Household Typology."}, {"section_title": "Financial Characteristics of the U.S. Farm Household Typology", "text": "To aid in describing the diversity in a farm household's income stream, a new typology is necessary. This typology extends beyond the more commonplace segmentation of farms based on total sales; it considers the resources available to a farm household. The U.S. Farm Household Typology is a classification system of today's farms that is based on a farm household's use of its capital and labor resources. This classification system consists of six groups: Single Income Ruralpolitan (SIR), Double Income Ruralpolitan (DIR), Active Seniors (AS), Farm Operator with Spouse Working Off Farm (FOSOFF), Traditional Farm (TRAD), and Commercial Farm (COM). Before answering the questions proposed earlier, the financial characteristics of the U.S. Farm Household Typology are discussed. Figures 1 and 2 show the average of income and wealth sources, respectively, for each group in the U.S. Farm Household Typology. The income sources are household net farm income, off farm wages for the operator and spouse, and other off farm income which includes dividend earnings, interest earnings, social security, etc. The wealth sources are the value of farm and non-farm equity and the value of farm and non-farm debt. The sum of these sources or the sum of each bar in the graph represents total household assets for the respective segment."}, {"section_title": "The Ruralpolitan Segments", "text": "Ruralpolitans (SIR and DIR) are individuals who operate a farm but primarily work off the farm. Figure 1 shows that the average farm income for these two segments is negative, yet total household income is quite high for both segments. In the SIR segment, the operator primarily works off the farm, and the average SIR operator's off farm wages is the highest among all segments. The DIR segment has the highest total household income among all categories, largely because the operator and spouse both work and earn wages off the farm. Since these two segments represent 47% of all farms, agricultural lenders cannot afford to overlook them just because they are not the 'traditional' farm (i.e. operator and/or spouse primarily work on the farm). Ruralpolitan households are a substantial and potentially profitable customer segment for lenders. For example, a ruralpolitan household may be professionals who chose a rural lifestyle. These households are of special interest to agricultural lenders for multiple reasons. One reason is the need for not just a loan, but also management assistance concerning the entire farming operation. Here, the lender's agricultural expertise may be the competitive advantage that will get the business. Loan repayment is secured by the stable income stream from off farm sources. Another opportunity with these customers is the need for credit to purchase and improve the rural homestead. Many of these customers also need smaller scale modern equipment and livestock facilities for their farming or recreational activities. With the increasing trend of families moving from the city to the countryside, the ruralpolitan segments clearly cannot be overlooked or ignored. One could argue that the ruralpolitan segments, SIR and DIR, are not 'farms' because the individuals primarily work off the farm and therefore are not 'agricultural borrowers.' In other words, they more closely emulate a non-farm household as opposed to a farm household. Although they may not match the historical perspective of a farm, i.e. mom and dad working on the farm, they are a reality in today's agriculture and constitute a substantial portion of farm households today (47%). For agricultural lenders, an appealing opportunity exists with the ruralpolitan segment. Both SIR and DIR have an average farm equity that far exceeds the median non-farm household equity (figure 2). Coupling this large investment in farm assets and their stable income from off-farm sources, these groups have the capital and capacity to be a profitable and reliable customer for a lender. Also, these segments have the highest amount of diversification in their asset portfolio. SIR and DIR have an approximate fifty-fifty split between farm and non-farm assets while all other segments have more farm assets relative to their non-farm assets. By diversifying their investments along with their income, a high level of financial stability is present in the SIR and DIR groups and lenders would agree that this is a very appealing customer segment."}, {"section_title": "Mature Farmers", "text": "The AS segment constitutes 26% of all U.S. farm households, which makes them a large group of potential customers. This segment is the oldest group of the typology. Yet, nearly 50% of their total household income is earned on the farm (figure 1). Although most of these farm households are not actively seeking credit, they may be the 'gatekeepers' to potential customers. Some of these operators have a second generation decision-maker working on the farm. Developing a relationship with the AS group might open the gate to this younger generation and a prosperous relationship for both parties. This segment also may likely need deposit and retirement and asset management financial services. AS may or may not be actively seeking credit. If AS are not seeking credit, this does not mean they should be ignored. Figure 2 shows that this group has very low levels of debt and a high level of owner's equity. Given their wealth position and that this is the oldest group, providing asset management financial services including farm management as well as trust services and investment counseling are an important offering for this customer segment. Once a relationship has been established, a question to ask this new customer is their succession plan for the farm. If this succession plan does not include a second-generation decision maker, the farm may be rented, share cropped, and/or sold to someone in the community. This is a perfect opportunity to leverage the relationship with the retiring farmer and offer financial services and/or credit to this new operator."}, {"section_title": "Farmer Businessmen", "text": "The last segments (FOSOFF, TRAD, COM) have a larger amount of resources allocated to the farm business compared to the other categories. In general, these segments have a larger commitment to the farm and are trying to get the highest return out of their farm operation. This is evident from the fact that these segments have the highest household net farm income relative to all other categories. A particularly interesting group is the FOSOFF segments which represent 12% of farms. The operator in this segment primarily works on the farm, but the spouse is working off the farm. This segment is similar to the ruralpolitan segments because 73% of total household income comes from off farm sources (figure 1). Although these customers may not need agricultural expertise, the off farm income causes these farm households to not be as affected by fluctuations in farm income. For this reason, this segment includes a large number of profitable, low risk, and long term customers. The TRAD segment has both the operator and spouse working on the farm. The COM segment only has the operator working on the farm. These two segments have more than half of their total household income coming from farming (figure 1). Also, they are the primary producers of agricultural commodities in the U.S. Farm Household Typology. The TRAD and COM segments are the typical agricultural borrowers; however they only make up 15% of the farms. Even though they are the smallest segment in terms of number of customers, they devote a substantial amount of resources to agriculture and have the largest amount of agricultural loan volume. The farmer businessmen (FOSOFF, TRAD, COM) have substantial wealth --averaging almost three-quarters of a million dollars for FOSOFF, and up to in excess of two million dollars for COM. Figure 2 shows that their farm operation or farm assets make-up the largest portion of their investments. These segments are making investment decisions relative to where they receive the highest return possible. Also, the farmer businessmen have an average farm debt-toasset ratio that is less than 14%. With this low amount of farm debt and a commitment to increasing the return from their farming operation, providing credit to these segments should clearly be a profitable endeavor for both parties. For these customers effectively using debt is a way to grow the farm business, and the progressive lender has the opportunity to provide other financial and investment products as well. Since the FOSOFF has off farm income and a substantial investment in the farm, they are a segment that agricultural lenders should actively pursue. They have off-farm income that mitigates the fluctuations in farm income and a commitment to agriculture as noted by their farm equity. TRAD and COM represent only 15% of the entire U.S. farm household population, but they have the largest amount of farm debt of all segments."}, {"section_title": "Implications of the U.S. Farm Household Typology for Agricultural Lenders", "text": "A customer-driven marketing strategy is increasingly critical for the successful agricultural lender. The U.S. Farm Household Typology provides a framework to develop a customer-driven marketing strategy that is focused and effective. Earlier we discussed the different customer segments in the typology relative to their income and wealth. Now we focus on a critical question that, when answered, will move agricultural lenders to developing their own customerdriven marketing strategy based on their market -who are our customers and what do they want? Table 1 summarizes some of the key characteristics and business needs of the ruralpolitans (single income and double income) and the retiring segment. The ruralpolitan segments are appealing customers because of the stable off farm income, and the double income segment is especially appealing given they have the largest amount of off farm income among all segments."}, {"section_title": "Ruralpolitans and Retiring Segments", "text": "Ruralpolitans either work off the farm to support their farm business, enjoy the lifestyle of farming, or are a farm investor. In the first case, it may be difficult for a lender to approve a loan solely supported by the farm business because the off farm employment is so engrained within the financial position of the entire farm household that the two support each other. This off farm employment ranges from an hourly-wage job to owning and/or operating a non-farm business. Therefore, one must be cognizant of this additional delineation when assessing the credit needs and characteristics of the Ruralpolitan segments. In essence, the non farm business may complement or compete with the farm business for financial and labor and management resources. Should an agricultural lender provide credit to the non-farm business knowing this will impact the farm business, i.e. potentially allow the farm business to continue to be viable? And what if credit is provided to the farm business -will it be siphoned off to finance or expand the non farm business? These are questions each lender must answer based on their comfort level in dealing with non-agricultural credits. However, it is possible that by providing credit to the non-farm business, the lender is supporting the farm business and, in a broader sense, the rural community as a whole. If credit is provided to the non-farm business, then the lender is exposed to a different set of credit and collateral risks. Assume a SIR operator owns and operates a local retail farm supply store. She works till midafternoon at the store and then spends the rest of her time on the farm. The store supplements the farming operation's cash flow needs and has produced a profit each year for the last 15 years. This example highlights an important issue for an agricultural lender -fungibility of non-farm business profits and farm business cash flows. If an agricultural lender provides credit to the retail store, will this credit benefit the farm (i.e. reduce cash flow pressures)? Also, if the nonfarm business is secured as collateral, will the farm take too much away from the store diminishing its collateral value? These questions and example highlight the importance of an agricultural lender conducting due diligence in all loan applications. Table 1 further summarizes some of the key characteristics and business needs of the three major farm business segments: FOSO, TRAD, and COM. Note that the different segments have different credit needs, different market potential, unique risks, and different collateral vulnerabilities. This summary is focused on the credit or loan product/service offering there are likely different financial products and services including cash management, asset management and insurance offerings that may be attractive to different customer segments as well."}, {"section_title": "The Farm Businessmen", "text": "The credit needs between the farm business segments are similar except for the new venture expansion of COM. These farm households, due in large part to their large amount of household net worth, are looking to expand. This directly impacts the increasing market potential for this group as well. COM, along with FOSO, are growing in numbers. In general, the numbers of TRAD or mom and dad working on the farm are decreasing. Some of these farms are being purchased by COM but others are not selling the farm but the spouse is now working off the farm and thus switching to the FOSO segment. Another potential 'switch' of TRAD is to the \"ruralpolitan\" or retiring segments. This of course depends on the availability of off farm employment, the desire and/or necessity, capability, and/or age of TRAD in making this switch. These potential switches are for discussion only and each agricultural lender should assess their own market and the potential of growth or decline in their market. Independent producers or the non-COM segments have relatively traditional credit needs and can be evaluated with familiar credit and risk analysis tools and techniques. In contrast, integrated and industrialized producers or COM may have not only different credit needs (for example, they may need funds to expand a distribution system or build a processing plant), but the traditional criteria for evaluating liquidity, solvency, and other credit or collateral risks may be impractical. Psychographic analysis, which evaluates the specific buying behavior of the customer and what drives his/her buying decisions (product attributes, quality, price, service, brand, information, convenience) is now being used by progressive agricultural lenders to better understand customer decisions and segment the agricultural loan market."}, {"section_title": "Conclusions", "text": "This research is the beginning of the discussion relative to the implications of the U.S. Farm Household Typology relative to today's agricultural borrower. This typology is a new approach in identifying a customer driven marketing strategy. The income and wealth sources of each segment were discussed and the credit needs and characteristics were discussed which demonstrate how a lender might pursue these different segments. Further analysis will consider econometric modeling relative to credit use by each group. The farming sector is increasingly becoming more fragmented with no \"typical\" farm borrower. The successful agricultural lender of the future will recognize the importance of segmenting the customer base, understanding the habits and purchasing behaviors of the various segments and providing appropriate product/service /information offerings to each segment. 26% 26% 21% 12% 7% 8% -$10,000 $0 $10,000 $20,000 $30,000 $40,000 $50,000 $60,000 $70,000 $80,000 $90,000  "}]