[{"section_title": "Abstract", "text": "This chapter provides a review on satellite remote sensing of tropical cyclones (TCs). Applications of satellite remote sensing from geostationary (GEO) and low earth orbital (LEO) platforms, especially from passive microwave (PMW) sensors, are focused on TC detection, structure, and intensity analysis as well as precipitation patterns. The impacts of satellite remote sensing on TC forecasts are discussed with respect to helping reduce the TC's track and intensity forecast errors. Finally, the multisatellite-sensor data fusion technique is explained as the best way to automatically monitor and track the global TC's position, structure, and intensity."}, {"section_title": "Introduction", "text": "The tropical cyclone (TC) is among the most severe weather systems, with the potential for catastrophic damage to human lives, society, transportation, properties, etc. For example, Hurricane Katrina during August 23-31, 2005 with a maximum wind speed of 280 km/hr impacted most of south-east US regions and landed in the Greater New Orleans. It is the costliest hurricane in US history which killed an estimated 1245-1836 people and caused damages of $149 billion [1, 2] . Hurricane Sandy during October 22-November 2, 2012 had a maximum sustained wind speed of 185 km/hr. It led to the death of 233 people and damages of $75 billion [1, 2] . Severe TCs can attain very strong wind speeds greater than 260 km/hr and bring heavy precipitation. Most TC damage is caused by the force of its strong wind and flash flooding. TCs normally initiate over tropical oceans with Sea surface temperature (SST) >26°C to a depth of 60 meter and weak vertical wind shears [3, 4] . It can intensify rapidly under favored environmental conditions. Because a TC's life span is mostly far away from land, remote sensing-especially the satellite remote sensing-is the only way to detect and monitor global TC activities. The television infrared observation satellite (TIROS) launched on April 1, 1960 was the first experimental project of the satellite's feasibility for study of the Earth [5] . It was the first satellite used for TC monitoring and tracking [6] . The geostationary operational environmental satellite (GOES) is the key element of the United States' weather monitoring and forecasting [7] . It can be used for weather forecasting, severe storm tracking, and meteorological research. Figure 2 shows the first images of GOES-1 at 1645 GMT on October 25, 1975. The advantages of geostationary satellites (GEO) are frequent observations over a large domain. Other countries such as China, Europe, South Korea, and Japan have their own meteorological satellite programs for improving weather monitoring and forecasting. The advanced sensors onboard operational geostationary satellites such as Japanese Himawari-8 and US upcoming GOES-R will be more powerful for providing measurements at more channels with higher spatial resolutions and more observing frequencies [7, 8] . Low Earth orbit (LEO) polar orbital satellites provide observations over a location only twice per day. However, they can measure the 3-D meteorological conditions needed for improving weather forecasts and monitoring. Especially for TC monitoring and forecasts, conical scan PMW sensors onboard the near-circular Sun-synchronous and near-polar orbital satellites are extremely important and widely applied in operations. This conical scan pattern of PMW measurements provides for a consistent spatial resolution which is crucial in analysis of TC detection, intensity, structure, and monitoring [9, 10] . The first Special Sensor Microwave Imager (SSM/I) onboard the US defense meteorological satellite program (DMSP)-F8 was launched on June 18, 1987 [11] . Its predecessor was the scanning multichannel microwave radiometer (SMMR), which was on the Seasat and Nimbus 7 satellites launched in 1978 [12] . SSM/I was later evolved into the Special Sensor Microwave Imager Sounder (SSMIS), which provides additional measurements such as atmospheric temperature and moisture profiles [13] . The first SSMIS (F16) was launched on October 18, 2003, while the latest SSMIS (F19) was launched on April 3, 2014.\nOther similar PMW sensors commonly used for TC monitoring and forecasts are the Advanced Microwave Scanning Radiometer-EOS (AMSR-E) onboard Aqua satellite and its following on the Advanced Microwave Scanning Radiometer 2 (AMSR-2) onboard the Global Change Observation Mission 1st-Water (GCOM-W1) [14, 15] [17] [18] [19] . These PMW sensors are critical in satellite-based rainfall retrievals [20] that are utilized in TC precipitation observations and forecasts [21] . Section 2 discusses TC detections from satellite observations, while Sections 3 and 4 describe analysis of TC structure and intensity with satellite remote sensing. Section 5 is about TC rainfall while Section 6 discusses the impacts of satellite remote sensing on improving TC forecasts. Global TC monitoring and tracking with multi-satellite sensors are discussed in Section 7. Section 8 presents a brief summary of history, applications, and impacts of satellite remote sensing on TC structure, intensity, forecast, and monitoring."}, {"section_title": "Identification of TC using satellite measurements", "text": "The TC is a highly organized weather system which can be easily detected by satellite observations. The deep clouds of TCs are shown in GEO Infrared (IR) measurements as low temperatures compared with cloud-free or thin cloudy areas because the IR sensors can only detect the cloud top without measuring anything underneath it, while the satellite Visible (VIS) observations show high values of reflectivity because of the clouds' high albedo. The GEO satellite is an ideal platform to detect TC activities because of its frequent measurements every 30 minutes, and even 10 minutes for next generation GEO sensors such as the Japanese Himawari-8 and the upcoming US GOES-R sensors. Due to the unique TC eyewall feature, it is easy to identify the position and lifecycle of a well-developed TC because of its apparent eye location where cloud-free or thin clouds exist. Figure 3 presents an example of observations over West Pacific from Himawari-8 IR. It is apparent that two typhoons (Goni and Atsani) are clearly displayed at 1800 UTC August 18, 2015.\nThere are limitations in satellite IR/VIS observations at early stages of storm development when its center is not obvious or overcast. The widely used analysis method for satellite remote sensing of TC is called the Dvorak technique [22] . It is based on combinations of the enhanced IR image analysis and detection of cloud shapes at different stages of storm development. Applications of the LEO satellite PMW remote sensing lead to large improvements in TC's detection in terms of structure, location, and intensity because of the PMW sensor's superior spatial resolution and sensitivity of cloud vertical profiles due to its capability to penetrate clouds. The PMW imagery at high-frequency channels shows a depletion of brightness temperatures (T B s) over deep cloud areas where the scattering effects of frozen hydrometeors on microwave radiance exist. Figure 4 presents an example of the multi-sensor combined four panels of IR/VIS and PMW high-frequency channel imagery for Typhoon Mindulle over west Pacific at 1800Z of June 26, 2004 from Naval Research Laboratory-Monterey (NRL-MRY) TC web page at http://www.nrlmry.navy.mil/TC.html. This kind of multi-panel display is used for a better analysis of the TC intensity, position, and structure. The upper-left panel is the GOES IR image, while the upper-right panel is the enhanced IR image (VIS imagery is used in daytime when it is available) with the Dvorak method for improved TC analysis. For this TC case, the overcast blocks a good view of the TC center from IR observations. The enhanced image is better in displaying the potential TC center, but is still not able to show the TC eyewall and [23] . It can provide additional information of the TC cloud patterns important to TC's overall structure and organization, especially for a potential low-level circulation center. Therefore, this multisensor-panel imagery can be applied for better analysis of these important TC characteristics such as eyewall development, formation of concentric eyewall, convective zones and cells, rain band formation, central dense overcast, shear, and low-level center."}, {"section_title": "TC structure analysis", "text": "Soon after the first satellite weather observations became available, routine TC intensity studies from this imagery began [23] . Determining the TC's center position was the only reliably produced operational use of TC satellite analysis until the influential work of Dvorak [22] in 1972. Dvorak developed an empirical model to diagnose TC intensity based on cloud organization in the visible channel. Factors that affected strength of the storm were accounted by structural features such as magnitude of the brightness, temperatures, and curvature of the banding or distortion of the cloud pattern. A flowchart of rules in the Dvorak method was created to consistently generate subjective estimates of TC intensity from the structural cues in satellite imagery. Dvorak refined his method with time to incorporate additional rules and constrictions as well as use of infrared channels, aiming to improve the accuracy and reduce subjectivity of the technique.\nThe Dvorak technique continues as a critical part of operational analysis today. It is still the most common method to diagnose TC intensity, with further attempts at intensity analysis heavily borrowing for this work's legacy. Some efforts continue to hone the technique's accuracy, such as updating the wind-pressure relationship used to define the intensity [24] . The application and customization of Dvorak analysis worldwide described in [23] help demonstrate its versatility and robustness as a tool for TC forecasting. Efforts to make the process more objective led to the creation of a fully automated TC intensity analysis [25] , which itself continues to have updates as the Advanced Dvorak Technique (ADT) [26] .\nBeyond the Dvorak technique, there are several other methods to diagnose TC structure and intensity from infrared and visible channels. The correlations between infrared T B s and operational storm size metrics (i.e., radius of maximum winds (RMW), and radii of the 34-, 50-, and 64-kt winds) were presented in 2007 [27] . A similar use of infrared imagery to resolve TC sizes, as defined by the radius of the 5-kt 850 hPa wind, that relate to the TC lifecycle were studied [28] . A statistical analysis of the distribution of temperatures with respect to TC axisymmetry (the deviation angle variance technique) continues to show great promise in not only diagnosing structure, but also helping with TC centering, genesis, and intensity [29] .\nAnother potential relationship between TC intensity and structure changes can be seen by differencing the GEO water vapor and infrared channels [30] . This methodology leverages information in each channel (due to the weighting function representing different altitudes and chemical profiles) to emphasize specific structural features such as overshooting convective tops. Finally, there are efforts to relate the rotational speed of IR and visible cloud tops about the TC center to the intensity of major typhoons in the northwestern Pacific basin [31] .\nBesides the traditional infrared and visible channels, other remote sensing frequencies have proven useful for observing TCs. The use of satellite active microwave radars (scatterometers) to estimate storm size and intensity via surface wind analysis has been very beneficial to operational efforts at the National Hurricane Center (NHC) [32] . Scatterometers transmit pulses that bounce off the ocean surface; the backscatter's variability due to wind roughening enables retrievals of the surface wind vector estimates. QuikSCAT scatterometer data were used to derive climatology of storm sizes at the 23 kt radius as well as an outer radius using a wind structure model [33] . Similar studies were done to create a QuikSCAT climatology of storm sizes for the 34-kt radius and outer-core strength (OCS) intensity [34] [35] [36] . TC structure and intensity are also investigated using other satellite sensor datasets such as the TRMM precipitation radar (PR) and TMI in tandem with lightning flash density to compare differences in frequency thresholds between regions of the TC [37] . The synthetic aperture radar (SAR) was used to visualize extremely small mesoscale details of TC and subjectively catalogue characteristics of the eye, including spatial area, shape, and wavenumber [38] . SAR TC retrievals are currently poorly tied to physical processes and the radar retrievals from space occur infrequently, while passive microwave can directly characterize TC structure by penetrating non-raining cloud tops, unlike in the visible and infrared channels [39] .\nWhile the ultimate purpose and mechanism of the TC eye formation remain uncertain, there are many characteristic modes associated with TC eye. In general, due to dynamical considerations of the eyewall, the TC eye tends to get smaller. Eventually, a new outer eyewall may form and produce an outer eye that encompasses the previous smaller eye. In rare cases of an extremely intense and compact TC, a \"pinhole\" eye will form [27] . In some other cases, a large and stable eye with multiple embedded meso-vorticies can form [40, 41] . The TC eye shape is not always circular, as polygonal eyewalls seem to be due to vorticity instability [42, 43] . Recent observations show eye-like features developing in the lower troposphere before being observed in the upper troposphere [44] .\nThe strongest vertical motion in TCs was found just inward of the RMW [45, 46] . In addition, the eyewall tended to slope outward with height due to the TC warm core. The TC intensity and eyewall slope relationship shows a great deal of case-to-case variability [47] . Due to this slope, the updraft itself was also tilted so that most of the falling hydrometeors in the eyewall (and thus the radar reflectivity maximum) lie outside the RMW [46] . The high-resolution airborne Doppler radar was recently used to update and extend these results [48, 49] . Regions of the TC core, defined by normalization with respect to the RMW, are shown to exhibit modes of radar reflectivity, convergence/divergence, and vorticity that correspond to the previously cited work; particularly, there is an outer peak in upper-level divergence and low-level convergence that occurs in the vicinity of secondary eyewall formation.\nThe nature of TC convection occurring in spiral bands was not known until their first observations on radar [50] . However, the TC spiral band was quantitatively and qualitatively characterized shortly thereafter [51, 52] . A logarithmic spiral based on radar observations was introduced to start at an inner radial circle (i.e., the inner-core or eyewall) rather than the center itself [51] . An analysis of the logarithmic spiral length has been quite useful in diagnosing intensity [22] . The idea that low-latitude TCs have lower spiral crossing angles than higher latitude storms possibly due to storm motion was also introduced [51] . The TC spiral bands propagate outward [52] , while some rain bands actually propagate inward when taking into account storm motion [53] . In general, there may be three types of spiral bands based on movement: stationary (non-propagating), apparent propagation (stationary with respect to the TC center), and intrinsic propagation [50] . These structural characteristics are summarized in Figure 5 for a well-organized double eyewall TC. The inner eyewall, outer eyewall, principal convective band, and secondary convective band are clearly presented with radar reflectivity (Figure 5a ). The stratiform precipitation occurs largely in the moat areas. These unique TC features are clearly captured by the PMW sensor's measurements at high-frequency channels as shown in Figure 4 . The TC's tilted updraft at the eyewall, forced descent air at the eye, lower level inflow and upper level outflow, brightband associated with stratiform precipitation as well as mesoscale updraft (downdraft) above (below) the brightband are demonstrated in Figure 5b . Detailed TC vertical temperature profiles can also be observed by PMW sensors. Figure 6 shows cross section of the AMSU-retrieved temperature anomalies through hurricane Bonnie at 1200 UTC August 25, 1998. The TC warm core near 250 hPa and the vertical temperature profiles match well with observations. Thus, this unique warm core feature can be applied for TC intensity estimates discussed in the next section. "}, {"section_title": "TC intensity estimation", "text": "Generally, there are two types of available polar-orbiting microwave sensors: imagers and sounders. The microwave imagers typically consist of sensors with frequencies that measure surface properties as well as organization of various water phases in the atmosphere. The microwave sounders aim to provide profiles of atmospheric thermal structure and moisture estimates. Depending on the mission goals of a particular sensor, there can be overlap between available channels of a microwave imager and sounder. Attempts to diagnose TC structure and intensity from microwave sounders occurred shortly after the first sounder was launched [54] . Although the coarse resolution of sounders has traditionally created an analysis barrier due to smoothing over the storm features, the more advanced sensors such as AMSU are starting to resolve the magnitude of thermal anomalies as well as core/eye size more faithfully [19, 55] . Figure 7 presents the AMSU-retrieved temperature anomaly distributions at 4000 ft at different stages of Hurricane Rita during 18-21 September, 2015. It clearly shows increased amplitude of the unique TC upper level warm core feature corresponding well with intensification of the hurricane intensity. Multiple linear regressions of the AMSU channels also can estimate features such as maximum sustained wind (MSW), minimum sea level pressure (MSLP), and wind radii at the 34-, 50-, and 64-kt thresholds [56] . Use of AMSU data as part of an ensemble shows great promise for more accurate TC structure retrieval; a combination of the ADT and two different AMSU intensity estimates makes up the satellite consensus (SATCON) method of TC intensity estimation [57] , which has the highest skill of all satellite-based intensity estimation methods [58] . A comparison of the TC sustained 1 minute wind estimates from different techniques is displayed for an example storm in Figure 8 . It demonstrates that the PMW sensor-based measurements can be used to accurately estimate the TC intensity. Although every method with individual PMW sensor in general agrees with each other, differences are still obvious. Results indicate that SATCON performs well against the TC's best track dataset. These techniques have been continuously evolved to create a better sounder TC intensity algorithm with new sensors such as SSMIS and ATMS, which have improved spatial resolution to depict the TC's warm core [18] . To contrast, microwave imagers have a more recent appearance in TC analysis, with perhaps more potential for added value. The near real-time access to digital microwave imagery was the largest impediment near the turn of the millennium [39] , in which authors describe efforts at NRL-MRY to provide near real-time access to high-resolution TC images, and to support a temporal return frequency favorable for operational TC forecasting. A more detailed discussion about the utility of microwave imagers indicated that despite the ability to create the PMW-derived physical quantities (e.g., sea surface wind magnitude, precipitable water, and cloud liquid water) using multiple frequencies which utilize different spatial resolutions, they smooth over important structural features of the TC [59] . These features include a TB depression at the high frequency channel (85, 89 or 91 GHz) due to ice scattering and lower frequencies such as 37 GHz principally showing liquid hydrometeor emissions near and below the freezing level. Both of these previously mentioned channels are measured at horizontal (H) and vertical (V) polarizations. Near the interface of the outer TC and the environment, interpretations at either polarization become muddled due to multiple competing influences (e.g., water vapor, cloud water, and sea surface). The polarization correction temperature (PCT) can improve the representation of atmospheric features, allowing them to stand out from surface background [60] .\nDespite its relatively new arrival, some progresses are apparent in using microwave imagers to examine tropical cyclones. For example, the NHC extensively uses microwave imagery to better locate a TC center and subjectively diagnose changes in structure [32] . The Morphed Integrated Microwave Imagery at CIMSS (MIMIC), a technique to create \"morphed\" animations of passive microwave imagery using an advection function between satellite passes, was introduced to allow a visually appealing depiction of TC structure changes [61] . Other studies also revealed relationship between microwave imager data to TC intensity [62, 63] . The microwave data have been used to improve TC intensity estimates through early detection of a forming eyewall [64] , while a color composite of the H-pol, V-pol, and PCT data at 37 GHz developed at NRL-MRY has shown particular promise in diagnosing TC inner core formation [39] . A symmetrical and closed T B threshold (\"cyan ring\") was applied to predict the TC onset rapid intensification [44] .\nSome efforts focused on cataloging TCs through an extended climatology of microwave imagers. The microwave data interpolated onto an 8-km grid in the hurricane satellite (HURSAT) archive was created in 2008 [65] . The HURSAT-microwave consists of data from the SSM/I platforms between 1987 and 2009, using global best track data from the International Best Track Archive for Climate Stewardship (IBTrACS) to search for TCs [24] . Based on this dataset, the TCs composited by their intensification rate and environmental wind shear were analyzed to compare microwave signatures during different intensity regimes [66] . Recently, a new study on eyewall size estimates using the HURSAT-microwave data compared to the aircraft reconnaissance measurements demonstrates the similarity of in-situ and satellitederived structural profiles [67] . A more advanced TC PMW TB database at 1 km spatial resolution has been developed at NRL-MRY from all available PMW sensors in 1987-2012 with more consistent inter-calibrated TBs at 89 GHz, better eye fixing, and high quality interpolation scheme [68, 69] ."}, {"section_title": "TC precipitation", "text": "One of the typical phenomena of TC activities is heavy rainfall, which is also one of the most significant impacts of TCs. The tremendous precipitation from TCs often leads to loss of lives and properties. Flooding from landfall TCs over United States is the leading cause of death related to severe storms [70] . However, TC precipitation can also bring in major economic benefits to areas surrounding its path. Based on the long-term TRMM rainfall measurements, over 84% of continental convective rainfall is contributed from rain intensity > 5 mm h -1 [71] ."}, {"section_title": "Recent Developments in Tropical Cyclone Dynamics, Prediction, and Detection", "text": "Analysis of the numerical weather prediction (NWP) model rainfall forecasts indicates TC precipitation could contribute 15-17% of the total annual rainfall over broad latitude zones [72] . TC rainfall can contribute up to 15% of total precipitation over a hurricane season in Carolinas of United States [73] . Therefore, even precipitation from one TC activities could ease the stress of drought over some areas. A good review of TC rainfall's structure, intensity, and forecasts was recently reported [21] .\nRain retrievals from advanced algorithms based on PMW measurements over ocean have been proven accurate and reliable [74] [75] [76] [77] . The satellite-derived instantaneous rain patterns over TCs clearly show the heavy rainfall is normally located in TC eyewall and spiral convective areas. In general, the intensity and pattern of TC precipitation are strongly associated with the TC intensity and radial distance to eyewall [78] .\nThe maximum rainfall appears in the TC eyewall around less than 50 km radii and the rainfall intensity rapidly reduces with increase of its radii. Rain intensity is about 13 mm h The asymmetry of TC precipitation is a prominent feature. It shows different characteristics depending on what matric is applied. Figure 9 presents the TC rainfall asymmetry patterns relative to its motion direction as a function of storm intensity based on 3 years' TRMM TMI rain retrievals [78] . For all storms and tropical storms, their maximum rain intensity is in the front quadrants of TC movement. The location of maximum rain intensity shifts from the frontleft for CAT1-2 to front-right quadrants for CAT3-5. Thus, the asymmetry of TC rainfall is linked with the TC intensity, especially for strong TCs. In addition, the asymmetry has a property of strong dependence on TC geographic locations. Maximum rainfall appears in front quadrants over WP while in front-right quadrants over AT. Maximum rainfall shifts to the front-left quadrants over SH. Over EP and IO, it is located in the front quadrants with a cyclonical pattern.\nA recent study based on TRMM rain datasets for landfall TCs over different parts of China presents various rainfall patterns relative to TC's motion at different times of landfall [79] . Maximum rainfall is located in the left quadrants for TCs landed in Guangdong province and Taiwan, while in the front-left quadrants for TCs landed in Hainan and Fujian provinces. Maximum rainfall is generally located in the back-right quadrants for TCs landed in Zhejiang province. However, maximum rainfall is generally positioned in the front quadrants of TCs relative to its vertical wind shear vector (Figure 10) , although there is still a slight difference in rainfall distribution between different areas. This feature is an important finding because it has a potential application for improving TC rainfall forecasts.\nWhat are the possible causes for the asymmetric distribution of TC precipitation? Several known factors are associated with this asymmetry feature, such as the advection of planetary vorticity, vertical wind shear, and friction-induced boundary layer convergence [80, 81] . The maximum rainfall in the front-quadrants of TC motion indicates the role of friction-induced boundary layer convergence. Higher TC moving speed leads to strong rain intensity in its front quadrants [78] , while its dependence on geographic locations shows importance of the TC's ambient wind influence. The improved consistence of rainfall asymmetry relative to its vertical wind shear for the landfall TCs over China further indicates the role of interaction between TC and its environmental forcing. However, this feature needs more verification studies over other TC basins and its connections to amplitudes of the vertical wind shear.\nA better prediction of the TC rainfall distribution is the ultimate goal of efforts in mitigating TC's rainfall impacts on society, life, and property. Several methods have been developed for operational TC rainfall forecasts. A popular one is the Tropical Rainfall Potential (TRaP) which is based on the satellite rainfall estimates, persistence of TC intensity, and satellite-derived wind vector [19, 82] .\nwhere R av is the mean rainrate along a line in the direction of TC motion, D is the distance of that line across the TC rain area, and V is the TC's actual speed. Accurate satellite rain retrievals and satellite wind vectors as well as its easy implementation have made this method popular Another method is the rainfall climatology and persistence (R-CLIPER) model which is a parametric model utilized with the TC rainfall climatology from satellite measurements [85] . This method assumes a circularly symmetric distribution of rainfall and its rainfall is translated in time. Although it accounts for TC intensity and moving speed, it does not include the TC's unique asymmetry rainfall patterns. An improved method called the parametric hurricane rainfall model (PHRaM) was introduced to incorporate with the TC rainfall asymmetry feature by including the azimuthal Fourier decomposition for shear and a term indicating the topographical uplift [86] . Results show that PHRaM is improved significantly compared with the standard R-CLIPER. A new parametric model was recently developed for including more factors such as TC motion speed and intensity, vertical wind shear, and typical features of the TC boundary layer [87] .\nAll the above-mentioned methods have one common assumption of the correct satellite rainfall retrievals. Although satellite-derived precipitation from PMW sensors is very accurate over ocean, there are still relatively large errors over land [75, 88] . Some discrepancies exist among satellite rain datasets, especially with different satellite sensors and retrieval algorithms. In order to minimize errors from different rain retrieval algorithms for different sensors, the physical-based inversion rain algorithm (GPROF) used in TRMM and GPM is also applied for other PMW sensors [77] . Thus, precipitation from different PMW sensors will be more consistent. The new NASA integrated multi-satellite retrievals for GPM (IMERG) is based on these consistent PMW rain retrievals and calibrated IR-based rainfall so that it will produce a higher quality precipitation data [20] . The high quality satellite rainfall will be used to generate a better TC rain climatology. In addition, precipitation has a strong diurnal cycle property [89] [90] [91] and there is also a clear diurnal feature in TC lifecycle [92] . These diurnal properties could also be utilized in improving TC rain forecasts in the near future. However, the best TC rain forecast should come from future advanced cloud-revolving models which could predict not only TC intensity and track, but also rain distributions at different spatial scales."}, {"section_title": "Impacts of satellite remote sensing on TC forecasts", "text": "The NWP models are used at major weather operation centers to provide regular 7-day weather forecasts. The prediction skills have been consistently improving about one day per decade in last several decades with advances in NWP model developments, application of more satellite observations, and high-performance computing power [93] . Especially after global satellite observations are applied in the NWP data assimilations, the NWP skills are proven very accurate for 3-day forecast, highly accurate for 5-day forecasts and very useful for 7-day forecasts for both northern and southern hemispheres. Modern NWP models even show skill for extended forecast beyond 10 days and up to months. The advanced climate models could provide seasonal and longer time predictions with various confidence levels [94] .\nAccurate predictions of TC genesis, intensity, and track are crucial for preparation and mitigation of TC's impacts. The forecast skills of global NWP models were always superior in the northern hemisphere than the southern hemisphere until 1999 when global satellite measurements were successfully assimilated so that difference of the prediction skills between northern and southern hemispheres diminished [93, 95] . The role of satellite observations in NWP forecast skills is normally assessed by the observing system experiments (OSEs) in which denying or adding a set of satellite data is applied from or to a baseline observing system in order to show its impacts on the forecast skills [96] [97] [98] . The famous example of the impacts of satellite observations on the NWP forecast skills is the accurate prediction of Hurricane Sandy's left (westward) turn to make landfall on the New Jersey coast for 7-8 days in advance by the European Center for Medium-Range Weather Forecasts (ECMWF) [99] . The OSE analyses show that the storm's landfall would be reasonable without observations from geostationary satellites; however, the prediction would not be very useful for 4-5 days before its landfall without measurements from polar-orbital satellites assimilated into the system. Figure 11 presents a comparison of the predicted Hurricane Sandy's positions before its landfall with and without the polar-orbital satellites. It clearly proves that the storm's intensity and position were accurate with the LEO satellite data, while its intensity would be weak and its position offshore without satellite data assimilations. Figure 11 . This image uses the model output from the ECMWF experiments, showing where Sandy was predicted to be located 5-days out with the normal satellite data inputs into the model (left) and without any polar-orbiting satellite data (right). Both position and intensity forecasts were affected-Sandy stays out to sea without the polar-orbiting satellite data, and the closer isobar lines encircling the storm also imply a more organized and stronger system (adapted from NOAA at http://www.noaanews.noaa.gov/stories2012/20121211_poesandsandy.html).\nMore accurate forecasts of TC's intensity and track will have to come from the cloud-resolving models such as the NOAA hurricane weather research and forecasting (HWRF) system and the NRL-MRY Coupled Ocean/Atmosphere Mesoscale Prediction System for Tropical Cyclones (COAMPS-TC) because of the TC's strong intensity and small spatial size. Thus, a high spatial resolution is required in making accurate TC simulations and predictions. The error trends of the TC's track forecasts have been consistently and significantly reduced in last few decades, while improvements on error trends of the TC's intensity forecasts are not so great [100] . Figure 12 is an example of the error trends of the National Hurricane Center (NHC) TC official track and intensity forecasts over the Atlantic basin. It demonstrates that the TC track forecast errors are substantially decreased (>50%) from the 1990s to 2014, especially for 4-5 day forecasts. The track error is only around 35, 60, 80, 140, and 190 nm for 24, 48, 72, 96, and 120 hr forecasts, respectively. The track forecast skill increased from about 10% in 1990 to 70% in 2014. However, a decrease of the TC intensity forecast error is very small at 24 hr, small at 48 and 72 hr, while substantial at 96 and 120 hr. The associated TC intensity forecast skill also increases accordingly. Therefore, the TC intensity forecast skill has improved slightly; however, these improvements are still statistically significant [101, 102] .\nAlthough improvement on the TC's intensity forecast is relatively small compared with the TC track forecast, accuracy of the TC intensity forecast is obviously improved since 2001 when more satellite observations have been systematically properly applied in NWP simulations. One of the important developments is to directly assimilate satellite observations into the cloud-resolving models. For example, a recent study indicates that introduction of the ATMS data into the HWRF system has significant impacts on forecasts of hurricane intensity and track [103] . Four landfall Atlantic hurricanes (Beryl, Debby, Isaac, and Sandy) in 2012 were investigated using two sets of comparisons of four experiments: CTRL1 is for assimilations of the conventional data, GPS RO data and ASCAT surface winds; CRTL1 + ATMS is for CRTL1 plus additional ATMS data; CRTL2 is for experiment setting of CRTL1 plus additional AMSU-A, AIRS and HIRS data; CRTL2+ATMS is for CRTL2 plus additional ATMS data. Results show a reduced bias of TC track for CRTL2 than CRTL1 so that impacts of the polar-orbital satellite data on TC track are further validated. The assimilation of additional ATMS data further reduced the bias of TC tracks and intensity as well as increased its lead time of forecasting. Figure 13 presents the combined comparison results on track errors and standard deviations of the four TC forecasts between CRTL2 and CRTL2 + ATMS. The track errors are similar because of the abundant polar-satellite measurements, while the errors of maximum wind speed (V max ) and minimum center pressure (P c ) are significantly reduced. Although the standard deviation of track forecast is slightly large mainly due to the deteriorated Debby track forecasts, the overall V max and P c errors are obviously reduced.\nThe COAMPS-TC system developed at NRL-MRY has been transitioned to operations for realtime TC forecasts for several hurricane seasons at a spatial resolution of 5 km and systematically evaluated for large samples of TC forecasts over Atlantic and West Pacific basins [104] . Results demonstrate the accurate predictions of TC track and intensity, as well as the sea surface temperature cooling response to the storm, indicating the capability of the COAMPS-TC system to realistically capture characteristics of the ocean surface waves and their interactions with boundary layers above and below the ocean surface. There are more satellite measurements than what are actually assimilated into the models. Proper utilization of satellite data with positive impacts on forecast skills still requires more investigations and validations."}, {"section_title": "Multi-sensor-based TC monitoring and tracking", "text": "Observation from the LEO satellite PMW sensors is the best way for detection and monitoring of the global TC activities. Figure 14 is an example of total orbits of GPM GMI observations at 89 GHz horizontal polarization on March 31, 2014. It is obvious that there are good coverages at high latitudes at daily scale, but there are large gaps in tropical and mid-latitudes. Therefore, multi-PMW sensors are required to have a reasonable coverage to monitor and track the global TC activities. Six PMW sensors could generally provide at least one measurement over a location every 3 hr. However, the high frequency channel of the PMW sensors onboard GHz-H for a 2014 typhoon Rammasun to display its structure, intensity, development, and tracking. ARCHER is used to find the TC centers while the multi-sensor calibration scheme is applied to generate the unified T B s at 89 GHz. In addition, the Backus-Gilbert interpolation scheme is utilized in providing high spatial resolution PMW T B images [108] . The 4° × 4° boxes centered at the TC eye positions from all PMW sensors are extracted and overplayed into one image to exhibit a summary overview of the TC structure, intensity, and tracking during its lifecycle. It clearly shows evaluations of TC's key characteristics for purposes of a global TC monitoring and tracking. This new live TC tracking imagery will be added into the NRL-MRY TC web page in the near future. "}, {"section_title": "Summary", "text": "TC is one of the most destructive weather phenomena. It is initiated in tropical oceans and has a lifecycle mostly over water surface with unique horizontal characteristics of eyewall, spiral convective zones, and a vertical warm core. Satellite remote sensing is the only way to provide complete observation and monitoring of the global TC activities. The GEO IR/VIS is very useful in monitoring TC activities but not in providing accurate estimates of the TC center locations and intensity. The LEO PMW sensors are better suited for detecting TC genesis, development, and structures because of their ability to measure the atmospheric profiles. TC structure and intensity can be estimated from the PMW measurements.\nHeavy precipitation is another important feature of TC activities. The abundance of TC rainfall is crucial to the drought-impacted regions because even one TC precipitation process could lead to significant relief to the severe drought situation. However, the large amount of rainfall from TC activities is also one of TC's impacts for loss of human lives and property damages. The asymmetric property of TC rainfall makes it hard to predict TC rainfall distribution. Although accurate rainfall retrievals from PMV sensors and the modern TC rainfall prediction schemes have led to reasonable TC rain forecasts, a more consistent TC rainfall from various PMW sensors and the TC diurnal characteristics are required to make further advances in TC rainfall forecasts.\nSatellite remote sensing is very important in improving TC forecasts with the data assimilation process. The near real-time measurements of accurate atmospheric conditions from LEO and GEO sensors are used to improve the NWP model's initial conditions and to minimize the innovation error for better forecasts. The LEO PMW sounding sensors are especially critical in improving weather forecasts because of their ability to provide accurate atmospheric temperature and humidity profiles. The TC track forecast errors have been gradually and substantially reduced in past decades with the improved NWP models and the data assimilation schemes. Although deduction of the TC intensity forecast errors is also statistically significant, the amplitude of its improvements is much smaller than that for the TC track forecast errors. Future efforts on optimum selections of the combined satellite sensor channels which have positive impacts and better data assimilation methods are necessary in addition to improvements in the next generation NWP models and developments as well as future advanced satellite sensors onboard adequate satellites for better spatial and temporal global coverage.\nData fusion from multi-satellite sensors is the only way to provide a global coverage of TC activities. The LEO PMW sensors have advantages in high spatial resolution for TC structures, accurate TC positions, intensity analysis, and precipitation distributions, but they lack in temporal observations because each polar-orbital satellite could provide measurements only twice over a location per day. The LEO IR/VIS sensors have advantages in frequent observations of TC activities, but they lack in accurate TC eye positions, intensity analysis, and horizontal structures. ARCHER is an advanced algorithm in fixing the TC center positions from both PMW and IR/VIS sensors in near real-time with high confidence. The ARCHER track provides excellent TC positions for monitoring of TC activities and initialization in model TC data assimilation processes. The TC live track from PMW sensors will display evolutions of TC structures and intensity for purposes of better monitoring and forecasts."}]