[{"section_title": "Abstract", "text": "This study investigates which factors may influence producers' use of irrigation technologies and/or water management practices (WMPs). One major finding is that Arkansas producers are more likely to rely on WMPs instead of sprinkler irrigation as a response to changes in depth to water and drought occurrences. This finding highlights the importance of expanding the existing literature that focuses mostly on more efficient irrigation technologies, especially in areas where WMPs are more prevalent. Climate factors also play a role. Sprinkler systems are more prevalent in regions with lower average temperature. WMPs are used to mitigate the impact of more frequent droughts."}, {"section_title": "Introduction", "text": "The availability of water has become a limiting factor for agricultural production in many parts of the world (United Nations World Water Assessment Programme, 2 Q I U Q I O N G H UA N G E T A L . 2015). In the United States, agricultural irrigation accounts for the majority of consumptive water use (Schaible and Aillery, 2012) . Switching to more efficient irrigation technologies has often been proposed as a solution to declining water supplies. For example, sprinklers such as center pivot and drip irrigation could reduce irrigation application rates per unit of land relative to gravity irrigation by distributing water more evenly, reducing percolation below the root zone, and eliminating runoff (Negri and Hanchar, 1989) , although they may not lower total farm-level water use or achieve real water savings in terms of reductions in consumptive water use (Pfeiffer and Lin, 2014) . Most existing studies have focused on the switch from traditional gravity irrigation to center pivot or drip irrigation and have identified a set of economic factors, farm and producer characteristics, technology-specific factors, and institutional factors. Economic factors such as crop prices and input prices (e.g., water price) often play a role in technology choices. Physical conditions of farm sites, such as size and land quality, are often associated with irrigation technology adoption (e.g., Caswell and Zilberman, 1986; Negri and Brooks, 1990; Shrestha and Gopalakrishnan, 1993) . Sources of water supply (surface water or groundwater) also matter (Carey and Zilberman, 2002) . Producer characteristics, such as age and education, are often linked with irrigation adoption decisions (Koundouri, Nauges, and Tzouvelekas, 2006; Olen, Wu, and Langpap, 2016) . Technological traits, in particular, installation costs, are also investigated and are found relevant in producers' choice among available technologies (Moreno and Sunding, 2005) . Existing studies further suggest institutional factors, such as land tenure, could play a role (Moreno and Sunding, 2005; Soule, Tegene, and Wiebe, 2000) . The roles of information dissemination, uncertainty, and irreversibility in technology choice are also increasingly stressed (Carey and Zilberman, 2002; Koundouri, Nauges, and Tzouvelekas, 2006) .\nThe focus on more efficient irrigation technologies, however, may miss important aspects in producers' behavior. In addition to more efficient irrigation technology, a wide range of water management practices (WMPs) could also play a substantial role in water conservation because many available practices could improve the performance of existing irrigation systems (Schaible and Aillery, 2012) . Sophisticated irrigation scheduling practices, such as soil or plant moisture-sensing devices and computer simulation models, can help producers decide when and how to irrigate, which can reduce water application rate or use the same amount of water to address crop demand more effectively (Schaible and Aillery, 2012) . Practices such as laser leveling, shortening of furrow length, and alternate row irrigation are designed to improve distributional uniformity. Tailwater recovery pits are used to capture and store rainfall runoff prior to the irrigation season and irrigation runoff during the irrigation season to reuse water (Negri and Brooks, 1990) . WMPs have proved effective in reducing water use in some areas (Negri and Hanchar, 1989; Schaible and Aillery, 2012; Waskom, 1994) ."}, {"section_title": "Irrigation Techniques and WMPs 3", "text": "WMPs and irrigation technologies could also synergize each other, and their joint use could greatly enhance the adaptability of irrigated agriculture to the changes in water supplies. Government agencies such as the Natural Resources Conservation Service (NRCS) are increasingly looking at a system approach in promoting on-farm water conservation practices that emphasizes improvements to multiple aspects of an irrigation system (e.g., irrigation, conveyance, and water storage/recovery) (Sullivan and Delp, 2012) . For example, soybean producers can combine center pivot systems with soil moisture sensors to produce the same or better yields with much less water. Without switching to more efficient irrigation technology, a rice producer can augment water supply by building a tailwater pit to capture water released from flooded fields and reuse it for future irrigation. The producer can further reduce water use by improving irrigation uniformity with land leveling. These possibilities speak directly to the potential merits of including WMPs in analysis of producers' adoption behaviors.\nAmong the factors that could influence irrigation technology choices, climatic factors have received increasing but still rather limited attention. This lack of focus is surprising because climate variations could affect irrigated agriculture in multiple ways. Changes in temperature and precipitation may affect crop irrigation demand both in terms of quantity and timing, as well as supply of water for irrigation (e.g., Elliot et al., 2014; Schewe et al., 2014; Schlenker, Hanemann, and Fisher, 2007) . These changes will also have direct impacts on water supplies in areas that rely on rainfall or other sources of surface water for irrigation. Areas using groundwater may also be affected. For example, the major source of irrigation water in Arkansas is groundwater supply. More than 60% of the state's water supply comes from groundwater in the Mississippi River Valley (MRV) alluvial aquifer (U.S. Geological Survey, 2008) . Groundwater stock is affected by the variability in annual precipitation because it is partly recharged by rainwater in addition to the rivers (Czarnecki and Schrader, 2013) . Available evidence suggests that future climate change may lead to increased variability in precipitation and temperature and higher probabilities of extreme events such as droughts and floods (Hall, Stuntz, and Abrams, 2008; Rosegrant, Ringler, and Zhu, 2014) . Irrigation technologies and WMPs could help producers adapt to a production environment characterized by more volatile climate conditions, and thus, climatic factors may play a role in their decisions to use these practices (Joyce et al., 2011) .\nAmong the existing studies that have examined the influence of climatic factors on irrigation technology choices, the focus has been on average climate conditions such as average temperature and total precipitation (Finkel and Nir, 1983; Frisvold and Deva, 2013; Negri and Brooks, 1990; Olen, Wu, and Langpap, 2016; Schoengold and Sunding, 2014) . These measures, however, do not capture variations in climate factors. For example, extremely hot days in one month followed by abnormally cold days in another month barely alter the average annual temperature. However, the shifts in temperature may generate at https:/www.cambridge.org/core/terms. https://doi.org/10.1017/aae.2017.3 large production losses. Lambert (2014) found that deviations in temperature and precipitation from a farm's long-term average had significant effect on farm production in Kansas. The observed effect may be because farmers only plan production for average weather conditions (Lambert, 2014) . There is evidence that the use of irrigation technology may be more sensitive to extreme events, such as droughts or sudden spikes in energy prices, rather than average climate conditions (Carey and Zilberman, 2002; Negri et al., 2005; Zilberman et al., 1995) . The explanation is that the hurdle rate of adopting more efficient irrigation technologies may be so high that widespread adoption only occurs when such extreme events drive returns of investments sufficiently above their costs. Therefore, it is important to include measures of climatic variations and extreme events when analyzing producers' decisions of using irrigation technologies and/or WMPs. The study by Koundouri, Nauges, and Tzouvelekas (2006) is among the few articles that have incorporated such measures in examining irrigation technology choices.\nThis study investigates which factors have predictive powers of producers' use of irrigation technologies and/or WMPs. Our contributions are twofold. First, we model the joint choices of irrigation technologies and/or WMPs. By providing a relatively more complete picture of irrigation practices, this article is a significant addition to the existing literature that focuses mostly on more efficient irrigation technologies. Such knowledge is indispensable in helping policy makers design policies that consider all available tools to conserve water. Only a few studies (e.g., Negri and Brooks, 1990) have done so. Second, this article examines whether historical variations in climatic factors have any predictive powers of producers' choices of irrigation technologies and/or WMPs. In addition to average climate conditions, such as mean daily temperature and total precipitation, a moment-based approach is used to measure expected climate risks such as volatility and the likelihood of extreme events. In an alternative specification, specific extreme events such as the frequency of drought and the share of intensive rainfall are used. These measures enable us to study producers' responses to different aspects of climate variations.\nThe rest of our article is organized as follows. Section 2 describes the study site and data sets used. Section 3 discusses the empirical specification and variable construction. Section 4 reports estimation results, and Section 5 concludes with policy implications from our findings."}, {"section_title": "Study Site and Data Description", "text": "This study focuses on the state of Arkansas. The climate of Arkansas is humid subtropical. The average temperature is around 60°F, with a wide range from winter lows around 0°F to summer highs above 100°F (Arkansas Natural Resources Commission [ANRC], 2015a). Temperatures in Arkansas can vary largely within short periods, owing to the interaction between the competing Irrigation Techniques and WMPs 5 air masses of warm air from the Gulf of Mexico toward the Great Plains and cool air flowing over the Rocky Mountains. Average precipitation in the state ranges from 43 to 69 inches per year (ANRC, 2015a). The spikes of precipitation in Arkansas occur from March to May and from October to December (ANRC, 2015a), which do not align well with the growing seasons of the major crops (April-September/October). Row crop production occurs mostly in eastern Arkansas (Watkins, 2012) . From late spring through early summer, most precipitation in eastern Arkansas falls as scattered thunderstorms, which is often insufficient for crop production (ANRC, 2015a). Based on data from National Oceanic and Atmospheric Administration (NOAA), Borengasser (2014) observed that the climate of Arkansas between 1895 and 2013 was characterized by considerable year-to-year variability in both temperature and precipitation. Temperature per century has only increased slightly; in contrast, the average annual temperature varied from 58°F to 63.6°F (Borengasser, 2014) . The warming trend was more pronounced between 1973 and 2013, with an increment of 4.7°F per century (Borengasser, 2014) . Between 1895 and 2013, although statewide annual precipitation increased at the rate of 3.11 inches per century, summer precipitation declined at a rate of 1.2 inches per century (Borengasser, 2014) . There have been increased frequencies of extreme events, such as heavy rainfall, ice storms, lightning, and tornadoes (Office of the Arkansas State Climatologist, 2014). The literature review conducted by the Arkansas Governor's Commission on Global Warming (2008) indicates that the state should anticipate increased incidence of severe weather events, flooding, and drought in the coming decades.\nArkansas is the largest producer of rice in the nation (U.S. Department of Agriculture [USDA], Economic Research Service, 2015). Other major crops include cotton, soybean, corn, and wheat. These major crops take up between 55% and 66% of the total acreage (Table 1) . Arkansas's agriculture is heavily irrigated. Its irrigated acreage ranks fourth nationwide (Schaible and Aillery, 2012) . The share of total acreage that is irrigated has remained 100% for rice and has been on the rise for other major crops, such as soybean and corn (Table 1) . For example, the share of soybean that is irrigated rose sharply from 25.9% in 1992 to 65.4% in 2008. The continuous and unsustainable pumping of groundwater has put the MRV aquifer in danger. A number of counties in east Arkansas have been designated as critical groundwater areas because of the continued decline in groundwater levels (Arkansas Soil and Water Conservation Commission, 2003) . Irrigation water that used to be readily accessible by producers is now markedly diminished. For example, pumping in Arkansas County decreased between 2000 and 2008 because producers were unable to withdraw as much water as they would like from the alluvial aquifer (Czarnecki and Schrader, 2013 ). An annual gap in groundwater as large as 7 million acre-feet is projected for 2050 (ANRC, 2015b). In the focus groups conducted by the authors in November 2014 with producers from east Arkansas, the decline in groundwater supply was ranked among the top concerns.\nThere are several studies in the United States related to economics of aquifer water level and its impact on agriculture. For example, both theoretical and empirical studies have analyzed various policy options to conserve groundwater in the Ogallala Aquifer (Amosson et al., 2009; Johnson et al., 2009 Johnson et al., , 2011 Wang, Park, and Jin, 2016; Wheeler et al., 2008) . However, despite the fact that irrigated agriculture is an important part of the economy of Arkansas, few economic studies are available to support policy makers in designing Arkansas policies to address a decreasing groundwater supply and increasing climate variations. The critical initiatives identified in the 2014 Arkansas Water Plan Update highlight adopting conservation measures that can improve on-farm application efficiency and infrastructure-based solutions (such as tailwater pits) that convert more irrigated acres currently supplied by groundwater to surface water in eastern Arkansas (ANRC, 2015b) . As such, the study of irrigation technology and WMPs is of particular importance to the region.\nThe main data set that forms the empirical basis of the article is the Farm and Ranch Irrigation Survey (FRIS) and Census of Agriculture collected by the U.S. Department of Agriculture. It is a set of repeated cross-sectional data collected in multiple years. We used 1998 We used , 2003 We used , and 2008 rounds in the analysis. The 1988 and 1994 data are excluded because information on several key variables, such as the change in depth to water in wells, participation in government programs, and number of irrigation information sources, was not collected in these rounds of the FRIS survey. The FRIS sample is drawn from the population of all farms identified in the Census of Agriculture (USDA, National Agricultural Statistics Service, 2010). For example, the sample of producers for the 2008 FRIS survey is drawn from the 2007 Census of Agriculture. A stratified sampling process was used for each state where farms were stratified based on total irrigated acres. In each state, some farms were selected with probability 1 to make sure the major irrigators in each state were included. It is arguably the most comprehensive data on irrigation. It contains information on the use of irrigation technologies on a crop-specific basis. It also has information on a range of WMPs. The FRIS data set is supplemented with several secondary data sets. County-level climate data such as daily precipitation and temperature are obtained from NOAA, National Climatic Data Center (2016). To measure soil quality, the average saturated hydraulic conductivity (K sat ) is extracted from the Soil Survey Geographic Database (USDA-NRCS, Soil Survey Staff, 2014). The values of K sat are adjusted to approximate 10% of the estimated K sat based on the soil surface texture of the soil mapping unit in each county (Saxton et al., 1986) . The adjusted K sat values are assumed to reasonably represent the ability of unsaturated soil to transmit water over the course of 1 year."}, {"section_title": "Empirical Specification", "text": "Following most technology adoption studies that use discrete choice models (e.g., Green and Sunding, 1997; Negri and Brooks, 1990; Schoengold and Sunding, 2014) , the propensity of producer i to choose technology/WMP package j for crop k is an unobserved latent variable that is linear in climate variables contained in the vector C and a set of control variables contained in the vector Z:\nwhere ε ijk is an unobserved random component that is often assumed to follow the logistic distribution. The observed producer choice, y ijk , equals 1 if y* ikj > 0 and equals 0 if y* ikj ≤ 0. Two forms of y ijk are used. The first is similar to those used in most existing studies. A dummy variable is used that equals 1 if the sprinklers are used to irrigate a given crop and 0 if gravity irrigation is used. In Arkansas, the main irrigation method for all major crops is still gravity irrigation, which includes both furrow and flood irrigation. For soybean, corn, and cotton, more than 80% of gravity-irrigated area uses poly-pipe or lay-flat tubing system. The most common gravity irrigation system used for rice is the portal-or ditch-gate system (more than 57% of gravity-irrigated area). In 2008, 97.2% of rice farms irrigated rice using a gravity system (Table 2 ). For all other major crops, more than 60% of the farms used gravity irrigation, and producers that used sprinklers were still in the minority. Between 1994 and 2008, the share of soybean producers using sprinkler irrigation had increased slightly from 11% to 14.6%. The use of sprinklers has declined among corn producers. The share of corn farms that used sprinklers dropped from 34.5% in 1994 to 14.3% in 2008. The same declining trend is also observed among cotton producers. However, the rates of use also fluctuate over years. For example, the share of soybean farms using sprinkler at https:/www.cambridge.org/core/terms. https://doi.org/10.1017/aae.2017.3 irrigation increased from 11% in 1994 to 15% in 1998. It dropped to 11.2% in 2003 and then went back to 14.6% in 2008. In our sample area, most irrigated acres under a sprinkler system are irrigated using center pivots. Because y ijk is a binary variable in this specification, we use a logistic regression model to estimate model parameters. As a robustness check, we also use a conditional logistic regression model, which allows us to add county and year fixed effects. Economic factors such as commodity prices, costs of inputs, and the costs of implementing the improved irrigation technology are also found to affect choices of irrigation technology (Buller and Williams, 1990; Dridi and Khanna, 2005) . However, because these factors do not vary much across space within the same county, their effects can be largely captured by the county fixed effects and year dummies.\nThe second form of the dependent variable reflects the fact that producers often do not just choose among different irrigation technologies; they consider other WMPs, too. Gravity irrigation is prevalent in the region. WMPs such as laser leveling and tailwater pits are often combined with gravity irrigation (and usually not with sprinklers) (Schaible and Aillery, 2012) . The FRIS data also show that even though most producers rely on gravity irrigation, about half of the producers also use one or more WMPs to improve existing gravity systems (Table 3 ). In 2008, laser leveling and tailwater pits were the most commonly used practices. Among the farms with a gravity irrigation system, 24.4% used laser leveling and 20.8% had tailwater pits on-farm. Alternative row irrigation was also commonly used (13.6%). Similar to the use of sprinkler irrigation, the rates of WMP use also fluctuates over years. For example, although the share of farms that used tailwater pits increased from 16.2% in 1994 to 20.8% in 2008, it dropped in 1998 and 2003 . Because the majority of farms use more than one WMP and only WMPs used under a gravity system are asked in the FRIS survey, we have put all WMPs into one group. Therefore, the dependent variable measures one of three choices: (1) gravity irrigation without any WMPs, (2) gravity irrigation with one or more WMPs, and (3) sprinkler irrigation. The joint choices of irrigation technologies and WMPs are estimated using the method of multinomial logit. Irrigation Techniques and WMPs 9 In both specifications, the following control variables are included in the vector Z: (1) years of experience on farm; (2) farm size; (3) the percentage of land rented or leased in from others; (4) crop diversity that is measured by the number of crop categories produced on a farm (grain crops, cash crops, fruits and vegetables, fodder crops); (5) cost of water calculated as farmlevel groundwater energy cost; (6) the percentage of acres that is irrigated by groundwater; (7) a dummy variable that equals 1 if depth to water in wells increased in the last 5 years; (8) the percentage of farms in the same county that participated in government programs, including programs that offer financial and/or technical assistance; (9) the number of irrigation information sources on which a producer relies; and (10) a continuous measure of soil permeability, the average saturated hydraulic conductivity (K sat ) in units of micrometers per second. A higher K sat value corresponds to higher soil permeability 1 . Although slope has been identified in the literature as an important factor, it is not included because the study site is located in the Mississippi River Delta region with flat floodplain landform. Because the use of irrigation technologies and/or WMPs (the dependent variables) would affect the decision to participate in government programs that offer financial and/or technical assistance during the same year, the lagged variable is used that measures the share of farmers in the county that participated in any government programs. In most specifications, average marginal effects are reported."}, {"section_title": "Constructing Climate Risk Variables", "text": "It is important to capture climate volatility and extremes in addition to average climate conditions because climate change is more likely to manifest in these aspects. One approach is to use the moments of the probability distribution of climatic factors to characterize climate risks. Moment-based measures of risks have been used in production economics where fluctuations in weather dominate production risks (Antle, 1983; Antle and Goodger, 1984) . The use of first (mean) and second (variance) moments has become standard in the risk literature. The third moment (skewness) can be used to measure exposure to upside or downside risk, often when extreme values only occur in one end of the distribution. For the distribution of yields or profits in the range of negative values, a lower value of skewness means greater exposure to downside risk (e.g., Kim and Chavas, 2003) . The forth moment (kurtosis) captures the likelihood of experiencing extreme profit/output values (e.g., Koundouri, Nauges, and Tzouvelekas, 2006) . Recent studies have associated production risk with agricultural technology adoption decisions (e.g., Kassie, Yesuf, and Köhlin, 2009; Koundouri, Nauges, and Tzouvelekas, 2006) . Koundouri, Nauges, and Tzouvelekas (2006) find that the probability of adopting irrigation technology is negatively associated with the probability of facing extreme profit values, as measured by the kurtosis of the profit distribution. Kassie, Yesuf, and Köhlin (2009) find that the adoption of fertilizer is significantly affected by the variance and skewness of return in addition to the mean expected return.\nWe apply the moment-based approach and construct climate risk measures using the higher-order moments. Using the daily temperature and total precipitation over the previous 30 years, variance is used to measure the volatility in temperature and precipitation. For example, for variables that come from the 2008 FRIS survey, temperature and precipitation data over the period from 1978 to 2007 are used. The length of 30 years is used in many previous studies that examine the impact of or adaptations to climate change. For example, Burke and Emerick (2016) measure long-run trends in climate over the period 1980-2000 and examine adaptation to climate change in U.S. agriculture. From the producers' point of view, it is reasonable to treat 30 years as a long-run time horizon. For example, to gauge farmers' perceptions of climate change, Di Falco, Veronesi, and Yesuf (2011) use a question that asks whether farmers have noticed changes in mean temperature and rainfall over the last two decades. We use coefficient of variation (CV) instead of variance to make it unit free. CV is the ratio of the standard deviation to the mean. For all the FRIS survey years, the CVs of mean daily temperature during the previous 30 years are all above 0.1 (Table 4 ). This is consistent with the variations over years observed in Figure 1 . The standard deviations of CVs, which give a sense of the variations in CVs across counties, range between 0.012 and 0.015. The small standard deviations are expected because only a small geographic region is studied (one state); therefore, Irrigation Techniques and WMPs 11 spatial variations in climate factors are limited. However, the magnitudes of the standard deviations are about 10% of the magnitudes of CVs, so they are not near zero. The CVs of total precipitation are slightly higher than that of daily temperature. The standard deviations are also around 10% of the magnitudes of CVs. Skewness measures are also constructed. The distribution of daily temperature in all counties is skewed to the left (negative skewness; Figure 1 and Table 4 ). Therefore, an increase in the value of skewness means reduced exposure to extremely low temperature (a less negative skewness). The distribution of the total precipitation in growing season is skewed to the right (positive skewness) in most counties (Figure 2) . Then, an increase in the value of skewness means increased exposure to extremely large rainfall. In some counties, negative skewness is observed. In these counties, an increase in the value of skewness means reduced exposure to extremely low temperatures. For both temperature and precipitation, skewness and kurtosis measures are highly correlated, so kurtosis is not used. These past climate risk measures are used to reflect producers' expectations of future climate risks, which may affect their choices of irrigation technologies and WMPs.\nIn addition to moments, we also construct climate variables that capture specific events. Negri et al. (2005) and Groisman, Knight, and Karl (2012) argue that daily precipitation more than 1 inch is detrimental to crop growth. Therefore, we use the share of days in the growing season when precipitation exceeds 1 inch to measure the frequency of excessive precipitation events (Bell, Sloan, and Snyder, 2004) . The potential of severe drought is another climate risk measure used. Computation is based on the NOAA-Dai database, provided by Earth System Research Laboratory, Physical Sciences Division (2014). Specifically, we use the Palmer Drought Severity Index (PDSI) where a monthly index below −3 is generally considered as severe drought (National Integrated Drought Information System, 2014; Palmer, 1965) . PDSIs of months in the growing seasons are used to construct the share of years that experienced severe droughts. Other measures, such as frost-free days, are also considered but not included in the final specification because they are less relevant in the context of Arkansas, as they do not vary much across years in Arkansas. This speciation also includes mean daily temperature and total precipitation."}, {"section_title": "Empirical Results", "text": "In line with existing literature, we model the binary choice between sprinkler and gravity systems (Table 5 ). In the binary choice model, farms that use gravity systems and farms that combine gravity with WMPs are grouped together. Table 6 separates these two groups and estimates a multinomial logit model. Test fails to reject the assumption of independence of irrelevant alternatives. We use the Small-Hsiao test: the P value for the alternative gravity irrigation with one or more WMPs is 0.468, and the P value for the alternative sprinkler irrigation is 0.207. So, there is no evidence against the validity of a multinomial logit model. Two specifications of climate variables are run: specification 1 uses momentbased measures, and specification 2 examines specific climate events, including the share of rainy days with intensive precipitation and the percent of years with severe droughts. The types of crops grown are important in determining irrigation technologies because water requirements are crop specific and different irrigation systems may work differently for different crops. Many previous studies have treated crop choices as exogenous factors in analyzing the choices of irrigation technologies (e.g., Green and Sunding, 1997; Green et al., 1996; Shrestha and Gopalakrishnan, 1993) . In the context of Arkansas, this approach makes sense because there were no major changes in the types of field crops grown in the region during the span of the data (Table 1) . Therefore, we have run both specifications on a crop-by-crop basis and, thus, are modeling technology choices conditional on crop choices. For Table 5 , we have run both specifications with county fixed effects (conditional logit regressions) and without county fixed at https:/www.cambridge.org/core/terms. https://doi.org/10.1017/aae.2017.3 191 1,191 1,191 1,191 1,191 1,191 Notes: Standard errors not reported for the sake of brevity. Asterisks (*, **, and ***) indicate significance at 10%, 5%, and 1% levels, respectively. The following variables are interacted with farm size: all temperature and precipitation measures; soil permeability (K sat ). All temperature and precipitation measures are calculated as the average of previous 30 years and only within growing seasons.\nIrrigation Techniques and WMPs 17 effects (logit regressions). The results do not vary sharply between the logit regressions and the conditional logit regressions in terms of the signs, levels of statistical significance, and magnitudes of estimated coefficients. The results from logit regression for soybean are reported in Table 5 .\nThe results on which factors may influence the likelihood of using sprinkler irrigation are largely consistent between Tables 5 and 6. The estimated coefficients of most variables have the same signs and similar magnitudes and levels of statistical significance. Both Tables 5 and 6 show that sprinkler irrigation is more likely to be observed on larger farms. The estimated coefficient of farm size is positive and statistically significant. Given the requirement of large capital investments, larger farms are more likely to enjoy economies of scale. They are also more likely to have access to more credit for capital investment. The same positive relationship between farm size and sprinkler usage has been observed in other states (e.g., Schuck et al., 2005) . It usually requires more labor to irrigate larger farms, which may also push the switch to sprinkler irrigation, which is less labor intensive. The estimated coefficient of cost of water is positive but not statistically significant. Most previous studies (e.g., Caswell and Zilberman, 1986; Negri and Brooks, 1990) have found a positive relationship between the cost of water and the use of sprinkler irrigation. The small or no effect found in our study may be explained by the fact that the estimation is done conditional on crop choices. The effect of water cost may have been reflected in the choice of crops. Moreno and Sunding (2005) also found that the choice of sprinkler technology is relatively unresponsive to water price after accounting for the influence of water price on land allocation decisions. Greater reliance on groundwater increases the likelihood of using sprinkler irrigation. This observation is consistent with both the theoretical results in Caswell and Zilberman (1986) and empirical findings of Green et al. (1996) . One possible explanation is that groundwater is more likely to be supplied with sufficiently high pressure for modern irrigation technologies, such as sprinkler irrigation. A larger number of irrigation information sources predict producers' use of sprinkler irrigation. This prediction is consistent with findings from previous studies that producers with access to more information are more likely to adopt modern irrigation technologies (e.g., Genius et al., 2014) .\nSome findings are better explained by the multinomial logit model in Table 6 . The estimated coefficient of the share of farms participating in government programs in the previous period is negative and statistically insignificant in both Tables 5 and 6. If only Table 5 were used to interpret the results, this might lead to the conclusion that the spread of government programs predicts lower probabilities of sprinkler irrigation. Such a finding would not be consistent with observations from previous studies that government programs offering financial or technical assistance are strong predictors of conservation technology adoption (e.g., Amosson et al., 2009) . Table 6 shows this finding is driven by the choice between WMPs and sprinkler irrigation. The multinomial logit model results at https:/www.cambridge.org/core/terms. https://doi.org/10.1017/aae.2017.3\nshow that a larger share of farms participating in government programs in the previous period predicts higher probabilities of using WMPs. Results in Table 6 point to a stronger influence of government programs offered at the local level. Policy makers in Arkansas have been promoting WMPs such as tailwater pits as a way to increase surface water use (e.g., ANRC, 2015b; Arkansas Soil and Water Conservation Commission, 1990) . For example, Arkansas offers a state tax credits program that allows producers to claim up to $9,000 in tax credits for conversions to surface water or land leveling. There are also programs offered by various water districts that target practices such as on-farm reservoirs. The policy nudge toward surface water use may also reduce the popularity of sprinklers as modern irrigation technologies are more likely to be used on fields with groundwater supplies because groundwater is usually delivered at higher pressure (Caswell and Zilberman, 1986) .\nAnother somewhat surprising finding is that an increase in depth to water in wells seems to be associated with lower probabilities of sprinkler irrigation. Again, the multinomial logit model does a better job of explaining the results. Table 6 shows an increase in depth to water is likely to predict increased use of WMPs, although the effect is not statistically significant. It is likely that Arkansas soybean producers have chosen to use WMPs instead of sprinkler irrigation as a response to the increasing depth to water. In addition to the influence of local government programs as discussed previously, this may also be because Arkansas crop production is less capital intensive than in other states such as California.\nThe results in Table 6 also shed light on which other factors may influence the use of WMPs by soybean producers. Smaller farms are more likely to use WMPs. Greater reliance on groundwater discourages the use of WMPs. Groundwater is generally a more reliable source of water than surface water. The quantity of groundwater varies much less seasonally than surface water. A greater reliance on groundwater, as measured by percentage of acres with groundwater irrigation, thus reduces the need for WMPs, such as tailwater pits, to redistribute water temporally. Because groundwater use in Arkansas is largely unregulated, the common property resources nature of groundwater resources may also reduce the propensity of producers to use WMPs. Producers that rely on a larger set of irrigation information sources are more likely to use WMPs. Table 7 reports results on other crops, including corn, cotton, and rice. The effects of farm size, government program participation, and number of irrigation information sources on the choices of irrigation technologies and/or WMPs by corn and cotton producers are similar to the findings in Tables 5 and 6. Estimated coefficients of several other variables are also statistically significant. Cotton producers with more diverse crop mixes tend to move away from a gravityonly system or sprinkler system to the combination of gravity and WMPs. In the data set, farmers with a more diverse crop mix usually grow cotton in addition to grain crops. It is likely that those farmers are using one or more WMPs to at https:/www.cambridge.org/core/terms. https://doi.org/10.1017/aae.2017.3 Notes: Standard errors not reported for the sake of brevity. Asterisks (*, **, and ***) indicate significance 10%, 5%, and 1% levels, respectively. The following variables are interacted with farm size: all temperature and precipitation measures; soil permeability (K sat ). All temperature and precipitation measures are calculated as the average of previous 30 years and only within growing seasons.\nIrrigation Techniques and WMPs 21 satisfy the irrigation demands of different crops both in terms of timing and quantities. For example, because different crops are grown at different times of the year, farms demand irrigation water for longer periods during the year. WMPs such as tailwater pits can meet this demand by increasing water stored on-farm. Higher soil permeability (K sat ) is associated with higher likelihood of using a sprinkler system and lower probability of using gravity with WMPs. These data are consistent with the findings of Negri and Brooks (1990) and Mendelsohn and Dinar (2003) that a sprinkler system is more likely to be used with sandy soil, which has higher soil permeability."}, {"section_title": "Results on Climate Variables", "text": "The effects of climate variables on the probability of using sprinkler irrigation are largely consistent between the binary choice model (Table 5 ) and multinomial choice model (Table 6) . Results from specification 1 show that higher temperature tends to reduce the likelihood of soybean producers using sprinkler irrigation (Tables 5 and 6 ). Above a critical temperature threshold, high evaporation losses from sprinkler irrigation could offset the benefit of higher irrigation efficiency to a large extent (Olen, Wu, and Langpap, 2016) . Water loss from air evaporation and drift is usually 1%-3% of the amount of applied irrigation water (e.g., Zazueta, 2011) . As temperature rises, water loss from air evaporation under sprinkler irrigation can reach as high as 15% (Finkel and Nir, 1983) . In hot areas, sprinkler irrigation may not be the appropriate irrigation method (Bjorneberg, 2013) . This may be the case in Arkansas where the growing season (April to September/October) spans the hotter months. Through higher evaporation losses, higher temperature reduces the attractiveness of sprinkler irrigation relative to gravity irrigation. Total precipitation in the growing season does not seem to predict the choice between sprinkler and gravity systems by soybean producers (Tables 5  and 6 , specification 1). One explanation may be that most precipitation occurs in Arkansas from March to May, and soybean is planted in June. So, soybean production may be less exposed to variation in precipitation. In an alternative specification, where the monthly mean temperature and monthly total precipitation of the previous 30 years and the moments of these monthly variables are used, estimation results reveal that lower precipitation in September predicts increased use of sprinkler irrigation and/or WMPs. This is probably because soybean is in the critical growth stage of bloom and pod development in August/September, and water (from either rainfall or irrigation) is critical for achieving good yields (Cooperative Extension Service, University of Arkansas, 2000).\nAmong climate measures constructed with higher moments, only the CV of total precipitation has some predictive power of soybean producers' irrigation practice choices. The estimated coefficient is negative and statistically significant, indicating that larger variations in total precipitation reduce the probability of using sprinkler irrigation. Often, the opposite is expected because a larger variation in precipitation calls for greater control over application of irrigation water and sprinkler irrigation can achieve better control. The argument made by Burke and Emerick (2016) offers a possible explanation: when there is a larger variation in precipitation, producers are less likely to recognize changes in climate and thus are less likely to adapt to those changes. Another possible explanation is the use of precision control methods such as the GreenSeeker handheld crop sensor.\nThe values of the skewness measures in the sample area are such that an increase in the skewness of daily temperature corresponds to a drop in the exposure to extremely low temperature and lower risks of frost, and an increase in the skewness of total precipitation corresponds to a larger exposure to extremely high precipitation. Because the skewness measures only capture exposures to extremely low temperature and extremely high precipitation, the specification using droughts provides additional information as drought is strongly correlated with the other ends of the distributions of temperature and precipitation (Table 5 , specification 2). The percent of years with severe droughts has a negative and statistically significant impact on the likelihood of choosing a sprinkler system. This is in contrast to the finding that during the 1987-1991 California droughts, a large share of cotton producers (one of the major field crops in California) replaced furrow irrigation with sprinkler irrigation (Zilberman et al., 1995) . Results from the multinomial logit model (Table 6 ) provide more insights that are amiss in the binary choice model. The negative coefficient on the percent of years with droughts in the binary choice model is driven by the choice between WMPs and sprinkler irrigation. The multinomial logit model results show that higher frequency of droughts increases the likelihood of using of WMPs and reduces the likelihood of using sprinklers. Both sprinklers and WMPs such as tailwater pits can be used to mitigate the negative impacts of droughts. Arkansas soybean producers choose WMPs such as tailwater pits over sprinkler irrigation as their response to more frequent droughts.\nThe two climate variables that have predictive powers in terms of soybean producers' choices of irrigation technologies and/or WMPs (i.e., mean daily temperature and the CV of total precipitation) have similar effects on corn producers (Tables 6 and 7 ). In addition, larger total precipitation reduces the likelihood of sprinkler irrigation (Table 7) . Because corn is planted in April, when most of the precipitation occurs in Arkansas (March to May), its growing season overlaps with the rainy season; thus, the amount of precipitation plays a role in choosing irrigation systems. Higher mean daily temperature also predicts lower likelihood of using sprinkler irrigation among cotton producers. None of the precipitation-related factors have any predictive power of cotton producers' behavior. For rice producers, the only climate factor that has a statistically significant coefficient is the annual total precipitation. Because rice is almost 100% irrigated, its growth may be much less sensitive to climatic factors. "}, {"section_title": "Conclusion", "text": "This study presents a relatively more complete picture of producers' irrigation behavior by examining both more efficient irrigation technologies and WMPs. One major finding is that Arkansas producers are more likely to rely on WMPs instead of sprinkler irrigation to adapt to changes in depth to water in wells and drought occurrences. This choice may be attributed to the influence of local government programs that provide incentives for producers to adopt WMPs. Therefore, it is important to expand the existing literature that focuses mostly on more efficient irrigation technologies. In areas where WMPs are more prevalent, a framework that only models the choice between more efficient irrigation technologies and gravity irrigation may lead to wrong policy implications.\nOther findings also generate policy implications. Conditional on crop choice, cost of water does not seem to play an important role. Although Arkansas producers currently only pay for the energy cost of pumping groundwater out, increasing water price is not an effective tool to promote the use of sprinklers or WMPs. In contrast, the number of irrigation information sources is a strong predictor of producers' decision to use irrigation technologies and/or WMPs for all crops. The FRIS data show that even in 2008, on average, Arkansas producers only relied on two different sources of information. Government support (extension agents or university specialists) and irrigation equipment dealers were the two most commonly used sources of information. Improving producers' access to different sources of irrigation information has the potential to increase the use of more efficient irrigation technologies and/or WMPs.\nEven in such heavily irrigated agriculture, there is consistent evidence that climate volatility and occurrence of climate extremes affect the decision making of Arkansas producers regarding irrigation practices. Both more efficient irrigation technologies and WMPs are used as a response to climate variations. Sprinkler systems are more prevalent with lower average temperature. WMPs are used to mitigate the impact of more frequent droughts. Both modern irrigation technology and WMPs should be included in the tool set used to adapt to increased climate volatility. Groundwater is becoming less available in the region, and producers will need to rely more on surface water or reduce irrigation in the coming decades. In either case, the influence of climatic factors on irrigation water supplies and, thus, producers' irrigation behavior will increase. This is particularly true given Arkansas's recent drought experience in 2010/2011 and the expectation of higher frequencies of droughts in the future (Arkansas Governor's Commission on Global Warming 2008; Watkins, 2013) . Therefore, it is important to incorporate climate information into farm risk management. Further research and development of irrigation technologies and WMPs should place more emphasis on the mitigation of the negative impacts of climate variations.\nat https:/www.cambridge.org/core/terms. https://doi.org/10.1017/aae.2017.3"}]