[{"section_title": "Introduction", "text": "Cross-border migration of highly skilled persons has expanded markedly, making it a focus of intense policy interest in many countries. In both the developed and less-developed world, keeping or attracting highly skilled workers is a key part of national economic policy and is a consideration not just for immigration policies but also plans for higher education, research funding, international investment, and even tax policies. This paper seeks to clarify the dimensions of some of the major outstanding research issues about the effects of this growing migration, particularly the migration of scientists and engineers. Migration across national borders provokes many spirited political and policy debates. Although these debates are often most contentious when they deal with migrants with lower skills, highly skilled migrants are usually employed in the types of jobs that some would prefer go to natives or citizens. At the same time, governments in both less-developed and many developed countries worry about losing their more highly educated workers. As high-skill migration appears to become more important to the world economy, understanding its likely effects becomes all the more significant. Unfortunately, these effects have not been well studied or measured. As the world's largest economy, as the largest educator of foreign students, and as a traditional nation of immigration, the United States is an important nexus for the international movement of highly skilled workers. The 2000 Decennial Census showed that a large proportion of highly skilled U.S. workers are foreign born. This includes 25.7% of all employed doctorate holders and 37.6% of doctorate holders in science and engineering (S&E) occupations. Although U.S. data on high-skill migration constitute only one piece of a much larger and complex picture, they are comparatively rich data that provide some general insights into the magnitude and direction of some of the possible effects of high-skill migration throughout the world. This paper raises as research issues possible negative and positive effects from the perspectives of both receiving and sending countries, and possible global consequences of high-skilled migration. Many of these issues are in turn related to unanswered questions in labor market theory and economic growth theory, for example: How interchangeable are skills among those with specialized knowledge? Does the presence of highly skilled workers in an economy affect firms' decisions about investment and research and development (R&D) (e.g., increasing demand over time for highly skilled workers)? Do more scientists lead to more knowledge? This paper does not provide answers to these types of questions. Instead, it examines how these and other questions, along with the paucity of good data, affect the understanding of high-skill migration. Table 1 outlines likely or possible economic effects of international high-skill migration. The possible positive and negative economic effects for both the sending and receiving countries must be considered. In addition to country-level effects, there are also global effects on the growth of technology and knowledge that cannot easily be assigned to individual polities."}, {"section_title": "National and Global Consequences of High-Skill Migration", "text": "The categories \"receiving\" and \"sending\" are not synonymous with \"developed\" and \"less developed.\" Many developed countries, such as the United Kingdom, have expressed concerns about retaining their researchers, and many less-developed countries attract foreign talent in subject areas in which they are able to offer opportunities to study or to use unique geological and biological natural resources. Indeed, many countries are both net receivers and net senders in different skill areas. • Possibility of exporting skills, which reduces risk and raises expected return of personal education investments. • Increase in domestic economic return to skills. • Knowledge flows and collaboration. • Increased ties to foreign research institutions. • Export opportunities for technology and other products and services. • Return of natives with foreign education and human capital. • Remittances and other support from diaspora networks."}, {"section_title": "Possible negatives", "text": "• \"Brain drain\": Lost productive capacity due to at least temporary absence of workers and students with higher skills. • Less support for public funding of higher education. • Training and research areas may not reflect local priorities (e.g., cancer, not malaria.)\n• Decreased incentive of natives to seek higher skills. • Possibility of displacement of native students from best schools. • Language and cultural barriers between native and immigrant highly skilled workers. • Technology transfers to competitors and to possibly hostile countries."}, {"section_title": "Receiving countries", "text": "Possible positives • Increased research and development and economic activity due to availability of additional highly skilled workers. • Knowledge flows and collaboration. • Increased ties to foreign research institutions. • Export opportunities for technology. • Increased enrollment in graduate programs, with the possible result of keeping smaller programs alive and maintaining quality in larger programs."}, {"section_title": "Possible global effects", "text": "• Better international flow of knowledge for both commerce and research. • Better job matches through global job search. • Greater employment options for workers and researchers. • Greater ability of employers to find rare or unique skill sets. • Formation of international research or technology clusters (e.g., Silicon Valley, CERN). • Net positive effect on incentives for individual human capital investments as a result of international competition for scarce human capital. Few of the possible effects discussed in this paper are well established empirically, although some \"indicator\" data do exist. Thus, this report primarily represents an agenda for research."}, {"section_title": "Negative Effects for Sending Countries", "text": "A loss of productive capacity because of the loss (at least temporarily) of highly skilled workers and students is the most discussed negative effect of high-skill migration on sending countries. This brain drain has been an issue not just for countries but for any area whose educated natives migrate. In the United States, for example, rural states often worry about graduates of their state universities moving to other parts of the country, where their skills are in greater demand. Although movement to a country willing to pay a higher wage for a given skill is, by one definition, a movement to a place with a higher demand for that skill, some have argued that this should not be the only measure. For example, the addition of a single medical doctor may have a greater effect on the health of individuals in a less-developed country than it would in a developed country. In addition to the direct effect on the availability of highly skilled labor, reduced political support for funding for higher education may be a possible consequence of highly educated workers leaving a country. Publicly funded education is a service provided to a country's citizens, but it is also considered to be a tool for economic development, even in highly developed countries like the United States. Migration of graduates is often viewed, whether correctly or not, as a loss of an investment. [1] College-educated foreign-born individuals in the United States receive significant portions of their formal education outside the United States. As shown by the National Survey of College Graduates, about 55% of college-educated foreign-born individuals in 2003 had at least one postsecondary degree from an institution outside the United States, and 41% had their highest degree (or most recent degree, if at the same degree level) from a foreign institution (see Table 2). Even at the highest education level, more than one-third of foreign-born doctorate holders who were residents in the United States received their doctorates from foreign institutions. Although many immigrants to the United States arrive as children, 69% of the college-educated foreign born graduated from a foreign secondary school, their preuniversity education having occurred outside the United States. Many countries are concerned about the return rates of their nationals who go to other countries for graduate training. Finn (2005) shows that more than half (61%) of 1998 temporary-visa recipients of S&E doctorates from U.S. schools were working in the United States in 2003. "}, {"section_title": "Positive Effects for Sending Countries", "text": "Less often discussed are the positive effects that may exist for countries whose highly skilled natives and citizens move across borders. In part, this is because of measurement difficulties. Although data on international migration are often poor, counts of initial migrations of people are easier to obtain than data on return migration or return knowledge flows.[2] Nevertheless, several indicators show that such benefits might exist. Although there is talk of brain drain, others have talked of brain gain or brain circulation to describe some of these complex effects."}, {"section_title": "Incentives for Human Capital Investment", "text": "The effect most difficult to measure-but theoretically most likely to benefit countries sending highly skilled workers-may be an increase in the incentive for natives to invest in their own human capital. In theory, this can occur through four mechanisms: (1) an increase in the domestic return to skills because of the relative scarcity created by the brain drain; (2) the incentive effect of an increase in the expected value of an individual's human capital investment if that individual has migration as an option; (3) a reduction in the risk associated with the return on individual human capital investment if migration serves as a labor market stabilizer; and (4) an increase in the domestic demand for skilled labor because of increased ties to foreign business and R&D activities. The first mechanism is the improvement of labor market conditions for highly skilled workers when emigration to other national labor markets reduces the domestic supply of these workers. Wages and unemployment for highly skilled workers in less-developed countries (with less-developed financial markets and entrepreneurial infrastructure) may be particularly sensitive to oversupply. Other channels through which migration leads to increased supply may, of course, offset this. The second mechanism results from uncertainties that individuals might have about their likely migration behavior.[3] When the expected foreign value of human capital is much greater than the domestic value, even a small nonzero expectation of migration may have an important effect on the expected value of a human capital investment decision. Thus, the existence of a foreign demand for their skill may influence even those with strong preferences against migration. The third mechanism depends on whether the amount of emigration of highly skilled labor from a country is related to current labor market conditions. A downturn in a country's demand for highly skilled labor that causes more highly skilled workers to leave might tend to reduce fluctuations in employment and salaries, thereby reducing the risk associated with the human capital investment. The considerable investments required for an individual to acquire higher skills might seem less worthwhile if the labor market demand for those skills is volatile. [4] To some extent, this effect of immigration as a labor market stabilizer may be offset by any instability caused by return migration driven by changes in conditions in the receiving countries. [5] The fourth mechanism, increasing domestic returns to human capital investment, is simply the secondary effect on the demand for skills of the positive economic effects discussed below. Indeed, a 1% increase in gross domestic product (GDP) due to increased access to technology and foreign collaboration may increase demands for skills more than a 1% increase in GDP due to factors like increased export commodity prices. Exploiting knowledge usually implies an increasing demand for higher skills. International migrants (other than refugees) seldom break all ties with their country of origin. There is reason to believe that highly skilled migrants who have extensive education and, often, work experience in their country of origin maintain contacts with former colleagues and education institutions. These contacts may provide a benefit for sending nations by facilitating the formation of international networks of contacts and knowledge exchange, both with expatriate natives and with contacts that returning expatriates nurtured while abroad. Some evidence for this is seen in figure 1, which shows a positive 0.66 correlation between the log of the number of U.S. doctorates received by those born in a foreign country and the percentage of that country's internationally coauthored articles with the United States. [6] That contacts in graduate school may lead to research collaboration across borders is not unexpected. The same effect is likely to be created by the international movements of people employed by industries. Movement of workers between firms has long been recognized as a powerful source of knowledge transfer-both of technology and of more subtle forms of knowledge such as business practices and networks of contacts-and the knowledge transfer is likely to be even more significant when the firms are across national borders.  An important (although not necessary) way for a sending country to benefit from the flow of knowledge is for its natives to return after they have spent a period of time outside the country either in school or working. Despite wage differentials and other differences in opportunities, return migrations are common, even between developed and less-developed countries."}, {"section_title": "Knowledge Flow and Collaboration", "text": "[7] To a great extent, this is unsurprising and reflects the importance of cultural and family ties to migrants. Another factor that encourages return migration is the temporary nature of the work permits that many countries use as their primary method for allowing employers to recruit noncitizens. For example, the most common visa the United States issues to highly skilled workers, the H-1B visa, has a duration of 3 years, allows a single 3-year renewal period, and is not formally part of any path to a permanent visa. [8] Finn (2005) showed that slightly more than three-fifths of foreign students with temporary visas who received U.S. S&E doctorates in 1998 were still working in the United States 5 years later. [9] This implies that the other two-fifths left the United States [10] with training received at a U.S. university and perhaps a postdoc position or other postgraduate work experience. As shown in table 3, Finn (2005) found that 5-year-stay rates varied by field of degree, ranging in 2003 from 36% in economics to 70% in computer science and computer and electronic engineering. Also noteworthy is that for a given Ph.D. cohort, the stay rates shown in table 3 hold reasonably steady for time since degree. However, data from another source, the National Science Foundation's (NSF's) 1995 Survey of Doctorate Recipients (SDR), suggest that even among those who do stay in the United States immediately after graduation, many leave after a period of time. But others return after initially leaving, thus producing the relatively steady estimates of the proportion in the United States over the five-year period. A complex pattern of migration of this form would enhance the role of foreign students in the knowledge networks between countries. [11] Some of this migration pattern among Ph.D. holders is suggested by data from the 1995 SDR. In that year, a special effort was made in collecting data for the SDR to discover whether survey nonrespondents resided outside the United States. Table 4 presents estimates of foreign-born recipients of U.S. S&E doctorates working outside the United States derived from the 1995 SDR. Because it is quite possible that other nonrespondents whose locations were never discovered also resided outside the United States, these should be considered lower bound estimates. \nAs shown in figure 1 and discussed earlier, there are strong reasons to believe that international migration leads to increased international collaboration and transmission of knowledge. For the United States, an increased connection to the rest of the world has always been a benefit of having large numbers of foreign students and large numbers of highly skilled immigrants. This factor may become even more important as the rest of the world continues to expand its R&D capacity. U.S. R&D spending as a share of the global total declined during the 1990's and reached 36% in 1993, down from about 40% early in the decade (NSB 2006)."}, {"section_title": "Return of Natives with Foreign Education and Human Capital", "text": "The SDR covers all those with S&E doctorates from U.S. schools who had plans to stay in the United States immediately after receiving their degree. [12] Thus, the only foreign-born doctorate recipients represented in the SDR are those with plans to stay at the time of degree conferral. Among this group, about one-fifth of those who graduated in the last three decades were identified as residing abroad; in the case of graduates from the last 10 years, more than 4% had left the United States in the previous 2 years. In addition to knowledge transfers, the return of natives to a sending country also brings a gain of human capital that may not have been developed had the migrants stayed in their home countries. There are several reasons for this. Differences in the availability or quality of particular areas of university instruction may have been a reason for the original cross-border movement. Knowledge of unique technologies may also be gained in formal employment. In addition, foreign employers and educational institutions often finance both formal education and job-related training to a considerable extent."}, {"section_title": "Support from Diaspora Networks", "text": "In the general immigration literature, many studies have analyzed the effects of having large populations of natives outside a country's border. [13] These include the creation of new export opportunities for their home countries, the creation of transnational social networks to facilitate business contacts and knowledge transfer, and the value of remittances to relatives and institutions in their home countries. It seems plausible that highly skilled migrants create the same type of opportunities, albeit sometimes in different ways. Lower skilled migrants often form part of the retail and wholesale infrastructure in their new countries. Highly skilled migrants may be less likely to become retail or wholesale managers but more likely to be involved in the purchase or selection of technology products and services. For example, significant anecdotal evidence shows that Indian migrants have played a key role in business partnerships and relationships between U.S. and Indian technology firms. [14] Remittances from highly skilled migrants may also be only a variation of the phenomenon discussed in the general immigration literature. [15] Highly skilled migrants are fewer in number than other migrants but often earn higher incomes. In addition to giving gifts to relatives, highly skilled migrants may serve significant financial or other roles as alumni of educational institutions in their home countries.  (1993 and 1995). Many participants in discussions of immigration policy have been surprised in recent years to find that international high-skill migration is no less controversial within receiving countries than immigration in general. A large amount of the immigration literature seeks to find the effect of lower skilled immigrants on opportunities for lower skilled natives. [16] However, little research has been conducted on the effects of the migration of more highly skilled workers. Nevertheless, several effects can be hypothesized."}, {"section_title": "Decreased Incentive for Natives to Seek Higher Skills", "text": "If highly skilled migrants are substitutes for natives in the domestic labor market, then a normal type of static supply and demand analysis would suggest a reduction in the wages associated with higher skilled occupations. [17] This in turn would lead to a decreased incentive for natives to make human capital investments. Several theoretical factors may moderate any such effect on native human capital investment patterns. First, the same analyses that assume lower skilled migrants to be substitutes for both lower skilled natives and for capital also assume that highly skilled migrants are complements to both lower skilled workers and to capital. Thus, highly skilled migrants might do more to create new capital investment and utilization of a perhaps underused segment of the labor force. To some extent, higher skilled workers may produce economic changes that increase the demand for their services and thereby mitigate the effect of increased supply on compensation. In addition, some types of high-skilled migration may complement, not substitute, for some types of native high-skilled workers. Even when a migrant has exactly the same degree level and field of study as a native (i.e., master's degree in chemical engineering, or a doctorate in biology), the knowledge of particular processes and technologies can be very different-adding value as a collaborator rather than as a competitor. Although no detailed econometric studies have been done, the most basic statistics suggest that high-skill migration is most prevalent in fields that present relatively good employment opportunities. Possible reasons for this include the following: Workers may be less willing to undertake the costs of migration unless the opportunities are great, employers may not want to pay the often considerable legal costs associated with obtaining work visas unless they face a tight domestic labor market, and the influx of diverse human capital brought by migrants may contribute to creating opportunities in a field. Figures 2 and 3 show the percentage of foreign-born holders of U.S. doctorates in major S&E fields relative to measures of labor market conditions for recent (1-5 years after degree) doctorate recipients in those fields. salary. This is not driven just by the high percentage of foreign-born individuals among U.S. doctorate holders in engineering; higher foreign-born representation is associated with higher salaries in many broad fields. In the social sciences, economists are paid more than sociologists. In the life sciences, biological scientists are paid more than agricultural scientists. In the physical sciences, physicists are paid more than geologists. In each case, the lower paid field had relatively fewer foreign-born doctorate holders. Figure 2 shows a strong positive correlation (0.67) between median salary and the percentage of foreign-born individuals among those who received a U.S. S&E doctorate within the previous 5 years."}, {"section_title": "Negative Effects for Receiving Countries", "text": "The same pattern holds when comparing the percentage of foreign-born doctorate holders among those in a particular field receiving their degree in the previous five years with a measure of labor market distress. For highly skilled workers, the unemployment rate can be a poor measure of labor market conditions in a field because highly skilled workers are usually highly employable in some capacity. The percentage of highly skilled workers involuntarily working outside their field of degree, a statistic that can be generated from the SDR or other components of NSF's Scientists and Engineers Statistical Data System (SESTAT), often provides a more sensitive indicator of labor market conditions. Figure 3 shows the percentage of recent recipients of U.S. S&E doctorates working involuntarily outside their field to be inversely correlated (-0.32) with the percentage of foreign-born recipients among U.S. S&E doctorates."}, {"section_title": "Crowding Out of Natives in Advanced Education", "text": "Another often-discussed but little-studied possible effect of high-skill migration on receiving countries is a crowding out of natives in graduate programs and other sources of advanced training. To some extent, this argument is simple to understand: If a given university has a limited number of openings for graduate students, then a migrant student would prevent a native from taking that slot. The number of graduate departments with some flexibility in the number of students they admit may offset this argument, at least in terms of aggregate positions in graduate programs. Beyond the top tier of institutions, some graduate programs might prefer to admit more high-quality graduate students to help faculty with both teaching and research. This may be particularly true for graduate programs that have trouble justifying their existence in terms of total graduate enrollment. NSF's Survey of Graduate Students and Postdoctorates in Science and Engineering (GSS), an annual survey that tabulates the enrollment of graduate S&E departments, can be used to examine the issue of displacement. Using GSS records for 1982-95, a pooled longitudinal file can be created with academic departments as the unit of observation. [18] This file can be used to make empirical estimates of the observed effect of a change in the foreign student enrollment on the enrollment of various ethnic categories of U.S. citizens and permanent residents. As table 5 shows, an increase in enrollment of 1.0 foreign students is associated with an enrollment increase of 0.33 for white U.S. students, an increase of 0.02 for U.S. underrepresented minority students, and a decrease of 0.07 for U.S. Asian students. With the exception of the odd, if small, decrease for U.S. Asians, [19] an increase in enrollment for one group is associated with increases in enrollment for all groups-a result inconsistent with displacement. In general, the higher the percentage of foreign-born doctorate holders, the higher the [20] Although this criticism is"}, {"section_title": "Other Negative Effects", "text": "Cultural differences between natives and migrants and the possibility of technology transfer to potentially hostile countries or terrorist organizations are two other possible negative effects of high-skill migration for receiving nations. These effects are included here for the sake of thoroughness, although these topics have received even less analysis than other areas. Some critics of high-skill migration have raised concerns that cultural differences between natives and migrants can be a barrier to native participation in technology. This criticism includes concerns about the ability of native students to understand the accents of foreign-born teachers and workplace discrimination against natives who are not part of the same ethnic group as their boss. difficult to evaluate, to assume that this issue is not an important part of the political response to high-skill migration in many countries would be a mistake. Technology transfer to potentially hostile countries or terrorist organizations is another issue that is difficult to analyze. In terms of a general transfer of knowledge that is useful to both civilian and defense industries, this almost certainly occurs. In the more specific sense of espionage to obtain classified information on sensitive technologies, the picture may be murkier. In the United States, some major public espionage cases have involved ethnic affinity (albeit by both naturalized and native-born citizens), but other cases have involved natives who were apparently motivated by money, power, or ideology."}, {"section_title": "Positive Effects for Receiving Countries", "text": "Many of the positive effects of high-skill migration for receiving countries are the same as those experienced by sending countries: gains related to increases in international collaboration and technology transfer, with the same implications for increasing domestic productivity and developing global markets. In the case of the United States, where relatively few native-born individuals migrate abroad for employment, many of its global connections come from foreign scientists and engineers. Both those who come to the United States to stay, and those who leave after a period of school or employment, form part of a network between U.S. research institutions and business and foreign institutions."}, {"section_title": "Increased Economic Activity and R&D", "text": "Even in a model of high-skill migration that does not include brain circulation, receiving nations benefit from a brain gain. They experience an exogenous increase in their stock of human capital, often including scarce or unique sets of skills that are needed to overcome bottlenecks in production or research. In the United States, highly skilled foreign-born workers make up a large part of the total S&E-educated labor force (see table 6). In 2003, more than one-third of S&E  (1982)(1983)(1984)(1985)(1986)(1987)(1988)(1989)(1990)(1991)(1992)(1993)(1994)(1995), special tabluations. doctorate holders are foreign born, ranging from about 10% of psychology doctorate holders to 51% of doctorate holders in engineering and 57% in computer science. At the bachelor's degree level, 15% of S&E degree holders are foreign born, ranging from 7% of sociology/anthropology bachelor's degree holders to more than one-quarter in physics/astronomy and electrical engineering. These estimates, and others shown in table 6 from the NSF SESTAT data file, are underestimates of the total proportion of foreign-born scientists in the United States. Because of the practical difficulties involved in tracking highly skilled migrants, SESTAT data on the U.S. S&E labor force exclude individuals whose S&E degrees were obtained from foreign educational institutions unless they were in the United States as of the decennial census of 2000. This would exclude, for example, the majority of individuals who entered the United States with an H-1B temporary visa in the 3 years between 2000 and 2003. Based on a sample of H-1B workers, the U.S. Immigration and Naturalization Service reported that 60% of H-1B visa recipients are recruited outside of the United States and thus are more likely to hold foreign degrees. [21] Comparing 2003 SESTAT estimates of the percentage of foreign-born individuals in S&E occupations with estimates from the 2000 census and the 2003 American Community Survey (ACS) gives one indicator of the possible undercount (see table  7). The 2003 SESTAT and 2000 Census estimates are similar, while the 2003 ACS shows a higher proportion. [22] The ACS proportion of foreign-born doctorate holders in S&E occupations was 3.9 percentage points greater than that reported in NSF's 2003 SESTAT database. Because SESTAT microrecords include a representative sample of individuals with new U.S. S&E degrees (both foreign born and native), the most likely explanation for these differences is the continuing entry in the early 2000s of large numbers of scientists and engineers with foreign degrees. [23] "}, {"section_title": "Increased Enrollment in Graduate Programs", "text": "Increased enrollment is the other side of concern about displacement of natives in graduate programs. In the United States, the availability of foreign students may allow many graduate departments to expand or maintain graduate programs. In other cases, foreign students may enable elite programs to maintain very high standards by allowing the programs to choose among the best of both foreign and native applicants. Graduate programs are important sources of new research and knowledge in their own right, with students providing labor for research and teaching both informally and through relatively low-paid research and teaching assistantships. This graduate student labor may provide a benefit to receiving countries, even if foreign students leave immediately after graduation and play no part in later knowledge networks. In addition, colleges and universities receive some direct financial benefits from foreign students in the form of tuition and fees. Data from the Institute for International Education (IIE) show 81.8% of undergraduate international students in the United States had personal and family funds as their primary source of support in the 2003-04 academic year. At the graduate level, IIE shows 51.6% with personal and family funds as their primary source of support. [24] "}, {"section_title": "Global Effects", "text": "In addition to any benefits or costs that might be viewed as accruing to particular countries that send or receive highly skilled migrants, there are global effects that cannot be assigned to individual countries. [25] These are essentially all the effects that could result in greater global efficiency in the production of knowledge and of goods and services. Even if one rejects the idea that one country benefits from wealth and knowledge creation in another, this greater efficiency would result in a larger global sum of gross domestic product, however distributed. A better international flow of knowledge may increase the efficiency of new knowledge production globally because it leads to better solutions to particular problems and reduces duplication in R&D. An international job market has important implications for the quality of job matches for both workers and employers. In a world where increased specialization leads to increased employer dependence on scarce or unique skill sets, the reasons employers find it increasingly efficient to search across borders are clear. Not only might an individual with a particular combination of skill and experience be hard to find, but the difference between the best and the second best job match may be large. At the same time, greater employment options resulting from a global labor market may allow workers to find the work most interesting to them. There may also be a global benefit from the formation of international research and technology centers. Researchers studying innovation have long noted the apparent benefits of geographic clustering of particular research activities. To a great extent, this clustering of specialized research required international migration of highly skilled workers for staffing. For all of these reasons, international high-skill migration is likely to have a positive effect on global incentives for human capital investment. It increases the opportunities for highly skilled workers both by providing the option to search for a job across borders and by encouraging the growth of new knowledge."}, {"section_title": "Conclusion", "text": "This paper has outlined major research and policy issues related to international high-skill migration. Simple models of brain drain and brain gain do not fully capture either the complex movement of people and knowledge across borders or the effects of this movement on knowledge creation and investments in physical and human capital. There are potential positive and negative effects of high-skill migration for both sending and receiving countries, and much research needs to be done to better understand these effects. However, clearly few of these effects are \"zero sum games\"-one country's gains are not necessarily another country's losses. Beyond the sum of effects on individual countries, the global net effect of high-skill migration seems likely to be positive for both knowledge creation and economic growth and should result in more efficient use of highly skilled labor and an increased flow of knowledge. [1] The total effect of migration on the local or national public rate of return on public investment in education would include all of the effects discussed in this paper and may not be negative. [2] The data limitations in the United States are illustrated by the title of a National Academy of Sciences study, Immigration Statistics: A Story of Neglect. Although many data systems have improved since this 1985 report, many data gaps remain. [3] To show this in a simple algebraic form, the expected value of an individual's human capital can be expressed as: , where E(H) is the expected value of human capital, P m is the subjective individual probability of migration, E f is the expected value of human capital, H, in the best foreign labor market, and E d is the expected value of the same human capital in the domestic labor market. [4] To the extent that highly skilled also means specialized skills, additional training may make individuals more, rather than less, sensitive to economic fluctuations. An example from the United States may be aerospace engineers, who have faced greater employment volatility than those in other occupations. [5] A prominent example of labor market instability being caused by return migration involved not highly skilled but low-skilled labor-the return migration of workers from Southeast Asia from the Arabian Peninsula at the time of the first Gulf War. [6] This is determined by the location of the institution with which each coauthor is affiliated. Thus, it could be between natives of the same country, one of whom works in the United States, or any other combination of nativities. [7] See Ahmed and Robinson (1994) for a profile of general emigration rates from the United States. [8] Estimates of H-1B visa holders remaining in the United States for longer periods vary, but it is becoming a common visa status for high skilled individuals converting to a permanent visa. [9] This is a higher 5-year stay rate than had been estimated for earlier Ph.D. graduation cohorts, about half of whom stayed in the United States. This recent increase in the stay rate is associated with an increase in the proportion of foreign graduate students coming from countries, such as China, that have very high stay rates. [10] This does not necessarily mean a return to their country of origin. Around 7% of temporary visa recipients of U.S. doctorates reported on the 2002 Survey of Earned Doctorates that they have initial plans for employment in some third country. This is likely to be an underestimate of movement to third countries, as many do not have immediate plans, and many with immediate U.S. plans have either postdoc appointments or other short-term work experiences. [11] Finn (2005) matches Social Security numbers from the Survey of Earned Doctorates to individual earnings records. To protect confidentiality, the Social Security Administration reports Notes E (H ) = P m E f (H ) + (1 -P m ) E d (H ) back to Finn the percentage of a doctorate cohort that was found in their records, but does not provide information on any individual. Thus, determining whether the same individuals are present each year is impossible."}]