[{"section_title": "Introduction", "text": "Coronaviruses (CoVs) belong to the subfamily Orthocoronavirinae in the family of Coronaviridae. In this family, there are four types of viruses: α-coronavirus, β-coronavirus, γ-coronavirus, δ-coronavirus (Banerjee et al. 2019; Yang and Leibowitz 2015) . The CoV genome is an enveloped, positive-sense, and single-stranded RNA whose size is 26-32 kb and it has the largest genome of known RNA viruses. It is known that αand β-CoV types cause infections in mammals as δand γ-CoVs infect birds (Banerjee et al. 2019; Yang and Leibowitz 2015; Schoeman and Fielding 2019) . Severe acute respiratory syndrome (SARS) and the Middle East respiratory syndrome (MERS) belonging to β-CoVs are the most well-known aggressive strains of coronaviruses and cause viral pneumonia outbreaks, recently. SARS first appeared in China in 2002, spread and resulted in 8437 cases and 813 deaths with an 11% mortality rate according to the World Health Organization (WHO) reports (Song et al. 2019; Graham et al. 2013; Zhong et al. 2003) . MERS, which emerged in Saudi Arabia in 2012 firstly, caused 2206 patients in 27 countries, 1831 cases in Saudi Arabia with 787 deaths with the mortality rate of 37% between June 2012 and April 2018 (Zumla et al. 2015; Hui et al. 2018; Su et al. 2015; Nassar et al. 2018) .\nIn December 2019, some people had sickness with unknown etiology in Wuhan City where 11 million residents live, Hubei Province in China. This sickness was a kind of pneumonia and the sequence analysis revealed that the cause of it was a novel CoV whose genome structure was more than 82% identical to those of SARS-CoV, following this phenomenon was named as coronavirus disease 2019 (COVID-19) Wong et al. 2020; Chan et al. 2020) . Unfortunately, case numbers are increasing continuously day by day, the COVID-19 disease has spread primarily to China, the Islamic Republic of Iran, and Europe. It was determined that the COVID-19 disease had human-to-human transmission ability by the National Health Commission of China on 20 January 2020. COVID-19 outbreak a public health emergency of international concern (PHEIC) on 30 January 2020.\nBeginning in March 2020, COVID-19 has spread in 72 countries quickly, caused over 90,000 confirmed cases and 2946 deaths . As this outbreak turned into a global threat, the WHO announced that the COVID-19 outbreak could be characterized as a global pandemic, on 12 March 2020 (The World Health Organization Regional Office for Europe. Coronavirus disease (COVID-19) outbreak news). 22,256,220 cases and 782,456 deaths caused by the COVID-19 pandemic according to the WHO records on 21 August 2020 (The World Health Organization Home. Coronavirus disease 2019 current case numbers).\nCurrently, the man has no registered specific vaccines or therapy methods for COVID-19 accepted by the whole world. WHO stated that there were nine vaccine candidates against COVID-19 in the advanced stages of clinical trials (timesnownews.com). Russia government announced the world's first COVID-19 vaccine called as Sputnik V (Table 1) was developed by the Gamaleya Research Institute of Epidemiology and Microbiology on 12 August (sciencemag.org/news), but WHO declared that there is not enough information about Sputnik V and they are in contact with Russia (timesnownews.com). That's why, there is an urgent need to find drugs or vaccines which can be used in the treatment of COVID-19 infections, effectively. Nevertheless, there are some reports and data from studies related to the use of known drugs like chloroquine and remdesivir that have proved efficacy on COVID-19 pneumonia both in vitro and in animal models. In this context, we summarize therapeutic options available for the treatment of COVID-19."}, {"section_title": "Therapy", "text": "The pharmaceutical interventions available for COVID-19 therapy can be divided into several groups: immunotherapy, cellular therapy, antiviral and other drugs, and Chinese medicine."}, {"section_title": "Immunoglobulins", "text": "Immunoglobulins are used to treat for various diseases, for example, Guillain-Barre Syndrome, Kawasaki disease as well as some pathologic conditions such as idiopathic thrombocytopenia purpura and chronic inflammatory demyelinating polyneuropathy (Cherin et al. 2016) . Various glycoproteins on virus surfaces or the protein shell of a non-enveloped virus could be recognized by extensively neutralizing antibodies, but HIV-1 (human immunodeficiency virus), dengue virus, hepatitis C, Ebola virus, and influenza viruses can mutate superficial glycoproteins, thus they avoid the antibody response. This condition creates an obstacle to develop new therapies for such infections (Srinivasan et al. 2016) . Although intravenous gammaglobulin has adverse reactions, it is probably the safest immunomodulating drug. Intravenous gammaglobulin has been used extensively for patients with SARS in Singapore, but venous thromboembolism including pulmonary embolism has emerged in one-third of critically ill patients (Lew et al. 2003 "}, {"section_title": "Interferons", "text": "Interferons (IFNs) are substances having protein structure that bind to receptors on cellular surfaces and initiate JAK-STAT signaling cascades (Schneider et al. 2014 ). IFNs are considered as two types: Type I and Type II IFNs. Type I IFNs, which make up of two different proteins: IFN-α and IFN-β are inclusive of natural immunity against viral infections. Type I IFN release forms are the first line of defense against infections caused by viruses. In the 7th published National Health Council (NHC) guideline, IFN-α single or in combination with other drugs are indicated in the clinical usages (Chinese Clinical Guidance for COVID-19 Pneumonia Diagnosis and Treatment (7th edition)). IFNα included in Type I IFNs is grown very rapidly as part of the congenital immune response to infections caused by viruses and inhibits the transcription of animal and human coronaviruses (Mathias et al. 2010; ClinicalTrials.gov [Internet] 2020a). In addition, they support innate and adaptive immune responses against viral infections. IFN-α effectively inhibited SARS-CoV replication in vitro experiments (Ströher et al. 2004; Zorzitto et al. 2006) . It was shown that Type I interferons with the inclusion of IFN-β could inhibit the replication of SARS-CoV in vitro, too (Morgenstern et al. 2005) . It was revealed that SARS-CoV blocked IFN transcription in infected cells and these cells might partly repair their congenital immune responsiveness to SARS-CoV following small amounts of IFNs had been prepared (Kuri et al. 2009 ). It has been shown that cynomolgus monkeys are preserved from SARS-CoV infection via IFN-α therapy, too . In a pilot clinical trial, synthetic recombinant IFN-α was proved to be active against SARS (Loutfy et al. 2003) . Additionally, IFN-α-2a and ribavirin combination prolonged the survival of people with severe MERS-CoV infection (Mustafa et al. 2018) . The different controlled test has been launched to test the efficiency of lopinavir/ritonavir and IFN-α-2b in hospitalized people with SARS-CoV-2 infections (ChiCTR2000029308) (Martinez 2020) . "}, {"section_title": "Convalescent plasma therapy", "text": "Antiviral antibodies, namely, IgG, IgA, IgM, IgE, and IgD available in convalescent plasma can be obtained from recovered patients and they can be used to treat patients viral infections, effectively. So far, this method has been widely utilized in some infectious diseases, for instance, poliomyelitis, influenza A (H5N1), and Ebola (Zhou et al. 2007 ; van Griensven et al. 2016; Rinaldo 2005) . In addition to this, passive immunization might be useful by making use of convalescent plasma from people with SARS-CoV infection. In Taiwan and Hong Kong convalescent plasma therapy has been tested on a small number of SARS-CoVinfected patients during the early course of the outbreak and this method has been determined to be useful (Cheng et al. 2005; Wong and Yuen 2008; Yeh et al. 2005) . In view of these findings, convalescent plasma therapy can be a promising option for the therapy and prevention of COVID-19 pneumonia cases. Convalescent plasma may be called as passive immunotherapy, too. If no specific vaccines or medications are available for arising infection-related diseases, this therapy method is generally applied (Marano et al. 2016 ). The feasibility, safety, and clinical efficacy of this therapy method has been tested in critically ill MERS patients and it has been revealed to have an immunotherapeutic potential (Arabi et al. 2015) . Similarly, convalescent plasma gained from recovered SARS patients has been useful to treat other SARS patients (Cheng et al. 2005; Soo et al. 2004) . One important thing to say is this, World Health Organization under Blood Regulators Network recommends the use of convalescent plasma or serum if there is no vaccination and antiviral medications for an arising virus. Convalescent plasma therapy should be normally used against COVID-19 on critically ill patients if it is available . Now, there are 140 clinical trials to appreciate the efficacy and safety of convalescent plasma for the therapy of COVID-19 and, of them nine trials were completed stage (NIH US National Library of Medicine clinical trial database, https://www.clinicaltrials.gov/ct2/results?cond= Covid19&term=convalescent+plasma&type=&rslt= &age_v=&gndr=&intr=&titles=&outc=&spons=&lea d=&id=&cntry==&state=&city=&dist=&locn=&rsub= &strd_s=&strd_e=&prcd_s=&prcd_e=&sfpd_s=&sfpd_ e=&rfpd_s=&rfpd_e=&lupd_s=&lupd_e=&sort=)."}, {"section_title": "Monoclonal antibody", "text": "It was determined that one recombinant human monoclonal antibody (mAb) (single-chain variable region fragments, scFvs 80R) inhibited S1 domain of S protein of SARS-CoV (Sui et al. 2004) . Depending on the development of monoclonal antibodies, the SARS-CoV-2 outbreak can be prevented. Several studies revealed that some monoclonal antibodies which aim to the SARS-CoV spike protein could prevent the virus entry into the host cells (ter Meulen et al. 2004; ter Meulen et al. 2006; Traggiai et al. 2004 ). Neutralizing monoclonal antibodies target the 193-amino acid (residues 318-510) receptor-binding domain (RBD) of the spike protein to perform their functions ). Considering these works, neutralizing monoclonal antibodies alone or in combination could be a promising therapeutic candidate for the therapy of COVID-19 pneumonia.\nPatients with severe COVID-19 infection experienced a cytokine storm with increased plasma concentrations of interleukins IL-6, IL-2, IL-7, and IL-10 and tumor necrosis factor TNF-α. This syndrome is described by fever and multiorgan failure. IL-6, interferon-gamma (IFN-γ), TNF-α, and IL-10 are cytokines including in cytokine release pathogenesis (Wang and Han 2018) . Especially, IL-6 acts as the central mediator of cytokine release syndrome (Lee et al. 2014) .\nFor the therapy of COVID-19 pneumonia, immunomodulant therapy is not recommended routinely. Nevertheless, considering the clinical and laboratory findings consistent with cytokine release syndrome and considering the formation of pulmonary edema and hyaline membranes, a targeted therapy could be useful in selected patients with severe pneumonia in association with respiratory support during a short time (Lombardy Section Italian Society Infectious and Tropical Diseases 2020).\nCurrently, there are 47 clinical trials are being conducted for monoclonal antibodies in the therapy of COVID-19 and, no study was been completed (NIH US National Library of Medicine clinical trial database, https://www.clinicaltrials. gov/ct2/results?cond=Covid19&term=monoclonal +antibody&type=&rslt=&age_v=&gndr=&intr= &titles=&outc=&spons=&lead=&id=&cntry=&state= &city=&dist=&locn=&rsub=&strd_s=&strd_e=&prcd_ s=&prcd_e=&sfpd_s=&sfpd_e=&rfpd_s=&rfpd_e= &lupd_s=&lupd_e=&sort=).\nTocilizumab Tocilizumab (Fig. 1) is a monoclonal antibody that aims to the IL-6 receptor. This agent can be used against COVID-19 in patients with severe and extensive lung disease with elevated IL-6 levels. Thus, the systemic inflammatory response syndrome by the viral-induced cytokine storm can be discontinued (Lombardy Section Italian Society Infectious and Tropical Diseases 2020). As on date, 65 clinical trials are being carried out to know the efficacy of tocilizumab in COVID-19 pneumonia, of them 4 trials were finished (NIH US National Library of Medicine clinical trial database, https://www.clinicaltrials.gov/ct2/results? cond=Covid19&term=tocilizumab&type=&rslt=&age_ v=&gndr=&intr=&titles=&outc=&spons=&lead=&id= &cntry=&state=&city=&dist=&locn=&rsub=&strd_s= &strd_e=&prcd_s=&prcd_e=&sfpd_s=&sfpd_e=&rfpd_ s=&rfpd_e=&lupd_s=&lupd_e=&sort=).\nBevacizumab Bevacizumab (Fig. 2) , a humanized monoclonal antibody, aims vascular endothelial growth factor (VEGF) (Clin-icalTrials.gov [Internet] 2020b; Wang et al. 2004 ). It has the ability to decrease the VEGF levels produced by hypoxia, severe inflammation, and upregulation of the infected respiratory tract epithelium; these symptoms might restrain the edema in patients suffered from COVID-19 pneumonia "}, {"section_title": "Cyclosporine A", "text": "Cyclosporine A (Fig. 3) which has been used in transplantation widely as well as in the therapy of autoimmune disorders is an immunosuppressive drug. Because cyclosporine A has been used extensively, the survival rates of patients and grafts improved highly following solid-organ transplantation (Ziaei et al. 2016) . It was claimed that nucleocapsid protein (NP) of SARS-CoV had a substantial role in the process of virus particle accumulation and release. In addition, it could connect to human cyclophilin A which is a key member of immunophilins. The function of these are to act as a cellular receptor for cyclosporine A Dawar et al. 2017 ). Cyclophilin (Dawar et al. 2017) . The inhibition of cyclophilins by using cyclosporine A might arrest the replication of coronaviruses such as SARS-CoV (Pfefferle et al. 2011) , so the non-immunosuppressive cyclosporine A derivatives might have the potential as inhibitors against coronaviruses such as emerging newly COVID-19. Now, only 6 clinical trials are being carried out to reveal the efficacy of cyclosporine A against COVID-19 (NIH US National Library of Medicine clinical trial database, https://www.clinicaltrials.gov/ct2/ results?cond=Covid19&term=cyclosporine+A&type= &rslt=&age_v=&gndr=&intr=&titles=&outc=&spons= &lead=&id=&cntry=&state=&city=&dist=&locn= &rsub=&strd_s=&strd_e=&prcd_s=&prcd_e==&sfpd_s= &sfpd_e=&rfpd_s=&rfpd_e=&lupd_s=&lupd_e=&sort=)."}, {"section_title": "Mesenchymal stem cells", "text": "Mesenchymal stem cells (MSCs) are strong anti-inflammatory and immunomodulatory. Besides, it has been determined that MSCs could improve acute/chronic lung injury and acute respiratory distress syndrome (ARDS), because they suppress the leakage of immune cells to pulmonary tissues and proinflammatory cytokine secretion (Ortiz et al. 2007; Gupta et al. 2007; Moodley et al. 2009; Matthay et al. 2010 ). Furthermore, MSCs contribute to decreasing lung fibrosis as well as increasing tissue repair (Kumamoto et al. 2009; El Agha et al. 2017 ). The patients with severe COVID-19 infections suffer from cytokine storm syndromes, ARDS, and acute lung injury so MSCs may be an encouraging therapeutic option to prevent these complications. There are 55 clinical trials ongoing about MSCs, of them only 2 trials were finished, now (NIH US National Library of Medicine clinical trial database, https://www.clinicaltrials.gov/ct2/results?cond= Covid19&term=mesenchymal+stem+cell&type=&rslt= &age_v=&gndr=&intr=&titles=&outc=&spons=&lead= &id=&cntry=&state=&city=&dist=&locn=&rsub=&strd_ s=&strd_e=&prcd_s=&prcd_e=&sfpd_s=&sfpd_e= &rfpd_s=&rfpd_e=&lupd_s=&lupd_e=&sort=). However, the use of MSCs for the treatment of COVID-19 is not advised except in a clinical trial (NIH COVID-19 Treatment Guidelines, https://www.covid19treatmentguidelines.nih.gov/ immune-based-therapy/blood-derived-products/mesenchyma l-stem-cells/)."}, {"section_title": "Natural killer cells", "text": "Natural killer (NK) cells are large granular lymphocytes and originated from bone marrow. Because NK cells have the ability to distinguish between normal cells and infected cells, it regulates a large number of immunological courses, for example, viral defense and immunological homeostasis. NK cells break down virus-infected cells by antibodydependent cellular cytotoxicity (ADCC) process (Hammer et al. 2018) . Therefore, NK cells show specificity to nearly all virus-infected cells. Some researches have indicated that NK cells can show antiviral efficiency against SARS-CoV, herpes simplex virus type 1 (HSV-1), cytomegalovirus, and HIV viruses through ADCC mediators (Dai and Caligiuri 2018; Arase et al. 2002; National Research Project for SARS, Beijing Group 2004) .\nSorrento and Celularity declared that clinical cooperation has been started to be used CYNK-001, an allogeneic, offthe-shelf, obtained from navel cord blood NK cell therapy, as a new therapy method for the therapy and prevention of COVID-19 (Sorrento and Celularity to initiate emergency allogeneic NK cell therapy development for coronavirus infection Sorrento and Celularity to initiate emergency allogeneic NK cell therapy development for coronavirus infection). In order to rise immunity by using NK cell therapy until new treatment methods are found, NK cell therapy is of great importance against COVID-19 pneumonia so 28 clinical trials are underway about NK cell, at present (NIH US National Library of Medicine clinical trial database, https://www.clinicaltrials.gov/ct2/results?cond= Covid19&term=natural+killer+cell&type=&rslt=&age_ v=&gndr=&intr=&titles=&outc=&spons=&lead=&id= &cntry=&state=&city=&dist=&locn=&rsub=&strd_s= &strd_e=&prcd_s=&prcd_e=&sfpd_s=&sfpd_e=&rfpd_ s=&rfpd_e=&lupd_s=&lupd_e=&sort=)."}, {"section_title": "Antiviral drugs", "text": "Remdesivir Remdesivir (Fig. 4) , a nucleotide analog GS-5734, has capable of being incorporated into the new viral RNA leading to early termination. This mechanism constitutes the . Furthermore, when the patient with COVID-19 infection got worse, this patient was treated with remdesivir, intravenously in the USA (Holshue et al. 2020 ). Remdesivir has some benefits to treat COVID-19 infections, but randomized controlled trials are necessary to prove its activity and safety.\nThe suggested mechanism of remdesivir is the host cells' post-entry stage . It was found that combined use of remdesivir and IFN-β created the higher an antiviral activity compared to the lopinavir/ritonavir-IFN-β combination against MERS-CoV virus in vitro and in vivo. Additionally, remdesivir could be better pulmonary function, cause to fall lung viral loads and severe lung pathology in mice, on the contrary, lopinavir/ritonavir-IFN-β could not (Sheahan et al. 2020) .\nTwo clinical studies regarding the use of remdesivir have been carried out against severe or mild respiratory infections caused by 2020c; NCT04252664 2020). Dyer et al. (2019) has shown that initial findings of a death rate were 33% in 499 patients under treatment by using remdesivir against the Ebola disease. Moreover, the mortality rate of non-treated infected patients was 75% (almost 1900 people) during the same epidemic period.\nRecently, it was proclaimed that the United States Food and Drug Administration (FDA) approved remdesivir for emergency use to treat COVID-19 pneumonia (The FDA has approved emergency use of remdesivir to treat COVID-19).\nMeanwhile, a molecular docking study including five antiviral drugs, ribavirin, remdesivir, sofosbuvir, galidesivir, and tenofovir was conducted against SARS-CoV-2 RNA-dependent RNA polymerase (RdRp), these drugs showed promising results against COVID-19. Further optimization of these agents using a high-quality model of the SARS-CoV-2 RdRp might be useful for designing perfect compounds able to prevent this spreading infection (Elfiky 2020) . Now, 44 clinical trials are being carried out to reveal the efficacy of this drug against COVID-19, of them 5 trials were completed (NIH US National Library of Medicine clinical trial database, https://clinicaltrials.gov/ct2/results? cond=Covid19&term=remdesivir&type=&rslt=&age_v= &gndr=&intr=&titles=&outc=&spons=&lead=&id= &cntry=&state=&city=&dist=&locn=&rsub=&strd_s= &strd_e=&prcd_s=&prcd_e=&sfpd_s=&sfpd_e=&rfpd_ s=&rfpd_e=&lupd_s=&lupd_e=&sort=). Considering the patient's supplemental oxygen necessities and the manner of oxygen delivery, the use of remdesivir has been changed in the therapy of COVID-19 in July (NIH COVID-19 Treatment Guidelines, https://www.covid19treatment guidelines.nih.gov/antiviral-therapy/remdesivir/)."}, {"section_title": "Lopinavir/ritonavir", "text": "Lopinavir and ritonavir (Fig. 4) that inhibit the HIVprotease enzyme are antiretroviral drugs used for AIDS treatment. It is known that as a result of the combined use of ritonavir, which is used in low doses to increase the Lin et al. (2020) , reported that lopinavir and ritonavir could connect to the SARS-CoV-2 protease in the modeling study. This offers that lopinavir/ritonavir could be effective by inhibiting SARS-CoV-2 protein synthesis. Furthermore, several findings proved that treatment with lopinavir/ritonavir alone or in combination together with other antiviral agents developed severe patients with SARS or MERS (Chu et al. 2004; Sheahan et al. 2020; Zumla et al. 2016) .\nThe combination of lopinavir/ritonavir and ribavirin has improved the course of the disease in SARS-CoV patients (Chu et al. 2004) .\nIn other combination studies with lopinavir/ritonavir, ribavirin and IFN-α2a carried out in South Korea, a patient with MERS-CoV disease has been successfully treated (Kim et al. 2016 ). Now, lopinavir/ritonavir and IFN-β1b is in phase 2 for the MERS therapy in a randomized controlled trial (Arabi et al. 2018) . Similarly, the therapeutic efficacy of the same combination is being investigated in a sequential randomized controlled trial (Arabi et al. 2020) .\nDespite the positive findings mentioned above, according to a recent study performed on patients with SARS-CoV-2 infection, it has been suggested that the lopinavir/ritonavir combination did not provide the clinical improvement compared to standard care processings . Actually, findings of lopinavir/ritonavir clinical efficacy remain limited and primarily anecdotal cases . Although COVID-19 viral load can be decreased via lopinavir/ritonavir application very fast (Lim et al. 2020) , the use of this combination for the therapy of COVID-19 is not advised by the COVID-19 Treatment Guidelines Panel except in a clinical trial (NIH COVID-19 Treatment Guidelines, https://www.covid19treatmentguidelines.nih. gov/antiviral-therapy/lopinavir-ritonavir-and-other-hivprotease-inhibitors/). Further research related the clinical efficacy about lopinavir/ritonavir combination in the therapy of COVID-19 is needed as current results contradict so 81 clinical trials are continuing on this combination, of them 8 trials were completed (NIH US National Library of Medicine clinical trial database, https://clinicaltrials.gov/ct2/results?cond= Covid19&term=lopinavir+%2F+ritonavir&cntry=&sta te=&city=&dist=).\nFavipiravir Favipiravir (Fig. 4) is a new antiviral drug that inhibits RNA-dependent RNA polymerase (RdRp). It was approved for use against novel influenza in February 2020 in China. Besides, its anti-influenza virus action, it stops the replication of RNA viruses such as flavi-, alpha-, filo-, bunya-, arena-, noroviruses (Delang et al. 2018) . Favipiravir is a pro-drug which is converted into an active phosphoribosylated form (Favipiravir-RTP) in cells, then viral RNA polymerase identifies it as a substrate, resulting in inhibiting RNA polymerase function (Furuta et al. 2017 ). Eventually, favipiravir may have a potent antiviral activity for the therapy of COVID-19. The promising outcomes were achieved in a clinical trial with favipiravir against COVID-19 in China. The preliminary results from this study involving 80 patients (a total of the experimental and the control group) stated that favipiravir showed a more powerful antiviral activity than that of lopinavir/ritonavir. Adverse reactions did not observe in favipiravir therapy group considerably. Compared to the lopinavir/ritonavir group, it had considerably fewer adverse effects (https://www.szdsyy.com/News/0a6c1e58-e3d0-4cd1-867a-d5524bc59cd6.html).\nPresently, 32 clinical trials are being carried out for using favipiravir in the treatment of COVID-19, of them 6 trials were completed and it is expected that promising results will be achieved in removing the virus (NIH US National Library of Medicine clinical trial database, https://clinica ltrials.gov/ct2/results?cond=Covid19&term=favipira vir&type=&rslt=&age_v=&gndr=&intr=&titles= &outc=&spons=&lead=&id=&cntry=&state=&city= &dist=&locn=&rsub=&strd_s=&strd_e=&prcd_s= &prcd_e=&sfpd_s=&sfpd_e=&rfpd_s=&rfpd_e=&lupd_ s=&lupd_e=&sort=). Moreover, a pharmaceutical company has started Phase 3 clinical trials by using of tablet favipiravir in India and the complete study results are expected in August (News: Glenmark begins Phase 3 clinical trials on antiviral drug Favipiravir for COVID-19 patients in India).\nDanoprevir Danoprevir (Fig. 4) , approved in China for the therapy of noncirrhotic genotype 1b chronic hepatitis C together with some drugs, is a HCV N53 protease inhibitor. Only two clinical trials were completed using danoprevir combined with ritonavir in the treatment of SARS-CoV-2 infection in China (NIH US National Library of Medicine clinical trial database, https://clinicaltrials.gov/ct2/results?cond=Covid19&term=da noprevir&type=&rslt=&age_v=&gndr=&intr=&titles= &outc=&spons=&lead=&id=&cntry=&state=&city= &dist=&locn=&rsub=&strd_s=&strd_e=&prcd_s=&prcd_ e=&sfpd_s=&sfpd_e=&rfpd_s=&rfpd_e=&lupd_s= &lupd_e=&sort=).\nDarunavir Darunavir (Fig. 4) boosted with ritonavir or cobicistat are currently used for in HIV/AIDS treatment approved by the FDA. Thus, the pharmacokinetics and pharmacodynamics of darunavir or ritonavir are enhanced by cytochrome p450 (CYP3A) inhibition (Mathias et al. 2010; Santos et al. 2019) . Cell experiments with darunavir showed that the drug inhibited viral replication of COVID-19 in vitro, significantly (News: Abidol and darunavir can effectively inhibit coronavirus). Although lopinavir/ritonavir used in the treatment of HIV/AIDS, has more efficacy and tolerability than darunavir, its use in COVID-19 is limited (Lombardy Section Italian Society Infectious and Tropical Diseases 2020). Currently, there are nine clinical trials at different phases of development on the efficacy of darunavir in the treatment of COVID-19 pneumonia (NIH US National Library of Medicine clinical trial database, https:// clinicaltrials.gov/ct2/results?cond=Covid19&term=daruna vir&type=&rslt=&age_v=&gndr=&intr=&titles= &outc=&spons=&lead=&id=&cntry=&state=&city= &dist=&locn=&rsub=&strd_s=&strd_e=&prcd_s= &prcd_e=&sfpd_s=&sfpd_e=&rfpd_s=&rfpd_e=&lupd_ s=&lupd_e=&sort=)."}, {"section_title": "Ribavirin", "text": "Ribavirin (Fig. 4) , has a broad-spectrum agent against virus diseases, is a nucleoside analog. It suppresses the action of inosine monophosphate dehydrogenase, thus, the synthesis of guanosine triphosphate (GTP) is affected, so the replication of RNA and DNA viruses could be prevented. Ribavirin was widely used during the outbreak of SARS in Hong Kong. For this, it was sometimes preferred with or without steroids (Wenzel and Edmond 2003; Jones et al. 2004; Peiris et al. 2003) . The combination of ribavirin and interferon-β, which appears to inhibit SARS-CoV replication, has shown significant efficacy in the inhibition of SARS-CoV (Morgenstern et al. 2005) . Ribavirin is being searched in 12 clinical trials, and 3 of them were completed, now (NIH US National Library of Medicine clinical trial database, https://clinicaltrials.gov/ct2/results?cond= Covid19&term=ribavirin&type=&rslt=&age_v=&gndr= &intr=&titles=&outc=&spons=&lead=&id=&cntry= &state=&city=&dist=&locn=&rsub=&strd_s=&strd_e= &prcd_s=&prcd_e=&sfpd_s=&sfpd_e=&rfpd_s=&rfpd_ e=&lupd_s=&lupd_e=&sort=). In one of the completed clinical trials, Hung et al. (2020) reported that the ribavirin triple antiviral treatment was safe and superior compared to lopinavir-ritonavir combined therapy."}, {"section_title": "Arbidol (umifenovir)", "text": "Arbidol (Fig. 4) is an antiviral agent that has indolderivative compound and is registered in Russia and China for prophylaxis and therapy of influenza and other respiratory viral infections. This drug prevents fusion between the virus and the cell membrane that is an important stage in the entry of the virus into the cell (Blaising et al. 2014) . And also, it blocks hepatitis virus entry and replication in vitro (Pécheur et al. 2016) . Arbidol and its derivative, arbidol mesylate, showed antiviral activity against SARS-CoV because they declined the reproduction of the virus in the cell cultures (Khamitov et al. 2008 ). Based on a few findings, arbidol tested alone or with some antiviral agents against COVID-19, and certain positive effects were observed . Currently, arbidol alone or in combination with some antiviral drugs are tested through ten clinical trials, of them only one trial was completed (NIH US National Library of Medicine clinical trial database, https://www.clinicaltrials. gov/ct2/results?cond=Covid19&term=arbidol&type= &rslt=&age_v=&gndr=&intr=&titles=&outc=&spons= &lead=&id=&cntry=&state=&city=&dist=&locn= &rsub=&strd_s=&strd_e=&prcd_s=&prcd_e=&sfpd_s= &sfpd_e=&rfpd_s=&rfpd_e=&lupd_s=&lupd_e=&sort=)."}, {"section_title": "Neuraminidase inhibitors", "text": "Oseltamivir, zanamivir, and peramivir (Fig. 5) are antiviral drugs that inhibit the viral neuraminidase enzyme and block the release of viral particles out of host cells (Uyeki 2018) . These agents called neuraminidase inhibitors are recommended for influenza ). Neuraminidase inhibitors have been used as an empirical treatment in MERS-CoV infection (Bleibtreu et al. 2018) . Furthermore, it was reported that oseltamivir has been used either with or without antibiotics and corticosteroids against COVID-19 . In a clinical trial, oseltamivir is tested with chloroquine and favipiravir (ClinicalTrials.gov [Internet] 2020d). Presently, 17 clinical trials are being conducted for using oseltamivir against COVID-19, of them only 1 trial was completed (NIH US National Library of Medicine clinical trial database, https://clinicaltrials.gov/ct2/ results?cond=Covid19&term=oseltamivir&type=&rslt= &age_v=&gndr=&intr=&titles=&outc=&spons=&lead= &id=&cntry=&state=&city=&dist==&locn=&rsub= &strd_s=&strd_e=&prcd_s=&prcd_e=&sfpd_s=&sfpd_ e=&rfpd_s=&rfpd_e=&lupd_s=&lupd_e=&sort=)."}, {"section_title": "Chloroquine and hydroxychloroquine", "text": "Chloroquine and hydroxychloroquine (Fig. 6) have been utilized against malaria for years. Besides, this chemical usage, they show antiviral effects against HIV. Their mechanism of action is to inhibit the virus entry into host cells. The second antiviral mechanism is thought to be relevant to the post-translation modification of freshly synthesized proteins over glycosylation inhibition (Rolain et al. 2007) .\nChloroquine and hydroxychloroquine blocked viral replication at multiple points in vitro experiments so these drugs have been found to be effective against SARS-CoV-2. Primarily, they come together in lysosomes, increase endosomal pH, and cut off the lysosome-endosome fusion. Therefore, the transport of virus is blocked . Furthermore, chloroquine and hydroxychloroquine have been determined to interfere with the angiotensinconverting enzyme 2 (ACE2) receptor, which has an important receptor for the attachment of COVID-19 into the cell by cell-surface protein glycosylation (Fantini et al. 2020 ). In addition, it was shown that chloroquine had higher efficacy than hydroxychloroquine .\nHydroxychloroquine combined with the macrolide antibiotic azithromycin cured 100% of patients with COVID-19 in a trial, lately. However, hydroxychloroquine alone cured only 57.1% of patients (Gautret et al. 2020) . Nowadays, the efficacy of chloroquine and hydroxychloroquine will be tried in people with COVID-19 (National Library of Medicine (US), Bethesda (MD) 2020) in the healthcare setting (COPCOV) (ClinicalTrials.gov [Internet] 2020e), and chloroquine as preventative medicine against COVID-19. Now, 246 clinical trials are being carried out with hydroxychloroquine, of them 21 trials were completed (NIH US National Library of Medicine clinical trial database, https:// clinicaltrials.gov/ct2/results?cond=Covid19&term= hydroxychloroquine&type=&rslt=&age_v=&gndr=&intr= &titles=&outc=&spons=&lead=&id=&cntry=&state= &city=&dist=&locn=&rsub=&strd_s=&strd_e=&prcd_ s=&prcd_e=&sfpd_s=&sfpd_e=&rfpd_s=&rfpd_e= &lupd_s=&lupd_e=&sort=).\nThe antiviral activity of chloroquine phosphate has been shown against the SARS virus and avian flu in clinical studies in vitro and animal models (Savarino et al. 2006; Vincent et al. 2005; Yan et al. 2013) . Because chloroquine has immunomodulatory action, this effect could enhance its antiviral activity in vivo. Chloroquine penetrates into the tissues well after oral administration. It was declared in February 2020 in China, the use of chloroquine improved the rate of clinical success, with a reduction of hospitalization and the improvement of the patient's outcome (Multicenter collaboration group of Department of Science and Technology of Guangdong Province and Health Commission of Guangdong Province for chloroquine in the treatment of novel coronavirus pneumonia 2020). Presently, 84 clinical trials are being conducted with chloroquine, of them 9 trials were at the completed stage (NIH US National Library of Medicine clinical trial database, https://clinicaltrials.gov/ct2/ results?cond=Covid19&term=chloroquine&type=&rslt= &age_v=&gndr=&intr=&titles=&outc=&spons=&lead= &id=&cntry=&state=&city=&dist=&locn=&rsub= &strd_s=&strd_e=&prcd_s=&prcd_e=&sfpd_s=&sfpd_ e=&rfpd_s=&rfpd_e=&lupd_s=&lupd_e=&sort=).\nSince clinical data about the use of chloroquine and hydroxychloroquine in the treatment of COVID-19 pneumonia with severe and critical conditions is very limited, the COVID-19 Treatment Guidelines Panel does not advise the usage of these drugs in therapy, except in a clinical trial (NIH COVID-19 Treatment Guidelines, https://www.covid19trea tmentguidelines.nih.gov/antiviral-therapy/chloroquine-orhydroxychloroquine/)."}, {"section_title": "Methylprednisolone", "text": "Corticosteroid therapy (methylprednisolone (Fig. 7) , dexamethasone, and hydrocortisone) has been shown to be useful for the therapy of SARS-CoV patients. This therapy method extended the survival period of clinical cases, significantly (Long et al. 2016) . On the contrary, other researchers claimed that when corticosteroids used in the early steps of SARS infections it caused to increase values of viral load . Besides, researches where corticosteroids in the adjuvant therapy against MERS-CoV Previously, methylprednisolone has been used with antibiotics, oseltamivir, and oxygen therapy against COVID-19 (Huang et al. 2020) .\nCurrently, a total of 32 clinical trials are underway with methylprednisolone in the treatment of COVID-19, of them 6 trials were completed (NIH US National Library of Medicine clinical trial database, https://clinicaltrials.gov/ct2/results? cond=Covid19&term=methylprednisolone&type=&rslt= &age_v=&gndr=&intr=&titles=&outc=&spons=&lead= &id=&cntry=&state=&city=&dist=&locn=&rsub= &strd_s=&strd_e=&prcd_s=&prcd_e=&sfpd_s=&sfpd_ e=&rfpd_s=&rfpd_e=&lupd_s=&lupd_e=&sort=).\nThalidomide Thalidomide (Fig. 7) speeds up the deterioration of mRNA in blood cells, consequently shows anti-inflammatory activity. And also, it reduces TNF-α. Additionally, this agent has the ability to increase the secretion of interleukins (ILs), e.g., IL-12, and activate natural killer cells (Newfield 2018) . Now, only 5 clinical trials are being conducted by researchers on thalidomide (NIH US National Library of Medicine clinical trial database, https://clinicaltrials.gov/ ct2/results?cond=Covid19&term=thalidomide&type= &rslt=&age_v=&gndr=&intr=&titles=&outc=&spons= &lead=&id=&cntry=&state=&city=&dist=&locn= &rsub=&strd_s=&strd_e=&prcd_s=&prcd_e=&sfpd_s= &sfpd_e=&rfpd_s=&rfpd_e=&lupd_s=&lupd_e=&sort=)."}, {"section_title": "Vitamin C", "text": "Vitamin C (Fig. 7) is a water-soluble vitamin and known as ascorbic acid also. Because of its antioxidant efficiency, it may have a reducing effect on oxidative stress and inflammation (ClinicalTrials.gov [Internet] 2020f; Kashiouris et al. 2020) . It has been revealed that vitamin C supported immune functions and protected against coronavirus infections (Hemila 2003) . In human-controlled trials, vitamin C decreased the incidence of pneumonia, significantly. Thus, it was thought that vitamin C may be an anti-sensitiveness compound that prevents the sensitivity to lower respiratory tract infections under particular situations (Hemilä 1997) . As of now, 32 clinical trials were being carried out on vitamin C, of them only 1 was completed (NIH US National Library of Medicine clinical trial database, https://clinicaltrials.gov/ct2/ results?cond=Covid19&term=vitamin+c&type=&rslt= &age_v=&gndr=&intr=&titles=&outc=&spons=&lead= &id=&cntry=&state=&city=&dist=&locn=&rsub= &strd_s=&strd_e=&prcd_s=&prcd_e=&sfpd_s=&sfpd_ e=&rfpd_s=&rfpd_e=&lupd_s=&lupd_e=&sort=).\nSince there are not enough data, it is not recommended to use or not use vitamin C in the treatment of COVID-19 patients (NIH COVID-19 Treatment Guidelines, https://www. covid19treatmentguidelines.nih.gov/adjunctive-therapy/vita min-c/). Pirfenidone Pirfenidone (Fig. 7) having anti-inflammatory and antioxidant activities have been used against idiopathic pulmonary fibrosis diseases, so far. Additionally, it inhibits IL-1β and IL-4, https://clinicaltrials.gov/ct2/show/ NCT04282902?term=NCT04282902&draw=2&rank=1. Probably, its anti-inflammatory effects might be beneficial, but there are no clinical trials on pirfenidone, at present. Bromhexine Bromhexine (Fig. 7) inhibits a transmembrane protease serine that is responsible for the activation of S-glycoprotein found in SARS and MERS viruses. This glycoprotein provides the entry of the virus through the plasma membrane so 5 clinical trials are carried out on the efficacy of bromhexine against COVID-19 cases (NIH US National Library of Medicine clinical trial database, https://clinicaltrials.gov/ct2/ results?cond=Covid19&term=bromhexine&type=&rslt= &age_v=&gndr=&intr=&titles=&outc=&spons=&lead= &id=&cntry=&state=&city=&dist=&locn=&rsub= Fingolimod Fingolimod (Fig. 7) is a sphingosine-1-phosphate receptor regulator. It has a potent modulator for the immune system thus, its use in multiple sclerosis is beneficial. Because some pathological evidences such as pulmonary edema and hyaline membrane formation are observed, it is thought that the utilization of drugs with immune modulator properties combined with the ventilator support is noteworthy to stop the progress of acute respiratory distress syndrome in severe patients. Only 1 clinical trial is being conducted by researchers on fingolimod, currently (NIH US National Library of Medicine clinical trial database, https://www. clinicaltrials.gov/ct2/results?cond=Covid19&term= fingolimod&type=&rslt=&age_v=&gndr=&intr=&titles= &outc=&spons=&lead=&id=&cntry=&state=&city= &dist=&locn=&rsub=&strd_s=&strd_e=&prcd_s= &prcd_e=&sfpd_s=&sfpd_e=&rfpd_s=&rfpd_e=&lupd_ s=&lupd_e=&sort=)."}, {"section_title": "Imatinib", "text": "Blocking virus-host fusion is a promising target for the discovering of novel antiviral agents, so there are some studies on drugs that inhibit the Abl kinase pathway . In a study, imatinib, an Abl kinase inhibitor, was observed to block the replication of SARS and MERS viruses by blocking viral fusion in 2016 (Coleman et al. 2016 ). Hoffman et al. (2020 also showed that the COVID-19 used the SARS-coronavirus receptor ACE2 as well as the cellular protease TMPRSS2 for accessing into target cells, so TMPRSS2, transmembrane serine protease 2, inhibitory agents such as imatinib may be evaluated as therapy options for COVID-19 disease. And five clinical trials are underway on the safety and efficacy of imatinib for the treatment of COVID-19 pneumonia, at present (NIH US National Library of Medicine clinical trial database, https://clinicaltrials.gov/ ct2/results?cond=Covid19&term=imatinib&type=&rslt= &age_v=&gndr=&intr=&titles=&outc=&spons=&lead= &id=&cntry=&state=&city=&dist=&locn=&rsub= &strd_s=&strd_e=&prcd_s=&prcd_e=&sfpd_s=&sfpd_ e=&rfpd_s=&rfpd_e=&lupd_s=&lupd_e=&sort=).\nCarrimycin Carrimycin (Fig. 7) is a macrolide class antibiotic and it is effective against some gram-positive bacteria, and Mycobacterium tuberculosis in vitro (Wang et al. 2019) . The drug has been used for the therapy of patients with COVID-19 in a clinical study (NIH US National Library of Medicine clinical trial database, https://www.clinicaltrials. gov/ct2/show/NCT04286503?term=carrimycin&cond= Covid19&draw=2&rank=1)."}, {"section_title": "Chinese medicine", "text": "The active compounds found in Chinese medicine, such as glycyrrhizin, hesperetin, baicalin, and quercetin (Fig. 8) are thought as considerable compounds in the prevention and treatment of COVID-19 disease .\nGlycyrrhizin (Fig. 8) , which is the active compound of liquorice roots used in Chinese medicine, can inhibit the transcription of SARS virus in vitro trials (Cinatl et al. 2003; Hoever et al. 2005) . Lately, it was found that glycyrrhizin can bind to the ACE2 receptor (Chen and Du 2020) . When given high doses of glycyrrhizin, it was clinically effective in clinical trials against the SARS virus (Lu et al. 2003; Wu et al. 2004 ). Moreover, it has been revealed that glycyrrhizin may inhibit the transcription of SARS-associated virus in vitro (Cinatl et al. 2003; Hoever et al. 2005) . Only one clinical trial is carried out about glycyrrhizin, now (NIH US National Library of Medicine clinical trial database, https://clinicaltrials.gov/ct2/results? cond=Covid19&term=Glycyrrhizin&type=&rslt=&age_ v=&gndr=&intr=&titles=&outc=&spons=&lead=&id= &cntry=&state=&city=&dist=&locn=&rsub=&strd_s= &strd_e=&prcd_s=&prcd_e=&sfpd_s=&sfpd_e=&rfpd_ s=&rfpd_e=&lupd_s=&lupd_e=&sort=).\nHesperetin (Fig. 8) has a flavon-structure compound obtained from citrus fruits and it is a notable traditional Chinese medicine. It was revealed that hesperetin had the capability of alleviating the division action of the 3C-like protease (3CLpro) of SARS virus dose-dependently in Fig. 8 Chemical structures of Chinese medicine cell-free as well as cell-based tests . 3CLpro is the viral parent proteinase that checks the actions of the coronavirus replication complex, thus it is an appealing target for treatment (3Clpro). Another study reported that hesperetin had the potential to inhibit ACE2 (Chen and Du 2020) . For these reasons, it seems that hesperetin has the potential to block SARS-CoV infection.\nBaicalin (Fig. 8) is one of the other active compounds used as Chinese medicine. Chen et al. (2004) revealed that baicalin can inhibit the SARS virus in vitro .\nQuercetin (Fig. 8) which is widely used in Chinese medicine is a flavone obtained from plants. Quercetin inhibits the 3CLpro of the SARS virus, thus, blocks the accessing of the SARS virus into host cells (Yi et al. 2004 ). Currently, two clinical trials are being conducted to evaluate the efficacy of quercetin in COVID-19 patients (NIH US National Library of Medicine clinical trial database, https:// clinicaltrials.gov/ct2/results?cond=Covid19&term= quercetin&type=&rslt=&age_v=&gndr=&intr=&titles= &outc=&spons=&lead=&id=&cntry=&state=&city= &dist=&locn=&rsub=&strd_s=&strd_e=&prcd_s= &prcd_e=&sfpd_s=&sfpd_e=&rfpd_s=&rfpd_e=&lupd_ s=&lupd_e=&sort=).\nIn view of these works, Chinese medicine can play a primary role in the therapy and prevention of COVID-19 disease."}, {"section_title": "Vaccines", "text": "Vaccination offers a very convenient tool to prevent and to inhibit the infectious diseases spread. The vaccines stimulate humoral immune responses, in this way, neutralizing antibodies are started to be produced in the human body. Thus, it is possible to both limit infection and prevents reinfection. Vaccine development studies are continuing as well as any discovery of new drug or development treatment method to treat COVID-19 pneumonia. Revealing the genome sequence of SARS-CoV-2 has accelerated vaccine development studies. The methods used for developing the SARS-CoV-2 vaccine are the same as those used for the SARS-CoV vaccine. Both viruses bind the same host cell receptor (ACE2). In addition to this, they can share similar disease pathogeneses as well as restricted cross-neutralizing antibodies (Devaux et al. 2020; Shih et al. 2020) . As of now (August 20, 2020), a total of 193 clinical trials are being conducted to develop a vaccine against COVID-19, of them 8 were at the completed stage (NIH US National Library of Medicine clinical trial database, https://clinicaltrials.gov/ ct2/results?cond=Covid19&term=vaccine&type=&rslt= &age_v=&gndr=&intr=&titles=&outc=&spons=&lea d=&id=&cntry=&state=&city=&dist=&locn=&rsub= &strd_s=&strd_e=&prcd_s=&prcd_e=&sfpd_s=&sfpd_ e=&rfpd_s=&rfpd_e=&lupd_s=&lupd_e=&sort=). Information about the vaccine candidates against COVID-19 is presented at Table 1 (NIH US National Library of Medicine clinical trial database, https://clinicaltrials.gov/ ct2/results?cond=Covid19&term=vaccine&type=&rslt= &age_v=&gndr=&intr=&titles=&outc=&spons=&lea d=&id=&cntry=&state=&city=&dist=&locn=&rsub= &strd_s=&strd_e=&prcd_s=&prcd_e=&sfpd_s=&sfpd_ e=&rfpd_s=&rfpd_e=&lupd_s=&lupd_e=&sort=; https://www.biocentury.com/clinical-vaccines-and-thera pies)."}, {"section_title": "Conclusion", "text": "The outbreak began with SARS-CoV in the year of 2002 firstly, then, extended to 32 countries and regions. Following one decade, the World encountered MERS-CoV, another coronavirus. Nowadays, the rising SARS-CoV-2 turned into a global threat so the WHO proclaimed that the COVID-19 outbreak was a global pandemic in March 2020.\nCOVID-19, previously known as SARS-CoV-2, targets lung cells by connecting to ACE2 protein. This protein is largely produced in some tissues such as bile duct, liver, gastrointestinal organs (e.g., small intestine, duodenum), esophagus, testis, and kidney as well as lung tissue Chai et al. 2020; Anti-2019 -nCoV Volunteers et al. 2020 Fan et al. 2020 ). Thus, COVID-19 may damage these organs and tissues. Now, COVID-19 has extended to various countries speedily, caused severe sickness and these events made it a relevant and considerable public healththreatening. Taking into account the global threatening caused by COVID-19, efficient therapy methods against COVID-19 disease are promptly necessary. Nevertheless, the development of new agents for this disease is still a considerable problem for people in the world, and we have none formally approved agents against COVID-19 pneumonia now. Looking at the epidemiological properties of COVID-19, it is very important to cut off the extending of this virus owing to epidemic prevention as well as checking procedures. For this, the most recommended preventions are putting infected people in quarantine and checking the source of infection. The limited information available we have is needed to develop novel drugs and to find new therapy methods to prevent this outbreak and to treat COVID-19 pneumonia. Furthermore, the design and improvement of vaccines against COVID-19 are also necessary as well as discovering novel agents and clinical trials of known drugs.\nIn this review, we focused on some medicines that have already started with the repositioning for COVID-19 therapy. The repositioning clinical trials seem to be an attractive strategy, thus, the discovery of new classes of drug can be easier, the costs and time for reaching the market can decrease, the pharmaceutical supply chain is available for formulation and distribution, more therapy methods are possible by combining the drugs. We hope that the continuing studies may provide solutions for the prevention and therapy against the COVID-19 pandemic in 2020."}, {"section_title": "Compliance with ethical standards", "text": "Conflict of interest The authors declare that they have no conflict of interest.\nPublisher's note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations."}]