[{"section_title": "Abstract", "text": "Missing covariate data commonly occur in epidemiological and clinical research, and are often dealt with using multiple imputation. Imputation of partially observed covariates is complicated if the substantive model is non-linear (e.g. Cox proportional hazards model), or contains non-linear (e.g. squared) or interaction terms, and standard software implementations of multiple imputation may impute covariates from models that are incompatible with such substantive models. We show how imputation by fully conditional specification, a popular approach for performing multiple imputation, can be modified so that covariates are imputed from models which are compatible with the substantive model. We investigate through simulation the performance of this proposal, and compare it with existing approaches. Simulation results suggest our proposal gives consistent estimates for a range of common substantive models, including models which contain non-linear covariate effects or interactions, provided data are missing at random and the assumed imputation models are correctly specified and mutually compatible. Stata software implementing the approach is freely available."}, {"section_title": "Introduction", "text": "Missing data are a pervasive problem in both experimental and observational medical research, causing a loss of information and potentially biasing inferences. In this article, we focus on settings in which interest lies in fitting a substantive model relating an outcome to a number of covariates, one or more of which have missing values. The method of multiple imputation (MI) has become an extremely popular approach for accommodating missing data in statistical analyses, both generally 1 and in the specific context of partially observed covariates. 2 MI involves 'filling in' each missing value with draws from an appropriate distribution, leading to a number M of completed datasets. The substantive model can then be fitted to each of the M completed datasets, and the results combined across the M datasets using Rubin's rules, 3 which account for the uncertainty due to the fact data have been imputed. MI is most often applied under the missing at random (MAR) assumption, which stipulates that the probability that data are missing are independent of the missing values, conditional on the observed data, although MI can also be used when data are missing not at random. 3 Parametric MI as originally proposed is based on a joint imputation model for the partially observed variables (conditional on any fully observed variables), which we refer to as 'joint model MI'. A popular alternative to joint model MI is the fully conditional specification (FCS) approach. 4, 5 FCS MI involves specifying a series of univariate models for the conditional distribution of each partially observed variable given the other variables. This permits a great deal of flexibility, since an appropriate regression model can be selected for each variable (e.g. linear regression for continuous variables, logistic regression for binary variables). Consequently, FCS MI is particularly appealing in settings in which a number of variables have missing data, some of which are continuous and some of which are discrete.\nOne of the strengths of MI is that it divides the process of dealing with missingness (the imputation stage) from the analysis of the completed data (the analysis stage). As has been previously discussed in detail, this division presents both opportunities and threats. [6] [7] [8] [9] . For example, we may be able to include so-called auxiliary variables in the imputation model which are not used in the analysis stage. This offers the potential for increased efficiency and may also improve the plausibility of the MAR assumption holding, by conditioning on auxiliary variables which are predictive of missingness. Sometimes the imputer and analyst will be different people. If the imputer has additional knowledge which enables him to impose (correct) additional assumptions in the imputation model, the analyst will gain efficiency.\nThe division may however sometimes lead to problems. In the context of imputing partially observed covariates, imputations might be generated from a model which is incompatible with the substantive model, which may lead to (asymptotically) biased estimates of parameters in the latter. Two conditional models are said to be incompatible if there exists no joint model for which the conditionals (for the relevant variables) equal these conditional models. This is a particular issue when the substantive model contains non-linear covariate effects or interactions, with which default imputation model choices may be incompatible. For example, suppose the substantive model is the linear regression of Y on a continuous covariate X and X 2 , and we wish to impute missing values in X. The default choice for the imputation model for XjY in software for MI is a normal linear model, with conditional mean equal to a linear function of Y, which is incompatible with the quadratic substantive model. Following imputation of X, X 2 is then passively imputed by squaring the imputed X values. In this case, estimates of the parameters of the substantive model from multiply imputed datasets will be biased (unless the quadratic coefficient is in truth zero), because within the subset of data where X has been imputed the association between X and Y is linear as a consequence of assuming linearity in the imputation model. 10 Incompatibility between the imputation and substantive models can be avoided by specifying a joint model for outcome and covariates for which the conditional distribution of outcome given covariates matches the substantive model and then using the imputation model implied by this joint model. However, specification of a joint model is challenging when there are a number of partially observed covariates, particularly when some are continuous and some are discrete. In this setting, the FCS method is an attractive option. However, the default univariate imputation models used in FCS may be incompatible with the substantive model. In this article, we therefore propose a modification of the popular FCS approach to MI which ensures that each of the univariate imputation models is compatible with the assumed substantive model.\nWe begin in Section 2 by introducing a motivating example from the Alzheimer's Disease Neuroimaging Initiative (ADNI). In Section 3, we formally define compatibility between an imputation model for partially observed covariates and a substantive model, explain when incompatibility implies imputation model mis-specification and give examples of when this occurs. We then outline how imputation models can be specified which are compatible with a given substantive model within the joint modelling approach to MI, which motivates our modification of the FCS MI approach. In Section 4, we briefly review the standard FCS framework for MI in the setting of partially observed covariates. In Section 5, we describe our modification of the FCS MI approach which ensures that each univariate imputation model is compatible with the substantive model. In Section 6 we give details for how this can be done when the model of interest is (i) normal linear regression, (ii) a model for a discrete outcome (e.g. logistic and Poisson regression) or (iii) a proportional hazards model. We report the results of a simulation study to investigate the performance of our proposed approach in Section 7. In Section 8, we apply our proposed approach to the motivating example. In Section 9, we discuss how our proposed approach can be used when, as is often the case, interest lies in fitting a number of different substantive models to the data. We conclude in Section 10 with a discussion."}, {"section_title": "Motivating example", "text": "The ADNI was launched in 2003 by the National Institute on Aging (NIA), the National Institute of Biomedical Imaging and Bioengineering (NIBIB), the Food and Drug Administration (FDA), private pharmaceutical companies and nonprofit organisations, as a 5-year public-private partnership. The aims of ADNI included assessing the ability of imaging and other biomarkers to measure the progression of mild cognitive impairment and early Alzheimer's disease (AD). The study aimed to recruit approximately 200 cognitively normal older individuals (controls), 400 with mild cognitive impairment (MCI) and 200 with early AD. Participants underwent clinical and cognitive assessment and MRI brain scans at baseline and at specified intervals (every 6 or 12 months, depending on subject group) up to 3 years. Further details regarding ADNI are given in the acknowledgements.\nRecently Jack et al. 11 used data from ADNI to investigate baseline predictors of time to conversion to AD in those subjects with MCI at baseline. In particular, using Cox proportional hazards models they found evidence of a non-linear association between amyloid 1-42 peptides (A 1À42 ) measured from cerebrospinal fluid (CSF) at baseline and log hazard of conversion. They found evidence that lower baseline hippocampal volume was predictive of increased hazard, after adjusting for total intracranial volume (a measure of head size). Jack et al. 11 also found evidence that the presence of the APOE4 gene, previously shown to be associated with development of AD in a number of studies, was associated with increased hazard for conversion to AD.\nParticipants were invited to have CSF measured at baseline by lumbar puncture, but were not required to do so to participate in the study. Consequently, only around 50% of subjects had CSF A 1À42 measured. The analysis of Jack et al. 11 was restricted to the subset of n ¼ 218 MCI subjects for whom CSF A 1À42 was measured. In a logistic regression analysis we found no evidence that availability of CSF was related to first of time to conversion to AD or censoring, or to the event indicator (joint test p ¼ 0.48). A second logistic regression model found evidence (p ¼ 0.02) that having a family history of AD was associated with an increased probability of having the CSF variables recorded, which seems quite plausible since those with a family history of AD may be especially concerned about their risk of developing the disease. These results suggest a complete case analysis might reasonably be assumed to be unbiased. However, it is inefficient, since it only uses data on 50% of MCI subjects.\nMCI is a heterogeneous classification, with only a certain proportion of subjects eventually going on to develop AD. For each subject their family history was collected at baseline, in particular in relation to whether their mother or father suffered from dementia or AD. Given that there is a genetic component to the disease, we were interested to investigate whether the presence of family history of AD was associated with increased hazard of conversion to AD, by including covariates indicating whether the subject's mother and father had had AD (Table 1) . Unfortunately, although family history of dementia was well recorded, family history of AD specifically suffered from missingness (see Table 1 ).\nWe aimed to estimate the parameters of a Cox proportional hazards model for hazard of conversion to AD using the available data from the n ¼ 382 ADNI subjects who had MCI at baseline and who had at least one follow-up visit. Of these subjects, 167 were observed to convert to AD during follow-up. Our substantive model contained as covariates the variables listed in Table 1 , plus the square of A 1À42 to allow for the non-linear association previously identified by Jack et al. 11 . In addition to CSF A 1À42 , we included CSF tau and p-tau as covariates, which are also thought to reflect pathology, and thus might be associated with hazard of conversion to AD. Tau and p-tau were log transformed to reduce skewness in their distribution. The FCS approach to MI is attractive here, since seven covariates are partially observed, with some continuous and some binary. However, we should be careful to ensure that the imputation models we use are compatible with the substantive model, which includes a quadratic effect of one of the partially observed covariates. If we impute from a model which does not allow for a potential non-linear association between (log) hazard and CSF A 1À42 , we would expect to obtain inconsistent parameter estimates, particularly of the coefficients relating to CSF A 1À42 . "}, {"section_title": "MI of partially observed covariates 3.1 Setup", "text": "We consider the setting in which interest lies in fitting a model to a fully observed outcome Y (although see Section 10) with p partially observed covariates X ¼ ðX 1 , . . . , X p Þ and q fully observed covariates Z ¼ ðZ 1 , . . . , Z q Þ. Let X obs and X mis denote the observed and missing components of X for a given subject, and let R be the vector of observation indicators whose elements are zero or one depending on whether the corresponding element of X is missing or observed. We assume throughout that the data are MAR. 12 Here, MAR means that PðRjY, X, ZÞ ¼ PðRjY, X obs , ZÞ. We assume that ðY i ,\n. . , n are independent and identically distributed. Lastly, we let f ðYjX, Z, Þ denote the 'substantive model', which is indexed by parameter ( 2 É). We assume throughout that this substantive model is correctly specified. That is, there exists 2 É such that f 0 ðYjX, ZÞ ¼ f ðYjX, Z, Þ, where f 0 ðYjX, ZÞ denotes the true conditional distribution of Y given X and Z."}, {"section_title": "MI of partially observed covariates", "text": "In Bayesian parametric MI, to multiply impute missing values in X we specify a parametric model f ðXjZ, Y, !Þ, ! 2 for the conditional distribution f ðXjY, ZÞ. To create the mth imputed dataset we first draw ! ðmÞ from its posterior distribution given the observed data fðY, X obs , ZÞ; i ¼ 1, . . . , ng and a (usually noninformative) prior f(!). For each subject the missing values (if any) X mis are imputed by taking a draw from the density f ðX mis jX obs , Y, Z, ! ðmÞ Þ implied by f ðXjY, Z, ! ðmÞ Þ.\nHaving created M imputed datasets, the substantive model parameter is then estimated separately using each imputed dataset, resulting in estimates^ 1 , . . . ,^ M and corresponding variances d Varð^ 1 Þ, . . . , d Varð^ M Þ. In this article, we assume that the substantive model is fitted using maximum likelihood. Rubin's rules are then invoked to provide a final inference for , with the estimator of given by^\nand an estimate of the variance of^ MI given by\nSuppose that the posited imputation model is correctly specified, so that there exists a value of ! 2 such that f 0 ðXjY, ZÞ ¼ f ðXjZ, Y, !Þ. Then^ MI is a consistent estimator of , and as the number of imputations M ! 1, confidence intervals (CIs) based on d Varð^ MI Þ achieve coverage at or above their nominal level. 6 "}, {"section_title": "Compatibility and imputation model mis-specification", "text": "When an imputation model f ðXjZ, Y, !Þ is directly specified, it may be mis-specified if it is not compatible with the substantive model (assuming this is correctly specified). For example, if the correctly specified substantive model includes an interaction between a partially observed covariate and a fully observed covariate in their effect on the outcome Y, imputation models which do not allow for this interaction will generally (unless the interaction term is in truth zero) be mis-specified. Such considerations led to recommendations that imputation models be used which do not impose restrictions which will conflict with subsequent analyses of the imputed datasets. 6, 7 Extending a definition given by Liu et al., 13 we now define the notion of compatibility between a set of conditional models. Let A ¼ ðA 1 , . . . , A p Þ be a vector of random variables, and let A Àj ¼ ðA 1 , . . . , A jÀ1 , A jþ1 , . . . , A p Þ. Let B denote a further, possibly empty, vector of random variables. Then a set of conditional models ff j ðA j jA Àj , B, j Þ; j 2 Â j , j ¼ 1, . . . , pg is said to be compatible if there exists a joint model gðAjB, Þ, 2 Â and a collection of surjective maps ft j : Â ! Â j ; j ¼ 1, . . . , pg such that for each j, j 2 Â j and 2 t À1\nOtherwise the set of models ff j ; j ¼ 1, . . . , pg is said to be incompatible.\nA weaker property which we shall also use is that of semi-compatibility for a set of models. A set of models is semi-compatible if they can be made compatible by setting one or more parameters to zero. More formally (again following Liu et al. 13 ), a set of conditional models fh j ðA j jA Àj , B, j , j Þ; j 2 Â j , j 2 K j , j ¼ 1, . . . , pg is said to be semi-compatible if there exists a set of compatible conditional models ff j ðA j jA Àj , B, j Þ;\nA set of compatible conditional models is always semi-compatible. If the joint model gðAjB, Þ corresponding to the set of conditionals ff j ; j ¼ 1, . . . , pg is correctly specified (i.e. contains the true probability distribution), we say (again following Liu et al. 13 ) that the set of models fh j ; j ¼ 1, . . . , pg is valid semi-compatible.\nThe imputation model f ðXjZ, Y, !Þ is correctly specified if and only if it is valid semi-compatible with the substantive model f ðYjX, Z, Þ. As an example, suppose the substantive model is YjX $ Nð 0 þ 1 X þ 2 X 2 , 2 Þ and the imputation model is XjY $ Nð! 0 þ ! 1 Y, 2 ! Þ. These two models are incompatible (this can be established by the theorem for compatibility of two conditional densities of Arnold and Press 14 ). They are semi-compatible, with the joint model for (X, Y) being the bivariate normal, by setting 2 ¼ 0. However, they are not valid semi-compatible, unless in truth 2 ¼ 0. The imputation model is therefore mis-specified in general, and the MI estimator^ MI will be inconsistent, as demonstrated through simulation by von Hippel 15 and Seaman et al. 10 It is important to note that incompatibility between the imputation and substantive models does not necessarily imply mis-specification of the former. For example, suppose the substantive model is\n! Þ, with each of the regression coefficients lying in ðÀ1, þ 1Þ. Then again the two models are incompatible, but are semi-compatible, with joint model the bivariate normal, by setting ! 2 ¼ 0. If the data in truth are bivariate normal, the two models are valid semi-compatible, and the imputation model is correctly specified. Here, incompatibility between imputation and substantive models does not imply misspecification of the former because a more restrictive version of the imputation model (with ! 2 ¼ 0) is compatible with the substantive model.\nIncompatibility may also arise when default imputation models are used for covariates in nonlinear substantive models. For example, suppose T (rather than Y) is a time to event outcome which is not subject to censoring, and that the substantive model is the parametric exponential model, with hazard function hðtÞ ¼ h 0 expð XÞ, with X a continuous partially observed covariate and h 0 a time constant baseline hazard. In this case H 0 ðTÞ ¼\nThen suppose, following the recent recommendations of White and Royston, 16 we adopt a normal linear imputation model for XjT $ Nð! 0 þ ! 1 T, 2 ! Þ with T / H 0 ðTÞ as covariate. The two models are incompatible, and are only semi-compatible by setting ! 1 ¼ 0 and ¼ 0, such that T and X are independent. The imputation model can thus only be valid semi-compatible (and thus correctly specified) with the substantive model if T and X are independent. The MI estimator^ MI will thus generally be inconsistent (although simulations by White and Royston 16 show the bias is often small).\nIn conclusion, except in cases where the imputation and substantive models can be made compatible by restricting the parameter space of the imputation model, incompatibility between the two implies the imputation model is mis-specified (assuming correct specification of the substantive model). Consequently, when choosing the covariate imputation model f ðXjZ, Y, !Þ we should (at least) ensure that it is either compatible with the substantive model, or a restriction of it is compatible with the substantive model."}, {"section_title": "Joint model imputation", "text": "The natural route to ensuring compatibility between the imputation and substantive models is to explicitly specify a joint model gðY, XjZ, Þ which has the substantive model f ðYjX, Z, Þ as its corresponding conditional, and to derive the implied imputation model. Given the (correctly) specified substantive model f ðYjX, Z, Þ, such joint models are specified by defining a model f ðXjZ, Þ. The imputation model is then given by\nWe emphasise that using a compatible imputation model does not guarantee it is correctly specifiedthis is only true if, in addition to the substantive model being correctly specified, f ðXjZ, Þ is correctly specified. In cases where p ¼ 1 and X is univariate, specification of a model f ðXjZ, Þ is relatively straightforward. When X is multivariate, and particularly when it contains a mixture of continuous and discrete variables, specification of a joint model f ðXjZ, Þ becomes more challenging. In this setting, Ibrahim et al. 17 proposed specification by factorising the joint distribution of XjZ as a product of univariate densities of the form\nThis breaks the problem of joint specification into the easier task of specification of a series of univariate models. This means that appropriate univariate regression models can be specified depending on the type (i.e. continuous, discrete and ordered discrete) of each variable. However, as the dimension of X increases the number of possible orderings of its components increases rapidly, and it is not obvious which ordering should be chosen. As far as we are aware, this approach to MI has not been adopted by applied researchers. A new joint modelling approach for handling interactions and non-linearities has recently been proposed by Goldstein et al. 18 "}, {"section_title": "FCS MI", "text": "In the more general setting of MI in multivariate data, the FCS approach to MI similarly splits the task of specification of a joint model into a series of univariate model specifications. In FCS MI, as we describe in further detail in Section 4.1, models are specified for each partially observed variable conditional on all other variables. In contrast to the approach proposed by Ibrahim et al., 17 there is no requirement to choose an ordering of the partially observed variables. FCS MI has now become an extremely popular approach to MI generally. 5 Application of FCS for imputation of partially observed covariates involves specification of models of the form f ðX j jX Àj , Z, YÞ, where X Àj denotes the components of X with X j removed. As we have described, for certain substantive models, such as those involving non-linear covariate effects or interactions, default choices of these imputation models within FCS will be incompatible. Further, they will not generally be valid semi-compatible with the substantive model, and will therefore be mis-specified (assuming correct specification of the substantive model). In the next sub-section, we review the standard FCS algorithm in detail, and then in Section 5 propose a modification of FCS MI which ensures that each of the covariate models f ðX j jX Àj , Z, YÞ is compatible with the substantive model."}, {"section_title": "The FCS algorithm", "text": "For each partially observed covariate X j , we posit an imputation model f ðX j jX Àj , Z, Y, j Þ, with parameter j , where X Àj ¼ ðX 1 , . . . , X jÀ1 , X jþ1 , : . . . X p Þ. This is typically a generalised linear model chosen according to the type of X j (e.g. continuous, binary and count). Furthermore, a noninformative prior distribution f( j ) for j is specified. Let x obs j and x mis j denote the vectors of observed and missing values in X j for the n subjects. Let y and z denote the vector and matrix of (fully observed) values of Y and Z across the n subjects.\nThe FCS algorithm begins by replacing the missing values in each X j by randomly selected observed values from the same variable. The algorithm then proceeds by repeatedly imputing the missing values in each variable, at each stage conditioning on the most recent imputations of the other variables. Let x misðtÞ j denote the imputations of the missing values x mis j at iteration t and let x ðtÞ j ¼ ðx obs j , x misðtÞ j Þ denote the vector of observed and imputed values at iteration t. Let\nThe tth iteration of the algorithm consists of drawing from the following distributions (up to constants of proportionality) \nThus, for the partially observed covariate X j the algorithm first draws j from its posterior distribution given x obs j , x ðtÞ Àj , z, y. This is equal (up to a constant of proportionality) to the product of the prior f( j ) and the likelihood corresponding to fitting the imputation model for X j to subjects for whom X j is observed, using the observed and most recently imputed values of X Àj . Missing values in X j are then imputed from the imputation model using the parameter value drawn in the preceding step. After a sufficient number of iterations it is assumed that the algorithm has converged to a stationary distribution, and the final draws of the missing data form a single imputed dataset. The process is then repeated to create as many imputed datasets as desired. In software implementations of FCS MI, the variables are typically updated in the ordering for which the missingness pattern is closest to monotone. Finally, the substantive model is fitted to each imputed dataset, and the results combined using Rubin's rules as described previously.\nNote that when drawing j , the FCS algorithm differs from a standard Gibbs sampler, which would draw j from its posterior distribution proportional to f ð j Þ f ðx misðtÀ1Þ j , x obs j jx ðtÞ Àj , z, y, j Þ, that is, the posterior corresponding to fitting the imputation model to all subjects, using the last iteration's imputation of X mis j , x misðtÀ1Þ j ."}, {"section_title": "Statistical properties", "text": "Despite the fact that FCS MI has been applied widely in a number of fields, 5 until recently few results were available regarding its validity. This is due to the fact that one can specify imputation models (which in our setting are f ðX j jX Àj , Z, Y, j Þ) that are not mutually compatible. 19 In this case, it is not clear to what distribution, if any, the algorithm will converge. Hughes et al. 20 have recently given conditions under which, at convergence, FCS draws imputations from a well-defined Bayesian joint model, which are as follows:\n(1) The conditional models f ðX j jX Àj , Z, Y, j Þ, j ¼ 1, . . . , p, are compatible, with corresponding joint model f ðXjZ, Y, Þ.\n(2) For each j ¼ 1, . . . , p, this joint model can be factorised as f ðXjZ, Y, Þ ¼ f ðX j jX Àj , Z, Y, j Þ f ðX Àj jZ, Àj Þ, where ð j , Àj Þ is a reparameterisation of , and j and Àj are variationally independent. (3) There exists a prior f() such that for each j\nHughes et al. 20 show that these conditions are satisfied when the conditional models are normal linear regression models, with the corresponding joint model being the multivariate normal, and the standard noninformative priors are used. Separately, Liu et al. 13 have given sufficient conditions under which the stationary distribution (assuming it exists) which FCS MI draws from converges (as n ! 1) to the posterior distribution of the missing data in a well-defined Bayesian model. Both Hughes et al. 20 and Liu et al. 13 give examples where compatible conditional models are used but FCS is not equivalent to imputation from a Bayesian joint model. A common, and therefore important, example is that in which a binary variable is imputed using logistic regression conditional on a continuous variable, with the latter imputed using a normal linear regression model. Although these models are compatible with each other, FCS imputation fails to utilise the information contained in the marginal distribution of the continuous variable about the logistic regression parameters, and consequently FCS MI does not draw from a Bayesian joint model.\nEven when the conditional models are not compatible, Liu et al. 13 show that provided the conditional models are valid semi-compatible, the estimator^ MI is consistent. This result can be used to conclude that in the linear-logistic example described in the previous paragraph, in which the models are compatible (and therefore also semi-compatible)^ MI is consistent provided both models are correctly specified. Note however that since valid semi-compatibility does not guarantee FCS is equivalent to imputation from a Bayesian joint model, there is no guarantee that Rubin's rule for the variance will provide valid inferences in this case. If the conditional models used are not even semicompatible, in general we expect inconsistent estimates.\nIn the appendix, we show that under certain conditions (essentially identical to those given by Hughes et al. 20 for standard FCS), the SMC-FCS algorithm, at convergence, generates imputations from a Bayesian joint model in which the model for YjX, Z is the same as the substantive model f ðYjX, Z, Þ. These conditions are as follows:\n(1) The covariate models f ðX j jX Àj , Z, j Þ, j ¼ 1, . . . , p, are mutually compatible, with corresponding joint model f ðXjZ, Þ. As stated in Section 4.2, Hughes et al. 20 have shown that these conditions are satisfied when (in our setting) the covariate models are normal linear regressions and the usual noninformative priors are used. When SMC-FCS is equivalent to imputation from a Bayesian joint model, and this model is correctly specified, we expect Rubin's rules estimator^ MI to be consistent and for the CIs to have nominal coverage. Following the results of Liu et al. 13 for standard FCS, if the covariate models f ðX j jX Àj , Z, j Þ are valid semi-compatible, we conjecture that the MI estimator of the substantive model parameters^ MI will still be consistent. Just as with FCS, however, there is no guarantee however that CIs based on Rubin's variance estimator will give at least nominal coverage. Lastly, if the covariate models are not valid semi-compatible, in general, we would not expect the estimator MI to be consistent."}, {"section_title": "FCS imputation accommodating the substantive model", "text": "In this section, we describe how the standard FCS algorithm, described in Section 4, can be modified to ensure that each of the univariate imputation models used is compatible with the substantive model. We term the algorithm substantive model compatible FCS (SMC-FCS). To specify an imputation model for X j , j ¼ 1, . . . , p which is compatible with the substantive model, we note that\nIn SMC-FCS, for j ¼ 1, . . . , p, we specify models f ðX j jX Àj , Z, j Þ, together with noninformative priors f ð j Þ. Then, given values of and j , we impute missing values in X j from the density proportional to\nIn general this density will not belong to a standard parametric family, complicating direct simulation of values. In Section 6, we show how rejection sampling can be used to draw values from it for the most common types of substantive model. The imputation model for X j defined by equation (4) depends both on j and the substantive model parameter . Recall that at the tth iteration of the standard FCS algorithm the parameter of the imputation model for X j is drawn from its posterior conditional on y, x obs j , x ðtÞ Àj , z. Under the imputation model defined by equation (4), the posterior for ð j , Þ conditional on y, x obs j , x ðtÞ Àj , z is difficult to draw from because subjects with X j missing contribute f ðYjX Àj , ZÞ to this posterior, whose calculation requires X j to be integrated out from f ðYjX, Z, Þ.\nThe posterior is however easy to draw from if we condition on (as in a standard Gibbs sampler) x misðtÀ1Þ j in addition to y, x obs j , x ðtÞ Àj , z. The posterior is then and then drawing the missing values of X j from the density proportional to (4) .\nIn software implementations of the standard FCS algorithm, 10 iterations are typically used to 'burn-in', based on empirical experience suggesting this is often sufficient for convergence of the sampler. Since when imputing missing values in X j SMC-FCS conditions on x misðtÀ1Þ j (unlike standard FCS), SMC-FCS might be expected to require a larger number of iterations in order to converge to the required stationary distribution, assuming it exists. As with standard FCS, convergence can be assessed by examining plots of means of partially observed variables by iteration number, and also by examining the relative magnitude of between-chain variation and within-chain variation."}, {"section_title": "Sampling from the imputation model", "text": "In this section, we give details of how the method of rejection sampling can be used to sample from the density given in equation (4) for some of the most common types of substantive model. Rejection sampling involves creating draws from a proposal density (from which it is easy to draw), until a draw is made satisfying a particular condition. We choose f ðX j jX Àj , Z, j Þ as our proposal density, on the assumption that it is easy to sample from this density. To use rejection sampling, the ratio of the target density to the proposal density (up to a constant of proportionality) must be bounded above by a quantity not involving X j . 21 Here this ratio is proportional to\nLet cðY, X Àj , Z, Þ denote an upper bound (in X j ) for f ðYjX j , X Àj , Z, Þ. To generate a draw from the density proportional to equation (4), we sample pairs of values X Ã j from the density given by f ðX j jX Àj , Z, j Þ and U from the uniform distribution on (0,1) until\nWhen this inequality is satisfied, the value X Ã j is a draw from the density proportional to equation (4) .\nWe must therefore bound f ðYjX j , X Àj , Z, Þ by a quantity not involving X j . The bound will depend on the specification of the substantive model. In the following sections, we derive bounds for the cases of (i) a normal regression model, (ii) a model for a discrete outcome Y and (iii) a proportional hazards survival model."}, {"section_title": "Normal regression", "text": "Suppose that the substantive model specifies that Y is normal, with conditional mean EðYjXÞ ¼ gðX j , X Àj , Z, Þ for some function g(), and residual variance 2 , so that ¼ ð, 2 Þ. Then\nTo generate a draw for the missing value X j , we draw a value X Ã j from f ðX j jX Àj , Z, j Þ, and U from the uniform distribution on (0, 1). The draw X Ã j is accepted if\nIf the draw is not accepted, new draws of X Ã j and U are made until they satisfy the condition in equation (9)."}, {"section_title": "Discrete outcomes", "text": "Now consider a discrete outcome Y. This includes the case of a binary outcome Y, which is commonly modelled using logistic regression. When Y is discrete, f ðYjX j , X Àj , Z, Þ is a probability, and hence is less than or equal to one. The rejection sampling algorithm then consists of drawing X Ã j from f ðX j jX Àj , Z, j Þ and U $ Uð0, 1Þ, and accepting X Ã j when U f ðYjX Ã j , X Àj , Z, Þ"}, {"section_title": "Proportional hazards models", "text": "Lastly, suppose that interest lies in the time T to an event of interest, but this time may be censored. Let C denote the censoring time. We observe W ¼ min(T, C), and D ¼ 1ðT 5 CÞ, which denotes whether the subject's event time has been observed or was censored. We assume that censoring is noninformative, in the sense that T?CjX, Z. Furthermore, we assume C?XjZ. Together these assumptions allow us to avoid modelling the censoring process. 22 We assume that the substantive model is the proportional hazards model:\nwhere hðtjXÞ denotes the hazard at time t, h 0 (t) denotes the baseline hazard at time t and gðX j , X Àj , Z, Þ denotes a function of X and Z indexed by parameter . In parametric proportional hazards models the baseline hazard function is parametrised by a finite set of parameters , so that ¼ ð, Þ. In Cox's proportional hazards model the baseline hazard is allowed to be arbitrary, so that ¼ ð, h 0 ðÁÞÞ with h 0 ðÁÞ an infinite-dimensional parameter. Equivalently, we can parametrise the model using the baseline cumulative hazard H 0 ðtÞ ¼ R t 0 h 0 ðsÞds, so that ¼ ð, H 0 ðÁÞÞ. We first consider how to sample X j for a subject for whom D ¼ 0, that is, their time to event is censored. Then since by assumption T?CjX, Z and C?XjZ\nWe draw X Ã j from f ðX j jX Àj , Z, j Þ and U $ Uð0, 1Þ, and accept X Ã j when\nFor a subject who is not censored (D ¼ 1), we have f ðW ¼ t, D ¼ 1jX j , X Àj , Z, Þ ¼ PðC 4 tjX j , X Àj , ZÞhðtjX j , X Àj , Z, ÞPðT 4 tjX j , X Àj , Z, Þ ¼ PðC 4 tjZÞh 0 ðtÞ expð gðX j , X Àj , Z, Þ À H 0 ðtÞe gðX j ,X Àj , Z, Þ Þ Since expðÞ is monotonically increasing, this expression takes its maximum when gðX j , X Àj , Þ À H 0 ðtÞe gðX j ,X Àj , Þ takes its maximum. Differentiating this with respect to g() and setting the resulting expression to zero shows that this occurs when H 0 ðtÞe gðX j ,X Àj , Þ ¼ 1. Therefore\nWe can thus draw X Ã j from f ðX j jX Àj , Z, j Þ and U $ Uð0, 1Þ, and accept X Ã j when"}, {"section_title": "Simulation study", "text": "In this section, we describe the results of simulation studies to investigate the performance SMC-FCS in situations in which the substantive model is incompatible with standard choices for covariate imputation models."}, {"section_title": "Linear regression with quadratic covariate effects", "text": "We first simulated from a linear regression substantive model with a single covariate X with linear and quadratic effects, for which standard imputation model choices for the covariate X are incompatible."}, {"section_title": "Simulation setup", "text": "The outcome Y was simulated according to\nÞ. These coefficients were chosen to give a moderately strong U-shaped association between Y and X. The variance 2 was chosen such that the coefficient of determination R 2 was equal to 0.5.\nThe covariate X was simulated from a normal, a log-normal or a normal mixture distribution. For all three distributions X had mean 2 and variance 1. For the log-normal distribution, X was generated by exponentiating a draw from Nðlogð ffiffiffiffiffiffi ffi 3:2 p Þ, logð5=4ÞÞ. For the normal mixture distribution, X was drawn from N(1.125,0.234) with probability 0.5 and from N(2.875,0.234) with probability 0.5.\nFor each distribution of X, values were made missing either according to the missing completely at random (MCAR) mechanism PðR ¼ 1jX, YÞ ¼ 0:7 or the MAR mechanism PðR ¼ 1jX, YÞ ¼ expitð 0 þ 1 YÞ, where expitðaÞ ¼ ð1 þ expðÀaÞÞ À1 , 1 ¼ À1=SDðYÞ and 0 was chosen to make the marginal probability of observing X equal to 0.7. In all simulations datasets for n ¼ 1000 subjects were generated and 1000 simulations were performed for each scenario.\nThe outcome Y was generated according to\nwhere as before, 2 was chosen to give\nIn the first scenario, X 1 and X 2 were generated from a bivariate normal distribution, with each covariate having mean 2 and variance 1, and the correlation between the two equal to 0.5. To explore robustness of the imputation methods to violations of normality assumptions, in a second scenario logðX 1 Þ and logðX 2 Þ were generated from a bivariate normal distribution so that they both had marginal distribution Nðlogð ffiffiffiffiffiffi ffi 3:2 p Þ, log 5=4Þ and the correlation between the two was equal to 0.5. To investigate robustness to linearity assumptions between covariates, in a third scenario we generated X 1 $ Nð2, 1Þ and X 2 jX 1 $ NððX 1 À 2Þ 2 , 2Þ. Fourth, we generated X 1 from a Bernoulli distribution with probability 0.5, and X 2 jX 1 $ NðX 1 , 1Þ. To explore robustness to violations of normality assumptions, in the final scenario we generated X 1 from a Bernoulli distribution with probability 0.5 and X 2 ¼ X 1 þ expðvÞ where v $ Nðlogð ffiffiffiffiffiffi ffi 3:2 p Þ, logð5=4ÞÞ. Values in both X 1 and X 2 were first made (independently) MCAR, each with probability 0.7 of being observed. We then repeated the simulations with X 1 observed with probability expitð 0 þ 1 YÞ where 1 ¼ À1=SDðYÞ and 0 was chosen to make the marginal probability of observing X 1 equal to 0.7, and with X 2 also observed with probability expitð 0 þ 1 YÞ.\nSurvival times were simulated with hazard function hðtjXÞ ¼ 0:002 expð 1 X 1 þ 2 X 2 Þ with ¼ ð 1 , 2 Þ ¼ ð1, 1Þ. Censoring times were generated from an exponential distribution with hazard 0.002. We simulated X 1 from a Bernoulli distribution with probability 0.5, and X 2 jX 1 $ NðX 1 , 1Þ. Values in X 1 and X 2 were made (independently) MCAR, with probability of observation 0.7. We performed simulations with n ¼ 1000 subjects and also with n ¼ 100 subjects."}, {"section_title": "Estimation methods", "text": "For each simulated dataset we first imputed the missing values of X using a linear regression model with the ice command in Stata. We used the default imputation model, with the expectation of X modelled as a linear function of Y. Note that since here there is only one partially observed variable, no iteration is required within FCS. Missing values of X 2 were then passively imputed as the square of these imputed values of X ('linear passive'). Second, we imputed the missing X values using the 'transform then impute' or 'just another variable' (JAV) approach proposed by von Hippel, 15 that is, by treating X 2 as another variable to be imputed in the ice command in Stata. Third, we imputed X using the mice.impute.quadratic function in the R MICE package ('polynomial combination'). This implements a method recently proposed by van Buuren 23 (p. 140), which imputes the linear combination of X and X 2 which enters in the linear predictor of the substantive model, followed by solving a quadratic equation for X. Lastly, we used SMC-FCS, assuming X is marginally normally distributed for all scenarios. We chose to implement SMC-FCS using the same marginal model for X to explore the performance of (substantive model) compatible but mis-specified imputation models. For all imputation approaches, 10 imputed datasets were generated, and estimates and CIs found using Rubin's rules. We used 10 iterations per imputation in SMC-FCS and the default 10 iterations in the ice command. With X univariate, SMC-FCS is equivalent to imputation from the corresponding Bayesian model. We used standard noninformative priors for normal linear regression parameters in SMC-FCS, that is, f ð, 2 Þ / 1= 2 , where and 2 denote the vector of regression coefficients and residual variance, respectively. Table 2 shows the results of the simulations, showing the empirical mean and standard deviation of estimates of 2 and the coverage of nominal 95% CIs. With normally distributed X and MCAR, linear passive imputation resulted in biased estimates, with considerable attenuation in 2 towards zero as expected. Here the imputation model being used is incompatible (with the substantive model) and mis-specified. CI coverage for linear passive imputation was also extremely poor, with zero Table 2 . Simulation results -linear regression with quadratic covariate effects. Empirical mean (SD) of estimates of quadratic coefficient 2 ¼ 1 from 1000 simulations, using linear passive imputation, JAV imputation, the polynomial combination method and SMC-FCS. Empirical coverage of nominal 95% confidence intervals is also shown (Cov). Monte-Carlo errors for means and SDs are less than 0.003, except for log-normal X MAR, where Monte-Carlo errors for means and SDs are less than 0.02. Monte-Carlo errors for confidence interval coverage are less than 1.6%. coverage for 2 . JAV, polynomial combination and SMC-FCS gave unbiased results, with similar efficiency to each other. SMC-FCS had CI coverage close to 95%, but JAV and polynomial combination had slightly low coverage. With X log-normally distributed and MCAR linear passive imputation was again biased with poor CI coverage. JAV was unbiased, although estimates were considerably more variable SMC-FCS. Furthermore, the coverage of the CI for 2 from JAV was only 83%. The polynomial combination method performed similar to JAV here. Despite the assumed model for X being mis-specified, SMC-FCS was unbiased and the 95% CI for 2 had the correct coverage. With X distributed according to a normal mixture model and MCAR, JAV and polynomial combination were again unbiased. The CI coverage of JAV and polynomial combination for 2 was close to 95%. Linear passive imputation continued to be severely biased. SMC-FCS was somewhat biased towards the null for 2 , and consequently CI coverage for 2 was only 66%.\nFor each simulated dataset we first imputed using the ice command in Stata, followed by passive imputation of the interaction term ('passive FCS'). A linear regression imputation model was used when the covariate was continuous and a logistic regression imputation model when the covariate was binary. In the imputation model for X 1 (X 2 ) the outcome Y, X 2 (X 1 ) and their interaction YX 2 (YX 1 ) were included as explanatory variables.\nWe obtained estimates using JAV by including the interaction variable X 1 X 2 as an additional variable in the ice command. Covariate X 1 (X 2 ) was imputed using a linear regression model (even when X 1 was binary) with Y, X 2 (X 1 ) and X 1 X 2 as explanatory variables. The interaction term X 1 X 2 was imputed using a linear regression model with Y, X 1 and X 2 as explanatory variables. Since all conditional imputation models are linear regressions with other variables included linearly, JAV is equivalent here to imputation from a trivariate normal imputation model for (X 1 ,X 2 ,X 1 X 2 ) conditional on Y.\nLastly, we obtained estimates using SMC-FCS, assuming a normal regression model for X 1 jX 2 or a logistic regression model when X 1 was binary. A linear regression model was assumed for X 2 jX 1 . When assuming X 1 jX 2 and X 2 jX 1 are linear regressions, SMC-FCS is equivalent to imputation from the Bayesian model defined by the substantive model and a bivariate normal model for (X 1 ,X 2 ). In contrast, when assuming a logistic regression model for X 1 jX 2 and a linear regression for X 2 jX 1 , although these models are compatible, SMC-FCS is not equivalent to imputation from a Bayesian model. When drawing from the posterior of the logistic regression parameters (equation (5)) we used a multivariate normal, with mean equal to the MLE and variance covariance corresponding to the inverse of the 'observed' data information matrix. Table 3 shows the mean (SD) estimates of 1 and 3 and empirical coverage of the corresponding 95% CIs. With data MCAR and X 1 and X 2 bivariate normal, passive FCS was substantially biased and had poor CI coverage for 1 and 3 . In contrast, both JAV and SMC-FCS were unbiased. However, SMC-FCS was somewhat more efficient than JAV. CI coverage for 3 was at the nominal level for both JAV and SMC-FCS. With X 1 and X 2 distributed log-normal, passive FCS had slightly larger bias for 1 and 3 and again poor CI coverage. JAV continued to be unbiased with correct CI coverage. SMC-FCS was somewhat biased, due to mis-specification of the models for X 1 jX 2 and X 2 jX 1 , although CI coverage was only slightly below the nominal level for 1 and 3 . When X 2 was normally distributed with mean a quadratic in X 1 , passive FCS was again biased. JAV continued to be approximately unbiased. SMC-FCS was again somewhat biased, with CI coverage for 3 approximately 88%. With X 1 Bernoulli and X 2 jX 1 normal, both JAV and SMC-FCS were unbiased, although SMC-FCS was slightly more efficient. Both had empirical CI coverage of approximately 95% for both 1 and 3 . It is important to note that here SMC-FCS is not equivalent to imputation a Bayesian model, and thus there is no guarantee that Rubin's rules will give asymptotically unbiased variance estimates. That the CIs from SMC-FCS had the correct coverage in this setting is thus encouraging. Passive FCS was again biased. As expected, with X 2 log-normal given X 1 JAV continued to remain approximately unbiased while SMC-FCS had moderately large biases for 1 and 3 , although CI coverage was only slightly below 95%.\nFor each simulated dataset we first estimated by fitting the Cox proportional hazards model to the complete cases (CC). Next, we multiply imputed the missing values in X 1 and X 2 using FCS (10 imputations). A linear regression imputation model was used for X 2 and a logistic regression model for X 1 . Following the recommendations of White and Royston, 16 we included the event indicator D and the Nelson-Aalen estimate of the marginal cumulative hazard as covariates in both imputation models (FCS). Lastly, we estimated using SMC-FCS as described in Section 6.3, assuming a logistic regression model for X 1 jX 2 and a linear regression model for X 2 jX 1 . As described previously, the SMC-FCS algorithm involves taking draws from the posterior distribution of the parameter in the substantive model. For Cox's proportional hazards model ¼ ð, H 0 ðÁÞÞ, where H 0 (Á) is an infinite-dimensional parameter representing the arbitrary baseline hazard function. It is unclear how a draw can be made from the posterior distribution of H 0 (Á), and indeed whether Rubin's rules can be expected to give asymptotically unbiased variance estimates in a semiparametric model. In our simulation study we allowed for uncertainty in by drawing a new value from a (bivariate) normal distribution with mean equal to the current estimate of and with covariance matrix based on the usual 'observed' data information matrix. We then updated H 0 (Á) using the usual Breslow estimator, conditioning on the newly drawn value of . Table 4 shows the results from the 1000 simulations. CC is consistent here, since missingness is completely at random. However, with n ¼ 100 CC showed some upward finite sample bias for both 1 and 2 . In accordance with the results of White and Royston, 16 FCS resulted in somewhat biased estimates, with the bias larger for the coefficient corresponding to the continuous covariate, although CI coverage for both 1 and 2 was approximately 95%. SMC-FCS, like CC, showed some slight upward bias, but was somewhat more efficient. Of interest was that the CIs had correct coverage, despite the fact that our implementation ignores uncertainty in the baseline hazard function."}, {"section_title": "Results", "text": "\nWhen X 1 and X 2 were MAR passive FCS continued to be biased for all X 1 ,X 2 distributions considered. With X 1 ,X 2 bivariate normal, estimates from JAV had a small bias towards zero for 3 , but a larger bias for 1 . In contrast, SMC-FCS was unbiased and more efficient. In a number of simulated datasets with covariates log-normally distributed or with X 2 quadratic given X 1 the FCS algorithm created imputed datasets with extremely large imputed values of X 1 and X 2 , resulting in a co-linearity error when attempting to fit the substantive model to the imputations. Consequently, for these scenarios results are shown for the subset of the simulated datasets for which estimates from all methods were obtained. JAV was approximately unbiased for 3 when the covariates were lognormally distributed, but was substantially biased for 1 . SMC-FCS was approximately unbiased here. With X 2 given X 1 normal with mean quadratic in X 1 , both JAV and SMC-FCS were biased, but again biases for 1 and 3 were smaller for SMC-FCS. Lastly, with X 1 binary and X 2 either conditionally normal or log-normal, JAV had little bias for 3 , but had some bias for 1 . SMC-FCS was unbiased for both 1 and 3 when X 2 was conditionally normal given X 1 . With X 2 log-normally Table 3 . Simulation results -linear regression with interaction. Empirical mean (SD) of estimates of 1 ¼ 1 and 3 ¼ 1 from 1000 simulations, standard FCS with passive imputation (Passive FCS), JAV imputation and SMC-FCS. Empirical coverage of nominal 95% confidence intervals is also shown (Cov). Monte-Carlo errors for means and SDs are all less than 0.04 for 1 and less than 0.02 for 3 . Monte-Carlo errors for confidence interval coverage are less than 1.6%. Passive distributed, both JAV and SMC-FCS were somewhat biased for 1 and 3 , although the biases of JAV were smaller.\nFor n ¼ 1000, CC was essentially unbiased. The biases of FCS were larger than for n ¼ 100, which is due to the fact that the finite sample bias, which acted in the opposite direction to the bias caused by the approximation used in the FCS approach, had largely disappeared. Consequently, CI coverage was below the nominal 95% level, with coverage for 2 particularly poor at 47%. In contrast, SMC-FCS was unbiased and had correct CI coverage.\n8 Analysis of data from ADNI Table 5 shows the estimated log hazard ratios from the substantive model fitted to the n ¼ 127 complete cases (of whom 61 converted to AD). This showed borderline evidence of an association between CSF A 1À42 and hazard of conversion, and borderline significant evidence of curvature in the association, in agreement with the findings of Jack et al. 11 The estimated association suggests that increasing A 1À42 is associated with increased hazard of conversion up until a value of % 14 ng/mL, after which hazard decreases. There was evidence that increased levels of p-tau were associated with increased hazard of conversion. Contrary to what we expected, having a mother or father with AD was suggestive of lower hazard of conversion to AD, although neither coefficient was statistically significant. Hippocampal volume was the strongest predictor of hazard (measured by statistical significance), with larger volumes associated with lower hazard of conversion. This is consistent with the findings of previous studies which have found that the hippocampus is one of the earliest structures of the brain to undergo atrophy during AD.\nNext, we used FCS MI to impute the partially observed baseline variables. 50 imputations were used. Continuous variables were imputed using linear regression models while binary variables were imputed using logistic regressions. To incorporate the censored time to conversion outcome we followed the recommendations of White and Royston 16 and included the event indicator and marginal Nelson-Aalen cumulative hazard function as covariates in the imputation models. We passively imputed the A 2 1À42 term in the imputed datasets. The FCS estimate of A 2 1À42 is smaller in magnitude than the CC estimate ( Table 5 ). This is consistent with the simulation results of Section 7.1, which showed that linear imputation of variables for substantive models which include quadratic effects of the variable leads to attenuation in the estimate of curvature. The coefficient for the linear A 1À42 term is also much smaller and no longer statistically significant. The estimated Table 4 . Cox proportional hazards outcome model simulation results. Empirical mean (SD) of estimates of 1 ¼ 1 and 2 ¼ 1 from 1000 simulations, using complete case analysis, MI of X 1 and X 2 using FCS with the event indicator and Nelson-Aalen marginal baseline cumulative hazard function as covariates (FCS), and SMC-FCS. Empirical coverage of nominal 95% confidence intervals is also shown (Cov). Monte-Carlo errors in means and SDs are no more than 0.02 for n ¼ 100 and 0.005 for n ¼ 1000. coefficient for p-tau is much smaller. The negative association between hippocampal volume and hazard of conversion remained. The coefficients for family history of AD changed by a proportionately large amount. Further investigation revealed that the dependence of hazard of conversion to AD on family history of AD varied (in a model without the CSF variables) according to whether or not the CSF variables were measured. This means that the assumption required for validity of complete case analysis failed for the reduced model without the CSF variables, and this is the likely cause of the large change in the coefficients for family history of AD. Standard errors were considerably smaller, consistent with the gain in information through inclusion of subjects with some missing values into the analysis. Lastly, we imputed using SMC-FCS, again using 50 imputations, with 10 iterations per imputation. Here we assumed linear regression covariate models for partially observed continuous variables and logistic regressions for partially observed binary variables. Comparing the estimates from SMC-FCS with complete case and passive FCS, we see that the linear and quadratic coefficients of A 1À42 are much closer to the complete case estimates, with the statistical significance of the quadratic coefficient preserved ( Table 5 ). The estimated coefficient for p-tau is similar to that obtained in the FCS analysis. For the other coefficients the SMC-FCS estimates and CIs are similar to those from FCS. In conclusion, consistent with our earlier simulation results, the results of this analysis suggest that ignoring the quadratic association at the imputation stage leads to attenuation in the corresponding coefficient. In contrast, imputation of the partially observed covariates using SMC-FCS preserved a quadratic association between CSF A 1À42 seen in the complete cases. Furthermore, use of MI has here led to practically important improvements in the precision of estimated associations, compared to CC."}, {"section_title": "Scenario", "text": "With normal X and MAR, linear passive imputation gave biased estimates and the CI for 2 had zero coverage. With data MAR, JAV no longer gave unbiased estimates, in agreement with the findings of Seaman et al., 10 and the CI for 2 had only 12% coverage. Polynomial combination had only slight bias, but CI coverage for 2 was only 75.9%. In contrast, SMC-FCS was unbiased and the CI for 2 had approximately 95% coverage. All estimators were considerably more variable with X log-normal MAR. JAV and polynomial combination had considerable bias and poor CI coverage for 2 , as did linear passive imputation. Despite using a mis-specified model for the distribution of X, SMC-FCS was again unbiased, although the CI for 2 had slightly lower than nominal coverage. Lastly with X distributed as a mixture of two normals and MAR, linear passive imputation continued to be substantially biased. JAV was biased to a lesser extent, although its CI for 2 had poor coverage. SMC-FCS was biased (since the assumed distribution for X was incorrect) towards zero, and its CI for 2 had extremely poor coverage, due to the estimator's large bias relative to its variability. The polynomial combination method performed best here, with unbiased estimates of 2 and only somewhat reduced CI coverage."}, {"section_title": "Linear regression with interaction", "text": "Next, we considered a linear regression substantive model in which two covariates interact with each other in their effect on outcome."}, {"section_title": "Cox proportional hazards models", "text": "Lastly, we performed simulations for imputing missing covariates with a Cox proportional hazards model. Recently, White and Royston 16 derived approximate results to inform the choice of imputation model in this context. They recommended including the event indicator and the Nelson-Aalen estimate of the marginal cumulative hazard function as covariates in imputation models. Their simulation results showed that this approach generally worked well for imputing normally distributed covariates, except when the covariate effects were large, when some attenuation towards the null occurred."}, {"section_title": "Parameter", "text": ""}, {"section_title": "MI of covariates in practice", "text": "Our developments thus far have assumed that at the imputation stage we have a single correctly specified substantive model f ðYjX, Z, Þ. Usually, we will not know in advance of analysing the data what is an appropriate model for the outcome Y of interest given the covariates. One of the apparent advantages of using MI is that once a set of imputed datasets have been generated, a number of different substantive models can be fitted and compared. It is important to note that the validity of estimates from different models fitted to a set of MIs depends on whether the imputation model is correctly specified. In practice, all imputation models are likely to be mis-specified to some extent, but biases may be small provided imputation models preserve those features of the data which are subsequently investigated. It is arguably therefore unrealistic in practice to expect a single set of multiply imputed datasets to be suitable for all possible subsequent types of analysis. Performing model selection in combination with MI is a challenging problem generally, 24 and therefore deciding on what substantive model to specify when using the SMC-FCS algorithm is not a trivial process. One possible approach would be to use the complete cases to select the substantive model. Alternatively, the SMC-FCS algorithm could be used to impute the partially observed covariates assuming a rich model for f ðYjX, Z, Þ which contains as special cases various simpler models that one may wish to fit to the imputed datasets. This approach would mean the imputation models used would be compatible with this larger model, and semi-compatible with those substantive models nested within it. This advice follows that given by others (e.g. Meng 6 and Schafer 7 ) for application of MI in general, whereby imputation models are used which are rich and do not impose assumptions which are subsequently to be relaxed in substantive models. For example, if one believes that two covariates may interact in their effect on Y, one could impute compatibly with a model f ðYjX, Z, Þ which includes the corresponding interaction.\nWe do not consider the requirement to specify a substantive model at the imputation stage to be a shortcoming of the SMC-FCS approach, since the issue of compatibility between imputation and substantive models is similarly present when one imputes using standard FCS MI. Indeed, whereas SMC-FCS forces the analyst to consider the issue of compatibility between these models, if using standard FCS MI one may unwittingly specify covariate imputation models which are incompatible with one's substantive model.\nAs noted in Section 1, in many settings auxiliary variables V may be available, which although not involved in the substantive model, may be useful for inclusion in imputation models in order to improve efficiency (by virtue of their association with variables being imputed) or to increase the plausibility of the MAR assumption. The notion of compatibility between imputation and substantive models does not then apply, since the two models involve different sets of variables. However, one could include the auxiliary variables V as additional covariates in the model for Y in the SMC-FCS algorithm, following which models for Y can be fitted using the imputed datasets which omit V."}, {"section_title": "Discussion", "text": "MI is an attractive approach for handling missingness in covariates of regression models. When the substantive model contains non-linearities or interactions, existing imputation approaches using the FCS algorithm may give biased estimates because the imputation models are incompatible with the substantive model. Our proposed modification of the popular FCS approach to MI ensures that each covariate is imputed from a model which is compatible with the substantive model. Although compatibility does not guarantee the imputation models are correctly specified, it ensures that the imputation and substantive models do not make conflicting assumptions which may induce bias in parameter estimates. In our simulations across a range of settings we found SMC-FCS to generally outperform existing alternative imputation approaches.\nIn special cases, SMC-FCS is equivalent to imputation from a Bayesian joint model, and thus inherits the latter's statistical properties. More generally, if the covariate models used in SMC-FCS are valid semi-compatible, we conjecture that the resulting estimator is consistent, which is supported by our simulation results. Further, in these cases CI coverage for estimates from SMC-FCS attained nominal coverage, despite the lack of equivalence to imputation from a Bayesian joint model. In simulations in which the covariate models were mis-specified, estimates from SMC-FCS were still less biased than those from what might be considered 'standard FCS'.\nFor linear substantive models which contain non-linear covariate effects or interactions, the 'JAV' approach is attractive, and is consistent if data are MCAR. This holds irrespective of the joint distribution of the outcome and covariates. However when data are MAR, or for other substantive model types such as logistic regression, we and Seaman et al. 10 have shown that JAV gives biased estimates. At least in our limited simulation study, the polynomial combination method recently proposed by van Buuren 23 was superior to JAV, with less bias and coverage closer to the nominal level. A limitation of this approach however is that it only applies to imputation of covariates which have a quadratic association with outcome, and it is unclear whether it can be generalised to substantive models other than linear regression.\nRelative to standard FCS MI, SMC-FCS is more computationally intensive because of the use of rejection sampling to sample from the required densities. For example, the SMC-FCS algorithm took six times longer than standard FCS to create 10 imputations for a simulated dataset from the first simulation scenario (linear regression with quadratic covariate effects). The acceptance rate of the rejection sampler will be low when the target density f ðX j jX Àj , Z, YÞ differs substantially from the candidate density f ðX j jX Àj , ZÞ. This will occur if a subject has an outcome value Y which is unlikely to have occurred given the values of X Àj and Z. However, our experience thus far in simulation studies has been that this has not been an issue. Furthermore, as for standard FCS MI, additional work is needed to understand the statistical properties of the SMC-FCS algorithm. In some settings, substantive models may be fitted to imputed datasets for a number of different outcomes, and a limitation of our approach is that imputation models are defined with respect to a single (possibly multivariate) outcome variable.\nWe note that compatibility between imputation and substantive models is closely related to the concept of congeniality defined by Meng. 6 We chose not to adopt this term because Meng's definition of congeniality depends additionally on specification of incomplete and complete data 'procedures' which give asymptotically equivalent inferences to those under a Bayesian model. Further, in many cases SMC-FCS is not equivalent to imputation from a joint model, and so would not satisfy Meng's definition of congeniality, which assumes imputation is from a welldefined Bayesian joint model. Lastly, the setup adopted by Meng assumed that covariates are fully observed.\nIn this article, we have assumed that the outcome is fully observed. In the absence of auxiliary variables subjects with missing outcome provide little or no additional information regarding the substantive model parameters, 25 such that imputation of missing outcomes may not be beneficial. Nevertheless, the SMC-FCS algorithm can be readily extended to impute missing outcome values by imputing from the assumed substantive model.\nA Stata program implementing SMC-FCS for linear, logistic and Cox proportional hazards models of interest is available for free download from www.missingdata.org.uk.\n5-year public-private partnership. The primary goal of ADNI has been to test whether serial magnetic resonance imaging (MRI), positron emission tomography (PET), other biological markers, and clinical and neuropsychological assessment can be combined to measure the progression of mild cognitive impairment (MCI) and early Alzheimer's disease (AD). Determination of sensitive and specific markers of very early AD progression is intended to aid researchers and clinicians to develop new treatments and monitor their effectiveness, as well as lessen the time and cost of clinical trials. A complete listing of ADNI investigators can be found at: http://adni.loni.ucla.edu/wp-content/uploads/how_to_apply/ADNI_Acknowledgement_ List.pdf\nThe Principal Investigator of this initiative is Michael W Weiner, MD, VA Medical Center and University of California San Francisco. ADNI is the result of efforts of many co-investigators from a broad range of academic institutions and private corporations, and subjects have been recruited from over 50 sites across the US and Canada. The initial goal of ADNI was to recruit 800 adults, aged 55-90, to participate in the research, approximately 200 cognitively normal older individuals to be followed for 3 years, 400 people with MCI to be followed for 3 years and 200 people with early AD to be followed for 2 years. For up-to-date information, see www.adni-info.org."}]