[{"section_title": "Introduction", "text": "Observations of the sea ice extent in the Southern Ocean derived from satellite data display a trend of 0.13 to 0.2 million km 2 per decade between November 1978 and December 2012 (Vaughan et al., 2013). Although the magnitude of this trend is subject to uncertainties (e.g., Eisenman et al., 2014), the behavior of the Antarctic sea ice cover is in sharp contrast with its Arctic counterpart which displays a decrease in sea ice extent over the last decades (e.g., Turner and Overland, 2009). Several explanations have been proposed to account for the slight increase in Antarctic sea ice extent but no consensus has been reached yet. Among the proposed mechanisms, a potential link with the stratospheric ozone depletion has been pointed out (Solomon, 1999) but this hypothesis is not compatible with recent analyses (e.g., Bitz and Polvani, 2012;Smith et al., 2012;Sigmond and Fyfe, 2013). Changes in the atmospheric circulation or in the ocean stratification may also have contributed to the observed expansion of the sea ice cover (e.g., Zhang, 2007;Stammerjohn et al., 2008;Goosse et al., 2009;Kirkman and Bitz, 2011;Landrum et al., 2012;Holland and Kwok, 2012;Bintanja et al., 2013;Goosse and Zunz, 2014;de Lavergne et al., 2014). The internal variability of the system, particularly strong in the Southern Ocean, may be responsible for the observed positive trend in Antarctic sea ice extent as well (e.g., Mahlstein et al., 2013;Zunz et al., 2013;Polvani and Smith, 2013;Swart and Fyfe, 2013). Observations in the Southern Ocean are rather sparse in space and time. In particular, reliable observations of the sea ice concentration are available from the late 1970's only (e.g., Parkinson and Cavalieri, 2012). In this context, climate models constitute adequate tools to compensate for the lack of observations and investigate the processes that govern the behavior of the sea ice cover around Antarctica. Coupled climate models are particularly useful to analyze the interactions between the different components of the climate system."}, {"section_title": "Present-day general circulation models involved in the 5th Coupled Model Intercomparison", "text": "Project (Taylor et al., 2011) generally simulate a decrease in the Antarctic sea ice extent over the last 30 years but a positive trend such as the observed one remains compatible with the internal variability simulated by these models (e.g., Mahlstein et al., 2013;Zunz et al., 2013;Polvani and Smith, 2013;Swart and Fyfe, 2013). Nevertheless, these models often display systematic biases in their representation of the seasonal cycle or of the internal variability (or both) of the Antarctic sea ice (e.g., Turner et al., 2013;Zunz et al., 2013). The reconstruction of the sea ice cover in the Southern Ocean provided by these models have thus to be considered cautiously. One way to more closely constrain the simulation of the ocean and the sea ice is to prescribe the atmospheric conditions at the atmosphere/ocean-sea ice interface. These so-called \"forced\" simulations resort generally to atmospheric reanalyses as boundary conditions, and have been used extensively to study the past variability of the ocean and sea ice states (Fichefet and Morales Maqueda, 1999;Fichefet et al., 2003;Zhang, 2007;Holland et al., 2014). It is clear the quality of these forced simulations is strongly dependent on that of the atmospheric product utilized. Intercomparisons between different reanalysis products and assessments against in-situ measurements all suggest that the reanalyzed atmospheric data are subject to large uncertainties or systematic errors in the Southern Ocean (Bromwich et al., 2007;Hines et al., 2000;Vancoppenolle et al., 2011) translating inevitably to the ocean-sea ice system (Timmerman et al., 2004;Stössel et al., 2011). An even tighter constraint on the oceanic and sea ice states can be realized if observations are used to update model estimates. Data assimilation has been an active area of research in climate science. A limited number of studies have, however, attempted to implement data assimilation in the Southern Ocean (Stammer et al., 2002;Stössel, 2008;Ferry et al., 2012;Balmaseda et al., 2008;Carton and Giese, 2008;Janjić et al., 2012) where pressing scientific questions remain, though. Implementing a data assimilation method in a large-scale ocean-sea ice model presents a number of challenges as several methodological, statistical and physical questions are raised. In theory, the background error statistics should be perfectly known in order for the data assimilation to produce an optimal analysis. This is not feasible in practice, due to the very high dimensionality of the state vector. For this reason, the true covariance matrix of background errors is projected onto a space of much lower dimensionality and specified either a priori (Ferry et al., 2012) or estimated on-the-fly (Sakov et al., 2012;Mathiot et al., 2012) using a finite-size ensemble. For computational reasons, it is also common to assume a diagonal structure for the observational error covariance matrix (i.e., uncorrelated errors) while this is not necessarily the case in reality. Most data assimilation methods also rely on statistical hypotheses. The gaussianity of background and observational errors is often assumed, but rarely fulfilled. Not only can this lead to sub-optimal updates, this can also lead to physical inconsistencies. Resorting to the transformation of variables (e.g. Bertino et al., 2003;Simon and Bertino, 2009;Béal et al., 2010) can be a first step, but it only acts on the marginal, and not multivariate probability distribution functions. Likewise, since the background statistics are boiled down to the covariance matrix, the update of non-assimilated fields follows their linear relationship with the observable; this may result in an unphysical or imbalanced state after the update in regions where strong nonlinearities are present, e.g. between sea surface temperature and sea ice concentration (Lisaeter et al., 2003)."}, {"section_title": "Last but not least, a central and non-trivial issue concerns the decision on what should", "text": "be estimated. While the state itself is commonly estimated for reanalysis purposes, the methods can be extended to the estimation of model bias to identify systematic errors (Sakov et al., 2012), to the estimation of model parameters to partly reduce such systematic errors (Massonnet et al., 2014) and ultimately to surface forcing estimation (Barth et al., 2011;Marmain et al., 2014;Ngodock and Carrier, 2014). The estimation of atmospheric forcing in the Southern Ocean has, to our knowledge, not been explored. Because Antarctic sea ice trends are largely controlled by the wind forcing (Kimura, 2004;Holland and Kwok, 2012), it seems natural to improve the representation of ice drift in the model. We propose to correct the wind forcing using satellite sea ice drift data, taking advantage of the strong relationship between sea ice drift and the wind field. A first set of preliminary experiments have shown the difficulty to assimilate ice drift in a coupled ocean-sea ice model. Sea ice drift is strongly related to the wind forcings (Kimura, 2004;Holland and Kwok, 2012) with a temporal scale of the order of days (about 4 days based on the autocorrelation). The memory of the sea ice drift is thus relatively short. The corresponding time scale is in fact more similar to the temporal scale of the atmospheric variability than the temporal scale of ocean mesoscale circulation (order of weeks). This short scale would require in principle a very frequent assimilation of sea ice drift data to adequately resolve its underlying time-scale. However, a too frequent assimilation can deteriorate the model results (e.g. Malanotte-Rizzoli et al., 1989;Yan et al., 2014). To improve sea ice drift in the model, we therefore propose to correct the wind forcing. This is possible due to the strong relationship between wind field and sea ice drift (Holland and Kwok, 2012). The objective of the study is to propose a methodology to use surface drift observations to constrain an ocean-sea ice large-scale circulation model. We also aim to test this approach in combination with sea surface temperature and sea ice concentration assimilation in a decadal simulation and to assess the quality of the results with independent data. This study also outlines an approach to evaluate the presence of model errors at the forecast step of the data assimilation and to identify their potential sources The ocean model is introduced in section 2 and then the used observations along with their error covariance are discussed (section 3). The procedure adopted to correct the wind field is detailed and validated in section 4. The data assimilation implementation is discussed in section 5 and the results of the reanalysis are then presented and validated (section 6). In the last section, post-processing techniques are used to relate forecast errors in sea ice coverage with model errors associated with the dynamics of sea surface temperature."}, {"section_title": "Model", "text": "The primitive-equations model used in this study is NEMO (Nucleus for European Modelling of the Ocean, Madec (2008)), coupled to the LIM2 (Louvain-la-Neuve Sea Ice Model) sea ice model (Fichefet and Morales Maqueda, 1997;Timmermann et al., 2005;Bouillon et al., 2009). The global ORCA2 implementation is used, which is based on an orthogonal grid with a horizontal resolution of the order of 2 • and 31 z-levels (Mathiot et al., 2011;. The hydrodynamic model is configured to filter free surface gravity waves by including a damping term. The leap-frog scheme uses a time step of 1.6 hours for dynamics and tracers. The model is forced using air temperature and wind from the NCEP/NCAR reanalysis (Kalnay et al., 1996). Relative humidity, cloud cover and precipitation are based on a monthly climatological mean. The sea surface salinity is relaxed towards climatology with a fresh water flux of -27.7 mm/day times the salinity difference in psu. As in the following the link between sea ice drift and wind stress is studied, only the equation for sea ice drift is given here. The sea ice drift u is governed by the momentum equation where the advection of momentum is neglected by scale analysis (Fichefet and Morales Maqueda, 1997): where m is the mass of the snow-ice system, f is the Coriolis parameter, e z is a unit vector pointing upward, τ ai (resp. τ wi ) denotes the drag with air (resp. water), g is the acceleration due to gravity, ζ is the surface elevation and F the force due to the variation of internal stresses. For the complete model equations, the interested reader is referred to Madec (2008); Fichefet and Morales Maqueda (1997); Goosse and Fichefet (1999)."}, {"section_title": "Observations", "text": "Global foundation sea surface temperature from OSTIA ( This data set also provides an error standard deviation (varying in space and time). Since information about the length scales over which the SST errors are correlated are lacking, the error standard deviation is also reduced to a resolution of 2 • by simply averaging the standard deviations of all values with a 2 • by 2 • grid cell (averaging the standard deviation instead of the variances corresponds to the case of perfectly correlated errors, which is more appropriate since the OSTIA data set is relatively smooth). Global sea ice fraction from the EUMETSAT Ocean and Sea Ice Satellite application Facility (OSI-SAF Roberts-Jones et al., 2012) was also reduced to a resolution of 2 • and assimilated with an error standard deviation of 0.  (Fowler, 2003). The ice drift is derived from the satellite data by maximizing the correlation of groups of pixels between image pairs. We use version 1 of this data set which does not include derived ice drift based on NCEP wind reanalysis (unlike the version 2 of the gridded and combined ice drift data set). As the focus of this study is the Antarctic Ocean, only data from the southern hemisphere is used. The error standard deviation for the assimilation is assumed to be 0.1 m/s. The value of this parameter was determined by a series preliminary experiments to find the right balance between correcting as much as possible the sea ice drift without degrading unobserved variables. The sea ice drift is used at two stages in our study: first it is used to adjust the wind fields and, at a later stage, is used during the analysis to correct the model state vector. This approach has been adopted as errors in the wind field and errors in the ocean circulation manifest themselves in the model sea ice drift (and not only error in the wind field). Experiments with different values of the standard deviation of the global sea ice fraction error and sea ice drift error were also conducted as detailed in section 5.5."}, {"section_title": "Wind field adjustment", "text": "Errors in the sea ice drift can be attributed either to errors in the winds fields or to error in the ocean currents. As winds and currents have two very different time scale, a two-step approach was adopted. First, the wind fields are adjusted using sea ice drift as described in this section. In a second step the sea ice drift is assimilated into the ocean-sea ice model in order to reduce errors due to the ocean currents (section 5)."}, {"section_title": "Relation between sea ice drift and wind", "text": "The model sea ice drift is strongly related to the used wind forcing. To quantify the relationship between sea ice drift and wind fields, the complex correlation coefficient (Kundu and Allen, 1976) between the daily NEMO-LIM sea ice drift (u ice , v ice ) and daily NCEP winds (u wind , v wind ) has been computed by introducing the following complex variables (i 2 = −1): In order to maximize the correlation, we correlate the sea ice drift with different transformations of the wind field. More specifically, we use different combinations of shifts and filters in time of the wind field. We use a time filter because we anticipate the sea ice drift to have a certain inertia and thus a memory of previous winds. The time shift and the temporal scale of the filter will be determined later. The time filter is implemented using an iterative diffusion scheme using a forward Euler step and a 2nd-order center diffusion operator (Alvera-Azcárate et al., 2009). The complex correlation coefficient between sea ice drift and filtered and shifted wind fields is given by: w ice w ice w wind w wind The over-line denotes the complex conjugate and the angular brackets an average over time. The absolute value of the complex correlation coefficient is maximized by changing the timeshift and time-filter. The complex regression coefficient r derives an empirical relationship between the sea ice drift and the wind field. This relationship will be used later for wind field adjustment. r = w ice w wind w ice w ice The complex correlation and regression coefficients are used instead of the (real) correlation/regression coefficient derived on the zonal and meridional component individually because the complex coefficients can represent a rotation by a constant angle between the two vectors (as a result for the Coriolis force) and is thus commonly used to analyze horizontal velocities (e.g Kundu and Allen, 1976;. The correlation analysis showed a strong correlation with magnitude of 0.9363 and a phase of -19.52 • between sea ice drift and 3-day average wind fields (panel (a) of Figure 1). This phase (which is also the phase of the complex regression coefficient) represents the angle between the sea ice drift vector and the wind vector. The maximum value was obtained with no time lag. These results did not confirm the initial expectation of a time lag between wind and sea ice drift as one could assume that the wind (the cause) precedes sea ice drift (the effect). The maximum of the correlation as a function of the time lag is very well defined while the correlation as a function of the filtering time scale is a bit flatter (panel (b) and (c) of Figure 1). A scatter plot of wind versus sea ice drift using the optimal parameters (filtering time scale and time lag) shows a good correspondence ( Figure 2). This strong relationship has been used to correct the surface winds. The general approach is to use the regression coefficient to transform the observed sea ice drift as pseudo wind observations and to attempt to improve zonal and meridional wind fields components. In particular the following procedure has been adopted to compute the adjusted wind field: • the first guess wind field is the NCEP reanalysis • the model is run with this wind field (here for the year 2000) • the sea ice drift error is calculated by comparing model with observed sea ice drift • the sea ice drift error is transformed to \"wind increment\" using the regression coefficient r • \"wind increment\" is analyzed with the tool divand (detailed in the next section) on the ORCA grid and the first guess (the NCEP reanalysis) is added While other calibration experiment are carried out for the year 1985, the wind field adjustments are first tuned for the year 2000 due to the availability of the Cross-Calibrated Multi-Platform (CCMP) Ocean Surface Wind Vector Analyses (Atlas et al., 2011) which will be used to independently validate the results."}, {"section_title": "Spatial analysis with divand", "text": "The sea ice drift provides only information about the wind field where the model has ice. However, if the sea ice drift indicates that the model should be corrected at a particular location, one can expect that it should also be corrected in a similar way at neighboring grid cells (even if they are not covered by ice). The tool divand ) (Data Interpolating Variational Analysis in n-dimensions) is used to spatially interpolate the \"wind increment\" derived from the sea ice drift on the full ORCA2 grid. This tool is similar to the variational analysis DIVA (Brasseur et al., 1996) but this latter works on a triangular mesh. The DIVA tool cannot represent a periodic domain as is the case with the NEMO grid. Therefore the new tool divand was adapted to operate directly on a structured model grid with periodic boundary conditions. For variational analyses, one requires that the analyzed field ϕ (here the wind increment) must be close to the N d observations d j (j = 1, . . . , N d ) and \"smooth\". This is quantified using a cost function J: (2) Each observation has a weight µ j which is directly related to its error variance. Abrupt variations of the analysis field are penalized using a regularization constraint (as in norm spline interpolation): The normalization coefficient c is set to 4π to ensure that the background covariance matrix has a unit variance (Brasseur et al., 1996). The data weight µ j represents the radio of the error variance of the background NCEP field and the error variance of the observation. The correlation length L is introduced by scaling the differential operator for gradient and Laplacian: Here the correlation length is a scalar, but it can also be a diagonal matrix in the previous equation if the length scale is different for the zonal and meridional dimensions. The regularization constraint guarantees that the interpolated field and its first order derivative (such as the wind curl) is continuous. An estimation of the background NCEP error standard deviation is necessary to define the data weight µ i . In the present case, the pseudo observation (the wind information derived from the sea ice drift observation) error standard deviation is derived using the error standard deviation of the sea ice drift. The remaining parameter of the analysis, namely the correlation length scale and background NCEP error standard deviation, will be determined in the following. The correlation length controls the distance over which the information from the pseudo-wind observation is extrapolated spatially and the NCEP error standard deviation determines how close the analyzed field has to come to these pseudo-observations."}, {"section_title": "Calibration", "text": "The correlation length is varied from 300 km to 5000 km and the standard deviation error is varied from 0.1 m/s to 10 m/s. For each parameter 10 values are tested. These values are uniformly distributed in logarithmic space. For each of these parameters, the divand analysis is performed and the NEMO-LIM2 model is run simulating the year 2000 with the adjusted wind fields. Besides the momentum equation, the norm of the adjusted wind field is also used in the heat flux computation via the bulk formulas (which is a separate input file for NEMO). Figure 3 shows the RMS error between the model sea ice drift obtained using the adjusted wind and the observed sea ice drift. This is not an independent validation since the observed sea ice drift is used to adjust the wind fields. This comparison is rather a confirmation that the adjustment works as expected. The RMS error between the model sea ice drift and observations is 0.1235 m/s with original (i.e. non-adjusted) NCEP forcing. The RMS error is indeed reduced thanks to the adjustment ( Figure 3) and, as expected, the lowest RMS error is obtained when using a large value of the standard deviation of the NCEP wind error. In this case, the adjusted wind will thus be forced to come closer to the pseudo-wind observations (based on sea ice drift). As an independent comparison the CCMP Ocean Surface Wind Vector Analyses (Atlas et al., 2011) based on ERA-40 and observations such as QuickScat for the year 2000 south of 60 • S is used. Sea ice drift is not used in the CCMP product. For every tested correlation length scale and NCEP error standard deviation, the RMS error between the adjusted wind and the CCMP wind field is computed ( Figure 3, panel b). This comparison shows that the wind field is indeed improved using the sea ice drift measurements. As before, the general tendency is that the RMS difference between the adjusted winds and CCMP winds decreases as the error standard deviation increases. This comparison shows that the optimal range of the correlation length scale is between 500 km and 1500 km. The model sea ice concentration obtained by the adjusted wind is also compared to the OSTIA/OSI-SAF observations (Figure 3, panel c). In general the sea ice concentration varies only weakly by changing the parameter of the analysis. This suggests that only a small part of the RMS error in sea ice concentration can be attributed to the wind forcing and that sea ice concentration is mostly driven by thermodynamic forcings. Contrary to the previous comparison the error slightly increases for large values of the NCEP error standard deviation. Overall a large value of the background error improves sea ice drift and reduces the RMS error in comparison with CCMP winds but it degrades the sea ice concentration (if error standard deviation is larger than 5 m/s). Correlation lengths between 500 km and 1000 km give acceptable results. By combining the results from the different comparisons, the wind fields have been adjusted using a correlation length of 700 km and a background error standard deviation of 2 m/s. The adjustment procedure has been applied to the wind field time series from 1985 to 2006. The average wind vector over this period has been computed ( Figure 4). The most significant change occurs near the coast where the adjustment generally increase the offshore wind and decreases (the generally negative) zonal wind component. Those changes are consistent with the changes from low to high resolution atmospheric models (Mathiot et al., 2010) and are attributed to katabatic winds which are important to the formation of polynyas (Massom et al., 1998;Morales Maqueda et al., 2004). As the wind curl is an important forcing for Ekman pumping it has been computed for the original and adjusted wind in order to determine the effects on the wind curl. The most important changes in the wind curl (in term of the RMS error) have been applied in the Weddell and Ross Seas (panel (b) of Figure   5). Even in these areas the RMS difference is still smaller by a factor of 2 to 3 than the standard deviation of the wind curl (panel (a) of Figure 5). For the year 2006, a problem in version 1 of the NSIDC ice drift product has been identified for the Arctic sea ice drift (Sumata et al., 2014). However the authors of this study did not analyse the ice-drift in the Southern Hemisphere. "}, {"section_title": "Data assimilation", "text": "The implemented data assimilation scheme is the Ensemble Transform Kalman Filter (Bishop et al., 2001). In ensemble-based assimilation schemes, the error statistics of the model state vector is estimated by perturbing uncertain aspects of the model. In the present configuration we perturb surface winds (10 m) and surface air temperature (2 m). The adjusted wind from the previous section are used. Atmospheric parameters coming from climatology are not perturbed. The data assimilation scheme employs an ensemble with available computer resources and maximizing the usage of the observations."}, {"section_title": "Perturbed forcings", "text": "The perturbation scheme is based on a Fourier decomposition. Formally all perturbed variables are grouped into a time-dependent vector: A Fourier decomposition of the NCEP wind vectors and air temperature over the time domain is performed (Barth et al., 2011;Marmain et al., 2014): where ω k is the k-th angular frequency (positive or negative) and a k are complex spatial vector fields corresponding to the Fourier coefficients of the angular frequency ω k (∆t is here 24 hours): where k max is the number of Fourier modes. Using the spatial and multivariate structure of the Fourier modes a k , perturbations x (t) are constructed by: where z k is a complex random time series with a temporal correlation scale of T k = 2π/|ω k |, zero mean and unit variance. The value of α is determined by ensemble simulations with perturbed forcings to ensure that the resulting ensemble spread is comparable to the expected error of the model. Only Fourier modes with a time period between 20 and 70 days are used for the perturbations in order to exclude the seasonal variations (which have a large variance and whose amplitude is not representative for its expected error) and short-scale variations which are not the primary focus of this study. Since the perturbation scheme is multivariate, the same range of time scales is used to perturb wind and air temperature. The real and imaginary parts of the random time series have the following covariance C T (t, t ): These perturbations have been added to the first guess estimate: where l is the index of the ensemble member. The perturbation scheme is similar to perturbations generated by Empirical Orthogonal Functions (EOF; e.g. Vandenbulcke et al., 2008;Béal et al., 2010). The advantage of perturbations proportional to a Fourier mode is that it is easier to associate a time scale to a Fourier mode than to an EOF. The wind perturbations have a magnitude similar to the wind correction derived in the previous section. However, the wind perturbations have a zero mean so that the wind corrections are still relevant for the whole ensemble (and in particular its mean state). As the wind speed is an independent forcing field for NEMO, the perturbed wind speed is computed for each ensemble member: The perturbation scheme (without assimilation) is illustrated for the year 2007. Figure 6 shows the ensemble standard deviation of the wind speed for a particular day (2007-02-21). The ensemble standard deviation is high near the polar regions where time variability (between 20 and 70 days) is relatively large. The same behaviour was also seen in the air temperature (not shown). other even after a one-year ensemble simulation."}, {"section_title": "State vector", "text": "In data assimilation, all model variables to be corrected by the observations are gathered in the state vector which is here composed of various hydrodynamic and sea ice variables. It includes the horizontal velocity components, temperature, salinity, surface elevation, curl of horizontal velocity components, divergence of horizontal velocity components, turbulent kinetic energy and barotropic stream function trends. Those variables are necessary to restart NEMO. Some of these variables are interdependent as the horizontal velocity components are directly related to their divergence and curl. However since the link is linear, the analysis will preserve their relationship. As the model uses a leap-frog time step, two time instances of these variables are included in the state vector. For the sea ice model, sea ice concentration, sea ice thickness, the horizontal sea ice-velocity components, snow thickness and temperature inside the ice/snow layer (at three layers) are included in the state vector. The sea ice concentration was transformed with a Gaussian anamorphosis (see section 5.3). In total, the state vector contains 28 different variables and about 6 million elements (all variables combined). A set of experiments was conducted with a reduced state vector, where the snow thickness and temperature inside the ice/snow layer was not corrected by the assimilation in order to determine if the assimilation has a beneficial impact on these variables."}, {"section_title": "Gaussian anamorphosis", "text": "The Kalman filter analysis provides the most likely state if errors are Gaussian-distributed. However some variables are clearly not Gaussian-distributed, in particular sea ice concentration which is bound between 0 and 1. A linear analysis scheme can produce unrealistic values outside of this range. Gaussian anamorphosis (Bertino et al., 2003;Lenartz et al., 2007;Simon and Bertino, 2009;Béal et al., 2010) consists of applying a non-linear transformation onto the model variable which should make the pdf of the state vector more similar to a Gaussian pdf. In practice such transformations are applied to individual elements of the state vector and thus operating only on the marginal distribution and not on the full multidimensional pdf. Such transformations can be based on an analytic transformation (e.g. logarithm, for lognormal distributions) or empirically based on the distribution of the observations. The initial distribution of sea ice concentration is estimated from a 1-year free-running ensemble simulation. The derived transformation function is here independent in time and space ( Figure 10). The anamorphosis transform was applied to all ensemble members so that the ensemble members include the transformed sea-ice concentration. Observed sea ice concentration was not transformed, therefore the observation operator includes the inverse anamorphosis transform and is non-linear. This approach allows to define the error standard deviation of the observations in the original units. The analysis scheme is implemented with the non-linear observation operator as described in Chen and Snyder (2007) and Barth et al. (2011). Other model variables exhibit a non-Gaussian behavior too as thickness of snow and sea ice layers (which have to be positive) and sea water temperature (which has to be above the freezing temperature). We limit ourselves to sea ice concentration as this is an observed variable and thus large corrections are expected for this parameter. Other variables with a non-Gaussian distribution are dealt with using an ad-hoc correction after the analysis step."}, {"section_title": "Analysis", "text": "The analysis scheme is based on the Kalman filter analysis, where the model forecast x f (with error covariance P f ) is updated by the observation y o (with error covariance R) resulting in the analysis state x a and its error covariance (P a ): where H is the observation operator extracting the observed part of the state vector. The mean state x f and its covariance are computed from an ensemble of perturbed members Evensen, 2007): where the columns of the matrix S f are the difference between each member and the ensemble mean (multiplied by 1 √ N −1 ). The ensemble update used here is based on the Ensemble Transform Kalman Filter (Bishop et al., 2001). In order to avoid to form P a explicitly, P a is expressed also in terms of the square root matrix S a (P a = S a S aT ) which is possible when the following eigenvalue decomposition is made: where U T U = I and where Λ is diagonal. U and Λ are both of size N × N . Using this eigenvector decomposition and the Sherman-Morrison-Woodbury formula (Golub and Van Loan, 1996) one can compute the analysis x a and the square root of the analysis error covariance S a by: Based on x a and S a , an ensemble can be finally reconstructed: In order to filter spurious long-range correlations, a localization scheme in the observation space has been used with a length scale of 2000 km (approximately 20 grid points). This assimilation scheme is implemented in a tool called the Ocean Assimilation Kit and described in more detail in Vandenbulcke et al. (2006); . The present setup is the first global implementation of the assimilation tool and it required some adaption in order to properly handle the periodic boundary conditions in the localization scheme."}, {"section_title": "Variant of assimilation experiments", "text": "Different assimilation experiments were conducted to assess the different choices that have been adopted during the implementation of the assimilation scheme. and in the observations. These experiments were carried out for the year (the initial year of the study). The skill-score is defined as: Negative values of this skill score mean a deterioration of the results and positive values an improvement. The baseline experiment uses a state vector of 30 variables, Gaussian anamorphosis is applied to sea ice concentration, and the standard deviation error for the sea ice concentration is set to 0.1. In a first test, the Gaussian anamorphosis was disabled and the sea ice concentration was adjusted to the interval [0, 1] after the analysis (row ExpFNA-0.1 in table 1). Compared to the baseline experiment, a small error increase in sea ice concentration was observed, while other variables are not affected. Given the strong non-Gaussian character of the sea ice concentration, one could have expected a larger impact of the anamorphosis transform. However, the Gaussian anamorphosis only transforms the marginal pdfs while the character of the multidimensional pdf of the state-vector might not be significantly changed by the transformation. In the following experiments, the Gaussian anamorphosis was kept. By reducing the error standard deviation (ExpFA-0.07) of the sea ice concentration to 0.07, the sea ice concentration forecast was improved by 8 % (compared to the baseline experiment with an error standard deviation of 0.1). A larger positive impact on the model variables (and especially on sea ice concentration) was obtained by using a reduced state vector excluding snow thickness and temperature inside the ice/snow layer (ExpRA-0.05, ExpRA-0.07 and ExpRA-0.1). This indicates that the excluded variables are related in a non-linear way to the observations and that relationship cannot be represented by a covariance. However, for this experiment the best results were obtained by using again 0.1 as error standard deviation of the sea ice concentration. Using a lower value did not result in an improvement contrary to the result with the full state vector. In summary, the experiments lead to the configuration with a reduced state vector and Gaussian anamorphosis of sea ice concentration, where sea ice concentration was assimilated with an error standard deviation of 0.1."}, {"section_title": "Reanalysis", "text": "While the calibration of the assimilation setup was performed on a single year (2000), this section presents the model simulations with data assimilation from 1st January 1985 to 31st December 2006. The time period was determined to ensure the availability of all used data sets."}, {"section_title": "RMS with assimilated data sets", "text": "The comparison with the assimilated data set is instructive to get a first view of the behaviour of the assimilated variables. The RMS error for sea surface temperature and sea ice concentration are computed over the whole globe while the RMS error for sea ice drift is limited to the southern hemisphere. The free model is not influenced by the observation described in section 3. In particular, its wind forcing is the original NCEP wind forcing. As mentioned previously, the sea ice drift observations are used at two stages: for correcting the wind forcing and during the analysis. Since the RMS errors showed a clear seasonal behaviour the 1606 assimilation cycles were aggregated on a monthly basis (Figure 11). In the free run, the sea surface temperature RMS error is on average 0.98 • C. This error is strongly reduced after the first assimilation cycle (not shown) and maintained at a relatively low level (about 0.5 • C) by the continuous assimilation of SST data. On average, the SST RMS error is highest during August and a secondary peak is observed in January. The seasonal behaviour of the SST RMS is significantly reduced by the assimilation. The behaviour of the sea ice concentration is similar, as a clear seasonal cycle can be seen in the RMS error and the average RMS error is highest in September (the period with the maximum sea ice extent in the Southern Hemisphere). As expected from the previous result, the RMS error of the sea ice drift component (only in the southern hemisphere) shows also a strong seasonal cycle. While the model forecast RMS is still smaller than the RMS of the free run, the RMS error increases relatively fast after the analysis (not shown). This is attributed to the fact that the underlying time scales of the variability in sea ice drift are shorter than the 5-day assimilation cycle. The average of the RMS error over all assimilation cycles is given in table 2."}, {"section_title": "Validation with the World Ocean Database", "text": "All observations from the World Ocean Database from the period 1st January 1985 to 31st December 2006 have been collected. For model verification, the model results are usually interpolated on the location and date of the observations (e.g . As the vertical grid of the model is the same at every location, we decided to rather interpolate the observations vertically on the model levels. These vertically interpolated profiles are then compared to the model results interpolated horizontally. The free-running model has the largest temperature error near the surface where the model has the most variability ( Figure 12). As the model assimilates sea surface temperature, the largest impact of the assimilation is indeed at the surface where the RMS error and bias (which is partly included in the RMS error) are strongly reduced. The RMS error is improved by the assimilation over 200 m depth and the bias over 120 m. Below those depths there is a slight degradation of the temperature which is essentially a systematic error in form of a bias. One possible way forward for improvement of the assimilation scheme could be to include a temperature relaxation toward a climatology to control such error. As the ensemble is generated by perturbing the atmospheric fields, the resulting vertical correlation scale between the surface and the subsurface level is about 100 meters (as calculated by computing the standard deviation averaged over time and horizontal space of the analysis increment). As the error increase at depth is not introduced by the analysis step, it must be introduced by the model reaction to an analyzed initial condition. In fact, it is well known that sequential analysis can produce shocks after restarting the model from an analysis (e.g. -Rizzoli et al., 1989;Yan et al., 2014). Incremental update techniques are a promising approach to reduce such problems during the re-initialization of the model (Bloom et al., 1996;Yan et al., 2014)."}, {"section_title": "Malanotte", "text": "The model does not assimilate salinity and therefore changes in salinity are only due to the multivariate covariance between the observed variables and salinity, and also due to the model adjustment after the analysis. The validation reveals that the assimilation reduces the salinity RMS error and bias everywhere with a diminishing impact at depth. Contrary to the temperature validation, no degradation at depth was observed."}, {"section_title": "Mean sea surface height", "text": "The mean model sea surface height was also compared with CNES-CLS09 MDT version 1.1 (Rio et al., 2011). The model sea surface height is related to the mean currents by the Assuming a jet with a Gaussian velocity profile, one can determine the characteristics of the polar front by fitting the error function on the mean sea surface height h (Gille, 1994): where y is the latitude, p is the position, w is the width, a and b are the hypothetical values of the sea surface height if y could tend to −∞ and +∞ (respectively). Tests were performed to include an additional term to separate the polar and the sub-polar front, however as SSH corresponds to mean over a long time period and given the coarse resolution of the model results, the sea surface height h did not contain sufficient details to distinguish these two fronts. The proposed fit corresponds thus to the overall change of SSH over the frontal system. This fit has been performed on the ORCA2 model grid (also for the CNES-CLS09 MDT) and repeated for all longitudes of the model grid. The model run without assimilation reproduces relatively well the position of the front (Figure 14). The RMS error of the position (averaged over all longitudes) is 1.70 • . While the assimilation can locally degrade the position of the front, it reduces on average the RMS error to 1.61 • . The overall structure of the width of the front agrees with the width determined from the CNES-CLS09 MDT. However, the width in the free model run is overestimated, indicating that the model is too smooth and the ACC (Antarctic Circumpolar Current) is too diffuse. While the width of the front in the analysis is still too large, the assimilation improves its representation and the RMS error is reduced from 5.96 • to 3.27 • ."}, {"section_title": "Identification of model errors", "text": "The aim of this section is the proposal of a technique for the identification of model errors during the assimilation cycle and its application on the proposed reanalysis for sea ice. Model errors can be traced by considering how the data assimilation system tends to pull the analysis away from the background towards the observations. Such approach was pioneered by Klinker and Sardeshmukh (1992) and further developed by Schubert and Chang (1996) and by Rodwell and Palmer (2007). The problem is approached here from a different perspective by the use of post-processing techniques and rigorous theoretical considerations. As argued in Vannitsem and Nicolis (2008), forecasts at small lead times can be corrected using Model Output Statistics (MOS) techniques in case systematic model errors are present. Random initial-condition errors, on the other hand, cannot be corrected. Importantly, additional corrections can be obtained by consideration of an additional predictor (other than the one corresponding to the predictand) in case this predictor is strongly correlated to the model error present. The aim of this section is to diagnose the presence of model errors by seeking additional predictors that strongly correct the forecast. The identification of good predictors may then lead to an increased understanding of the source of error. The data set considered consists of the ensemble-mean of the NEMO-LIM2 reanalysis. The observations against which we calibrate and compare the results are the aforementioned OSTIA data set."}, {"section_title": "Correction based on post-processing techniques", "text": "Three predictands or corrected forecasts are constructed: The total Antarctic sea ice area, the The corrected forecast x c is obtained by use of two predictors or model variables, x f 1 and x f 2 , based on the following regression relation: Here the function θ ensures that the corrected sea ice area x c is nonnegative: θ(z) = z when z ≥ 0, and, θ(z) = 0 when z < 0. The regression coefficients β 0 , β 1 and β 2 are obtained by numerical minimization of the mean squared error, analogous to the technique of Linear Model Output Statistics (LMOS) as discussed by Vannitsem and Nicolis (2008): where • n represents the average over the training data set and y o denotes the observation. Three correction methods are used here: • Bias correction: β 1 = 1 and β 2 = 0 while β 0 is an optimized parameter. • One-predictor correction: β 2 = while β 0 and β 1 are optimized parameters. • Two-predictor correction: β 0 , β 1 and β are optimized parameters. As the first predictor x f 1 the model variable corresponding to the predictand is taken. For the second predictand x f 2 , on the other hand, the following variables are considered, all taken from the 5-day forecast: ice thickness, ice y-velocity, ice x-velocity, sea surface height, barotropic stream function trends, sea surface height mean, sea surface salinity mean, sea surface temperature mean, sea surface x (meridional) and y (zonal) mean velocity, divergence and rotational components of horizontal velocity components, salinity, temperature, x-velocity, y-velocity and turbulent kinetic energy. As the model uses a leap-frog time stepping scheme, for some of the variable two consecutive time steps are available and have been used as predictors. Extra second predictors are constructed by full-field transformations of the aforementioned variables. More specifically, the totally advected, the longitudinallyadvected and latitudinally-advected quantities are obtained by multiplying the variables with the total velocity or the longitudinal or latitudinal surface velocities, respectively. Also full-field multiplications are performed with the sea ice concentration SIC, with 1-SIC and with SIC(1-SIC) in order to obtain predictors that are only nonzero over sea ice, over open sea or near the sea ice edge, respectively. For non-surface variables we consider also the vertically-averaged (oceanic) quantities. Verification scores are obtained by correcting data subsets that are independent from the ones used to obtain the regression coefficients. More specifically, a cross validation is performed by which each single calendar year is corrected using the coefficients that were trained on the other 20 years."}, {"section_title": "Results of post-processing", "text": "The overall impact of all correction schemes on the Antarctic sea ice area is tabulated in Table 3 showing in the first column the RMSE values of the corrected forecasts, relative to the RMSE of the uncorrected 5-day forecast. Our post-processing technique was also applied on the analysis data (taking x f → x a in Eq. 22) for which results are shown in the right-most column of Table 3. A bias correction of the forecast amounts to a 5% RMSE reduction as compared to the uncorrected forecast while an additional variability correction (or one-predictor correction) yields 4% of extra reduction. By far the strongest correction (45% extra reduction) derives from the use of the best two-predictor correction. The situation is clearly different for postprocessing applied to the analysis where all correction methods pull the analysis away from the observations (increased RMSE). The main second predictor that reduces the RMSE associated with the 5-day forecast is model sea-surface temperature (SST). Almost all other (second) predictors that are not directly related to the model SST improve marginally or deteriorate upon the one-predictor forecast. Using the model SST (averaged south of 50 • S) as a second predictor to correct the antarctic sea ice area, the RMSE is reduced with 50% as compared to the one-predictor forecast (see Table 3). Correcting the Antarctic sea ice area as a function of longitude using the model SST amounts to a reduction of 12%. This is a strong indication of a model error correlated with SST that considerably affects the forecast of the sea ice area. The global view of the modeling impact on forecasts allows for emphasizing the dominant role played by model errors associated with sea surface temperature forecasts. Improvements will therefore be expected provided a better representation of sea surface temperature is achieved. Fig. 15 shows the average Antarctic sea ice area for the different forecasts, the analysis and the observation as a function of the day of the year and the RMSE associated with these forecasts is given in Fig. 16. Clearly the RMSE of the two-predictor corrected forecast has the weakest seasonal cycle. Analogously, Fig. 17 depicts the longitudinal RMSE dependence of the sea ice area as function of longitude. The strongest two-predictor corrections are obtained in the Ross and Weddell seas and during Antarctic summer. The best two-predictor correction scheme for the analysis leads to a larger value of the RMSE. As discussed in details in Vannitsem and Nicolis (2008), the absence of correction of the post-processing approach indicates that no model errors nor initial biases (related to the observations) are affecting the analyses, or in other words that the sole error present in the analysis is a random initial condition error and that the data assimilation scheme has made a proper use of the observations. In turn the presence of a purely random initial condition error affecting the forecast step of the data assimilation scheme allows for concluding that the large biases of the five-day forecast are predominantly induced by a model error strongly correlated to the model SST. Even though so far no specific modeling scheme -such as horizontal turbulent transport -is pinpointed as the source of model error, we believe that progress can be made by considering other predictors more related to some specific parameterization schemes. This question is worth addressing in the future. Once a second predictor providing substantial corrections is found, the variables or parameterization tendencies that strongly affect this predictor must be used to define more specific predictors for the post-processing scheme. Since, in our case, the model error is strongly correlated with SST, new predictors related to surface heat fluxes, ice melting or freezing, or the parameterization of eddy-induced mixing at sub-grid scales could be good candidates. Once the observables responsible of the model error are isolated, the parameterization scheme should be reassessed, and sensitivity analyses based for instance on adjoint models could be performed. Note that the post-processing approach as proposed here is not equivalent to finding variables that are highly correlated with the observations. In addition the use of different interpolation schemes could affect the amplitude of the absolute RMSE values, but the ratio between the best two-predictor scheme and the one-predictor scheme is not affected, suggesting the robustness of the conclusions."}, {"section_title": "Conclusions", "text": "This study shows that sea ice drift can be used to correct the wind field over the Southern Ocean as the model sea ice drift and 3-day mean surface wind field are strongly correlated. This relationship was used to adjust the wind field using pseudo-wind field observations based on sea ice drift data. As expected, the model using the adjusted wind field produces results closer to the sea ice drift data. But the adjusted wind field is also closer to the Cross-Calibrated Multi-Platform Ocean Surface Wind field (based on ERA-40 and observations). The impact on sea ice concentration was also assessed. However, only a small error reduction was found which suggests that only a small part of the model error in sea ice concentration is due to the wind fields. Comparison of the adjusted wind fields with direct wind observations would be useful to further assess the validity of the wind corrections. Based on this adjusted wind, a reanalysis using the global NEMO model ORCA2 for the period 1985 to 2006 using 50 ensemble members has been presented. This model assimilates sea surface temperature, sea ice concentration and sea ice drift. The sea ice concentration assimilation used a Gaussian anamorphosis to transform this variable into a variable which follows more closely a Gaussian distribution. This transformation resulted in an improvement of the sea ice forecast. Despite this improvement being relatively small, the cost in term of CPU time is vanishingly small compared to the ensemble forecast and the analysis. Finally, the reanalysis was compared to the World Ocean Database which is an independent data set. The assimilation was able to reduce the overall RMS error and bias of the model compared to in situ temperature and salinity profiles. As the focus of the reanalysis is the Southern Ocean, the impact of the assimilation on the ACC (Antarctic Circumpolar Current) was also assessed by comparing the mean sea surface height of the model to the mean dynamic topography derived from various observations. The assimilation improved in general the mean surface height of the model in the Southern Ocean. In particular, the overall position and strength of the ACC was closer to observations after the assimilation. Data assimilation is not directly suited to correct or diagnose consistent model errors since these are usually considered as random uncorrelated processes (except when the model bias is related to errors in the model parameters which can be estimated using variational assimilation or using a Kalman filter with an augmented state vector). The post-processing technique known as model output statistics attempts to relate a series of past forecast variables with the corresponding observations and is commonly used in numerical weather predictions for improving forecasts by reducing the impact of model errors. This technique can also be used to identify the presence of model errors by means of the analysis of the forecast improvements obtained using multiple predictors (Vannitsem and Nicolis, 2008). Indeed the potential forecast improvement based on a predictor reflects the presence of model errors (systematic or not) strongly correlated with this specific predictor. In the present investigation, the cross-validated RMS error of the 5-day forecast for the total Antarctic sea ice area could be halved using the SST forecast (averaged south of 50 • S) as predictor. This indicates that SST is an important predictor strongly affected by the modelling error. This finding constitutes a first step to the identification of the underlying modeling scheme at the origin of the model error affecting the forecast. The post-processing technique was also applied on the analysis but was unable to reduce the RMS error, indicating that there is no obvious systematic error affecting the sea ice analysis."}, {"section_title": "Acknowledgments", "text": "This work was funded by the project PREDANTAR (SD/CA/04A) from the federal Belgian Science policy and the Sangoma FP7-SPACE-2011 project (grant 283580). François          "}]