[{"section_title": "Abstract", "text": "Abstract: Cardiovascular disease remains the leading cause of death in most of the developed world despite advances in both prevention and treatment. At the same time, the incidence rates of cardiovascular disease differ greatly between the genders, with men more likely than women to manifest ischemic heart disease. This observation has prompted new research initiatives to explain the discrepancy in heart disease prevalence and incidence between the sexes. Whether androgens affect cardiovascular disease adversely remains a contentious issue, with some data pointing to a deleterious effect of androgens on lipid profiles, and other studies revealing androgens' possible benefits on cardiovascular function. This review will examine the relationship between the endogenous production of androgen as well as the exogenous replacement of testosterone in men and the possible links to cardiovascular disease. The role of testosterone in male cardiovascular health is not completely understood, and additional studies are needed to explain its effect on atherosclerosis and its complications.\nKey Words: testosterone, androgens, coronary artery disease (Cardiology in Review 2010;18: 251-257) C ardiovascular disease remains the leading cause of death in the United States despite aggressive control of known risk factors such as systemic hypertension, diabetes, dyslipidemia, and cigarette smoking. The life expectancy for men is significantly less than that for women, despite advances in medicine, and men are twice as likely to die of the complications of coronary artery disease (CAD) than are women."}, {"section_title": "1", "text": "Sex steroids may play a role in this gender difference, spurring current research studies to investigate mechanisms by which sex steroids affect mortality and heart disease. Historically, androgens were deemed harmful and estrogens protective for the cardiovascular system, stemming from the observation that women, on average, live longer than men. However, the Coronary Drug Project showed that administering estradiol to male survivors of myocardial infarction was associated with excess coronary and thromboembolic events. 2 Since the first prospective, placebo-controlled, randomized clinical trials showed no cardiovascular benefits of combined estrogen/progestin therapy in menopausal women, views on how reproductive hormones influence cardiovascular disease have drastically changed. [3] [4] [5] Androgens are connected to many aspects of cardiovascular disease in men, but the exact role is uncertain. 6, 7 Controversy continues to surround the relationship between baseline testosterone and mortality, but causality has never been established. Historically, epidemiologic studies have found no association between physiologic elevated androgen levels and atherosclerosis. 8, 9 In contrast, the results of several recent studies show a correlation between endogenous hypogonadism and increased morbidity and mortality. Given the proven benefits of testosterone replacement on bone, musculature, body fat, wellbeing, and mood, investigators have hoped to demonstrate favorable effects on the cardiovascular system. 10 Androgen substitution continues to be commonly prescribed for both primary and secondary hypogonadism, with known improvement in physical and quality of life measures, but questions still remain about the long-term effects of testosterone on the cardiovascular system. [11] [12] [13] This review will examine the relationship in men between the endogenous production of androgen and the exogenous replacement of testosterone on the risk of CAD."}, {"section_title": "TESTOSTERONE PHYSIOLOGY AND MALE HYPOGONADISM", "text": "Total testosterone is derived from a portion bound to binding proteins, sex hormone binding globulin (SHBG) and albumin, and a free percentage of Ͻ2%. Most testosterone directly binds to the androgen receptor (AR), but the biologic effects of testosterone also depend on its conversion to bioactive metabolites. About 5% to 10% of testosterone is converted to its 5␣ reduced metabolite dihydrotestosterone by 5␣ reductase. Dihydrotestosterone then binds to the AR, amplifying testosterone's action because dihydrotestosterone has a higher molar potency from a higher binding affinity and a slower dissociation rate from the AR. Testosterone is also converted through the enzyme aromatase to estradiol, activating the estrogen receptor. Aromatase gene expression has been detected in several vascular tissues in men, including human coronary arteries. 14 The actions of testosterone are mediated by both genomic and nongenomic effects. The AR mediates the genomic effects by triggering transcription factors and regulating target gene expression. Many tissues in the body express AR, including vascular tissue cells and endothelial cells, all showing a gender specific expression of AR. 15 Nongenomic androgen effects occur via membrane-bound receptors triggering both rapid effects of androgen and second messenger signaling. The nongenomic steroid action of testosterone is characterized by rapid onset, insensitivity to inhibition of ribonucleic acid and protein synthesis, and is involved in multiple tissues mediating such effects as vasodilation of the rat coronary arteries and gallbladder motility. 16 The Endocrine Society defines hypogonadism in men as a clinical syndrome resulting from the failure of the testis to produce physiologic levels of testosterone and the normal number of spermatozoa. 17 The consequences of reduced androgen levels include fat mass gain, loss of muscle and bone mass, fatigue, depression, anemia, poor libido, and erectile dysfunction. Most of the studies in the medical literature have used a cutoff level of total testosterone of Ͻ300 ng/dL to aid in the biochemical diagnosis of hypogonadism. 18 The diagnosis is made based on both clinical and biochemical data, taking into account the difficulty in measuring serum androgens given its circadian rhythm (levels being highest in the early morning), and with the variations in laboratory methodologies, which often yield inconsistent measurements.\nHypogonadism is found commonly in elderly men who are frequently evaluated for possible androgen replacement therapy. Total testosterone decreases by approximately 0.4% to 2.6% per year after the age of 40, with a progressive increase in SHBG. 20, 21 These changes result in a decrease in bioavailable testosterone and may possibly explain the late onset hypogonadism seen in men over the age of 60, with serum total testosterone concentrations below the reference range for young adult males. 21 Andropenia in old age also appears to be caused by hypothalamic dysregulation. 22 Pulsatile luteinizing hormone (LH) secretion is decreased, resulting in a reduction in gonadotropin releasing hormone secretion, and supports the concept of hypothalamic secretions becoming exhausted with increased age. At the same pulse frequency, the pulse amplitude of LH is reduced, and therefore less LH is secreted. Total testosterone secretion diminishes from a decreased LH response by the Leydig cells, which are responsible for testosterone production in the testis. The decrease in testosterone may represent a physiological part of the aging process and may also include an expression of pathology. It is well known that hypogonadism is also associated with general chronic illness and changes in SHBG, and these clinical scenarios must be taken into consideration during the evaluation of low testosterone levels. Testosterone replacement has been suggested as a treatment for improving muscle strength and mass with aging; however, sleep apnea and secondary polycythemia may develop as a consequence of this therapy."}, {"section_title": "23", "text": ""}, {"section_title": "Endogenous Testosterone Production and Morbidity/Mortality", "text": "The clinical observation that men with a history of CAD have a higher prevalence of hypogonadism has led to the assumption that low testosterone could be involved in the pathogenesis of atherosclerotic heart disease. 24 Low androgen production in men has been implicated in the observed difference between men and women dying from CAD. 25 History gives us some insight for the validity of this observation by examining the mortality of castrated men. The castrati, boys who had prepubertal orchiectomies to preserve singing voice, had no difference in life span when compared with intact singers. 26 Many of the studies examining the relationship between endogenous testosterone production and cardiovascular disease incidence in men failed to show causality or even a clear association. 21, [27] [28] [29] [30] [31] [32] [33] The weak association between mortality and testosterone levels in some studies may be attributed to study design characteristics; either case control or prospective cohort design, with patient populations varying greatly according to age and CAD risk. In addition, some of the older studies did not take into account free or bioavailable testosterone in their results, which could account for changes in SHBG that would affect total testosterone measurements.\nThere are some studies investigating androgens and CAD that did show a weak association between hypogonadism and coronary events, however, study results often fail to show a statistically significant relationship. In the Multiple Risk Factor Intervention Study, Cauley et al 29 found similar testosterone concentrations in 163 men who had coronary events compared with matched controls. In another study, 20 years of follow-up of 96 men with heart disease showed no difference in testosterone concentration compared with controls. 32 The Rancho Bernardo study reported 196 cardiovascular and CAD deaths in 872 men followed up for 12 years. There was no significant difference in testosterone levels in men who experienced a coronary event and in men who did not have a cardiovascular event. 28 The Caerphilly Study followed 2500 men for 5 years, where 153 men diagnosed with ischemic heart disease had baseline plasma testosterone levels similar to those without ischemic heart disease.\nMore recently a twin study of 566 men showed no significant difference in androgen concentration between those who experienced a coronary event and those without CAD. 34 In the Framingham cohort, 386 cardiovascular events were reported over 10 years of follow-up. When examining testosterone levels, no difference was found between those who had cardiovascular events and their healthy cohorts. 27 One of the difficulties in establishing a clear association between testosterone levels and cardiovascular disease in these studies comes from the difficulty in measuring androgen levels themselves. Laboratory measurements vary widely; and analyses of free and bioavailable testosterone were not used in some of the older studies. In addition, only 1 blood sample may have been used, and the time of blood collection may have differed. 35 Despite the large amount of published data described earlier, which seems to disprove a clear relationship between low androgen levels and heart disease, there are several other studies that have reported a completely different finding, showing a direct link between low testosterone levels and heart disease or mortality. Retrospective data on hypogonadal male veterans showed an association with hormone levels and increased mortality. 36 Phillips et al studied 55 men undergoing coronary angiography without history of myocardial infarction and found a strong inverse correlation between free testosterone and the degree of disease. 37 Additional cross-sectional studies have found a relationship between diminished testosterone and carotid atherosclerosis, 38, 39 as well as progression of aortic atherosclerotic disease. 9, 40 Transesophageal echocardiography, evaluating the degree of thoracic aorta intima thickness, found a negative correlation with plasma testosterone in a study including 42 eugonadal males. 40 Rosano et al examined 129 patients referred for symptoms of CAD, and found a clear inverse relationship between the degree of CAD and plasma testosterone levels. 41 Even after adjusting for classic risk factors, the association between endogenous testosterone and all-cause mortality remained unchanged.\nA cohort of older men with testosterone insufficiency were found to have an increased risk of death over 20 years of follow-up, 42 suggesting that men with total testosterone levels in the lowest quartile (Ͻ241) ng/dL were 40% more likely to die than those with higher levels. 43 The Baltimore Longitudinal Study of Aging, 21 using carotid artery duplex ultrasonography, found that low testosterone levels predicted a higher arterial stiffness index after adjusting for age, fasting plasma glucose, and body mass index. Testosterone values measured 5 to 10 years prior to the carotid study also predicted the higher stiffness index, leading to the suggestion that low testosterone levels may have a long-term influence on arteries. 21 Factors defining a possible relationship of cardiovascular disease with low levels of endogenous androgens in men have also included objective measurements of atherosclerosis, such as angiography, or vessel thickness, as opposed to looking at the overall incidence and prevalence of heart disease. In addition, there is great variation in the study populations, especially with regard to age and comorbidities affecting cardiovascular status. Therefore, despite the considerable work done in this area, the relationship between low testosterone and heart disease in men still remains unclear.\nAnother important confounding factor in several epidemiological studies has been the influence of SHBG concentrations on the measurement of testosterone concentrations. Because 30% to 50% of testosterone is bound to SHBG, the total concentrations of testosterone are lower in men with decreased SHBG concentrations. 44 Obese men have lower SHBG concentrations and lower free testosterone concentrations compared with those who are lean. 45, 46 "}, {"section_title": "Schwarcz and Frishman", "text": "Cardiology in Review • Volume 18, Number 5, September/October 2010\nHowever, one cannot exclude the possibility that the relationship between measured testosterone concentrations and visceral fat and atherosclerosis might also reflect a relationship between SHBG and these outcomes.\nCardiology in Review • Volume 18, Number 5, September/October 2010 testosterone. 96 In one study, testosterone administration by implants was given for 2 years to patients complaining of severe premenstrual symptoms as compared with age-matched controls. 96 In treated patients, apo A1 and HDL-C were significantly decreased and very low density lipoprotein cholesterol increased. No significant change was found in the levels of total cholesterol, LDL-C, apolipoprotein B, lipoprotein(a), lecitihin-cholesterol acyl transferase, and cholesteryl transfer protein activity. There was no difference in the clotting factors of both groups, which included prothrombin time, fibrinogen activator inhibitor, ␤-thromboglobulin, and prothrombin fragments 1.2. There was no change in the architecture of the ovaries."}, {"section_title": "Exogenous Testosterone and Cardiovascular Disease", "text": "Given that there is some evidence that low endogenous testosterone in men correlates positively with the prevalence and incidence of cardiovascular disease, investigators have attempted to show that the administration of exogenous testosterone may prevent or benefit those men with CAD. Overall, the study results are lacking in establishing a clear benefit of testosterone replacement therapy on the number of cardiovascular events. A meta-analysis of randomized controlled trials by Calof et al 47 showed no association between testosterone treatment and cardiovascular events. An additional analysis of previous studies revealed that many of the studies included in the meta-analysis did not have cardiovascular disease as a specific end point, which may contribute to the lack of an association; in addition, consistent methods of measuring free or bioavailable testosterone were not used in all studies. 44, 48 However, in animal models and smaller clinical studies involving exercise-induced ischemia, a benefit of testosterone administration has been shown in ameliorating aspects of CAD. Animal studies have shown that low testosterone is associated with a greater atherosclerotic burden and that replacement with testosterone improves aortic atherosclerosis. 49, 50 In low density lipoprotein (LDL) receptor-deficient mice, orchiectomy is associated with accelerated formation of atherosclerotic lesions in the aorta, and testosterone supplementation was shown to retard the progression of these lesions. 50 Administration of an aromatase inhibitor blocked the beneficial effect. 51 One of the original studies examining the beneficial effect of testosterone on CAD was carried out by Jaffe. 52 Fifty men with stable angina were treated with testosterone cypionate and found to have significant improvement in the amount of ST segment depression on subsequent treadmill testing exams. Other studies have found a similar effect of testosterone on exercise-induced ischemia. Short-term administration of intravenous testosterone by Rosano et al 53 resulted in amelioration of exercise-induced myocardial ischemia in 14 men. Oral testosterone undecanoate prescribed to 22 men with low plasma testosterone and angiographically proven CAD 6 did not result in increased global myocardial perfusion, but the myocardium supplied by unobstructed coronary arteries showed increased perfusion.\nIn a placebo-controlled trial, testosterone replacement in hypogonadal men was shown to improve the time to ischemic threshold on treadmill exercise testing after 4 and 12 weeks of treatment. 54, 55 English et al treated 46 men with stable angina with 5 mg of transdermal testosterone or placebo for 3 months in a double-blind, randomized trial. A 2-fold increase in androgen levels was observed along with an increase from baseline in time to electrocardiogram 1-mm ST depression with exercise. 56 When 87 diabetic males with CAD were given oral testosterone undecanoate for 3 months, a significant decrease in the number of angina attacks was observed. 57 Longer term benefits of testosterone replacement therapy on angina threshold and atheroma in hypogonadal men over 1 year were examined in 13 males with chronic angina pectoris and exercise-induced ST segment depression. 58 Testosterone undecanoate treatment for 1 year was shown to increase the time to ischemia significantly, but carotid intimal medial thickness reductions were not significant in these subjects.\nA high prevalence of hypertension has been found to correlate with low endogenous testosterone levels in elderly men, 59 and testosterone undecanoate treatment was shown to have a favorable effect on measurements of systolic blood pressure. 60 The mechanisms proposed to explain testosterone's effect on the coronary circulation and blood pressure include a direct vasodilatory action of testosterone. In isolated rat coronary arteries and thoracic aortas, testosterone reversibly attenuated coronary vasoconstriction and this effect did not appear to be AR dependent. 61 Additional evidence from animal model studies demonstrated that androgen treatment, in addition to its vasodilatory effects, can retard atherosclerotic lesion formation in large vessels. 62 The direct effects of testosterone on the myocardium itself are unclear. A single intramuscular administration of testosterone in hypogonadal men resulted in a negative linear relation between QT interval and testosterone concentration, suggesting that testosterone could possibly shorten ventricular repolarization. 63 Studies in animal models have also shown adverse effects of testosterone treatment on the myocardium with regard to myocardial remodeling. 64 A single dose of testosterone after ischemia reperfusion in the isolated rat heart was shown to increase myocardial apoptosis and to decrease myocardial function recovery. 65 The subsequent blocking of testosterone resulted in an accelerated time to myocardial recovery.\nHowever, in humans, an association between low androgen levels and heart failure has been observed, 66 with evidence of clinical improvement with androgen replacement. 67 Giving physiological doses of testosterone, using patches, to men (25% with hypogonadism) with heart failure and an average ejection fraction of 32.5% resulted in an improvement of functional capacity even though the ejection fraction was unchanged. 67 The effect of exogenous testosterone on the cardiovascular system must also be evaluated by the amount of replacement dose used, physiological versus supraphysiological. One area of clinical observation that gives insight into the cardiovascular effects of testosterone includes data with androgen abuse in athletes. Case reports of myocardial infarction, hypertension, arrhythmia, cardiac failure, pulmonary embolism, stroke, and sudden death suggest deleterious effects from supraphysiological doses of androgens. 68 Bodybuilders using high doses of androgens have developed left ventricular hypertrophy 69, 70 and congestive heart failure. 71 However, the few studies that have examined androgen abuse in athletes, excluding case reports, did not clearly demonstrate an increase in cardiovascular disease. The East German athletic program involved more than 2000 athletes who received high-dose synthetic androgens. Although complications were recorded, no specific cardiovascular complications were noted in their reports. Androgen abuse may still potentially cause detrimental cardiac effects by triggering atherogenesis through changes in lipid metabolism, and a hypercoaguable state by increasing platelet aggregation, erythrocytosis, and thrombus formation. 72 Unfortunately, studies on high-dose anabolic steroid use in human beings do not define the steroid type used or the drug dose, and the use of concomitant stimulants are unknown, which may affect the accuracy of adverse event reporting in the published data.\nRecently, it was observed that neoadjuvant hormone replacement therapy in patients with prostate cancer was associated with an increased risk of all-cause mortality among men with a history of CAD-induced congestive heart failure or myocardial infarction, an observation not seen in men having no comorbidity or a single risk factor for CAD."}, {"section_title": "73", "text": ""}, {"section_title": "EFFECTS OF TESTOSTERONE ON LIPIDS AND LIPOPROTEINS", "text": "Many factors that influence both high density lipoproteincholesterol (HDL-C) levels and testosterone levels are similar, and include coexisting chronic disease, obesity, and body fat distribu-tion, along with lifestyle factors such as smoking, alcohol use, and exercise. Low testosterone may also reflect changes in SHBG associated with chronic illness and obesity. The Telecom Study 74 looked at the association between cardiovascular risk factors and men with normal and low testosterone. Low testosterone was associated with higher total cholesterol, LDL-cholesterol (LDL-C), apolipoprotein B, body mass index, fasting plasma insulin, and lower values of HDL-C and apolipoprotein A1 (apo A1). SHBG levels were also lower in the low testosterone group, which may have affected total testosterone concentration, especially since bioavailable testosterone levels were not significantly different between the 2 study groups. 74 Endogenous testosterone production does appear to be associated with changes in lipoprotein subfractions, the significance of which remains unclear. 75, 76 Hepatic lipase is primarily produced in the liver on the luminal surface of sinusoidal endothelial cells, and mediates the removal of lipoproteins from plasma by catalyzing the hydrolysis of triacylglycerols and phospholipids. The phospholipids are then transferred into HDL. Hepatic lipase also mediates the conversion of subfractions of HDL and facilitates their liver uptake. 75 In addition, hepatic lipase also converts large buoyant LDL to small, dense LDL, a known risk factor for CAD. 76 It has also been suggested that the decrease in HDL-C with testosterone administration might be the result of increased cholesterol efflux from endothelial macrophages stimulating a reverse cholesterol transport; potentially producing an antiatherogenic effect. 77 However, the results of intervention trials showing that testosterone therapy can lower HDL-C levels raise concern that testosterone may contribute to cardiovascular risk. 24, 78 The effects of androgen on HDL, nonetheless, depend on the formulation and type of androgen used, and the dose and route of administration. Supraphysiological doses of androgens, especially orally administered, nonaromatizable, androgen steroids, will decrease plasma HDL-C levels significantly. 79 -81 When androgens such as stanozolol are administered, there is a marked reduction in HDL. 81 In the Multiple Risk Factor Intervention Trial, 82 a direct relationship was also found between plasma testosterone and decreased HDL-C concentration. Retrospectively analyzed data from 503 men evaluated for anabolic steroid hormone levels and mortality also found an inverse association between measurements of serum testosterone and lipid and lipoprotein profiles, specifically the total cholesterol to HDL ratios. 83 In their study, Singh et al gave 61 eugonadal young men varying graded concentrations of testosterone enanthate after administration of gonadotropin-releasing hormone agonists. 84 Plasma HDL-C and apo A1 concentrations were inversely correlated with total and free testosterone concentrations, but were significantly decreased only in the supraphysiological dose of 600 mg/wk group. No significant change in total cholesterol, LDL-C or very low density lipoprotein cholesterol was found.\nIn a study of 12 elderly eugonadal men undergoing elective hip or knee replacement, subjects were treated with supraphysiological doses of testosterone (600 mg/wk) for 3 weeks. Hepatic lipase activity increased more than 60% above baseline levels and HDL and its subclasses HDL2 and HDL3 significantly declined in 3 weeks. 85 Tan et al administered 250 mg of testosterone enanthate intramuscularly monthly for 3 months to hypogonadal Chinese men and demonstrated a significant increase in HDL activity. 86 The study of Dobs et al looked at 29 hypogonadal men treated with testosterone patches for 1 year and found a strong negative correlation with body mass index, HDL, and testosterone concentrations at baseline; after treatment, there was a positive trend that did not reach significance between testosterone levels and HDL. 87 In a meta-analysis on the metabolic effect of testosterone treatment, it was concluded that the HDL-C reduction was seen in studies where testosterone supplementation was supraphysiological. 13 This effect was possibly attributed to the formulation of testosterone: long-acting testosterone esters produce supraphysiological levels immediately after injection, whereas testosterone patch or gels provide more consistent testosterone levels. The pooled effect of testosterone on serum total cholesterol was more pronounced in hypogonadal than in eugonadal men, and testosterone had little effect on LDL-C. A small but significant reduction in HDL-C was observed in the group of studies performed in men with higher baseline testosterone concentrations, but the overall effect was not statistically significant. The meta-analysis found that the magnitude of the decrease in HDL-C was lower in the studies using testosterone esters with respect to other formulations (oral testosterone undecanoate or cypionate and transdermal testosterone), 13 possibly attributable to the effect of the high serum levels of estradiol achieved with intramuscular testosterone injections. Other studies examining older men treated with testosterone enanthate found no significant change in HDL, 88, 89 while oral testosterone undecanoate was found to significantly suppress HDL in another study. 90 In contrast to the aforementioned, Zitzmann and Nieschlag observed 66 hypogonadal men receiving testosterone undecanoate in a longitudinal observation study for 9.5 years, noting lower LDL-C and higher HDL-C in treated patients. 91 The alteration in HDL-C has been found in cross-sectional noninterventional observations, perhaps because of the longer observation period of therapy and overall favorable alterations in body composition. A meta-analysis of 30 randomized, placebo-controlled trials, which included 808 men treated with testosterone, showed no association between testosterone therapy and lipid fractions. 77 The evidence to date indicates that physiological replacement of androgens does not alter overall lipoprotein profiles, while supraphysiological doses of nonaromatizable androgens decrease HDL-C. Overall, physiologic testosterone replacement appears to be associated with little or no decrease in plasma HDL-C."}, {"section_title": "OTHER ADVERSE EFFECTS OF TESTOSTERONE", "text": "The goal of testosterone replacement therapy is to restore normal circulating levels, similar to that of estrogen and thyroid replacement. 23 This approach is distinct from using supraphysiologic doses in otherwise healthy individuals for athletic enhancement. 92 Testosterone replacement does not result in more rapid growth of prostate cancer. 93 Men having high levels of endogenous testosterone are at no greater risk for prostate cancer than those with low testosterone levels. 94 In addition, many of the previous fears regarding testosterone replacement causing hepatic and renal toxicity have been abandoned with the use of new formulations. However, there is a mild risk of developing erythrocytosis, gynecomastia, or testicular atrophy with testosterone replacement."}, {"section_title": "95", "text": ""}, {"section_title": "TESTOSTERONE IN WOMEN", "text": "Androgen therapy is used as a performance enhancer in women and could be considered as a treatment in congestive heart failure. However the long-term cardiovascular effects of androgen replacement therapy in women have not been established. Testosterone's role in the development of CAD in women is still not completely understood. 96, 97 One study demonstrated the positive relationship of free testosterone level with hypertension 98 and another showed a positive correlation with HDL-C and CAD. 99 Worboys et al demonstrated improvement in endothelium-dependent and independent (glyceryl trinitrate) brachial artery vasodilation in postmenopausal women receiving hormone replacement therapy and"}, {"section_title": "100", "text": ""}, {"section_title": "CONCLUSIONS", "text": "Uncertainty continues to cloud the relationship between low or high androgen levels and the rate of CAD, and direct causality has not yet been established. One of the largest prospective studies of more than 3000 men was recently published and shows that the risk of death nearly doubled in elderly men with low levels of both testosterone and estradiol. 101 No association was found specifically between low testosterone or estradiol levels and cardiovascular disease mortality risk, supporting previous prospective studies, although risk estimate was much lower than that for total mortality. This large study had the benefit of gas chromatography mass spectroscopy for evaluating androgen levels. The clinical picture of male hypogonadism produces significant morbidity, and after thorough diagnostic evaluation to identify the underlying cause of hypogonadism, testosterone replacement may be considered after examining benefit to risk ratio for an individual patient. The clinician is able to choose different testosterone preparations, tailoring pharmacokinetics and route of application to the patient. Long-term effects of androgen replacement and its effects on the cardiovascular system still remain unanswered. Much of the published data consists of small, observational studies without clear outcome definition. We still lack large randomized controlled studies examining the relationship between testosterone replacement and heart disease risk, although androgen replacement therapy demonstrates beneficial effects on body composition, muscle strength, bone density, and metabolism in hypogonadal men. [102] [103] [104] The effects of physiological doses of androgens on the lipoprotein profile remain to be fully clarified and the risk of not replacing androgens in the deficient male also remains unanswered. A Men's Health Initiative trial to evaluate testosterone use for cardiovascular disease prevention and other medical indications needs to be done, similar to the completed placebo-controlled Women's Health Initiative, which evaluated the effects of estrogen and estrogen plus progesterone. 3 On first glance, we might think that testosterone and cardiovascular disease are clearly linked, but the intricacies of the relationship are much more complex. As the role of androgens in cardiovascular disease becomes clarified in future research studies, we one day hope to comprehend the mechanisms that account for the observed sex differences in the incidence of CAD in the middle-aged population."}]