[{"section_title": "Abstract", "text": "For all Ocean related activities it is necessary to predict the actual water levels as accurate as possible. The present work aims at predicting the water levels with a lead time of few hours to a day using the technique of artificial neural networks. Instead of using the previous and current values of observed water level time series directly as input and output the water level anomaly (difference between the observed water level and harmonically predicted tidal level) is calculated for each hour and the ANN model is developed using this time series. The network predicted anomaly is then added to harmonic tidal level to predict the water levels. The exercise is carried out at six locations, two in The Gulf of Mexico, two in The Gulf of Maine and two in The Gulf of Alaska along the USA coastline. The ANN models performed reasonably well for all forecasting intervals at all the locations. The ANN models were also run in real time mode for a period of eight months. Considering the hurricane season in Gulf of Mexico the models were also tested particularly during hurricanes."}, {"section_title": "INTRODUCTION", "text": "Prediction of water levels caused by tidal action is an essential prerequisite for design as well as operational activities in the ocean. Numerous models for tidal forecasting have been carried out in the past including classic equilibrium tidal theory proposed by Darwin (1892) and the least-squares method to determine harmonic constants proposed by Doodsen (1952) which is still used widely for forecasting tides. The accuracy of harmonic models depends entirely on the maximum number of harmonics considered which in turn depends upon length of the measured sample. Although there are as many as 69 harmonic constituents that are identified so far for the tide prediction, when non-periodic meteorological and oceanographic effects such as hurricanes, cold fronts become influential the harmonic analysis becomes inapplicable (Deo and Chaudhari, 1998) . A similar opinion is expressed by The National Water Level Program (NWLP) and the National Water Level Observation Network (NWLON) of National Oceanic and Atmospheric Administration (NOAA) of the USA which owns and maintains tidal stations which measure water levels along the USA coastline. They also publish tide predictions for about 3000 locations around the USA. It is mentioned on their web site that, \"We work to insure that the predictions are as accurate as possible. However, we can only predict the astronomical (up to 5 years) with a very short (even just 1 month of data) period of tidal record. The tidal forecast based on the application of harmonic analysis and artificial neural networks to short-term measurements was successfully done by Lee et al. (2007) . The results of the methodology validation show that short-term sea level registrations can be efficiently employed to produce accurate tidal predictions. Liang et al. (2008) mentioned that under the strong meteorological effects like storm surge or typhoons, non-astronomical part of tidal level is mainly meteorological data driven. Direct prediction of water level requires isochronous meteorological data, but often such data are not available. Thus, mathematical techniques are required to overcome the shortage of meteorological data. Liang et al. (2008) used Back Propagation Neural Networks to improve the accuracy of tide prediction and supplement of tidal records. The technique of artificial neural networks was employed to predict sealevel variations with warning times from 1 h to 5 days on the basis of hourly tide gauge observations at Cocos (Keeling) Islands in the Indian Ocean by Makarynska and Makarynskyy (2008) . The suggested neural methodology demonstrated reliable results in terms of the correlation coefficient, root mean square error and scatter index when compared with actual observations. The present work follows the suite of Cox et al. (2002) in that it uses the water level anomaly instead of observed water levels. However the observed water level anomaly time series is the only variable (and not the time series of wind speed, barometric pressure as used by Cox et al. (2002) ) used to predict water level anomalies up to 24 hours in advance and finally water levels are calculated by adding these predicted anomalies to the harmonic tides. The Neural Network models will be developed to forecast water level anomaly with lead times of 6hr, 12hr, 18hr and 24 hr. By subtracting harmonic tide from the observed water level and using it for training, the network is relieved from training and then predicting the astronomical tidal component which is determined harmonically. Thus the meteorological effect may be in the form of cold front or hurricane wind forcing will be the only component in the anomaly model. Hence in a sense it is an optimized neural network design wherein a deterministically modeled component of harmonic tides is subtracted from the observation and the only natural random meteorological component is modeled. It may be noted that the harmonically predicted tidal values are accepted all over the world and it is not that the ANNs would be unable to predict these values accurately. This actually has been done in the earlier research works presented earlier. Therefore it was felt if the deterministic components like harmonic tide which is widely accepted all over the world if not included in the network training we can save millions of computations it carry out ultimately optimizing the network design. The water level models will be developed at six locations in three areas (two teach in the Gulf of Mexico, the Gulf of Maine, and the Gulf of Alaska). The flow chart of the proposed method is shown in Figure 1 .\nThe outline of the paper is as follows. The next section describes the salient features of the data used to train and test the ANN model. Next a brief review of the modeling strategy is provided. Modeling results are presented in the next section along with discussion. The succeeding sections provide results of a real-time implementation of the model with a view to providing operational on-line forecasts in the future followed by results of model performance in Hurricanes. Concluding remarks are given at the end. Table 1 and Figure 2a and 2b. It can be observed from Figure 2a that station 1 and 2 are inside the Gulf of Mexico region which experiences very severe hurricane events every year from June to November. Therefore the effect of hurricane winds will be of greater extent on water levels. On the other hand station 3 and 4 in Gulf in Maine facing an open sea will experience extreme cold weather conditions along with wind forcing due to tropical storms. The difference between maximum and minimum tidal levels at these locations also indicates that there is a large variation in water levels.\nThe water level anomaly at each location for every hour was first calculated by subtracting the harmonically predicted tides from the observed water levels. It has been experienced that the effect of a natural phenomenon like a hurricane is generally felt for about a week's time including its approach, actual land fall and passage over the coastal area. Considering this data from previous seven days were used to make predictions for the eighth day. It was assumed that the influence of data from the remote past had less of an influence on the predictions. To be specific, the input layer had 28 neurons representing 7 days of water level anomalies (at 12 and 24 h on day-7; at 8, 16, and 24 h on days-6 and-5; at 6, 12, 18, and 24 h on days -4 and -3; at 4, 8, 12, 16, 20 , and 24 h on days -2 and -1). The output layer had 4 neurons pertaining to water level anomaly predicted on the eighth day at t = 6, 12, 18, and 24 h. Sets of 32 data pieces (28 input water level anomalies and 4 output water level anomalies) can in fact be created in this fashion at increments of 1 h. This creates over 8000 data sets per year. For the first station examined in this research (Pleasure Pier), the network was trained with all these sets. As the length of the data available for training was considerably greater for the other stations also, the possibility of constructing the required input and output datasets on a daily basis rather than an hourly basis with the first forecast at 0500 local time (LT) on day zero was also examined. Thus, 358 sets were prepared for 1 yr of data. For Pleasure Pier station, the results obtained by both methods were similar in terms of accuracy of predictions. For convenience, therefore, in training the network, datasets prepared on a daily basis were used. For testing, pairs of input and output sets were constructed on an hourly basis. This input selection was suggested by Londhe and Panchang (2006) in their work on wave predictions."}, {"section_title": "NEURAL NETWORK MODELING", "text": "A neural network is a massively parallel distributed processor that has a natural propensity for storing experiential knowledge and making it available for use (Haykin, 1994) . It resembles the brain in two respects: Knowledge is acquired by the network through a learning process and Interneuron connection strengths known as synaptic weights are used to store the knowledge. An artificial neural network imitates the biological neural network prevalent in human brains in a given cognition process. It represents interconnection of computational elements called neurons or nodes, each of which basically carries out the task of combining inputs, determining the strength of such a combination by comparing the combination with a bias (or alternatively passing it through a non-linear function) and executing the result in proportion to such a strength. The network is first trained with examples, the strengths of interconnections (or weights) are accordingly fixed and then it is readied for application to unseen inputs. For training the network various algorithms are available which essentially reduce the error between the network output and target by distributing the performance error between the weights and biases associated with each neuron. Once trained the weights and biases are retained for testing the unseen inputs. The readers are referred to Jain and Deo (2006) for a review of application of Artificial of Neural Networks in Ocean Engineering. Details of Neural Networks can be found in published articles like The ASCE Task Committee (2000a), Dawson and Wilby (2001) and books like Wasserman (1993) , Bose and Liang (1998) .\nAs discussed in previous section the network had 28 neurons in the input or first layer and 4 neurons in the third or output layer. The number of neurons in the hidden layers was decided upon by trial and error. These simple feed forward types of networks were then trained using the Levernberg-Marquardt algorithm with 'log-sigmoid' transfer functions in between first (input) and second layer (hidden) and 'linear' transfer function between the second and third layer (output). The data were normalized between 0 and 1. The performance function was the mean square error 'mse'. For training, all the data packets were used except the data for last year (January to June 2005). All the networks were trained till a very low value of 'mse' was achieved in training and the trained weights and biases were retained for testing. The unused data were then used to test the network performance where in every data packet yields, by way of output, 4 values of water level anomaly for the eighth day. This predicted water level anomaly is then added to the astronomical tidal level to predict water level at that station. Table 2 shows details of network architecture (Input neurons: Hidden neurons: Output neurons) for all the stations along with the number of data sets used for training and testing."}, {"section_title": "124", "text": "Forecasting Water Levels Using Artificial Neural Networks\nInternational Journal of Ocean and Climate Systems "}, {"section_title": "RESULTS AND DISCUSSION", "text": "All the networks were tested for unseen data and the resulting water level anomalies were compared with observed water levels anomalies. The comparison was done qualitatively by drawing water level anomaly plots and scatter plots of the observed and predicted water level anomalies and quantitatively by calculating the correlation coefficient (r) between the predicted and the observed water level anomalies. It was observed that all the models predicted water level anomaly reasonably well except Boston and Portland. At both the locations the correlation coefficients between the network predicted and observed water level anomaly were on a lower side compared to other four locations for all the forecasting lead times. Table 3 shows consolidated results of all the models for water level anomaly predictions. For all the models the prediction accuracy was reduced as the lead time of forecast was increased. For Boston and Portland it was reduced considerably from 6hr forecast to 24 hr forecast (from r > 0.7 to r < 0.4). This may be attributed to the fact that all forecasts (6, 12, 18 and 24 hr) were done using same set of inputs. Perhaps input patterns suggested by Jain and Deo (2007) in their work on wave forecasting may improve the accuracy for larger intervals of forecasts. It may be noted that all the locations show a large variations in their minimum and maximum water levels which may be contributing to this performance the networks. Similarly the water level anomaly results due to meteorological factors which are a-periodic in nature and extremely random. Figure 3 shows water level anomaly plot at Pleasure Pier for 6 hour forecast. Figure 4 shows scatter plot between the predicted water level anomaly and observed water level anomaly at Dauphin for 6 hr forecast.\nFigures 5 and 6 show water level anomaly plots at Boston and Valdez for 12 hr and 18 hr forecasts respectively. These predicted anomalies are then added to the harmonically predicted tides to get water levels. It was observed that results of all the models were highly in agreement with the observed values as shown by scatter plots, water level plots and accompanying high values of correlation coefficients. These results are presented in the next paragraph."}, {"section_title": "Shreenivas N. Londhe 125", "text": "Volume 2 · Number 2 · 2011 The results for Boston show same level of accuracy for all the four lead times. The correlation coefficient of 0.99 between the observed and predicted water levels for lead times of 6, 12, 18 and 24 hour forecasts indicate the ANN model has captured the underlying phenomenon admirably well. Figure 10 shows water level plot for 24 hour forecast. Only 200 values are plotted for the sake of clarity. For Portland ME station similar level of accuracy has been achieved for all the four forecasts. Figure 11 shows water level plot for 18 hour forecast. For Valdez and Cordova in Gulf of Alaska the results are highly satisfactory with a correlation coefficient of 0.99 for all lead times between the observed and the predicted water levels. Figure 12 shows water level plot for Valdez for 12hr prediction and shows scatter plot between the observed and predicted water levels at Cordova for 18 hour prediction. It may be noted that due to very high accuracy of predictions (correlation coefficient = 0.99) the observed and predicted water levels are difficult to distinguish separately. Table 4 shows consolidated results of all the models with values of correlation coefficient (r) between the observed and predicted water levels are mentioned. By observing table 3 and 4 in can be seen that results of Dauphin are inferior compared to all and especially from that of Boston and Cordova which shown equally poor results for prediction of water level anomaly. It may be noted that the Dauphin model is trained with less data packets (913) compared to Boston and Cordova data packets (1780 and 1815 respectively). However the interesting fact is that though prediction accuracy for anomaly is less the accuracy of prediction for water levels is very high and consistent. For Pleasure Pier the correlation coefficient of harmonic tides and observed water level is 0.72, 0.71, 0.71 and 0.71 respectively for 6hr, 12hr, 18hr and 24hr observations where as when water level is predicted by adding harmonic tides to the predicted water anomaly the correlation coefficients are 0.95, 0.91, 0.87 and 0.85 which clearly indicate that the method of predicting water level anomaly and adding it to harmonic tides is paying its dividend. For other locations also similar pattern was noted."}, {"section_title": "REAL TIME APPLICATION", "text": "Real time prediction was performed at 3 stations namely Dauphin Island AL, Boston MA and Cordova AK using the weights and biases obtained by training their respective models. The models were run continuously for 8 months starting from 1 st January 2008 to 31 st August 2008. Figures 14 shows scatter plot between the network derived water levels and observed water levels respectively at Dauphin Island (6 hr ahead). Figures 15 and 16 shows these forecasts at Boston and Cordova respectively (18 and 24hrs ahead respectively) along with water level measurements which were retrieved after the forecasts were made for all the three locations. The results show that the all the forecasts are highly reliable for most applications. They also display the same trends noted earlier, i.e. the 6 and 12 hour forecasts are more accurate than 18 and 24 hour forecasts (these latter forecasts are not shown) for Dauphin and where as for Boston and Cordova all forecasts displayed same level of accuracy in terms of correlation coefficient (not shown). Repeated implementation of these models required for operational forecasting was rendered possible by the extremely small simulation time. Once trained, the ANN models required less than 1 second to provide a forecast. It may be noted that models were calibrated using data from the years 2000 to 2004 and tested for the data of the year 2005. In real time mode the models are run in the year 2008 (3 years later) and the quality of the results is of the same order of magnitude even after a gap of 3 years. Figure 19 shows model performance for 6 hour prediction during hurricanes Ivan, Katrina and Gustav. Figure 20 shows a plot of harmonic tides, observed water levels and predicted water levels during this hurricane period at Dauphin Island. The figure shows that the predicted water levels are closer to observed water levels rather than the harmonic tides. The vary purpose of developing the water level model using water level anomaly thus seems to fulfill. "}, {"section_title": "APPLICATION IN HURRICANES", "text": ""}]