[{"section_title": "Top Five Reasons for Nonresponse (Refusal & Inaccessible)", "text": ""}, {"section_title": "Reasons for Refusal", "text": "Reasons for Inaccessible 1. Would not take time/too busy. 1. Tried several times; could not reach anyone for an appointment."}, {"section_title": "2.", "text": "Information too personal/intrusive, confidentiality concerns.\nThe operator is away on vacation or business.\nUpdate NASS's Survey Processing System, Interactive Data Analysis System, or Blaise Systems to provide each state with a print-out of their state's reasons for nonresponse. This output would be an extension to the enumerator rating and work completion summary. Impact: Provide field offices the opportunity to track their response rates and provide insight into problems occurring during enumeration.\nUpdate NASS's Survey Processing System, Interactive Data Analysis System, or Blaise Systems to provide each state with a print-out of their state's reasons for nonresponse. This output would be an extension to the enumerator rating and work completion summary. Impact: Provide field offices the opportunity to track their response rates and provide insight into problems occurring during enumeration."}, {"section_title": "3.", "text": "Respondent refuses on all surveys, and refused on this one.\nNo operation or respondent, as listed on the label, could be found. No structure exists.\nRe-emphasize the importance of collecting nonresponse data to field enumerators during the Agricultural Resource Management Survey workshops. The statistician who manages the survey should do this. Impact: Improve the recording of reasons for nonresponse.\nRe-emphasize the importance of collecting nonresponse data to field enumerators during the Agricultural Resource Management Survey workshops. The statistician who manages the survey should do this. Impact: Improve the recording of reasons for nonresponse."}, {"section_title": "4.", "text": "Will do other surveys, but not financial surveys.\nAccess to the address on the label was denied by a gate/guard/etc.\nFollow up with the operators of agricultural operations providing reasons for refusing to participate in the ARMS III such as: \"Respondent feels that surveys and reports hurt the farmer more than help. No benefit to farmers.\" and \"Mentions a specific grievance with the Federal/State Government, state cooperator, FO, or NASS.\" Recommend Field Office Directors directly contact (personal visit, telephone and/or mail) these operators to discuss the operator's feelings on these matters and to explain the importance of NASS's estimates and publications. Impact: Gain future support for NASS surveys from previous refusals.\nFollow up with the operators of agricultural operations providing reasons for refusing to participate in the ARMS III such as: \"Respondent feels that surveys and reports hurt the farmer more than help. No benefit to farmers.\" and \"Mentions a specific grievance with the Federal/State Government, state cooperator, FO, or NASS.\" Recommend Field Office Directors directly contact (personal visit, telephone and/or mail) these operators to discuss the operator's feelings on these matters and to explain the importance of NASS's estimates and publications. Impact: Gain future support for NASS surveys from previous refusals."}, {"section_title": "5.", "text": "Would not keep appointments or postponed the interview beyond the end of the survey period.\nThe address on the label is seasonal housing or operation is vacant.\nSurvey statisticians address field enumerators pertaining to situations recorded as violent/threatening refusals. Also, comments describing these situations need to be documented in the comments section of NASS's List Frame, for future data collection planning. Impact: Make field enumerators aware of any possible dangerous situations. Protect the field enumerator from harm.\nSurvey statisticians address field enumerators pertaining to situations recorded as violent/threatening refusals. Also, comments describing these situations need to be documented in the comments section of NASS's List Frame, for future data collection planning. Impact: Make field enumerators aware of any possible dangerous situations. Protect the field enumerator from harm."}, {"section_title": "RECOMMENDATIONS", "text": "\n"}, {"section_title": "1.", "text": "Continue tracking the reasons for nonresponse every year, until the response rate reaches 80 percent. Impact: Nonresponse data will enable NASS to statistically determine if particular nonresponse reasons are state specific, regional and/or national. Also, this has the potential to determine those aspects of the data collection process (questionnaire design, survey promotion, data collection) requiring improvement.\nContinue tracking the reasons for nonresponse every year, until the response rate reaches 80 percent. Impact: Nonresponse data will enable NASS to statistically determine if particular nonresponse reasons are state specific, regional and/or national. Also, this has the potential to determine those aspects of the data collection process (questionnaire design, survey promotion, data collection) requiring improvement."}, {"section_title": "6.", "text": "Update and implement the Fire-Up Response training (NASS program for increasing response rates) for states with response rates below 80 percent. Also, measure if the training has any effect on response rates.\nUpdate and implement the Fire-Up Response training (NASS program for increasing response rates) for states with response rates below 80 percent. Also, measure if the training has any effect on response rates."}, {"section_title": "7.", "text": "Combine the reasons for nonresponse research with the research being done to develop predictive non-response models which attempts to predict operations likely to refuse to complete surveys and which contribute the most to nonresponse bias. Field Offices should review reasons for nonresponse for any records flagged in ARMS as influential likely nonrespondents. Impact: Assist the field offices and field enumerators in determining the most efficient approach to gain cooperation from these particular operations. INTRODUCTION The National Agricultural Statistics Service's (NASS) primary purpose is to provide timely, accurate, and useful statistics on United States and Puerto Rico agriculture. NASS has forty six field offices which conduct hundreds of surveys annually for the purpose of making estimates on crops and livestock, exploring production practices, and identifying economic trends. The Agricultural Resource Management Survey (ARMS) is a multi-purpose national survey conducted each year for varying commodities. ARMS provides information about agriculture's economic status and its impact on the quality of the environment. Overall, ARMS is the primary source of economic data providing a true picture of the financial well being of all U.S. farms. The United States Department of Agriculture (USDA) uses ARMS data to evaluate the financial performance of farms and ranches, and other critical issues related to agriculture and the rural economy, which influence agricultural policy decisions. ARMS data also are used by farm organizations, commodity groups, agribusiness, Congress, and state departments of agriculture. Improving response rates to meet or exceed 80 percent has been a constant challenge. To improve response rates, NASS is conducting research to further its understanding of the reasons for survey nonresponse. This will provide the agency with the necessary knowledge for assessing and improving the data collection process.\nCombine the reasons for nonresponse research with the research being done to develop predictive non-response models which attempts to predict operations likely to refuse to complete surveys and which contribute the most to nonresponse bias. Field Offices should review reasons for nonresponse for any records flagged in ARMS as influential likely nonrespondents. Impact: Assist the field offices and field enumerators in determining the most efficient approach to gain cooperation from these particular operations. Respondent refuses on all surveys, and refused on this one."}, {"section_title": "ARMS Program", "text": "The ARMS is composed of three phases. Phase I, conducted May through July, is the screening phase which determines whether the operation is in business, its type of operating arrangement, and whether the operation has those commodities targeted for the survey. For the 2009 ARMS Program, wheat, organic wheat, and hogs were the targeted commodities. Phase II, conducted October through December, focuses on chemical use and production practices on the targeted commodities. Phase III, the most complex and detailed sample survey data collections, conducted February through April of the following year, pertains to the financial condition of the farm, including income, expenses, assets, and debt. Operator characteristics are also collected. Phase III is the only phase of the ARMS with response rates lower than 80 percent. Thus, Phase III of the 2009 ARMS is the focus of the research project and this report."}, {"section_title": "Problem: Response Rates Remain at the 65 Percent Range for the ARMS III", "text": "For the last five years (2004 to 2008), ARMS III response rates have remained around the mid to upper 60's percent. The use of monetary and non-monetary incentives has resulted in only a marginal increase in response rates. There are three types of survey nonresponse: 1) refusals, 2) inaccessibles, and 3) incompletes. Refusals are operators who were not willing to respond or participate in the survey. Inaccessibles occur when field enumerators are unable to contact or reach the operators for data collection. A questionnaire is considered incomplete if a substantial number of questions are left unanswered. Overall, survey nonresponse negatively impacts data estimates, increases survey cost and data collection time, and significantly complicates the data editing and summarization processes. Nonresponse also increases the potential to bias the estimates. One of the ways that NASS reduces nonresponse bias is by using calibration (Earp, McCarthy, Schauer, Kott, 2008). However, calibration is another complicated layer of the survey analysis process requiring staffing resources. Therefore, reducing nonresponse is vital in using the collected data to determine accurate agricultural estimates."}, {"section_title": "METHODS", "text": "The 2009 ARMS III sample was comprised of agricultural operations, across 48 states. Alaska and Hawaii were excluded from the 2009 ARMS III. Mail and self-administered web were the primary data collection methods used. Personal field enumeration was utilized as a follow-up contact for those operations failing to complete the mailed or web form."}, {"section_title": "Enumerator Training", "text": "Field enumerators were instructed on the collection procedures for the ARMS III at their respective field offices' annual workshop conducted in January. For this study, the field enumerators were provided the following instructions: 1.) In the event of a refusal, the field enumerator was to ask and record the operator's primary reason for not participating in the survey. 2.) For inaccessibles, the field enumerator was to document why the operator could not be contacted. 3.) For incompletes, the field enumerator would record why the operator did not answer specific questions. In all three cases, field enumerators were instructed to review a supplemental handout listing various nonresponse reasons, each of which had a corresponding code number. The field enumerator would record this code in the Office Use Box of the questionnaire. See Appendix A for a copy of the supplemental handout. The additional nonresponse training administered for this study lasted approximately 15 minutes per field office."}, {"section_title": "Project Costs", "text": "This study involved no additional field enumerator training costs since the additional training was absorbed into the field offices' ARMS III workshops. Also, no additional burden fell on the field enumerators since recording the reasons for the nonresponse is encouraged for all NASS surveys."}, {"section_title": "RESULTS", "text": "The compiled findings in this report reflect the results after the primary and post survey data collections and edits, unless otherwise noted. Tables 1 and 2 show the response rates at the state and U.S. level. Hawaii and Alaska are excluded since they do not participate in ARMS III. The tables were provided by the \"2009 Agricultural Resource Management Survey (ARMS) Phase III -Survey Administration Analysis (Preliminary Yellow Book)\"."}, {"section_title": "Overall Response Rates", "text": "West Virginia's response rate of 87.1 percent was the highest response rate and also the only state that exceeded OMB's 80 percent response rate requirement. Colorado had the lowest response rate at 39.1 percent.  Michigan  567  300  11  1  216  26  9   Minnesota  1,695  1,143  53  3  373  78  27   Mississippi  228  176  19  0  26  7  0   Missouri  1,638  1,025  70  0  375  140  21   Montana  543  386  3  0  119  29  4   Nebraska  1,782  983  83  1  629  65  14   Nevada  88  45  5  1  26  11  0   New Hampshire  42  30  5  0  5  1  1   New Jersey  85  56  2  1  22  3  1   New Mexico  162  100  13  1  36  11  0   New York  300  166  22  0  77  22  13   North Carolina  1,605  1,262  68  0  189  47  29   North Dakota  556  331  13  0  152  58  0   Ohio  588  363  8  1  196  20  0   Oklahoma  638  410  26  8  112  12  70   Oregon  404  270  15  2  103  8  6   Pennsylvania  410  247  16  9  110  14  13   Rhode Island  46  21  2  0  22  1  0   South Carolina  205  154  9  1  35  2  1   South Dakota  619  264  15  0  289  40  11   Tennessee  274  174  31  0  45  8  12   Texas  1, "}, {"section_title": "REASONS FOR REFUSALS", "text": "A refusal occurs when an operator declines to participate in the survey. In this case, the field enumerator records the reason for the refusal, determines which nonresponse reason best matches the situation from the supplemental handout, and finally codes the questionnaire appropriately. Table displays the reasons for refusing to participate in ARMS III. \"Refused but no reason given\" was recorded 1,622 times (20 percent of the total refusals). There was one report for which the code was not recognizable and no written reason to determine a correct code and was left out of the analysis. Excluding those questionnaires recorded as \"Known refusal, no contact attempted\" and \"Refused but no reason given.\" The top three reasons for refusal were: 1.) \"Would not take time/too busy.\""}, {"section_title": "2.)", "text": "\"Information too personal/intrusive, confidentiality concerns.\""}, {"section_title": "3.)", "text": "\"Respondent refuses on all surveys and refused on this one.\" Four percent (323 reports) of the total refusals were recorded as \"Respondent feels that surveys and reports hurt the farmer more than help. No benefit to farmers\". There were also an additional 240 reports which \"Mentions a specific grievance with the Federal/State Government, state cooperator, FO, or NASS.\" The authors propose that State Directors address the operators of these agricultural operations through personal contact, telephone and/or mail to better understand the operator's feelings on these matters, provide guidance on obtaining a peaceful resolution, and to explain the importance of NASS's estimates and publications. Appendices B and C contain individual state specific nonresponse tables. Respondent refuses on all surveys, and refused on this one. 4.5 Will do other surveys, but not financial surveys. 4.3 Would not keep appointments or postponed the interview beyond the end of the survey period. 3.9 Respondent only does compulsory surveys. 3.9 Respondent feels that surveys and reports hurt the farmer more than help. No benefit to farmers. 3.9 Illness/death in the family prevents the operator from responding. 3.9 Feels survey items are too complex/difficult -too much recollection is involved. Records are inadequate. 3.5 \"My farm is too small to count/not a farm.\" 3.5 Contacted too often and refused on this one. 3.3 Mentions a specific grievance with the Federal/State Government, state cooperator, FO, or NASS. 2.9 Quitting farming, or out of business now, or will not answer for previous year. 1.8 Farm records are not available until after the survey period closes. (Includes technical problems in retrieving electronically stored data.) 1 1/ One report was missing and was excluded from the analyses. 2/ Total Percent may be less than or greater than 100% due to rounding."}, {"section_title": "REASONS FOR INACCESSIBLES", "text": "A questionnaire is recorded as inaccessible if the field enumerator was unable to contact the operator. For inaccessibles, the field enumerators were instructed to code the reasons for the nonresponse on the questionnaires. Table 4 shows the reasons for questionnaires being coded inaccessible. There were 256 reports that cited \"Inaccessible but no reason given.\" This reason may be valid for refusals but not for inaccessibles. For these instances, the field enumerators failed to record the reason why they could not contact the operator. The authors suggest that the statisticians overseeing the survey re-emphasize the importance of collecting and recording the reasons for questionnaires being recorded as inaccessible. Excluding \"Inaccessible, but no reason given,\" the number one reason for questionnaires being coded as inaccessible was, \"Tried several times; could not reach anyone for an appointment.\" There were 6 instances (0.4 percent of all inaccessibles) coded as inaccessible because the field enumerator's heavy workload prevented contacting these operators. Authors suggest improving communication between field office staff and supervisory field enumerators to ensure work is distributed and completed in a timely manner. "}, {"section_title": "INCOMPLETES", "text": "A report is coded as incomplete if the respondent provided partial information, but would not or could not provide enough information to make the questionnaire complete. Table 6 shows that incompletes are rare. California, however, lead the way with 78 incompletes which accounted for 10 percent of the state's nonresponse. "}, {"section_title": "COMPARISON OF PAST STUDIES", "text": "The next step was to compare results with past reasons for nonresponse studies. In 1990 and 1991, NASS examined reasons for nonresponse occurring in the predecessor to ARMS III which was called Farm Costs and Returns Survey, (O'Connor & 1992. In 1996, Farm Costs and Returns Survey (FCRS) was renamed Agricultural Resource Management Survey Phase III. A comparison of reasons for refusals and inaccessibles across studies was conducted. Reasons for nonresponse categories used in 2009 were collapsed to mirror those used in 1990 and 1991 for the comparison. Table 6 displays the 2009 ARMS III's top five refusal reasons in rank order and the corresponding rank from the past FCRS studies. Comparing reasons for nonresponse reported in the 2009 ARMS III versus those from the 1990 and 1991 FCRS studies show similar ranking for the top three reasons. However, it appears that respondents are becoming less cooperative to complete financial questionnaires In 2008 and in 2009, NASS also examined reasons for nonresponse occurring on the June Area Survey, (Gerling, Tran, O'Connor, 2010) and (Gerling, Tran, Mitchell, O'Connor, 2011). The June Area Survey focuses on collecting agricultural information for certain areas of land across the United States. Although the ARMS III and JAS surveys differ in several ways (questionnaire, focus, and sampling scheme), a comparison of reasons for refusals and inaccessibles across all reasons for nonresponse studies was conducted. Table 6 displays the 2009 ARMS III's top five refusal reasons in rank order, as compared to those of the 2008 and 2009 June Area Survey studies. Overall, there is similar ranking of the top three refusal reasons across studies. The reason \"Will do other surveys, but not financial surveys\" is ranked low on the June Area Survey since the survey's focus is not on the financial aspect of the agricultural operation. Would not keep appointments or postponed the interview beyond the end of the survey period. Table 7 compares the 2009 ARMS III study's top five reasons for recording a questionnaire as an  inaccessible with those from past NASS nonresponse studies. The data show that the rankings of reasons for being inaccessible are consistent with those from previous studies.  3  3  3  3  2 No operation or respondent, as listed on the label, could be found. No structure exists."}, {"section_title": "5 4", "text": "Access to the address on the label was denied by a gate/guard/etc. The address on the label is seasonal housing or operation is vacant."}, {"section_title": "FIRE UP RESPONSE", "text": "Fire Up Response is a training course developed by NASS for instructing field enumerators on how to handle potential nonresponse situations. A substantial part of the training involves role playing the various nonresponse situations and demonstrating the best techniques to obtain cooperation. Therefore, the authors recommend updating, formalizing, and implementing the Fire Up Response training in those states with low response rates and measure whether the training has any effect on response rates. This updated version would include the most popular reasons for nonresponse and the techniques used by field enumerators to gain cooperation by the agricultural operator."}, {"section_title": "PROVIDING REASONS FOR NONREPSONE TO FIELD OFFCIES AND INTERVIEWERS", "text": "The reasons for nonresponse data tables could be provided to the field offices before data collection begins. NASS's Survey Processing System, Blaise System or the Interactive Data Analysis System could produce output for each state to view their own reasons for nonresponse counts with information being stored in ELMO for each operation so that the field enumerators would be aware of potential difficult interviews."}, {"section_title": "CONCLUSION", "text": "Implementation of the recommendations will not resolve the nonresponse issue; however, it is a step in the right direction. The recommendations proposed are also not limited to the ARMS III but can also be implemented on NASS's 400 other surveys where practical. In the future, the Research and Development Division will continue to work with field offices and NASS's Program Administration Branch in studying nonresponse to effectively increase future response rates."}, {"section_title": "Appendix A Reasons for Refusals", "text": "Refused, but no reason given. Would not take the time/too busy. Information too personal/intrusive, confidentiality concerns. Respondent feels that surveys and reports hurt farmers more than help. No benefit to farmers. Contacted too often and refused on this one. Illness/death in the family prevents the operator from responding. Would not keep appointments, or postponed the interview beyond the end of the survey period. Spouse/secretary/etc. will not let the enumerator see the operator. Wants to be paid for interview time and effort. Violent/threatening/hostile refusals. Does not want to report due to legal/financial problems. Quitting farming, or out of business now, or will not answer for the previous year. Figures for the previous year were not typical. Will do other surveys, but not financial surveys. Questionnaire was not sent to the field to avoid jeopardizing cooperation on other surveys. The operator called the office after receiving the pre-survey letter, and asked not to be contacted further. Not aware of NASS. Currently has or recently had disease problem with herd/crops."}, {"section_title": "Appendix B Reasons for Inaccessibles", "text": ""}, {"section_title": "Code", "text": ""}, {"section_title": "Reasons for Inaccessibles", "text": "No operation or respondent, as listed on the label, could be found. No structure exists. No structure exists. The operator is away on vacation or business. The address on the label is seasonal housing or operation is vacant. Access to the address on the label was denied by a gate/guard/etc. Enumerator workload prevented this operation from being contacted during the survey period. Non-English speaking respondent; interpreter not available. Inaccessible, but no reason given. Tried several times; could not reach anyone for an appointment. INCOMPLETE --Respondent provided partial information, but would not or could not provide enough information to make the questionnaire complete.            Does not want to report to legal/financial problems."}, {"section_title": "Appendix C Reasons for Refusing by State", "text": ""}, {"section_title": "<0.5", "text": "Questionnaire was not sent to the field to avoid jeopardizing cooperation on other surveys.\nQuit farming or out of business now, or will not answer for previous year.\nNot aware of NASS.\nKnown refusal, no contact attempted.\nThe operator called the office after receiving pre-survey letter, and asked not to be contacted further. --Wants to be paid for interview time and effort.         Would not keep appointments or postponed the interview beyond the end of the survey period. 11 5 Contacted too often and refused on this one. 10 5 Respondent feels that surveys and reports hurt the farmer more than help. No benefit to farmers. 10 5 Will do other surveys, but not financial surveys. 10 5 \"My farm is too small to count/ not a farm.\" 9 4 Quit farming or out of business now, or will not answer for previous year. 9 4 Feels the survey items are too complex -too much recollection is involved.            Respondent only does compulsory surveys. 9 Quit farming or out of business now, or will not answer for previous year. 9 \"My farm is too small to count/ not a farm.\" 8 Illness/death in the family prevents the operator from responding. 7 Contacted too often and refused on this one. 6 Respondent feels that surveys and reports hurt the farmer more than help. No benefit to farmers.      Would not keep appointments or postponed the interview beyond the end of the survey period. 6 Information too personal/intrusive, confidentiality concerns. 4 Respondent only does compulsory surveys. 3 Illness/death in the family prevents the operator from responding. 2 Respondent feels that surveys and reports hurt the farmer more than help. No benefit to farmers. 1 Does not want to report to legal/financial problems. 1 Quit farming or out of business now, or will not answer for previous year. 1 Respondent refuses on all surveys, and refused on this one. 1 Spouse/Secretary etc. would not let the enumerator see the operator. --Questionnaire was not sent to the field to avoid jeopardizing cooperation on other surveys."}, {"section_title": "--", "text": "The operator called the office after receiving pre-survey letter, and asked not to be contacted further.  Currently has or recently had disease problems with herd/crops.\nThe operator called the office after receiving pre-survey letter, and asked not to be contacted further. 1/ Total Percent may be less than or greater than 100 due to rounding. Information too personal/intrusive, confidentiality concerns. 3 9 Respondent only does compulsory surveys. 1 3 \"My farm is too small to count/ not a farm.\" 1 3 Contacted too often and refused on this one. 1 3 Feels the survey items are too complextoo much recollection is involved. Records are inadequate. 1 3 The operator called the office after receiving pre-survey letter, and asked not to be contacted further. --Respondent feels that surveys and reports hurt the farmer more than help. No benefit to farmers.  Contacted too often and refused on this one. 10 Respondent only does compulsory surveys. 8 Illness/death in the family prevents the operator from responding. 7 Mentions a specific grievance with the Federal/state Government, state cooperator, FO, or NASS. 6 \"My farm is too small to count/ not a farm.\" 6 Would not keep appointments or postponed the interview beyond the end of the survey period. 6 Wants to be paid for interview time and effort. 3 Quit farming or out of business now, or will not answer for previous year.  Would not take time/too busy. 18 Information too personal/intrusive, confidentiality concerns. \"My farm is too small to count/ not a farm.\" 14 Refused but no reason given. 11 Would not keep appointments or postponed the interview beyond the end of the survey period. 11 Respondent feels that surveys and reports hurt the farmer more than help. No benefit to farmers. 7 Illness/death in the family prevents the operator from responding. 5 Contacted too often and refused on this one. 5 Mentions a specific grievance with the Federal/state Government, state cooperator, FO, or NASS. 5 Will do other surveys, but not financial surveys.   \"My farm is too small to count/ not a farm.\" 1 7 Information too personal/intrusive, confidentiality concerns. 1 7 Contacted too often and refused on this one. 1 7 Known refusal, no contact attempted.\nThe operator called the office after receiving pre-survey letter, and asked not to be contacted further.    The operator called the office after receiving pre-survey letter, and asked not to be contacted further. <0.5 Quit farming or out of business now, or will not answer for previous year. <0.5 Does not want to report to legal/financial problems. <0.5 Technical problemsdata stored electronically and are currently not accessible.                                 The operator is away on vacation or business. 1 7 Access to the address on the label was denied by a gate/guard/etc. 1 7 Enumerator workload prevented this operation from being contacted during the survey period.\nThe address on the label is seasonal housing or operation is vacant.  Operator died or sent out of business in 2009/early 2010, but was in business for part of 2009. 6 10 Access to the address on the label was denied by a gate/guard/etc. 4 7 Enumerator workload prevented this operation from being contacted during the survey period. 1 2 Operator is ill or in hospital. 1 2 The address on the label is seasonal housing or operation is vacant. 1 2 Non-English speaking respondent: interpreter not available.   "}]