[{"section_title": "Introduction", "text": "In this paper, we provide the first nationally representative estimates of the representation of sexual minorities in Science, Technology, Engineering, and Mathematics (STEM). 3 By doing so, we start to address the dire need for statistics on sexual and gender minorities in STEM emphasized in the letter sent to the National Science Foundation (NSF) by 251 scientists, engineers, legal and public policy scholars, as well as 17 scientific organizations (1). Prior research has documented the presence of substantial gaps in STEM degree completion and occupational attainment in STEM fields associated with gender and race/ethnicity (2,3), but to our knowledge there have been only a handful of studies (based on non-random samples) on STEM representation for sexual minorities. Despite improvements in the legislative and institutional background for LGBTQ people, such as the legalization of same-sex marriage in numerous countries in the last twenty years, the workplace environment for LGBTQ scientists is still far from welcoming. In 25 U.S. states, it is still legal to discriminate against applicants and employees in hiring, firing, wages, and promotions based on their sexual orientation or gender identity (4). While the NSF tracks the participation rates of women, racial and ethnic minorities, and persons with disabilities in science and engineering (2), it does not routinely collect statistics on LGBTQ people. 4 Other federal agencies, such as the National Institutes of Health, have historically funded only a very small fraction of LGBTQ-related projects (5). Researchers have documented under-representation and worse workplace experiences for LGBT employees in STEM-related federal agencies (6). In addition, several studies and reports have documented the academic and social isolation, as well as the heterosexist and uncomfortable workplace climate faced by LGBTQ STEM professionals (7)(8)(9)(10)(11)(12), in addition to explicit anti-LGBTQ harassment (13,14). Similar experiences have been documented in the medical profession (15,16). Previous studies on sexual minorities in STEM are rare and have relied on small or conveniencebased samples (8,10,17,18). One prior study (19) used data from a 2015 survey of undergraduates that contained 147 self-identified gay men: it found that, conditional on reporting a STEM major aspiration upon college entry, gay men were 14 percentage points less likely than straight men to persist in STEM majors by the fourth year of college (even if they were more likely to have worked in a lab). Our study builds on this prior work in two critical ways. First, we use samples of sexual minorities that are two orders of magnitude larger than previous studies (19). Specifically, we draw on data from the 2009-2018 American Community Surveys (ACS) which identify over 142,000 individuals in same-sex cohabiting romantic relationships. A large body of research in social science and demography confirms that the vast majority of same-sex couples in the ACS are gay men and lesbians (20). The ACS also contain information on the undergraduate major(s) for individuals who obtained bachelor's degrees, as well as detailed information on current occupation. 5 Both of these sources of information allow us to identify individuals in STEM fields. The large sample sizes of the ACS provide increased confidence in the magnitude and precision of estimated gay/straight gaps and permit sub-group analyses (e.g., by race). Second, we complement the ACS with information from the 2013-2018 National Health Interview Surveys (NHIS) which also contain detailed information on occupation as well as direct individuallevel questions about sexual orientation. This allows us to examine whether sexual minority representation in STEM fields differs between lesbian and bisexual women, for example. Sample sizes in the NHIS are smaller than in the ACS, though they are still an order of magnitude larger than prior work (4,763 self-identified sexual minorities in the 2013-2018 NHIS). Using ACS data, we show that men in same-sex couples are significantly less likely than men in different-sex couples to receive a bachelor's degree in a STEM field, or to work in a STEM occupation. The gap in STEM degrees between men in same-sex and different-sex couples (12 percentage points) is larger in size than the STEM gap between white and black men (4 percentage points) but is smaller than the gender STEM gap (21 percentage points). 6 Consistent with the ACS results, we find that gay male respondents in the NHIS are less likely than heterosexual men to work in STEM fields. While we find comparable gaps between heterosexual men and bisexual men or men who identify with another sexual orientation category, these differences are not statistically significant. In both datasets, we find that all women are underrepresented: women are always less likely to study or work in a STEM field, irrespective of their sexual orientation. As with prior evidence on STEM gaps associated with gender and race, our findings on LGBQrelated STEM gaps are important because addressing these gaps could increase efficiency by improving group decision-making, company performance, and the quality and variety of scientific work (21). In addition, increasing the number of LGBQ people entering into STEM fields could help to alleviate the chronic shortage of workers in these fields (22,23)."}, {"section_title": "Data and methodology", "text": ""}, {"section_title": "The American Community Survey (ACS)", "text": "The main dataset used in our analysis is the ACS: a nationally representative and repeated crosssectional survey conducted by the U.S. Census Bureau. It contains demographic, economic, social, and housing information on 1 percent of the U.S. population (or approximately 3 million people each year). Such large sample sizes facilitate studies on relatively small subpopulations, such as individuals in same-sex couples and/or working in STEM occupations, or even heterogeneity analyses among these subgroups (e.g., by sex or race within same-sex couples). These data are publicly available through IPUMS-USA at the University of Minnesota (24). The ACS does not directly ask individuals about their sexual orientation. To identify sexual minorities, we follow a large body of prior research that uses intrahousehold relationships to identify individuals in same-sex couples (25). Specifically, the ACS identifies a primary reference person, defined as \"the person living or staying here in whose name this house or apartment is owned, being bought, or rented\". For each individual in the household, the ACS also collects information on sex and the individual's relationship to the primary reference person for all members of the household, and the range of possible relationships includes husband, wife, and unmarried partner (as a different category than roommate or other nonrelative). Thus, we identify individuals in same-sex couples in the following way: households with an adult who is the same sex as the primary reference person and whose relationship to the primary reference person is described as spouse or unmarried partner. We restrict our attention to individuals age 18 to 65 who were interviewed between 2009 and 2018. 7 Our final sample includes 73,000 women and 69,641 men in same-sex couples, as well as 10,809,885 men and women in different-sex couples."}, {"section_title": "The National Health Interview Survey (NHIS)", "text": "The main disadvantage of using ACS data is that it is not possible to identify single LGBQ individuals without a partner or same-sex couples who do not live together. Furthermore, since there is no individual-level information on sexual orientation, researchers cannot identify bisexual individuals in different-sex (or same-sex) couples. In order to address these limitations, we have analyzed data from the NHIS. The NHIS is a household, face-to-face health survey conducted by the National Center for Health Statistics of approximately 87,500 people in 35,000 households each year. The NHIS sample is designed to be representative of the U.S. civilian, noninstitutionalized population. Interviewers collect information from family reference adults on the household, socio-demographic characteristics, and health indicators for all persons in the selected households. In addition, extensive information (including employment status and occupation) is collected on one randomly selected sample adult and one sample child from each family. From 2013, sample adults were asked whether they identified as straight, gay/lesbian, bisexual, or 'something else'. These data are publicly available through IPUMS-HealthSurveys at the University of Minnesota (26). Between 2013 and 2018, our final sample with information on selfreported sexual orientation and occupation includes 67,367 heterosexual women (age 18 to 65), 59,732 heterosexual men, 1,213 lesbian\\gay women, 1,524 gay men, 1,113 bisexual women, and 426 bisexual men. The sample also includes 279 women and 208 men who identified with another sexual orientation category."}, {"section_title": "Methodology", "text": "We identify two key measures of representation in STEM fields in the ACS and NHIS: STEM degrees and STEM occupations. Information on STEM degrees is only available in the ACS; individuals were asked to identify the specific major of any bachelor's degrees each individual in the household had received. We code fields of study as being in STEM based on the individual's primary or first bachelor's degree. STEM occupations are instead observed in both our datasets. As explained in detail in the Appendix, we follow the Department of Commerce and Bureau of Labor Statistics definitions to determine which degrees and occupations are in STEM fields. There are several reasonable alternative definitions of STEM degrees and STEM occupations. For example, some scholars include economics and finance degrees and professions in STEM. For our core definitions we do not code degrees in biology, health, economics or finance as STEM degrees. We also do not include health and medical professions or economics and finance professions in the definition of STEM occupations. Results with alternative definitions can be found in Appendix Table B1. We start by presenting descriptive statistics and mean comparisons in Tables 1-2. We then report estimates from ordinary least squares models in Table 3. We estimate standard errors that are robust to heteroscedasticity, and we use the survey sample weights throughout. We account for the NHIS complex sample design by using the command svy in Stata 15 to include information on primary sampling units and strata. Details on all the variables used in the empirical analysis can be found in the Appendix."}, {"section_title": "Descriptive statistics", "text": "We begin by presenting the unconditional weighted means of our key outcome variables separately by couple type. Because of the large and well-documented gender gap in STEM, we present results separately for men and women. For women in the left columns of Table 1, the ACS data indicate that 14 percent of women in same-sex couples earned a bachelor's degree in a STEM field, while a nearly identical 13.9 percent of women in different-sex couples earned a bachelor's degree a STEM field, resulting in essentially no gap in STEM degrees between the two groups. When we examine STEM occupations, however, we observe that a larger share of women in same-sex couples are in STEM occupations compared to women in different-sex couples (5.0 versus 3.2 percent). The difference in these two means is statistically significant at the one percent level. For men in the right columns of Table 1 we find a notably different pattern from the one for women. Specifically, we find a large gap in STEM degrees: while 22.8 percent of men in same-sex couples earned a bachelor's degree in a STEM field, the associated share for men in different-sex couples was 34.8 percent, or 12 percentage points highera difference that is statistically significant at the one percent level. Interestingly, the gap in STEM degrees between men in same-sex couples and men in different-sex couples is also observed for STEM occupations. Although the size of the STEM occupation gap by couple type for men is smaller (1.1 percentage points), it is statistically significant at the one percent level. [8][9] We present the associated evidence on STEM occupations from the 2013-2018 NHIS data in Table  2. The NHIS patterns for women by self-reported sexual orientation in the left columns of Table 2 largely confirm the couples-based ACS patterns observed in Table 1. Specifically, we find that 3 percent of heterosexual women in the NHIS are in STEM occupations; the associated share for self-identified lesbian women is 3.4 percent, while 3.7 percent of self-identified bisexual women and 2.7 percent of women who describe their sexual orientation as 'something else' are observed in STEM occupations. Sample sizes in the NHIS are smaller than in the ACS, and none of these differences between the non-heterosexual groups and the heterosexual women is statistically significant. For men in the NHIS in the right columns of Table 2 we find that 8.8 percent of self-identified heterosexual men are in STEM occupations, while only 6.5 percent of self-identified gay men are in STEM occupations, a difference in means of 2.3 percentage points that is statistically significant at the one percent level. This pattern is qualitatively identical to the ACS couples-based gap in STEM occupations documented in Table 1. We also observe that self-identified bisexual men and men who describe their sexual orientation as 'something else' are less likely to be in STEM occupations than heterosexual men, though these differences in means are not statistically significant due to small sample sizes."}, {"section_title": "Multivariate analysis", "text": "In addition to documenting the size of the unadjusted gaps in STEM degrees and occupations by sexual orientation, it is also interesting to understand the extent to which these differences can be explained by differences across groups in observable characteristics. Put differently, the STEM gaps documented in Tables 1-2 are unconditional gaps; in this section, we examine whether the differences in STEM degree and STEM occupation persist once we control for age, race, ethnicity, and location. Doing so effectively asks whether sexual minorities who are otherwise similar to heterosexual individuals have different rates of STEM representation. 10 We report the coefficient on the sexual minority variables, and in each case the relevant excluded category is the dummy variable for the majority group (individuals in different-sex couples in the ACS, self-identified heterosexual individuals in the NHIS). Table 3 presents the multivariate regression results. The patterns largely confirm that the unadjusted gaps in STEM outcomes survive adjustment for the aforementioned observable characteristics. For example, column 1 shows that women in same-sex couples are 1.2 percentage points more likely to have STEM degrees compared to women in different-sex couples with the same age, race/ethnicity, and location, and this estimate is statistically significant at the one percent level. For men in same-sex couples compared to men in different-sex couples, the raw gap documented in Table 1 of 12 percentage points falls slightly to 10.8 percentage points once we adjust for demographic characteristics and location, though this estimate remains statistically significant at the one percent level. The patterns for STEM occupations in columns 3 and 4 are qualitatively similar: we continue to find that women in same-sex couples are slightly more represented in STEM occupations compared to women in different-sex couples, while the opposite is true for men in same-sex couples compared to men in different-sex couples. Table 4 perform the same regression adjustment exercise for self-identified sexual minorities in the NHIS. Here too we observe that the patterns observed in the unconditional differences in means are also observed in the regression estimates. Specifically, gay men are 1.9 percentage points less likely to be in STEM occupations than otherwise similar heterosexual men with the same age, race/ethnicity, and location, and this estimate is statistically significant at the five percent level. None of the other estimates on the sexual minority indicator variables is statistically significant for women or for men due to the large standard errors, thus highlighting the relatively small sample sizes in the NHIS."}, {"section_title": "Columns 5 and 6 of", "text": "Importantly, we note that the estimated gaps in the likelihood of STEM occupations between lesbian women and heterosexual women and between gay men and heterosexual men in the NHIS are similar to the regression-adjusted differences for the same outcome when we compare couples in columns 3 and 4 of Table 4. Lesbian women in the NHIS are estimated to be 0.6 percentage points more likely than similarly situated heterosexual women to have a STEM occupation, while the associated difference in column 3 for women in same-sex couples compared to women in different-sex couples is 1.9 percentage points. Gay men in the NHIS are estimated to be 1.9 percentage points less likely than similarly situated heterosexual men to have a STEM occupation, while the associated difference in column 4 for men in same-sex couples compared to men in different-sex couples indicates a 1.4 percentage point gap in the same direction. Moreover, both estimates comparing sexual minority men to heterosexual men across the ACS and NHIS are statistically significant, suggesting that there is a robust association between sexual orientation and STEM (under)representation for men in two independently drawn datasets. 11 "}, {"section_title": "Relationship with Gender Gap in STEM", "text": "Extensive research has documented a robust gender gap in STEM degrees and STEM occupations: men are much more likely to be represented in STEM than women (2). Indeed, the data we analyze confirm that the gender gap in STEM is pervasive, affects both heterosexual and sexual minority women, and is larger than the associated gap between sexual minority men and heterosexual men. A natural question is whether the gap in STEM fields experienced by gay men is systematically related to the gender gap in STEM. Prior research has documented occupational sorting by gay men into female-dominated occupations (27,28). Is this also the case in STEM? Figure 1 presents evidence that the mechanisms underlying the gender gap in STEM may be related to those driving the gap in STEM between gay and heterosexual men. Specifically, we plot in the left panel of Figure 1 the relationship between the gender gap in STEM degrees and the gay male/heterosexual male gap in STEM degrees: the x-axis is the share of individuals in the STEM degree field that are women, and the y-axis is the share of coupled men in the STEM degree that are in same-sex couples. Each data point is a unique STEM degree field. There is a clear positive relationship between the share female in the STEM degree and the share of coupled men that is gay in the STEM degree. Moreover, the right panel of Figure 1 shows that the same relationship is observed for STEM occupations. Appendix Figure B1 shows that these positive relationships are unique to men in same-sex couples: there is no relationship (or a weakly negative one) observed when we change the y-axis to the share of coupled women in the STEM degree or STEM occupation that are women in same-sex couples. Taken together, these patterns are highly suggestive that the mechanisms underlying the very large gender gap in STEM fields are related to the factors driving the associated gap in STEM fields between gay men and heterosexual men. The patterns also suggest that policies to improve representation of women in STEM fields may have the associated benefit of increasing representation of gay men in STEM fields, and vice versa."}, {"section_title": "Conclusions", "text": "In this paper, we have provided the most comprehensive evidence on the representation of LGBQ individuals in STEM fields in the United States using large nationally representative datasets. We document the existence of a large gap in STEM degrees between men in same-sex couples and men in different-sex couples in the nationally representative American Community Surveysa gap that is larger than the black/white STEM gap but smaller than the gender STEM gap. Moreover, we show that this gap in STEM degrees between men in same-sex couples and men in different-sex couples is observed for STEM occupations and is highly robust to controls for observable characteristics. It also replicates in independently drawn data from the National Health Interview Survey with individual level information on sexual orientation. Finally, we document that the gap in STEM degrees and occupations for men in same-sex couples is systematically related to the gender gap in STEM degrees and occupations. We hope that this work will emphasize the importance of focusing on sexual orientation in addition to sex, race, ethnicity and disability when discussing the status of minorities in STEM fields. And while we cannot directly comment on STEM representation differences associated with transgender status due to data limitations, our work highlights the need for more large nationally representative data on both sexual minorities and gender minorities in STEM, in particular bisexual, queer and transgender individuals, to better understand their representation in undergraduate and graduate programs, in academia, and in the private sector, as well as the specific barriers and challenges faced by these groups. An important step -currently under discussion at the NSF (29) -would be to regularly include sexual orientation and gender identity measures in NSF surveys such as the Survey of Doctorate Recipients and the National Survey of College Graduates (1). Finally, there are several areas and best practices that have been identified to foster representation of LGBTQ members in STEM fields. Researchers have already emphasized the importance of role models, representation, community, and equal treatment from employers (11,30). Campaigns such as 500 Queer Scientists (31) and associations such as the National Organization of Gay and Lesbian Scientists and Technical Professionals are actively increasing visibility and supporting LGBTQ STEM workers. Federal agencies and universities could include LGBTQ representation into their diversity objectives (21). Furthermore, promoting gender parity could contribute to creating a welcoming and tolerant workplace climate also for sexual and gender minorities (17). More generally, fostering the use of gender-neutral pronouns could lead to more positive attitudes towards women and LGBTQ individuals (32).     In the labor force is an indicator equal to one if an individual was a part of the labor force, either working or seeking work, in the week preceding the interview; zero otherwise. Unemployed is an indicator equal to one if an individual did not have a job, was looking for a job, and had not yet found one at the time of the interview, rather than being employed. Individuals not in the labor force have been coded as missing. Individuals who had never worked but were actively seeking their first job are considered unemployed. STEM occupation is an indicator equal to one if an individual's primary occupation was in a STEM field; zero otherwise. This indicator has been set to missing if an individual was unemployed, with no work experience in the 5 years preceding the interview or earlier, or if they had never worked. Because of data limitations (no detailed codes for teachers), STEM postsecondary educators cannot be coded as STEM workers. In line with the classification used by the U.S. Department of Commerce 14 and the U.S. Bureau of Labor Statistics, 15   Fertility is an indicator equal to one if an individual had one or more own children (of any age or marital status) living in the household at the time of the interview, zero otherwise. This indicator includes step-children and adopted children as well as biological children."}, {"section_title": "A.2 NHIS variables", "text": "Sex reports whether an individual was male or female. The original NHIS variable is available for all individuals. Higher Education is an indicator equal to one if an individual's highest degree completed was a bachelor's degree or higher (Master's degree, Professional degree beyond a bachelor's degree, Doctoral degree); zero otherwise. This indicator has been set to missing if an individual refused to answer, did not know, or if the original NHIS variable is missing. The original NHIS variable is available for all individuals age 5 or older. In the labor force is an indicator equal to one if an individual was a part of the labor force, either working (Working for pay at job/business; Working, without pay, at job/business; With job, but not at work) or seeking work (unemployed) in the week preceding the interview; zero otherwise. This indicator has been set to missing if an individual refused to answer, did not know, or if the original NHIS variable is missing. The original NHIS variable is available for all individuals age 18 or older. Unemployed is an indicator equal to one if an individual did not have a job, was looking for a job, and had not yet found one at the time of the interview, rather than being employed. Individuals not in the labor force have been coded as missing. This indicator has been set to missing if an individual refused to answer, did not know, or if the original NHIS variable is missing. The original NHIS variable is available for all individuals age 18 or older. STEM occupation is an indicator equal to one if an individual's primary occupation was in a STEM field; zero otherwise. This indicator has been set to missing for individuals not in the universe, if an individual refused to answer, did not know, or if the original NHIS variable is missing. The original NHIS variable is available for sample adults age 18 or older who were working at a paying job in the week preceding the interview; with a job or business but not at work; working at a nonpaying job in the week preceding the interview; or who had ever worked. The following occupations have been coded as STEM: Fertility is an indicator equal to one if an individual had one or more own children (of any age or marital status) living in the household at the time of the interview, zero otherwise. This indicator includes step-children and adopted children as well as biological children. The original NHIS variable is available for all individuals. Neuroscience; Miscellaneous Biology. STEM degree without food/nutrition does not count as STEM: Food Science; Nutrition Sciences. STEM degree with secondary field indicates whether an individual received a bachelor's degree with a primary or secondary concentration in STEM. Unemployment rate is computed only among the individuals in the labor force. \"Observations\" refers to the total number of respondents in the relevant sub-group. Source: ACS 2009-2018. * p < 0.10, ** p < 0.05, *** p < 0.01   "}, {"section_title": "Appendix B: Additional figures and tables", "text": ""}]