[{"section_title": "", "text": "information on underlying causes have been eagerly developed primarily for research purposes [2] .\nIn this issue of EAPCN, several papers deal with Alzheimer's disease (AD). One of them [1] is of particular interest for the search for biomarkers for mental disorders. This excellent paper provides the opportunity to ask: What can we learn about biomarkers in mental disorders from dementia due to Alzheimer's disease?\nThe authors address changing concepts of Alzheimer's disease [7] : up to now in clinical routine. \"Major neurocognitive disorder due to possible Alzheimer's disease\" (DSM-5) is phenomenologically defined in a relatively global manner-only in psychopathological terms, very much like other mental disorders (in this context major neurocognitive disorder stands for dementia). The neuropathological characteristics of the majority of postmortem cases with this clinical diagnosis motivated a hypothetical, well-confirmed concept of the underlying causal neurobiological disease process: the accumulation of amyloid with subsequent neuronal damage. A series of in vivo biomarkers could be derived to indicate this process, particularly the CSF markers Aβ 42 (indicating the presence of amyloid in the brain) and total Tau as well as phosphor-Tau (indicating neuronal damage). It already took nearly two decades to standardize the handling and measurement procedures, which are now robust and sensitive enough to reveal appropriate intercenter compatibility. These research activities created a major breakthrough: Previously, Alzheimer's disease could only be diagnosed postmortem and not before death. Now, in vivo detection of the disease process by CSF biomarkers is possible with high degree of accuracy.\nMotivated by these achievements and by the promising developments of anti-amyloidergic substances, a broad consensus for a revision of the criteria for dementia was stimulated in order to diagnose Alzheimer's disease in vivo.\nA majority of biological psychiatrists are expressing the opinion that the detection, validation and clinical application of biomarkers for mental disorders and/or the underlying disease processes are of utmost importance for our field [5, 8] . The core argument is that biomarkers not only help to establish biologically based diagnoses, but also support the detection and development of drugs with innovative mechanisms of action, the monitoring of drug effects and of their prediction. Given the current emptiness of the therapeutic pipeline in psychiatry, as well as the limited treatment success in routine care for mental disorders, it is evident that biomarker detection holds a major promise for future progress-with the final goal to promote faster and more complete recovery in our patients.\nFrequently cited reasons for this deficiency are that standard diagnoses of mental disorders are not informative enough for the underlying causes or individual presentations [5] . The search for biomarkers for mental disorders is troublesome, as also evident from recent papers in this EAPCN (e.g., [3] ). Therefore, psychiatrists frequently mention with regret that clinical tests are well established in other areas of medicine [8] .\nHowever, there is also a model disease in psychiatry: A common diagnosis in the diagnostic manuals for mental disorders (DSM-IV, DSM-5, ICD-10) is dementia (resp. major neurocognitive disorder) probably due to Alzheimer's disease. For this diagnosis, biomarkers with"}, {"section_title": "3", "text": "The National Institute of Aging (NIA) and the American Alzheimer's Association (AAA) took the lead to create guidelines for biomarker-based diagnostic criteria for AD dementia [6] -in a first step only for research purposes. Now, as the CSF profiling for AD is ripe for clinical practice, these new diagnostics for AD dementia can be tested also in routine care for patients with dementia. Alexopoulos et al. [1] undertook this practice test; these authors report on it in issue of EAPCN. They, in addition, compare their observed relationship of CSF profiling and clinical diagnosis (found in routine care) with a distinguished multicenter research setting-the well-known ADNI cohort. They use classical statistical indicators like sensitivity (proportion of biomarker-positive cases) and specificity (1-proportion of biomarker-positive controls).\nAlexopolous et al. report, in agreement with the hypothesized pathologenic model, that the CSF profile for the Alzheimer pathology consisting of the two biomarkers Aβ 42 and Tau/P-Tau is clearly associated with the clinical diagnosis of \"dementia due to Alzheimer's disease.\" Yet, the observed sensitivity and specificity are not perfect, particularly so in the clinical routine setting. The sensitivity for the requested combination of amyloid and Tau-markers was 53 % (research setting) or 40 % (routine setting); among controls only between 20 and 30 % were purely negative, the majority of controls revealed borderline patterns and less than 10 % turned out to clearly biomarker positive for AD. The specificity gets substantially reduced when Aβ 42 is used as the only AD marker: Among controls, when only applying this amyloid-related marker, between 18 and 30 % are positive; in contrast, under this condition (Aβ 42 the only Alzheimer's disease marker) sensitivity increases to 85 % (research setting) and 70 % (clinical routine).\nThe obtained results provoke a series of unforeseen problems.\n• A substantial proportion (in clinical settings even the majority) of clinically diagnosed \"dementia due to Alzheimer's disease\" cases reveal atypical biomarker constellations pointing at a divergent etiology. Should a new diagnosis for these biomarker-negative patients with the clinical diagnosis \"dementia due to Alzheimer's disease\" be introduced as it was previously proposed with \"suspected-non-Alzheimer-pathology (SNAP)? [4] . How to deal with these biomarker-negative AD patients if anti-amyloidergic drugs turn out to be effective in slowing the clinical decline? • How to consider age-matched healthy controls without a negative AD biomarker constellation but with borderline biomarker values? Should those subjects be considered at risk and should they be treated with anti-amyloidergic drugs when becoming available for patients?\nMight these cases, after passing most of the risk period, help to detect protective mechanisms? • How to consider relatively high proportions of healthy elderly subjects with an amyloid-positive biomarker (Aβ 42 )? Are they on transition to dementia? Or are they remaining cognitively healthy despite an ongoing biological disease process? Could these cases help to uncover protective mechanisms? • Biomarkers are first established and validated in research settings. Subsequently, they enter clinical practice. Do they work equally in both settings? Alexopoulos et al. report evidence that biomarkers turn out to be less efficient in routine care.\nWhat are the implications emerging from this scenario for other mental disorders-particularly those with a strong neurobiological underpinning? It is difficult to imagine that biomarkers will help to validate clinical diagnoses (for example, schizophrenia). Instead, once biomarkers rooted in the heterogeneous pathophysiology of the mental disorder are detected, it is likely that it indicates an underlying neurobiological condition but not a psychopathologically defined diagnosis. By these means, clinical diagnoses are deconstructed! Biomarker-positive cases might delineate a majority group among patients with a specific clinical diagnosisbut how to deal with biomarker-negative cases? Given that biomarkers are continuously distributed without a natural cutoff point, realistically, a substantial proportion of borderline cases between the two extremes (healthy and clearly affected) is to be expected. Patients with those biomarker values \"in-between\" experience uncertainties about the biology of the diseases-at least as long as the prospective significance of borderline values remains unclear. Those diagnostic vaguenesses are unlikely to be of advantage to the individual patients.\nDespite these increasing diagnostic complexities, biomarker-supported diagnoses hold the promises for drug developments with new mechanisms of action close to the underlying biology. There, Alzheimer's disease presents again as a model of upcoming success.\nThus, in conclusion the merits of a biomarker-based diagnostics are primarily of advantage to research and development of treatments-but less so to the individual patient."}]