[{"section_title": "Abstract", "text": "This paper reports the result of an experiment with a pretest-posttest control group design, which aims to find out the role of generative learning model and student's basic mathematical knowledge (BMK) in the improvements of students' mathematization and the correlation between students' mathematization and mathematical disposition. The subjects of the study included 73 eight grade students of a junior high school. The instrument of this study was a set of mathematical tests adopted from the Indonesian National Examination (UN). The data were analyzed using t-test and non-parametric Mann-Whitney U test. This study finds that the generative learning model had effects on students' mathematization and basic mathematical knowledge (BMK)."}, {"section_title": "INTRODUCTION", "text": "The result of international assessments of student achievements is one of the indicators that show how the quality of Indonesian education is still low. The Survey of Trends in International Mathematics and Science Study (TIMSS) in 2003, ranked Indonesia the 34 th out of the 45 countries. The achievement was even lower for the Program for International Student Assessment (PISA), which measures the literacy ability of 15 year-old children in math and science. The assessment is held in every three years, and in 2003 it put Indonesia on the second lowest rank, or the 39 th out of the 40 countries as the sample (Ministry of Education and Culture, 2011) .\nIndonesia has participated in PISA study (Program for International Student Assessment) in mathematics for five times during 2000-2012. However, since the first time joining this program, the achievements of Indonesian students had been dissatisfactory.\nFurthermore, on the PISA mathematics in 2009, almost all of Indonesian students only reached the third level, and only 0.1% Indonesian students reached level 5 and 6 (Ministry of Education and Culture, 2013) . The declining achievements are more visible on the latest survey of PISA in 2012, in which most of Indonesian students did not reach level 2 (75%) and 42% of the students did not even reach the lowest level (level 1).\nThe achievements of Indonesian students can also be seen from their success in taking the question levels. In PISA, the leveling of questions shows students' proficiency in solving the daily problem which needs mathematics to solve. The skills are commonly called mathematical literacy by PISA, which refers to the ability of students in formulating a certain problem mathematically based on the concepts and relations that are embedded to it, and then applying a mathematical procedure to get mathematical results and interpret the results into the first formal problems.\nSeveral scientific studies exposed some reasons why Indonesian students are not qualified in mathematical literacy. Some studies show that the students are not familiar with the modeling materials, which are the ability to transform daily problems into the formal mathematical forms needed to solve them. In fact, mathematical modeling has been launched in Indonesia, either in high school or college. However, until now, mathematical modeling in the school is not positioned as a subject, but only a subtopic in mathematical subject or basic competence in the standard competency.\nSome educational researchers have begun to focus their research on mathematical modeling at various levels of the school under college level. It can be seen by some research publications groups of researchers in Australia (Galbraith, et al., 2013) , Belgium (Verschaffel, et al., 2002) , Denmark (Niss, et al., 2007) , Germany (Blum, et al., 1989) , and United States (Lesh, et al., 2003) . The questions addressed in the studies can be concluded into the following question: how is the readiness of students right now to resolve the problems they will face outside the school to meet their goals in employment, whether to become good citizens as well as to further the learning process? (Mousoulides, 2007) . In Lesh and Doer's statement (2003, p. 220) , mathematical modeling is concerned with \"how students can work with the problems which less obvious mathematical school-related and which that they are not yet familiar by thinking flexibly and creatively.\" Crouch and Haines (2004) in their study concluded that the interphase among real problems and mathematical models present students with the difficulty of translating the problems in daily life into formal mathematical forms and changing the formal mathematical forms to the forms of everyday problems. Similarly, Mass (2006) stated that the form of students' errors in forming problem into a model are to create a correlation between mathematics and reality, and to simplify and arrange reality, as well as issues related to mathematical solutions.\nThe problems that occur in the high school, especially in the location of this research, is that the students still have difficulties in solving the mathematical questions in the forms of stories related to daily life problems. This is because they encounter difficulties to connect between reality and mathematics, do not understand how to transform real world problems into mathematics, and are not able to build up a concept for the solution.\nLiterature on research on the implementation of generative learning is quite limited. In the field of physical and health education, Farouk and Elfateh (2016) recently conducted research assessing the effectiveness of generative learning on increasing students' strategic thinking skills and learning level of basics of offensive. Their study found that generative learning significantly improved strategic thinking skills and learning of fencing basics. In the field of physics, Maknun (2015) conducted a study on the implementation of generative learning model to increase vocational school students' conceptual mastery and general science skills. Similarly, his study found that the model could significantly improve students' conceptual mastery and general science skills. Meanwhile, in the field of mathematics itself, research on the implementation of generative learning is very scarce. Hence, the present study aims to find how the effects of generative learning model on students' mathematization and mathematical dispositions based on different levels of basic mathematical knowledge (BMK), namely low, medium, and high levels."}, {"section_title": "LITERATURE REVIEW Mathematization and Generative Learning", "text": "The ability to translate the daily problems into a formal mathematical form is called mathematization. The simple meaning of mathematization is a process to make a phenomenon mathematically or build a mathematical concept from a phenomenon. Mathematization is a process of changing a phenomenon into a mathematical form. Traffers (in Darhim, 2004) distinguished two kinds of mathematization, namely, horizontal and vertical mathematization. Horizontal mathematization is the activity of changing the contextual issues into mathematical problems, while the vertical mathematization formulates a problem into various mathematical resolutions by using a number of mathematical rules.\nThe horizontal mathematization is related to the process of generalization; it begins from the identification of mathematical concepts of regularities and relations that are found through visualization and schematic problems. So, in this horizontal mathematization, students try to solve problems of the real world by using their own language and symbols.\nDifferent from vertical mathematization, a process of formalizing, the result of horizontal mathematization becomes the formal development of mathematical concepts through a process of vertical mathematization.\nTherefore, both types of mathematization may not be separated; both of them occur alternately and gradually. After the students understand the process of horizontal mathematization, then the students perform the process of vertical mathematization. This process is done to achieve aspects of formal mathematics. According to de Lange (1987) , formal mathematics is equal to the vertical mathematization.\nGenerally, mathematical competence is often related to the ability of manipulating the numbers, for example to calculate quickly. It is true that one form of mathematical literacy competency is counting; however, counting is only a small part of mathematics. The calculators and computers have been widely used, and the speed of counting is a goal in mathematical skill. How fast the people can count something can be replaced by calculators and computers. The counting competence is important, but it is not enough.\nTo improve the students' mathematization, we should be able to choose the model of learning that direct students to learn more actively. There are many learning models which refer to active learning, and the most popular is a learning model with constructivist approach because students are expected to develop their own understanding so that the students can raise their own knowledge and be active in the teaching and learning process.\nConstruction means to build. In the context of philosophy of education, constructivism is an effort to build a modern life style. Constructivism is the foundation of thinking (philosophy). Meanwhile, contextual learning is slow constructed knowledge, whose results are extended through the unlimited context and a long process. Constructivism sees knowledge not as a set of facts, concepts, or rules ready to be picked and remembered. Students should construct that knowledge and give meanings through the real experiences.\nA famous theory related to constructivist learning theory is Piaget's (1950) mental development theory. This theory is also called the theory of intellectual development or the cognitive development theory. The learning theory is related to the readiness of children for learning. It is packed in the stage of intellectual development from the birth until adult. Each stage of intellectual development is equipped with specific signs in science construction. For example, in the remote motor domain, the children think through movements or action.\nFrom the description above, it can be concluded that this theory make humans more active in learning how to find their own competence, knowledge or technology, and anything else that is needed in order to develop themselves. In addition, it is understood that learning is an activity which takes place interactively between internal factors and external or environmental factors to change the students' behavior.\nOne of the learning models that resemble the Constructivist model of learning is generative learning. Generative learning model is regarded to be better than the constructivist approach by some experts. According to some experts, the generative learning model is more focused on the syntax of the lesson because this learning model is not combined with any learning approach. Essentially, a learning model that is combined with a learning approach is usually more advanced, so that the models and approaches could fit, and it allows the original syntax from the models or approaches that are not used. In line with that, Bonn and Grabowski (2001) argued that the model of generative learning resembles the constructivist approach, but more fully in providing perspectives.\nGenerative learning model is based on the view of constructivism, assuming that the knowledge base is built in the minds of students. According to Wittrock (1992) , the essence of generative learning is the brain which does not receive the information passively but constructs an interpretation of that information actively. From the opinion above, generative learning is a learning model that is done so that students can actively construct an interpretation of the information and make a conclusion.\nThe students ' ability in constructing an interpretation from an information and making a conclusion in the generative learning model allows for the students' mathematical ability to be more improved than by using conventional learning."}, {"section_title": "METHODS", "text": "This research employed the quasi-experimental method to apply generative learning model in the mathematics subject; in addition, the subjects or participants were not grouped randomly (Ruseffendi, 1998) . The use of quasi experiments was based on the consideration that the existing classes had been formed and because learning takes place naturally and students would not feel as a subject of experiment, so that such situations are expected to contribute to the level of research validity.\nThe research used the pretest-posttest control group design, involving two groups of students. The first group is called the experimental group, treated with generative learning. The second group was treated by using conventional learning, called the control group. The two groups were given different treatments in order to find the improvements of mathematization in terms of different levels of basic mathematical knowledge (BMK). The diagram of research design (quantitative and qualitative research) is described as follow:\nAccording to Nasution (1996) , the subjects of a study that become the research sample are the only sources that can provide information. The sample can be humans, events, things, or situations that are observed. The sample is selected \"purposively\" related to a particular purpose. Therefore, the subjects examined would be determined directly by the researchers or related parties (headmaster and math teacher) in relation to the problem and research objectives. However, there are also subjects determined specifically for the purpose of obtaining information needed for the sample of the study. This study uses a purposive sample, so the sample was determined by considerations of information needed.\nFrom the explanation above, the researcher decided that the subjects of this research would be the eighth grade students of junior high school, taken from two classes (73 students in total). The first class as the experimental class was taught with generative learning model and the second class as the control group treated with conventional learning. The researcher considered the appropriate mathematics topics to find about the students' mathematization ability were systems of linear equation in two variables (SLETV) and the Pythagorean theorem."}, {"section_title": "RESULTS AND DISCUSSION The Results of the Tests on Students' Mathematization", "text": "The mathematization test was given to students before (pre-test) and after learning activity (post-test) to find about the students' improvements in the ability to mathematize (mathematization). The results of students' mathematization tests are described based on the indicators of mathematization. Thus, the achievements and improvements of the capabilities of the students' to mathematize can be more clearly reflected on every indicator. The results of the students' tests can be seen in Table 1 .\nBased on Table 1 , it can be seen that the generative learning had no effects on improving the students' mathematization. In this study there are six indicators measuring mathematization. Two of the six indicators are measured. The improvements of the students who were taught with generative learning were greater than those of the students who got the conventional learning. Indicators one and two show that the improvements in the mathematization of the students taught with generative learning were classified as low, but the first indicator of achievements belonged to the medium increase/improvement, and the second indicator of achievements belonged to low increase. In addition, the percentage of students' mathematization taught with generative learning achievement was lower than that of the students' taught with the conventional Learning despite the much greater increase.\nThe third to the sixth indicators demonstrate the improvements in the mathematization of the students who were taught with generative learning were much lower than the improvements of those who got the conventional learning. But there is one among those indicators that had a greater percentage for generative learning compared to the conventional learning.\nFor the third, fourth, and sixth indicators, it can be seen that the generative learning had no effects on the improvements in students' mathematization. Even generally, generative learning did not have effects on the improvements of students' mathematization, while the conventional learning showed low improvements. It means that the mathematization of the students taught with conventional learning was better than that of the students taught with generative learning. Table 2 indicates that the overall students who were taught with conventional study learning showed greater improvements in their mathematization than the students who were treated with generative learning. These results are supported by the average of students' post-test results. The table also shows that students who were taught with generative learning obtained smaller results than those taught with conventional learning in the post-test. The average grade/result of students learning conventionally was 36.50, whereas those who learned using generative learning got an average score of 32.80.\nBased on the descriptive statistical data of the mathematization ability, it can be inferred that in general the average scores of achievements and improvements of the mathematization of the students who were taught with generative learning were lower than the average scores of the students who got the conventional learning. The average scores for achievement and improvements of the mathematization ability of students with higher BMK and taught with generative learning were greater than the average scores of the students with high BMK and who learned using conventional learning. The average scores of achievements and improvements of the mathematization of the students with medium BMK who were taught with generative learning were smaller than the scores of the medium BMK students who got Conventional Learning. Finally, the average scores of achievements and improvements of the ability to mathematize of the students with low BMK taught with generative learning were smaller than those of the students with low BMK taught with conventional learning.\nThe percentages of achievements and improvements based on students' mathematization group learning (generative and conventional) and BMK (high, medium, low) can be seen in figures 3 and 4.\nOverall, the percentages of achievements and improvements in the mathematization of the students who got generative learning were smaller than those of the students who got the conventional learning. The improvements of the mathematization ability of the students who were taught with conventional learning belonged to the low category, while their achievements belonged to the medium category. Then, the improvements of the mathematization ability of the students taught with generative learning belonged to the low category, and the achievements belonged to the medium category.\nThe percentages of the improvements and achievements of the mathematization of the high BMK students who learned using generative learning were higher than those of the students who got the conventional learning. The improvement and achievements of the mathematization of the students who were treated with generative learning were both included under the category of medium. Meanwhile, the improvements and achievements of the mathematization of the students taught with conventional learning were both categorized into the low and medium, respectively. The percentages of the improvements and achievements of the mathematization of the students with low and medium BMKs who were taught with generative learning were smaller than those of the students who were taught with conventional learning. Nevertheless, the improvement and achievements of the mathematization abilities of the students with low BMK who were taught with conventional learning and generative learning were included under the categories of low and medium, respectively.\nFinally, the improvements and achievements of the mathematization ability of the students with low BMK and taught with conventional learning belonged to low and medium categories, respectively. Meanwhile, the increase and achievements in the mathematization ability of the students taught with were both categorized as low improvements."}, {"section_title": "The", "text": ""}, {"section_title": "Improvement of Overall Students' Mathematization", "text": "The data of the improvements of students' mathematization for all of students in the experimental (generative learning) and control (conventional learning) groups were not normally distributed and did not have homogeneity of variance. Therefore, to find about the presence or absence of mathematization improvement, the overall difference between students who were taught with generative learning and those taught with conventional learning was obtained using non-parametric statistical test Mann-Whitney U. The results of the test average differences of these groups are presented in table 5.\nThe results of nonparametric statistical test (Mann-Whitney U) indicate the value of -0.68, lying between the values of , so that the zero hypothesis was accepted. It means there was no significant difference between the mean of the data on the improvements of mathematization of the students who got generative learning and students who got conventional learning. Based on the results of the analysis of the test of mean differences, the improved mathematization of the students who were taught with generative learning was not better than that of the students taught with conventional learning. The Improvement of Students' Mathematization based on Basic Mathematical Knowledge (BMK) Next, to know whether there is a difference in the averages of both group of students' mathematization based on BMK, the researcher employed the nonparametric statistical test of Mann-Whitney U to test the mean differences. The results are presented in Table 6 . From the data above, we know the values of for students with high BMK were at the intervals of , so the zero hypothesis was accepted. This means that there was no significant difference between the average of improvements in the mathematization of the experimental group students (generative learning) and that of the control group (conventional learning) in terms with high BMK.\nMeanwhile, the value of for medium BMK was located above the limit of , so the null hypothesis was rejected and the alternative hypothesis was accepted, where X > Y (X = generative learning, and Y = conventional learning). This means that there was a significant difference between the means of the improvement in the mathematization of the experimental group students (generative learning) and the control group (conventional learning) based on medium BMK. It can be concluded that the average mathematization ability of the experimental group (generative learning) was better than the average of the control group (Conventional Learning) with medium BMK.\nSimilarly, the value of for students with low BMK lay outside the interval of , so the zero hypothesis was rejected and the alternative hypothesis was accepted, where X > Y (X = conventional learning, and Y = generative learning). This means that there was a significant difference between the averages of the mathematization of the experimental group students (generative learning) and control group (conventional learning) reviewed based on low BMK. It can be inferred then that the average improvements in mathematization ability of the control group (conventional learning) were better than those of the experimental group (generative learning) in terms of low BMK."}, {"section_title": "The Interaction between Learning Types and Basic Mathematical Knowledge (BMK) and Improvements in Mathematization", "text": "To measure the hypothesis, a two-way ANOVA was employed. Before doing the two-way ANOVA, homogeneity and normality tests of variance in mathematization improvements were carried out. In the previous discussion, it is known that statistical tests used to measure data on mathematical ability were nonparametric, because there was a nonGaussian data distribution and the data did not have homogeneity in variance. Therefore, the prerequisite assumptions for the two-way ANOVA test were not fulfilled, which means the significance value of the influences of interaction between variables cannot be calculated. However, it can be seen graphically whether there is an interaction or not between learning and (high, medium, low) BMK and the mathematization ability of the students, as shown in Figure 7 .\nFrom Figure 7 , it can be seen that for the students with high BMK and taught with generative learning, their mathematization was better than the students who got the conventional learning. This is not the case for the students with low and medium BMK who learned using generative learning, whose improvement in mathematization was lower.\nFigure 7 also shows an interaction between types of learning (generative and conventional) and BMK (high, medium, low) with the improvements in students' mathematization. The interaction can be seen from the intersection of the two lines, where students of higher BMK taught with generative learning experienced a greater improvement in their mathematization than the students of higher BMK taught with conventional learning.\nIn addition, the interaction can be seen from the difference in the average improvements of the students' mathematization for each group. The difference in the average improvements of the mathematization of students who were taught with generative learning and those taught with conventional learning with medium and low BMK was very small (the average improvements are almost the same). However, the average improvement in the mathematization of the students who were taught with generative learning and those with conventional learning with high BMK was much smaller than the average improvement for the same students with medium and low BMK."}, {"section_title": "Figure 7", "text": "The Analysis of the Correlation between Improved Mathematization and Mathematical Disposition Table 8 shows that the value of of the correlation between improvement in students' mathematization and mathematical disposition was greater than (0.325), so the zero hypothesis was rejected. This means that there was a significant correlation between improved mathematization and mathematical disposition. In addition, the coefficient of the correlation between improved mathematization and mathematical disposition was 0.404, which can be classified as medium correlation. The results of this study do not confirm the findings of the previous studies by Farouk and Elfateh (2016) and Maknun (2015) who found that the implementation of generative learning had significant effects in improving their students' conceptual mastery and general science understandings, respectively. However, there is indeed a correlation between mathematization and mathematical disposition in generative learning."}, {"section_title": "CONCLUSIONS", "text": "Based on the results of data analysis, findings, and discussion that have been outlined in the previous section, some conclusions can be drawn.\nFirst, the overall improvements in the mathematization of students who were taught with generative learning were not greater than those of the students who got the conventional learning.\nSecondly, the improvements in the mathematization of the students taught with generative learning were not greater than those of the students who were taught with conventional learning in terms of high BMK. The improvements can be categorized as low.\nThirdly, the improvements in the mathematization of students who were taught with generative learning were not better than those of the students who got conventional learning reviewed from medium BMK, in which the improvements of both groups can be included in the low category.\nFourthly, in terms of low BMK, the improvements in the mathematization ability of the students taught with generative learning were not better than those of the students taught with conventional learning, where the improvements of both groups were categorized as low.\nFifthly, there was an interaction between learning types (generative and conventional) and mathematical knowledge/BMK (high, medium, low) and students' mathematization Finally, there was a correlation between the improved mathematization and mathematical disposition of the students who were taught with generative learning model. Hence, although generative learning model did not have significant effects on improving students' mathematization, the learning model can still be made an alternative in teaching mathematics, especially because there was interaction between mathematization and mathematical disposition in the implementation of generative learning. "}, {"section_title": "The Average Gain of Mathematization Ability", "text": "Generative Learning Conventional Learning"}]