[{"section_title": "", "text": "The availability of sweetened beverages in schools has become a controversial issue because of the potential health problems associated with sweetened beverage consumption (1) . Among school-aged children, total energy intake is positively associated with sweetened beverage consumption (2, 3) , ranging from an adjusted mean of 7694 kJ/d (1839 kcal/d) for non-consumers of sweetened beverages to 8443 kJ/d (2018 kcal/d) for those drinking an average of 9 oz or more daily (4) . There is mixed evidence regarding the relationship between sweetened beverage consumption and weight gain and obesity in children and adolescents. Some studies have found a positive association (1, 3, (5) (6) (7) (8) (9) , while others have shown no relationship (10) (11) (12) . Nevertheless, two recent meta-analyses provided strong evidence for the independent contribution sweetened beverage intake on weight gain and obesity in children and adolescents (6, 13) . In addition, sweetened beverage consumption results in less consumption of more nutritious beverages, such as milk (4, 14, 15) , and related nutrients like calcium (3, 4) . Many school districts have enacted nutritional policies for beverages sold during the school day, with the aim to improve the environment within schools and positively impact student health. Sweetened beverages have been banned or severely limited in school systems as large as those in the New York City Department of Education (16) , the Los Angeles Unified School District (17) and the School District of Philadelphia (18) . Other approaches include requesting or mandating that schools have alternative beverages available, such as water, juice and milk. To date, there is little information available about the impact of nutrition policies on students' purchase or consumption of sweetened beverages (10) . The assumption that an administrative policy regarding the availability of sweetened beverages and alternative beverages will lead to less purchase and consumption of sweetened beverages is untested. Spangler found that banning sweetened beverages in vending machines in a West Virginia school district did not significantly change the amount of beverages purchased at vending machines or in stores outside the school (19) . Other studies have shown that while reducing the availability of beverages in schools affects students' beverage consumption in schools (20, 21) , it may not have any impact on their consumption at home (20) or may actually increase it (21) . There is a need for closer investigation of the relative costs and benefits of the various proposed policies in managing the sales of beverages in schools to guide decision making at both national and local levels.\nThe purpose of the current paper is to provide information about the behaviours of elementary-school children in schools with sweetened beverage policies in a nationally representative sample. Our specific objectives were to test, by comparing schools with and without a sweetened beverage policy, whether having a policy regarding the availability of sweetened beverages in school was associated with: (i) children's purchase of sweetened beverages at school in the presence and absence of alternative beverages for purchase; and (ii) children's total weekly and daily consumption of sweetened beverages."}, {"section_title": "Methods", "text": ""}, {"section_title": "Conceptual framework", "text": "The policy analysis framework that guided the current study posits that policy intents (e.g. reducing childhood obesity by reducing sweetened beverage consumption) should be well-matched to a policy instrument (e.g. regulation of sweetened beverages in schools), and that the instrument should be implemented at the appropriate levels of authority (e.g. school administrators, school districts, states) to lead to the intended outcome. Policy regarding reduction of sweetened beverage consumption is often matched to a regulatory instrument that limits the availability of these beverages in schools. The intended policy outcome is often the prevention of childhood obesity by reducing energy intake. The potential reduction of energy intake resulting from limiting the availability of sweetened beverages might happen through either reduced purchasing behaviour or a reduction in the desire to consume sweetened beverages associated with the promotion (i.e. marketing, exposure, valuing) of alternative products in schools. While the current study cannot address the prevention of childhood obesity or energy intake, it does assess associations between beverage consumption and implementation of different options for the regulation of availability (e.g. no sweetened drink availability, sweetened drink availability, sweetened drink availability with alternatives)."}, {"section_title": "Data", "text": "Data were obtained from the Early Childhood Longitudinal Study-Kindergarten cohort (ECLS-K), a multistage probability, nationally representative cluster sample of 21 260 kindergarten children attending 1592 elementary schools in 1998-9. Our analytic sample included 10 719 children aged 9-13 years and 2065 elementary schools with child and school administrator reports available during the 5th grade year in 2003-4. Child participants in the ECLS-K were asked to complete a questionnaire about their food consumption based on questions from the Youth Behavior Risk Factor Surveillance System (YRBSS). A child was given the following instructions. 'The next questions ask about food you ate or drank during the past 7 days. Think about all the meals and snacks you had from the time you got up until you went to bed. Be sure to include food.' They were then asked the following questions. 'During the past 7 days, how many glasses of milk did you drink? (Include all types of milk, including cow's milk, soy milk or any other kind of milk; include the milk you drank in a glass or cup, from a carton, or with cereal. Count the half pint of milk served at school as equal to one glass.)' 'During the past 7 days, how many times did you drink 100 % fruit juices such as orange juice, apple juice, or grape juice? (Do not count punch, Kool-Aid*, sports drinks, or other fruit-flavoured drinks.)' 'During the past 7 days, how many times did you drink soda pop (EXAMPLES Cokey, Pepsiz, Mountain Dewz), sports drinks (EXAMPLE Gatoradey), or fruit drinks that are not 100 % fruit juice (EXAMPLES Kool-Aid, Hi-Cy, Fruitopiay, Fruitworksz)?'\nResponses for each beverage group were ordinal: never; one to three times during the past 7 d; four to six times during the past 7 d; one, two or three times per day; and four or more times per day. Responses were recoded into two binary variables to indicate whether the children reported consuming the beverage occasionally (one to six times during the past 7 d) or frequently (once more per day) compared with no consumption.\nChildren also were asked about purchasing sweetened beverages: 'In your school can children buy soda pop (Coke, Pepsi, Mountain Dew), sports drinks (Gatorade), or fruit drinks that aren't 100 % juice (Kool-Aid, Hi-C, Fruitopia, Fruitworks)?' If a child's response was affirmative, he or she was asked how often he or she purchased those beverages in school. The response categories were the same as the consumption responses described above. Responses were recoded to indicate whether children reported purchasing at least one sweetened beverage in school in the past week.\nA school administrator survey was administered in the 5th grade year of the ECLS-K that asked selected School Health Policies and Practices Survey questions regarding the administrative policies related to food availability. Specifically, administrators were asked: 'Can students purchase, either from vending machines, school store, canteen, snack bar or à la carte items from the cafeteria during school hoursy (i) 1 % or skimmed milk? (ii) 2 % or whole milk? (iii) bottled water? (iv) 100 % fruit juice? (v) 100 % vegetable juice? (vi) soda pop, sports drinks, or fruit drinks that are not 100 % juice?' Administrators could respond 'yes' or 'no' to the availability of each item and this coding was maintained for subsequent analysis. Because administrators determine school-level policy, the administrator's report of availability of beverages was interpreted for the purposes of the current study as the school's policy on beverage availability. Analysis Statistical analyses were conducted using the STATA statistical software package version 9?1 (Stata Corporation, College Station, TX, USA). Multilevel regression commands were used to estimate all models. Multilevel logistic regression (XTLOGIT) was used to determine the magnitude and significance of relationships between the availability of different beverages (as measured by the school administrator report) and the purchase of sweetened beverages at school, with the school entered into the model as a random effect. The same modelling procedure was used to relate sweetened beverage consumption to the availability of sweetened drinks and alternative beverages.\nA wide variety of covariates were considered for inclusion in the analysis based on previous work with ECLS-K data (22) . Covariates included in final regression analyses were factors related to both school beverage availability and child purchase and consumption: family income; child's age in months, gender and race/ethnicity; school's Title 1 status; and whether the school had a 7th and 8th grade. Family income was a categorical variable reflecting annual income for the household as $US 5000 or less, $US 5001-10 000, $US 10 001-15 000, $US 15 001-20 000, $US 20 001-25 000, $US 25 001-30 000, $US 30 001-35 000, $US 35 001-40 000, $US 40 001-50 000, $US 50 001-75 000, $US 100 001-200 000 and $US 200 001 or more. Child's age was entered into models as a continuous variable in months. Gender was entered as a dichotomous variable. Race/ethnicity categories included White, non-Hispanic, African-American, Hispanic, Asian, Native Hawaiian or other Pacific Islander, or more than one race. Title status categories were yes, no and not applicable. Two variables that indicated whether or not the school had a 7th grade and whether or not the school had an 8th grade were included.\nMultilevel, multinomial logistic regression models were used to examine the association of children's occasional or frequent consumption (v. no consumption) of sweetened beverages with availability and purchase. Because of incomplete data patterns, four regression models were considered to allow the maximum number of children to be included in models that controlled for variables that were drawn from school administrator, primary caregiver and child food consumption surveys."}, {"section_title": "Results", "text": "In the present sample of elementary schools from across the USA, school administrators reported that a variety of beverages were available for children's purchase. Nearly two-thirds (62 %) of schools reported that 2 % or whole milk was available for children to purchase at school, and 43 % reported that 1 % or skimmed milk was available. About 47 % of schools reported that children could purchase 100 % fruit juice, and only 6 % reported vegetable juice was available. About 40 % of elementary schools in the sample had bottled water for purchase, and 27 % had sweetened beverages, such as soft drinks, sports drinks and juice-flavoured drinks available.\nThe purchase of sweetened beverages by children in school was strongly associated with the reported administrative policy of sweetened beverage availability. Twenty-four per cent of the children in schools with a policy that allowed sweetened beverages purchased at least one sweetened beverage at school, while 8 % of the children purchased sweetened beverages in schools where the administrators reported not allowing purchase of sweetened beverages. Children in schools with a policy that allowed sweetened beverages were five times more likely (OR 5 5?16, 95 % CI 4?18, 6?49) to purchase at least one sweetened beverage at school in the past week when the presence of alternative beverages was not considered. The population-attributable risk (calculated from the relative risk for this association and the prevalence of availability) was 35?7 %, meaning that if all schools changed to a policy of no availability of sweetened beverages, more than one-third of the children currently purchasing sweetened beverages in elementary schools would be prevented from doing so.\nWe next examined the potential effect on children's purchasing patterns of policy that encourages or requires alternatives to sweetened beverages to be present (Table 1) . If the administrator did not have a policy that made an alternative beverage present, the policy regarding availability of sweetened beverages (not available v. available) was associated with the percentage of purchase of sweetened beverages, about 3-4 % when not available v. 16-27 % when available. If instead the administrator did have a policy that made alternatives present, the availability of The relationships of children's sweetened beverage consumption with purchase and a policy of availability in school were examined using four multilevel, multinomial logistic regression models. The first model examined unadjusted associations; the second adjusted for family income only; the third for family income and child demographic characteristics; and the fourth for school characteristics ( Table 2 ). Adjustment for any of these other factors had little effect on the strength of the association of consumption with purchase and a policy of availability. Compared with the group of children attending schools with an administrative policy of no availability of sweetened beverages and reporting not purchasing sweetened beverages, children in schools where the policy allowed beverages to be available and were purchased by the child were three times more likely to report consuming either occasionally (Table 2, top) or frequently ( Table 2 , bottom). If the school administrators reported that the policy was that beverages were not available but children reported purchasing at least one beverage in the past week in school, then children were more than twice as likely to report consuming either occasionally or frequently. If the beverage was available but children did not report purchasing at least one beverage in the past week, then they were 11 % less likely to report occasional consumption and 16 % less likely report daily consumption. Considering these data from a slightly different perspective, highlighting the statistical interaction (P , 0?039 for frequent, P , 0?088 for occasional consumption), the effect of purchasing in schools on consumption (using coefficients from Model 1 and occasional consumption as an example) was 0?83 for children in schools with school administrators reporting no availability and 1?23 in schools with school administrators reporting availability. Conversely, the effect of a policy of availability in school on consumption was 20?12 when children reported not purchasing and 0?29 when children reported purchasing."}, {"section_title": "Discussion", "text": "Sweetened beverages are available in some elementary schools according to these findings and other national studies (23) . In the elementary school setting, sweetened beverages are often available as one of a number of alternatives, including milk, 100 % juices and water. Thus, children aged 5-11 years are offered the opportunity to choose from a variety of beverages without parental supervision of their choices. Nutritional concerns are less important to children than availability, taste, price and social acceptability (24) , and children younger than 3rd grade may not have the reading and maths skills to distinguish nutritional information among the alternatives.\nOur findings suggest that a policy of availability of sweetened beverages makes an independent contribution to children's purchase and consumption of sweetened beverages in the 5th grade year. There was no significant direct association between availability and overall consumption (results not shown); these findings are not surprising, since there are many different factors that determine consumption of sweetened beverages (25) . Furthermore, the interaction found between availability and purchase suggests that when administrators reported having a policy of availability of sweetened beverages at school, the association between purchase and consumption was stronger than when administrators reported a policy of no availability of these beverages.\nThe association between a policy of availability and purchase of sweetened beverages was only partially attenuated by the presence of juice and bottled water, with children still being three times more likely to purchase sweetened beverages if they were available. The joint association of a policy of availability and children's purchase was similar for both occasional and frequent consumption.\nOur findings are consistent with two other studies, one of which was done in older children. In a study of thirteen Massachusetts middle schools, 43 % of all students reported purchasing something from vending at least once in the prior 7 d. The most frequently purchased items were sweetened drinks other than soda (64 %), soda (11 %) and bottled water (22 %) (25) . Compared with children who reported not purchasing something from vending, those who reported using the vending machine one to three times per week consumed almost 0?25 more total servings of sweetened beverages per day (24) . A study of primary and secondary schools in Belgium-Flanders found that the availability of beverages at secondary school was associated with a 38 % increased odds of consuming a daily soft drink; however, the study did not find a significant association between availability and consumption in primary schools (26) . We found that children reported purchasing and consuming sweetened beverages even when the school administrator stated that sweetened beverages were not available for purchase. Assuming that the administrators' reports represent the schools' policies regarding availability, it may be concluded that the policies are not always enforced. Two other studies have found discrepancies between the reports of administrators and others in schools. In a sample of Minnesota schools, more school food service directors than administrators perceived that policies existed regarding the availability of foods (27) . In a sample of Pennsylvania high schools, more administrators than food service directors perceived that policies existed and were enforced regarding the availability of foods (28) . The discrepancies might reflect that administrators and school food service directors have authority over different aspects of the food environment and misperceive the enforcement of policies by the other (28) . At the very least, our findings support that the administrators may have some misperceptions about the availability of sweetened beverages in their schools.\nThe recent report from the Institute of Medicine, Nutrition Standards for Schools: Leading the Way toward Healthier Youth (29) , recommends that sweetened beverages not be available in elementary, middle or high schools. The report encourages local, state and federal authorities to limit availability of beverages. The American Beverage Association worked with the Alliance for a Healthier Generation to issue beverage guidelines for elementary schools that would limit the availability of beverages in elementary schools to water, 100 % juices, and low-fat and skimmed milk (30) . Our results confirm the need to not only offer the alternatives of water, juice and milk, but to also eliminate the availability of sweetened beverages.\nHome continues to be the primary place where children consume sweetened beverages, but the proportion of these beverages obtained from home is declining (24) . A study of parents of middle-school-aged children found that most parents would support limiting or eliminating the sale of soft drinks at school (31, 32) . A study of the determinants of soft drink consumption in 8-to 13-yearold children found, however, that 64 % of respondents reported that their parents drank soft drinks three or more times per week. Children of parents who reported regular consumption were 4?41 times more likely to report consuming soft drinks five or more times per week (33) . Likewise, children were more than five times more likely to report consuming soft drinks five or more times per week if soft drinks were available to them in their home (33) . Thus, the impact of school-based policies will be limited by the family's beverage habits.\nThe limitations of the present study are associated with the study design and measurement. Cross-sectional associations do not allow us to confer causality, but can be an important step in the process of establishing causal relationships. The measure of sweetened beverage consumption used in our study does not allow us to measure actual intake of sweetened beverages but rather times per day that a child reported consuming a sweetened beverage. Given the variety of portion sizes available, the measure is likely to substantially underestimate servings of sweetened beverages. Finally, it is possible that some children were classified as non-purchasers because they responded that children were not able to purchase sweetened beverages in their school and were never asked the second question about whether they purchased sweetened beverages at school. This misclassification error may have caused some random measurement error which would lead to an attenuation of the effects reported here."}, {"section_title": "Implications", "text": "Political momentum is building to provide greater regulation of the school food environment. A common recommendation of newly proposed legislation and scientists is to eliminate the availability of sweetened beverages in elementary schools. Our findings suggest that if availability were eliminated, students would purchase and consume less sweetened beverages. Furthermore, our findings suggest that providing alternatives to sweetened beverages will not be as effective as eliminating their availability.\nThe discrepancy between the school administrator's report of availability and the children's purchase of sweetened beverages in school deserves more attention. The population-attributable risk calculation suggests that, if a school administrator changes his or her stated policy regarding the availability of sweetened beverages, then 35 % fewer children would report purchasing a sweetened beverage at school. The other 65 % of children might still be able to purchase sweetened beverages through other venues at school, such as cafeterias, teachers, parents and clubs. In others words, there may be institutional barriers to regulating and enforcing the elimination of sweetened beverages from schools related to who has authority over which aspects of the school food environment (e.g. administrators and vending, teachers and classrooms, cafeteria managers and cafeterias). Working with all stakeholders, including children, administrators, school food service directors, teachers and parents, will be essential to reduce consumption of sweetened beverages obtained at school. The policy approach that is chosen to regulate the school food environment should encourage assessment, decision-making and implementation processes that involve all relevant stakeholders. Which policy approach (e.g. federally mandating elimination v. requiring local wellness policies that lead to elimination) will be most effective in improving the school food environment is unknown, and further research on the policy alternatives is needed."}]