[{"section_title": "", "text": "Nationally, data from the 2011 Behavioral Risk Factor Surveillance System (BRFSS) survey determined that 12.7% of respondents older than 60 years of age reported increased confusion or memory loss in the preceding 12 months. Among those reporting increased confusion or memory loss, 35.2% also reported experiencing functional difficulties (Centers for Disease Control and Prevention [CDC], 2013). Many older adults notice memory lapses and worry about incidents of forgetting (Haug, Wykle, & Namazi, 1989;Herzog & Rodgers, 1989;Weaver, Collie, Masters, & Maruff, 2008). These memory lapses also are upsetting in the daily lives of adults 40 years of age and older (Begum et al., 2012;Waldorff, Siersma, Vogel, & Waldemar, 2012). Changes in memory performance, specifically a decline in episodic memory, are often the initial symptom of declining ability and cognitive impairment (Albert, 2011;Salthouse, 2003;R. S. Wilson et al., 2002)."}, {"section_title": "PURPOSE", "text": "Meta-analyses have concluded that depression and older adults' memory performance are negatively correlated (Burt, Zembar, & Niederehe, 1995;Kindermann & Brown, 1997). In addition, other affective and cognitive factors are known to affect memory performance in older adults. The study reported here examined gender differences in metamemory (subjective awareness) and memory (objective performance) and the factors influencing memory in community-residing older adults."}, {"section_title": "DIFFERENCES IN COGNITIVE AGING Cohort Studies of Cognitive Aging", "text": "Two studies, Brooks, Friedman, and Yesavage (2003) and Burack and Lachman (1996), found that healthy older adults who used used memory strategies, specifically list making, recalled more items than did those individuals who did not use a memory strategy. Engagement with friends protected cognitive function, specifically orientation and memory, in women but not in men (Zunzunegui, Alvarado, Del Ser, & Otero, 2003). Using the California Verbal Learning Test, verbal memory declined as age increased for younger men and older women, but not for younger women (Kramer, Yaffe, Lengenfelder, & Delis, 2003). Women generally outperformed men on auditory memory, whereas males performed at a higher level on visual episodic and visual working memory tasks (Pauls, Petermann, & Lepach, 2013). In another study, women excelled in verbal episodic memory tasks-such as remembering words, objects, pictures, or everyday events-but men outperformed women in remembering symbolic, non-linguistic information, known as visuospatial processing (Herlitz & Rehnman, 2008). Cansino et al. (2013) found that working memory abilities declined with age. Cansino maintains there is no agreement on whether working memory declines equally for both visuospatial and verbal information. However, the comparison across cohort groups showed that discrimination in the visuospatial tasks started to decline earlier in women than in men, but data failed to demonstrate any differences associated with gender for tasks in the verbal domain. Females have been found to have advantages in verbal and autobiographical tasks and general episodic memory (Andreano & Cahill, 2009). Gender differences that are inconsistent have emerged in other autobiographical memory studies (Grysman & Hudson, 2013). Women reported more vivid memory experiences, including more details about emotions, other people, and the meaningfulness of their memories. It was proposed that gender differences in autobiographical memory development may be related to the influence of interactions with others when autobiographical memory skills were developing (Grysman & Hudson, 2013)."}, {"section_title": "Cognitive Aging and Depressive Symptoms", "text": "The Baltimore Longitudinal Study on Aging examined the influence of depression on cognitive decline in cognitively normal controls with no Alzheimer's pathology, individuals with Alzheimer's pathology, individuals with mild cognitive impairment plus Alzheimer's pathology but no cognitive decline, and individuals with a clinical diagnosis of dementia plus Alzheimer's pathology. Depressive symptoms were assessed using the Center for Epidemiologic Studies-Depression Scale. Individuals with Alzheimer's pathology but without cognitive decline had significantly lower rates of depression than cognitively normal individuals with no Alzheimer's pathology and individuals with Alzheimer's pathology plus clinical diagnosis of dementia (Morgan et al., 2007). In a population-based study, 1241 participants, aged 62-85 years, were asked about their physical activity during their early adult years. Researchers found that risk factors associated with depression included female gender, history of cerebrovascular diseases, generalized anxiety disorder, and loneliness (Polyakova et al., 2013). Regular physical activity was positively associated with information processing speed at older ages in men, but not in women (Dik, Deeg, Visser, & Jonker, 2003). Zelinski and Burnight (1997) found sixteen year age-related declines in list and text recall among a sample of 106 older adults that were not the result of cohort differences. In the Baltimore Longitudinal Study of Aging, Lamar, Resnick, and Zonderman (2003) tested the memory performance of 385 older adults with the California Verbal Learning Test (CVLT). Regardless of baseline performance, both younger adults and women scored higher on delayed recall. The Health ABC Study followed 2509 black and white elders longitudinally (Yaffe et al., 2009). Over the eight-year study, 30% of the participant's maintained cognitive function, 53% showed minor declines, and 16% showed major cognitive declines. Even though unique profiles of individuals were found based on age, education, literacy, level of physical activity, and smoking, no gender differences were identified. The Health and Retirement study, published in Older Americans 2012: Key Indicators of Well-Being found that males in every age cohort older than 65 years had a higher percentage of memory impairment than did females. Moderate or severe memory impairment in the study was defined as 4 or fewer words recalled out of 20 (Federal Interagency Forum on Aging-Related Statistics (2012). Even though males had more severe memory impairment, females also were impaired. In those 85 years of age or older, 37% of males, and 35% of females had moderate to severe memory impairment."}, {"section_title": "Longitudinal Studies of Cognitive Aging", "text": ""}, {"section_title": "Neuro Imaging Studies", "text": "Studies of magnetic resonance imaging have found greater atrophy and shrinkage in the brain structures of men than in the brains of women (Coffey, Lucke, Saxton, Ratcliff, Unitas, Billig, & Bryan, 1998;Larkin, 1998;Xu et al., 2000). Langley and Madden (2000) found that during retrieval in older adults the prefrontal cortex was bilaterally activated. Positron emission tomography (PET) and functional magnetic resonance imaging (fMRI) demonstrated evidence for possible over-activation in brain regions, demonstrating that older adults have decreased activity in multiple regions important for memory tasks (Persson & Nyberg, 2006)."}, {"section_title": "METHODS", "text": ""}, {"section_title": "Setting, Participants, and Procedure", "text": "We analyzed data from three studies of adults aged 59-100 years: the Community Sample study (n = 177), the Retirement Village (n = 97), and the Senior WISE Study (n = 265). Potential participants signed a consent letter before joining the study. The recruitment sites consisted of senior centers, adult learning programs, continuing care retirement communities, and low income housing facilities in Ohio and Texas. There were 396 (73%) females and 143 (27%) males in the sample. The mean age of the sample was 76.6 years (SD = 6.4 years). Education, in years, was 13.1 years (SD = 3.68 years). Ethnicity was 68% Caucasian, 23.4% African-American, and 8.5% Hispanic; 31% of the sample was married, 49.7% were widowed, 12.9% were divorced, and 6.0% were single."}, {"section_title": "Measures", "text": "Study instruments were administered in a face-face interview. First, individuals were given the Mini-Mental State Exam (MMSE). Next, demographic information was collected, and the metamemory and depression instruments were administered. Then, the memory performance timed test using the Rivermead Behavioural Memory Test and a health questionnaire were administered. Finally, questions from the last part (\"delayed\" recall) of the memory performance test were administered. Cognitive Function-The Mini-Mental State Examination (MMSE; Folstein, Folstein, & McHugh, 1975) is a 30-item performance measure that assesses cognitive functioning in older adults and is commonly used to diagnosis dementia. Scores can range from 0-30 and higher scores suggest better cognitive functioning. The measure is comprised of 11 areas: orientation to time, orientation to place, registration, attention and calculation, recall, naming, repetition, comprehension, reading, writing, and drawing. Tombaugh and McIntyre (1992) found that test-retest reliability ranged from about .80 to .95, and studies report moderate-to-high levels of predictive validity. Memory Performance-The Rivermead Behavioural Memory Test (RBMT) tested episodic memory performance and was designed to capture everyday memory (Cockburn & Smith, 1989;B. A. Wilson, Cockburn, & Baddeley, 1991;B. A. Wilson, Cockburn, Baddeley, & Hiorns, 1989). The assessment asks participants to remember a name (first and surname), a hidden belonging, an appointment, a brief news article, a new route (immediate), a new route (delayed), a message, orientation in place and time, and a date, as well as to recognize a picture and a face. Questions are designed so that normal participants will pass but individuals with everyday memory problems will fail. For each subtest, two scores are produced, a pass/fail screening score and a standardized profile score from 0-2 (0 points = abnormal; 1 point borderline; 2 points = normal). Thus, each participant's evaluation results in two scores, a Screening Score (SS) ranging from 0-12 and a Standardized Profile Score (SPS) ranging from 0-24. To control for practice effect, the test is available in four alternate (parallel) forms. Test-retest reliabilities have been reported as . 78 for the screening score and .85 for the profile score. Metamemory-The subjective assessment of memory was operationalized as seven scores on the Metamemory in Adulthood (MIA) questionnaire developed by Dixon, Hultsch, and Hertzog (1988). The MIA is a measure of the memory components of knowledge, beliefs, and affect. The MIA consists of 108 statements, which are rated on a 5-point Likert scale. The seven subscales measure achievement, anxiety, capacity, change, locus, strategy, and task. Achievement is the perception of one's motivation to perform well in memory tasks (+ = high achievement). Anxiety is rated as the influence of anxiety and stress on performance (+ = high anxiety). Capacity is one's beliefs about capacity (+ = high capacity). Change is the perception of memory abilities as generally stable or subject to long-term decline (+ = stability). Locus is the individual's perceived sense of personal control over remembering abilities ( + = internal locus). Task is knowledge of one's own memory processes (+ = high task). Strategy is having knowledge of one's remembering abilities such that performance in given instances is potentially improved (+ = high use). Internal strategies are captured by nine Likert-type questions: rehearsal (4 questions), elaboration (4 questions), and effort (1 question). External memory strategies include nine Likert-type questions related to the use of calendars (1 question), lists (2 questions), notes (3 questions), place (2 questions), and someone (1 question). The psychometric characteristics of the MIA have been examined with multiple samples of university students and community-dwelling middle-aged and older adults. Cronbach's alphas from five studies of the instrument's internal consistency for the two subscales reported here were as follows: Strategy, .82-.86 and Anxiety, .83-.87 (Dixon, Hultsch, & Hertzog, 1988). Depressive Symptoms-In the various samples, depression was operationalized with two valid and reliable scales. The short version of the Geriatric Depression Scale (GDS) (Brink et al., 1982;Sheikh & Yesavage, 1986), a 15-item instrument, has a Yes/No response format. Scores range from zero to 15, with a score ≥5 indicating depression. Depressive symptoms also were measured with the Center for Epidemiologic Studies-Depression (CES-D) scale. Individuals respond on a 4-point scale, ranging from \"rarely or none of the time\" to \"most or all of the time.\" There are four subscales: depressed affect, well-being, somatic symptoms, and interpersonal relations; however, a composite score is acceptable (Hertzog, VanAlstine, Usala, Hultsch, & Dixon, 1990;Radloff & Teri, 1986). Scores range from zero to 60, with higher scores indicating more depressive symptomatology. The CES-D has been tested with older adults and has been found to be stable when subscale and total scores are reported. High reliability coefficients from .85 to .91 have been obtained and factor structures have remained constant with older adults (Himmelfarb & Murrell, 1983)."}, {"section_title": "Statistical Analysis", "text": "Sequential binary logistic regression was used to determine whether gender differences were present for three sets of variables. The covariates (depression, age, ethnic group, and education) were entered first into the logistic regression model, followed by the performance variables, and then the subjective self-report measures. We also conducted an analysis in which the block of self-report measures was entered before the performance measures to assess if results were sensitive to order of entry (they were not). When a given block of variables was found to discriminate between male and females, we examined the impact of individual variables within the block to determine which particular variables contributed to gender differences. For this assessment of individual variables, we used analysis results from the full model with all variables included. We also computed McFadden's (1974)  , which is an effect size measure that describes the proportional improvement in model fit that is due to each block. For the logistic regression analysis, gender was the outcome variable. Further, Harell 2001notes that logistic regression is generally preferred over discriminant analysis because the latter requires more stringent assumptions about the discriminating variables (i.e., multivariate normality and equal variance/covariance matrices across groups). As such, logistic regression is a more robust procedure. Of the 539 participants, 529 provided responses on all study variables. Given the limited amount of missing data, we removed the ten participants (1.8%) who had missing data. Among the 529 remaining cases, 390 (74%) were female and 139 (26%) were male. Relatively few participants indicated Hispanic ethnicity (n = 44); therefore, to avoid potential problems associated with small cell sizes, the ethnic variable used in the analysis had two categories: Caucasian (n = 361, 68%) and other (n = 168, 32%)."}, {"section_title": "RESULTS", "text": ""}, {"section_title": "Memory Performance Groups", "text": "As shown in Table 1, males and females were classified into the four RBMT memory performance groups of normal, poor, moderately, and severely impaired categories. There were no differences in the groupings by gender. Table 2 provides descriptive statistics on all study variables by gender. This table shows very similar means on the performance measures for males and females. Males reported, on average, more years of formal education. Females reported more anxiety about their memory function, yet also reported greater memory capacity and more use of external strategies than did males. Prior to conducting the logistic regression analysis, we assessed whether the data supported the use of this procedure. The two performance measures were positively correlated, and the self-report measures were generally moderately correlated, as shown in Table 3. These correlations supported the use of an analysis model considering associations. While study variables were correlated, excessive multicollinearity was not observed; the largest variance inflation factor for all predictors in the model was 2.4, well under the commonly used value of ten, denoting serious multicollinearity (Stevens, 2009). The statistical assumption of linearity in the logit was assessed by using the Box-Tidwell procedure (Menard, 2010), which found no evidence of nonlinearity. In addition, the p value (.43) associated with the Hosmer-Lemeshow goodness-of-fit test provided support for the assumed functional form of the logistic regression model. While there were outlying values in the solution (3 cases with standardized residuals greater than 4), these outliers did not influence study results; the largest value of Cook's distance for these observations was 0.26, well below the value of 1 that is often used to characterize excessive influence (Stevens, 2009). These outlying cases were males who had below average years of formal education but had higher than average memory performance, capacity, and use of external strategies. There also was one participant whose Cook's distance value (.50) was larger than for other cases. However, this case did not influence results, which we determined by temporarily removing the case and rerunning the logistic regression analysis. Thus, all 529 cases were used in the logistic regression analysis. Table 4 presents the results of the analysis. When the covariates were entered as a block, the likelihood ratio test (χ 2 = 14.00, df = 4, p = .007, R L 2 = 2) indicated that the set of covariates distinguished between males and females. As Table 4 indicates, females reported fewer years of education than males. Adding the performance variables to the model that contained the covariates did not improve the fit of the model (χ2 = 2.07, df = 2, p = .499, R L 2 = .002),"}, {"section_title": "Covariates Influence on Memory Performance", "text": "indicating that there were no performance differences between males and females. However, adding the self-report measures to the model improved the fit (χ 2 = 56.41, df = 8, p < .001, R L 2 = .09). As the odds ratios in Table 4 indicate, females were more likely to have greater anxiety as well as greater capacity and greater beliefs in better memory and were more likely to use external strategies than males."}, {"section_title": "DISCUSSION", "text": "This study provided evidence of subjective and objective evaluations of memory function in a diverse group of community-residing older adults from Ohio and Texas. The data were collected using a cohort design that measured affective and cognitive function one time. Since the sample was not random, we cannot extrapolate these findings to all older adults. However, the results contribute to the cognitive aging literature, providing new data on gender differences in memory evaluation. In a random sample of older adults between the ages of 60 and 94, these adults ranked problems with memory among the five most frequently occurring daily symptoms; however, memory concerns were ranked among the lowest 10% of symptoms that these individuals felt required attention (Haug, Wykle, & Namazi, 1989). Based on the Rivermead memory performance scores, almost half the sample in this study had everyday memory problems. Forty-six percent of the females and 48% of the males were in the poor memory performance category. An additional 30% of the sample was in the memory impaired category. Age was not a significant predictor of cognition or memory performance in this large sample. Additionally, males and females were equally represented in the four memory performance groups. There were no significant differences in global cognitive function or memory performance scores. In our sample, females reported that they were using significantly more external memory strategies than were the males. Females in this sample also were more anxious about their memory, which may have increased their use of memory strategies. Memory strategies may be considered a compensatory mechanism to deal with the difficulties experienced by adults in their everyday memory performance as they age. Hutchens et al. (2013) found no association between control beliefs and memory strategy use, or control beliefs and memory performance for older adults with amnestic mild cognitive impairment (MCI); these researchers did find a strong association between strategy use and memory performance in healthy older adults. Researchers have found that a number of risk factors, such as being a female, having a history of cerebrovascular diseases, experiencing a generalized anxiety disorder, having loneliness, and living in a long-term care institution, are strongly associated with mild cognitive impairment (Polyakova et al., 2013). After a comprehensive review of studies from adults 55 years of age and older, the investigators determined that although minor depression is rarely investigated in elderly persons with MCI, nearly 20% of patients with MCI seem to suffer from depression."}, {"section_title": "Neuroscience Issues", "text": "Neuroscience is providing more in-depth knowledge of the physiological basis of memory function and aging while assisting clinicians in understanding the behavioral and functional manifestations encountered in the aging adult population. For instance, the integrity of specific white matter tracts of the prefrontal cortex have been investigated and are evident in studies of healthy older adults. Three cognitive processes that utilize the tracts of the prefrontal cortex involve episodic memory, working memory, and reasoning. Strenziok (2013) concluded that episodic memory, working memory, and reasoning were related to the integrity of specific fibers that can be tracked using current medical technology in the prefrontal cortex. This current investigation explored not only behavioral changes encountered in subjective and objective measures but also the emerging information from the field of neuroscience. Substantial progress has been made in understanding the behavioral aspects of learning and memory. However, examining the neurochemical aspects of memory, covariates of functional plasticity, may provide a deeper understanding of age as well as gender related differences. Neurochemical analyses have been found to be more sensitive than behavioral analyses in delineating gender based differences (Sebastian et al., 2013). Current Alzheimer's disease research is focused on the combination of neurochemical indicators, such as decreased cerebrospinal fluid (CSF) levels of beta-amyloid (1-42), and increased levels of phosphorylated tau (ptau-181) or total tau protein are known to be biomarkers of AD (Galvin, Fagan, Holtzman, Mintun, & Morris, 2010). Other studies have found that basal and feedback indices of cortisol regulation varied by gender; women without memory complaints had lower cortisol levels (Wolf et al., 2005). The researchers hypothesized that memory complaints may be related to enhanced hypothalamus-pituitary-adrenal (HPA) axis activity leading to stress-related increases in plasma cortisol levels. The brain achieves approximately 75% of its adult weight by the age of 2 but the regional brain structure continues to change throughout life. These changes in regional brain structure were modified by activity in a particular portion of the neostriatum. One study measured the structural covariance of various portions of the neostriatem and determined that aging and gender were correlated with changes in regional brain volumes and produced gender related differences in memories and how they are processed (Soriano-Mas et al., 2013). These neuroscience findings are providing a more dynamic view of memory changes in aging and are enhancing our understanding not only of gender differences in memory but also those associated with other characteristics."}, {"section_title": "Clinical Relevance of Men's Mental Health", "text": "The Centers for Disease Control and Prevention (2009) reported that for all races, the top ten causes of death in males were led by heart disease (25.2%) and cancer (24.4%). Even though suicide accounted for 2.4% and Alzheimer's disease only 2% of deaths in males, these top chronic illnesses profoundly affect mental health. Affective and cognitive impairments are often inversely related to chronic illness (Burt, Zembar, & Niederehe, 1995). For example, cognitive impairment was significantly greater in individuals with heart failure, independent of all other variables except comorbid conditions (Zuccala`, Pedone, Cesari, Onder, Pahor, et al., 2003). Our limited measures of memory performance were not able to determine if mild cognitive impairment (MCI) was present in the sample. However, in a study of community elders (McDougall, Becker, & Arheart, 2006), 46 individuals, or 17% of the sample met the criteria of poor everyday memory functioning and had memory complaints, whereas 81 (31%) were considered to be at-risk based on other MCI criteria (Winblad et al., 2004). Memory function is the conundrum for determining what healthy aging is, and what dementia is, for not only adults and their families, but also for the health care professionals who advise and counsel elders. The correct diagnosis of these nuances in cognitive function and memory performance in seemingly normal older adults is the emphasis of cognitive aging research and allows for the differentiation of MCI from Alzheimer's disease (Knopman, 2013). Men's health is often ignored and men do not seek health care as frequently as women do. The federal government offered a policy level solution in 2003 through the Office of the Secretary General in Departmental Management. The introduction of HR Report 107-229 provided a public statement declaring that there was no entity responsible for the coordination and oversight of activities across the agency concerning men's health. This recommendation was based on reports that men were 25% less likely than women to receive regular health screenings, and that men were less likely to visit a doctor when they noticed a problem. The Committee recommended that the Secretary expand Departmental disease prevention and health promotion activities among men and to give consideration to establishing an office for men, similar to the Office of Women's Health. This initiative has not been codified. In summary, women had higher anxiety scores and a greater memory capacity, and they used more strategies to maintain memory performance than did men. Females believed that they remembered more information than did males, but there were no memory performance differences by gender on either standard profile scores or the screening scores for the subscales. Older women's greater memory capacity should have resulted in improved memory performance. These findings indicate that, in this sample, the gender differences in memory were subjective, not objective, measures of performance.   Correlations among the Discriminating Variables  "}]