[{"section_title": "Abstract", "text": "Despite massive off-farm migration and relatively prosperous agricultural years, estimates of returns to factors of production indicate that labor earnings in agriculture remain low. This is primarily caused by farm factor market characteristics and the resulting tendency of any increase in farm income to be capitalized into land values."}, {"section_title": "", "text": "In 1965, Philip Raup asked: \"Do we have reason to believe that a continuation of labor withdrawal will in the next 20 years fmally lead to an improvement in the return to labor relative to land?'' (Raup 1965 (Raup , p. 1276 . The purpose of this paper is to offer a midterm and tentative answer in light of two important occurrences in the farm sector during the 1970s: (a) a sharp decrease in the rate of farm population decline and a national reversal in rural outrnigration; and (b) substantial absolute and relative increases in gross farm income.\nOff.farm migration has long been advocated as a major solution to the problem of low returns to agricultural labor. The \"excess of human resources\" and \"labor fixity\" were cited as fundamental causes of low labor returns and the \"farm problem\". Recent data indicate that the exodus of onfarm labor has largely terminated. It appears that the farm population has taken most of its prescribed cure, but analyses of factor income distribution indicate that the adjustment has not resulted in substantially higher labor returns for those remaining. This is partially a consequence of the differential impact of technological advance on the factor markets for land and labor and the resulting tendency for increased farm income to be capitalized into land prices at the cost of labor factor earnings."}, {"section_title": "CHANGES IN U.S. FARM POPULATION", "text": "As indicated by data presented in Table 1 , the nation's farm population reached its peak of 31 million during the 1930s. In the following three decades, off-farm migration offset net natural increases and cut deeply into the farm population. This rate of decline was steepest during the 1960s, when off-farm migration exceeded the net natural increase by 4.8 percent annually. But for all practical purposes, this process appears to be reaching its inevitable end . Between 1970 and , farm population loss averaged 1.5 percent annually. The number of net outmovers and the rate of outmovement for 1970-75 were substantially less than in the previous 30 years. Net off-farm movement is now largely confined to nonwhites, primarily southern · blacks. In 1975, the estimated nonwhite farm population was 611,000, or 6.9 percent of national farm population. Measured against their own base, the decline in E Bert .Mason is Assistant Professor, Department of Agricultural G~o~onucs, Cornell University. Helpful comments by Varden Fuller, ikllian Hart and three anonymous reviewers are gratefully ac nowtedged."}, {"section_title": "7", "text": "nonwhite farm population between 1970 and 1975 was 35 percent (an annual average rate of decrease of 8.6 percent), which also cannot last long. Between 1970 and 197 5, the number of whites on farms declined by only 6 percent, with an annual rate of loss averaging 1.2 percent.\nDuring the 1950s and 1960s farm employment for farm residents declined at about the same rate as farm population, but has remained fairly constant at 2.2-2.3 million persons since 1970 (ERS, Current Population Reports) . A concurrent and significant change has occurred since 1970 in the age composition of farm operators. Between 1970 and , the proportion of farm operators under 35 years increased from 15 to 21 percent, while those 60 years and older declined from 33 to 27 percent (Beale, p. 7) . This shift in age composition is the result of an increase in the number of self-employed persons in agriculture under 35 years (from 265,000 to 358,000 between 1970 and 1975) , and a decrease in those 60 years and over (from 601,000 to 461,000 between 1970 and 1975) . As a result, the median age of self-employed farmers fell from 53. 1 in 1970 to 50.4 in 1975 . The movement towards a superannuated farm operator population-a fairly consistent trend since the 1930s-has apparently come to a halt as young operators are replacing old at an exceptional rate.\nIf the agricultural labor market is indeed near equilibrium, as claimed by Huffman and the Council of Economic Advisers, the expectation would be reversal in chronically low returns to labor. As further analysis will show, this has not been the case. Before examining recent trends in returns to factors of production, a brief discussion of the nature of the markets for hired and self-employed farmworkers is appropriate."}, {"section_title": "CHARACTERISTICS OF THE MARKET FOR HIRED F ARMWORKERS", "text": "Between 1950 and 1970, the number of people who did some farm work for wages declined from 4.34 million to 2.48 million. 1 Since 1970, the hired farm work force has averaged about 2.7 million persons, of which approximately 77 percent were nonfarm residents. In the 1973-75 period, about 43 percent of the farmworkers were casual (doing less than 25 days of farm work), 34 percent were seasonal (25-150 days), 9 percent were regular (150-250 days) , and 14 percent were year-round workers (more than 250 days). These statistics suggest that the hired farm work force is predominantly casual and seasonal.\nFarm work was the chief activity for only 741,000 of the 2.6 million who did some farm work in 1975. Only 583 ,000 worked for farm wages for more than 150 days ; 1, 416 : 1920-59, Fuller and Van Vuuren; 1960 , Farm Population Estimates for 1970 . USDA, E RS.\n3 Column 3 minus column 2 divided by column L were attending school, keeping house, or otherwise not regularly participating in the labor force as their chief activity. Approximately 1.1 million persons, or 41 percent of the total hired farm work force did both farm and nonfarm work. Of this group of 1.1 million interindustry workers, farm wage work was the chief activity for only 161,000 (15 percent), whereas nonfarm work was the chief activity for 419,000 intersectoral workers (38 percent). For the remaining 483,000 workers who were employed in both farm and nonfarm jobs, their principal activity was \"not participating in the labor force.\" Farm work therefore offers opportunity for those principally engaged in nonfarm work to supplement their nonfarm earnings. It also provides casual employment for people not normally in the labor market (but employed temporarily at both farm and nonfarm work.) . The average daily earnings for those doing both farm and nonfarm work in 1975 are presented in Table 2 . It is apparent from these statistics that the 419,000 chiefly nonfarm intersectoral workers are using the opportunity to work on farms when they otherwise might not have been employed. The person who was chiefly not a farmworker and earning $25.85 per day at nonfarm work is not likely to forego days at that level of earning to do farm work at $16.85 per day, suggesting that these chiefly nonfarm workers are working on farms in periods when they have little or no employment opportunity in the nonfarm sector. Their relation to farm employment is not fundamentally different from those 1.4 million individuals who principally were not labor force participants.\nHourly wage rates for hired farmworkers also reflect the salvage nature of the farm labor market. Although some modest relative gains have been made in recent yea rs, hourly wage rates for hired farmworkers have averaged about one-half of U.S. industrial wage rates during the last 20 years. Evidence on labor force participation, daily earnings and hourly wage rates illustrates the dominant characteristic of the hired farm labor market. For workers with casual attachment to the labor force (those who are principally not in the labor force), hired farm work provides an easy-access means to supplement family income. For most of those who work in both the far m and nonfarm sectors, farm wage work is a chance to earn something during periods when nonfarm employment is not available.\n2 Under these conditions, it is not surprising that earnings for the hired portion of the farm labor force remain low despite favorable product market conditions during the 1970s."}, {"section_title": "MARKET CHARACTERISTICS FOR SELF -EMPLOYED FARM WORKERS", "text": "Annual income estimates published by the ERS indicate that off-farm earnings have become a larger proportion of farm families' incomes. In 1950, income from nonfarm sources was approximately 31 percent of total personal income of the farm population. For 1970 and , the comparative percentages were 53 and 50, respectively . The proportion of nonfarm to farm income has, however, varied considerably, primarily as a result of changes in farm product prices and gross farm income.\nThe proportion of nonfarm to farm income is inversely related to farm size (Table 3 ). For farms with less than $10 000 gross farm sales in 1970, the majority of family incdme came from nonfarm s?urces. There were 1,988,000 farm units, or 67 percent, havmg less than $10,000 of farm product sales in 1970. ~thou~ estimates of.returns to labor by farm size are not avrulable, It can be surrrused that farmers and family workers on farms with less than $1 0,000 in sales were using most of their time devoted to farming to supplement income when off-farm employment is unavailable. This probably also is true for a substantial portion of those farms with sales between $10,000-$19,999. In terms of relative magnitudes of persons involved, self-employment is similar to hired farm work in that it appears to be a salvage use for low-opportunity time. It should be noted that farms with less than $20,000 sales owned approximately 45 percent of total land used for farming in 1969 (U.S. Bureau of the Census, Census of Agriculture). Activities of these smaller farm units in land markets will therefore exert an important influence on farm land prices and, as will be developed, returns to the factors of production. "}, {"section_title": "LAND AND LABOR MARKETS", "text": "In the farm sector, adoption of new technology tends to create underemployment rather than unemployment. As Fuller and Van Vuuren point out, the self-employment characteristic and other attributes of farm enterprise make it possible for farm people to sustain long periods of underemployment. Moreover, the self-employed worker is not likely to have the same awareness of his/her labor factor income as a worker who depends solely on wage earnings. If the total earnings of a farm household-from investment, capital gains as well as labor returns-are acceptable then the factor earnings for labor (particularly if the labor time has low opportunity value) may not be critical in determining whether the operator and family stay in the farming business. This economic calculus is probably attenuated by residential advantage and preferences for rural lifestyles. The result is that self-employed farmers may continue to farm despite low returns to their labor inputs.\n.Until 1968, ERS published a useful annual series on the esttmates of returns per }:lour to operator and family labor by 9 type of farm and location (USDA, Farm Costs and Returns) . These calculations were derived by subtracting all variable costs, depreciation and returns on investment in fixed equipment and an interest rate of return on land and improvements from realized gross income. The residual, divided by the number of hours worked by farm operators and family members , gave an imputed hourly return for self-employed labor. Although the series has been discontinued , business management records compiled in various states provide similar information on a state-by-state basis. What they show is a generally depressed level of labor factor earnings , particularly for small farming units. For example, in a sample of 605 dairy farms in New York State, 37 percent reported negative returns to labor and management of operators in 1975 (Bratton) Economists have long considered the divergence in earnings of land and labor factors a paradox. The adoption of new technology-such as machinery, chemicals for fertilizer and pest control, and improved varieties and breeds-means that a given quantity of food can be produced with less labor and land as output per unit of input is increased (Heady, 1962) .1f demand for output is relatively inelastic (as in the case of food) and the supply of inputs is comparatively inelastic, the marginal value product of both labor and land should be depressed. As discussed earlier, the depressing effect on labor has been partially offset by massive exit of surplus labor. In contrast, there has been no comparable removal of land despite government land diversion and retirement programs. Yet redundance of supply and low returns characterize the lab~r market while scarcity of supply and high prices dominate the land market.\nVarious explanations have been offered for this dichotomy in the functioning of the two factor markets. For example, Chryst suggested that technological advance exerts differential effects on the factor markets for land and labor. Observation of trends in the land and labor markets indicates that technological advance has been dominantly land-embodying and land-augmenting, as Heady (1949) predicted. ~he parcel which once supported an owner and family and proVIded them full-time employment is no longer sufficient unde~ new technology. A search for additional land has resulted m the substantial capture of labor factor returns by the land factor. All have some validity and some are probably dominant in specific geographic areas. But, as Fuller and Van Vuuren point out, it is doubtful that any contributor to the demand for farm land is as important as a farmer who has some land and needs more. Technology advancement-by substituting capital for labor-has the dual effect of creating underemployment for both labor and equipment. A seemingly simple act such as purchasing a more powerful tractor can result in spare time for both the operator and tractor and implements. Several factors may motivate the farmer to purchase new equipment-perhaps to replace an outmoded machine, to pursue size economies, to BERT MASON gain lucrative tax credits, as an investment, or perhaps Veblen had something to say about farmers' propensity towards buying bigger and better machinery. Regardless of farmers' motivations, the result of this technological adoption is that the farm gains incentive to buy or rent additional land to employ underutilized labor and capital (and for smaller farmers to attain size economies).\nThe link between technological advance, underemployment and land inflation is difficult to prove . But limited eviden~ suggests that this relationship exists. Indices of major farm inputs indicate that farmers' investments in machinery in· creased more rapidly than all inputs except agricultural chemicals (which are also a partial substitute for labor) between 1970 and 197 5 (Table 5 ). In good years , farmers invest in capital items such as tractors. Perhaps more impor· tantly, the capacity of this equipment is greatly expanded as older, smaller equipment is replaced with the newest models.\nBetween 1970 and 1976, U.S. farmers decreased the number of tractors which they owned from 4.6 million to 4.1 million.\nBut the total horsepower produced by this diminished stock increased from 203 million in 1970 to 228 million in 1976.\nThe adoption of new machinery has a logical link to the land and labor markets. More sophisticated investments result in underemployed time for labor and machinery , and the search for additional acreage continues. Narrow marginal analysis of returns to incremental acreage in relation to inflated land prices might indicate that enlargement is ir· rational. However, considering the prospect of further capital gains and the possibility of employing low opportunity time, the calculus changes considerably. The rationale of marginality can go beyond the incremental land decision ; the gain accrued from salvaging time and achieving size economies can also be spread across already owned land. Raup suggests a related aspect of rural psychology:\nThe evidence suggests that landowners who acquire land through inheritance or at low prices tend not to reckon the opportunity cost of the present capital value of that land as a true cost. By this reasoning, a landowner can afford to pool the income expected from existing land and from his contemplated purchase of additional land, and devote this total return to retiring the cost of the added tract (Raup, p. 1274 ).\nThe outcome is that the enlarger can pay more for the enlargement increment than for the entire unit which wiU eventually be owned. Even if true opportunity costs of the existing stock of land are considered, a higher maximum price for add-on land than for the entire unit can be expected . This stems from the lumpiness of capital (discussed previously), and lumpiness in off-farm labor opportunity. It is not always easy for the individual family to withdraw labor from farming in fractional amounts. A farmer who is underemployed by 10 hours a week may not find it feasible to obtain off-farm employment for the 10 hours. The realistic choice for many farm families is to quit farming or to acquire more land. The individual farmer may therefore be willing to expand the farm operation even if the marginal return on labor is less than prevailing non-farm wage rates.\nIt is apparent that many farm families have chosen to enlarge, by renting or buying additional land, rather than quit farming. The strength of this enlargement motive is indicated by the statistic that 59 percent of all farm land purchases between 1971 and 1975 were described as expansion purchases (USDA, ERS. Farm Real Estate Market Developments). During this same period, the index of national farm land values increased by 75 percent. The impact of enlargement on farm real estate values is clear.\nThe net result of this link between labor, investment and land inflation is that increased farm product prices are quickly capitalized into land values at the expense of labor factor earnings. Robinson similarly observes that unstable prices exert a \"ratchet effect\" on land values by overcapitalizing in land and machinery in prosperous years. He cites S. W. Warren's observation of potato farmers' behavior: \"In a poor year, farmers go into debt, while in a good year, they buy another farm\" (Robinson, p. 772) ."}, {"section_title": "LOSS OF INCOME DUE TO LAND VALUE INFLATION", "text": "Following the procedures of Fuller and Van Vuuren, the loss of labor factor income to land value inflation can be approximated. This exercise is carried out in Table 6 (footnotes explain the arithmetic procedures used). This approach is admittedly overaggregated and somewhat hypothetical, but does offer some insight into the magnitude of loss to the labor factor. Treating labor earnings as a residual after allowing for a rate of return to land equal to the current average of new federal land bank loans, 1954-1975 , column 3 gives an imputed return to self-employe-d and hired labor. For land values assumed to have been stabilized at the level of their 1950-54 ratios to gross farm income, the same residual imputation procedure is used to estimate the aggregate labor factor returns shown in column 6. These total returns to labor are converted to an hourly basis in columns 4 and 7.\nThe divergences between the two hourly series after 1954 suggest the magnitude of loss of labor factor income to land that is attributable to the divergent characteristics and the differential impact of technological change in the land and labor markets. During the 1972-74 \"boom\" years for agriculture, returns to labor under both inflation and noninflation of land values increased dramatically from earlier trends. But labor residuals for 1974 and 1975 indicate that increased product prices were quickly capitalized (with some lag in land market response) into land values, as reflected in the total and hourly differentials between columns 3 and 6 and columns 4 and 7 for the two years. Returns to labor under land inflation in 1974 were $2.85 per hour, as compared to $3.98 per hour computed under noninflation of land prices; for 1975, the comparative figures were $1.04 and $2.98. The sharp and dramatic downward figures for labor return in 1974 and 1975 11 (columns 3 and 4) suggest that farmers have done just as Warren observed. They tend to overcapitalize in prosperous years, thereby depressing returns to labor.\nSince the effect of increased wage rates paid to hired farmworkers is incorporated in column 1 and hence is reflected in the residuals of columns 4 and 7, the divergent changes in these two series (almost $1.00 per hour and $2.00 per hour in 197 5) give some indication of the extent to which later purchasers of land are having to forego self-employed labor earnings to compete in the land market."}, {"section_title": "SUMMARY AND IMPLICATIONS", "text": "Farm population and employment trends indicate that the off-farm adjustment has largely been accomplished-the \"cure\" often prescribed for low labor returns has apparently been taken. For those remaining in agriculture, welfare expectations have had the additional benefit of the sharp and unanticipated change in the world and national supply/ demand situation. Yet, both of these occurrences in combination have had a very limited impact upon labor earnings. For self-employed labor, the increase in returns to labor was substantial but quite temporary, as high product prices were qUickly capitalized into land values (Table 6 ). Depressed labor earnings are the result of market characteristics for hired and self-employed farm labor and the internal linkages between land and labor in the farm sector. The hired labor market continues to be an open-access means for supplementing household income. In the self-employed segment, enlargement and capital investment dominate; factor earnings of land continue to rise relative to labor returns.\nThese conclusions have important implications for farm and rural income support programs. Concern about adequate incomes for farm operators and families (a narrow focus which ignores the persistently low earnings of hired farmworkers) has been used to justify, in part, price support and supply control programs. Given the peculiar functioning of the factor markets for land and labor, there is a tendency for any increase in income, regardless of its source, to be capitalized into land values. As Gaffney points out, price support and land retirement programs were really not \"farm\" programs but instead were landowner programs. Substantial evidence exists which indicates that government price and income programs were capitalized into land values and allotment holdings. Rosine and Heimberger, in analyzing the U.S. farm sector between 1948 and 1970, concluded that \" ... the major beneficiaries of farm programs have been landowners and not the suppliers of labor. ... In recent years benefits to land accounted for about 92 percent of total benefits.\" (p. 725).\nSince 1975, farm surpluses and low farm prices have dominated the agricultural sector. Target price support levels authorized by the Food and Agriculture Act of 1977 exceed market-clearing prices for wheat, cotton, corn and other feed grains, and \"set-aside\" programs to reduce acreage planted to wheat and corn have been established. Although the maximum payment limitations included in the 1977 Act may reduce the concentration of benefits among the richest farms, the substantial income redistribution from present to future landowners effected by earlier support programs will continue. In the absence of dramatic (and unanticipated) changes in the functioning of farm factor markets, it is almost certain that these program benefits will be capitalized into land values. If policies are truly aimed at supporting farm incomes rather Agricultural Statistics, 1967 , 1969 , 197 5, and 1976 . aR ealized net income of farm openltors plus interest paid on farm mortgage debt, wages paid to hired farm labor, and net rent paid to nonfarm landlordl bAn inputed interest earning at the current average of new federal land bank loans and based on current values of land and buildings.\ncSame as column 2 except that land values are held to same ratio to current realized gross farm income as prevailed tluough 1950-54. dColumn 1 minus column 2.\neColumn 3 divided by estimated total man-hours of labor required. fColumn 1 minus column 5.\ngSame as column 4 except for the use of noninflated residual of column 6.\nthan land prices, they should not be tied to land. Commodity price support programs should not be confused with rural income support policies; they are quite separate in impact and the former should not be justified as pursuit of the latter."}]