[{"section_title": "", "text": "Using a probability model framework designed to estimate the likelihood with which a student loan borrower becomes 120 or more days delinquent on a student loan within five years of entering repayment, we show that borrower-level credit characteristics are important predictors of future student loan delinquencies. In particular, despite the notion that credit histories of young student loan borrowers are not necessarily well established and, consequently, are less likely to be predictive of future credit behavior, we show that credit scores of young borrowers are highly predictive of future student loan delinquencies, even when measured prior to the borrower entering repayment. In marked contrast, and perhaps contrary to the popular narrative, student loan balances are generally not a significant predictor of student loan delinquency/default risk, both in statistical and economic terms-a result also shown in Hillman (2014) using the 2004/09 Beginning Postsecondary Students (BPS) survey data from 2003 through 2009. Our analysis offers additional interesting insights. In particular, other credit indicators remain highly predictive of future student loan delinquencies, even after controlling for borrower credit scores. For example, and perhaps counter to simple intuition, borrowers with credit card or mortgage debt prior to entering repayment are less likely to become delinquent on their student loans than borrowers with no such debts, potentially because borrowers with less risky underlying credit profiles are more likely to qualify for such debt while in school. Moreover, in our regression specifications that exclude credit variables, degree completion and attendance at a for-profit institution (see Hillman, 2014 or Looney and Yannelis, 2015 for supporting evidence) are some of the strongest predictors of future student loan delinquencies, both in statistical and economic terms. 3 However, once credit controls are included in the regression specification, their statistical and economic significance declines (though the dropout indicator remains highly statistically significant), suggesting that credit variables-and credit scores in particular-are correlated with degree completion and attendance of for-profit institutions. These findings, coupled with the low predictive power of student loan debt, corroborate the notion that the observed rise in student loan delinquencies in general may not be driven by high levels of student loan debt, but rather by other factors that correlate with a borrower's ability to repay it (see, for example, Dynarski and Kreisman, 2013;Hillman, 2014;and Hylands, 2014). 4 Finally, similar to other studies (see Gross et al., 2009 for a comprehensive review of the existing literature, and Looney and Yannelis, 2015 for a recent analysis of defaults on federal student loans), we confirm that other factors such as Pell Grant controls-which partly proxy for a borrower's socioeconomic background-are important predictors of student loan delinquencies. Our findings that credit characteristics are salient predictors of future student loan delinquencies, even when measured before borrowers enter repayment, have important practical implications. Coinciding with the rapid increase in student debt and delinquencies, a number of initiatives have been put forth to help borrowers manage their debt. 5 For example, new plans tied to borrowers' incomes (so-called \"incomedriven\" repayment plans) were introduced to help borrowers lower their monthly payments to manageable levels relative to their income. 6,7 While income-driven repayment plans are a potentially promising way to alleviate student loan burdens for borrowers who might otherwise be at risk of delinquency, a limited number of early indicators of student loan non-performance-such as high student loan balances-have been available to policymakers to efficiently target the at-risk population. 8 While our results point to a limited explanatory power of the level of student loan debt in predicting future student loan delinquency risk, our results also suggest that borrowers' credit scores could be used to identify at-risk borrowers. In particular, even the most rudimentary regression specification that includes credit scores and student loan balances is able to capture 60% of all student loan delinquencies among the 25% of borrowers most likely to become delinquent. Furthermore, the riskiest 15% and 30% of borrowers (as predicted by the model) account for 40% and 70% of all student loan delinquencies, respectively. The purpose of this study is not to devise a method that could be used to underwrite student loans at the time a borrower applies for college. Rather, we aim to identify variables that policymakers could use to effectively target at-risk borrowers for enrollment in programs designed to mitigate delinquency risk and potentially increase student loan debt manageability at the time when these borrowers exit school or enter repayment. To this end, we use a probability model to estimate the likelihood with which a student loan borrower becomes delinquent on their student loans using a set of predictive variables that are observed at or shortly before exiting school or entering repayment. 9 We organized this paper as follows. First, we describe the newly constructed, core data set from which we drew the estimation sample used in the analysis, as well as the criteria used for construction of the estimation sample. Then we briefly describe the empirical design, interpret the regression output, and use a cumulative delinquency curve framework to assess the predictive power of various model specifications. Finally, we conclude with a discussion of our findings."}, {"section_title": "Data", "text": "We pooled our data from several sources. 10 Appendix A discusses the details of the data, checks the representativeness of the merged data set against alternative data sources, and provides caveats relevant for the analysis. To summarize, the data set started with a nationally representative random sample of credit bureau records, picked and provided by TransUnion LLC, for a cohort of 34,891 individuals who were between ages 23 and 31 in 2004. Individuals were followed over time, with credit records pulled approximately every two years, namely, in June 1997, June 2003, December 2004, June 2007, December 2008, and December 2010. The data contain all major credit bureau variables, including credit scores, tradeline debt levels, and delinquency and severe derogatory records. In the next step, we merged on the TransUnion data individual educational records through early 2008 from the DegreeVerify (for degrees) and Student Tracker (for enrollments) programs by the National Student Clearinghouse (NSC). We then used the NSC educational institution identifiers to further merge school-level information from the Integrated Postsecondary Education Data System (IPEDS), as well as the historical school-level two-year cohort default rates (CDR) from the U.S. Department of Education Federal Student Aid (FSA). 11,12 Finally, we merged individual-level information about Pell Grants and Federal loans-sourced from the National Student Loan Data System (NSLDS)-with the data for Pell Grant and federal student loan recipients. Among the 34,891 individuals in our total sample, 54% (or 18,748 individuals) have existing NSC postsecondary education enrollment records, indicating that these individuals have at least some college education. 13 Our analysis targets the subpopulation of our total sample with 1) at least some college education and 2) with student loan debt. A total of 11,766 individuals match these two criteria in our sample. This number indicates that approximately 60% of college-goers in our sample use student loans to fund their postsecondary education. 14 We next dropped 1,231 individuals with zero student loan balances at the time they entered their last repayment, with the last repayment period defined as starting 200 days after a borrower leaves school for the last time in our sample. The 200-day period between school completion and the beginning of the repayment period reflects the six-month grace period. 15 Next, consistent with our discussion in Appendix A1 on reweighting the sample to adjust for underrepresentation of for-profit schools in the NSC sample, we dropped 226 borrowers who entered their last repayment period before fiscal year 1998, and for whom we cannot construct sample weights due to data limitations. Additionally, given that our analysis focused on borrowers' delinquency outcomes five years after they entered repayment for the last time, we also dropped 3,582 borrowers who entered repayment for the last time after fiscal year 2006 and for whom we did not observe the outcome variable throughout the five-year window. Furthermore, due to the very small sample and corresponding issues with weight adjustments, we dropped 34 individuals who last attended a private not-for-profit two-year school, as well as six individuals who last attended a private for-profit school in fiscal year 1998. Finally, we dropped five borrowers who entered their last repayment period before age 19 and additional 31 individuals with missing information on the CDR or school sector associated with the last institution attended. The final sample thus contains 6,651 student loan borrowers with existing educational records. All dollar-nominated variables were deflated into 2010 dollars using the Bureau of Labor Statistics' Consumer Price Index for All Urban Consumers (CPI-U). Table 1 shows the age distribution when entering repayment in our final sample. As shown, about 8% of student loan borrowers were age 21 or younger when entering repayment for the last time in the sample. These borrowers generally represent those with completed one-or two-year degrees, dropouts, or-in rare instances-very young four-year-degree college graduates. The next 42% of student loan borrowers with at least some college entered repayment for the last time between ages 22 and 24. The remaining 50%t entered their final repayment period between ages 25 and 33. These borrowers generally represent individuals with advanced degrees, as well as individuals who were either older when entering college or had longer or interrupted educational histories. Given the focus on credit variables as predictors of student loan delinquencies, Table 2 shows the distribution of credit scores by age of a student loan borrower. 16 At least in theory, any individual with at least one credit tradeline account that is open for six months and reported to the credit bureau agency should have a credit score. 17 To the extent that the need for credit increases with age, one would expect that the fraction of individuals with credit scores would increase with age. In our final sample, only 30% of individuals had a credit score at age 18, but 70% had a credit score by Note: The table captures the age distribution of student loan borrowers in our final sample at the time when these borrowers enter repayment for the last time in our sample. Note: The table captures the fraction of individuals with no credit score in the final sample. For those with a credit score at a given age, it also reports the average (mean) credit score. Since borrowers are captured in our panel data at various ages, an individual who is observed at ages 18 and 19, for example, will be included in the calculation of the mean credit score in both lines 1 and  2 of the table. age 19, and 93% by age 22. For those aged 26 or above, close to 100% had a credit score. Moreover, the age profile of the average credit score for those with scores followed a U-shape. The average credit score started at about 650 at age 18 but-perhaps somewhat counter to initial intuition-declined monotonically by about 80 points to 567 at age 26 before rising again to about 600 at age 31. Additionally, the variance in credit score increased with age. Combined, the initial decline in the average credit score and the increasing variance suggest that while young borrowers start their credit histories as a relatively homogeneous group in terms of their observable credit characteristics, over time the scores become increasingly heterogeneous and, consequently, increasingly predictive in explaining future credit events-a fact that we will exploit in our analysis. Table 3 provides basic summary statistics for the final estimation sample. Out of the 6,651 individuals in our sample, 43.5% left school without a degree, with the remainder of the sample earning at least a certificate or an associate's degree. Additionally, 47.3% were last associated with a public four-year institution. Moreover, 8.6% last attended a private for-profit institution and an additional 5.1% attended a for-profit institution at some point but not as their last school. On average, individuals entered their last repayment period with almost $22,000 in student loan debt (in constant 2010 dollars) on average, and 55.9% received a Pell Grant. Interestingly, the delinquency rate-defined as a borrower being at least 120 days past due within five years after entering the last repayment period in the sample-derived solely from credit records is 19.4% in the sample. However, when the credit data is augmented with information on federal student loan defaults, this delinquency rate rises to 25.7%, suggesting that not all federal student loan defaults recorded by the U.S. Department of Education can be identified in the credit data. 18 Moreover, among the 1,707 borrowers who became 120+ days past due on their student loans within five years after entering the last repayment period, 1,094 (or 64%) ended up defaulting on their federal student loans in those five years. For additional descriptive statistics for the final sample, see Appendix C."}, {"section_title": "Results", "text": ""}, {"section_title": "Bivariate Analysis", "text": "This section summarizes several insightful bivariate relationships between student loan delinquencies and some of their correlates. Our delinquency measure takes a value of one if a borrower was ever 120 or more days delinquent within five years after entering the last repayment period, and takes a value of zero otherwise. 19 Table 4 and Figure 1 show the distribution of student loan balances for delinquent versus non-delinquent student loan borrowers. As can be seen, delinquent borrowers are, on average, associated with lower (rather that higher) student loan balances than non-delinquent borrowers. Since the results in Table 4 and Figure 1 do not account for borrowers' attained education, the negative coefficient on student loan debt should not be too surprising; those with lower educational attainment levels are more likely to become delinquent but, at the same time, tend to have lower levels of student loan debt. Table 5 illustrates this point by tabulating the average student loan debt and delinquency rate by the highest attained degree. The average delinquency rate and student loan balance among those who did not complete their degree are 43.5% and $12,524, compared to 6.8% and $48,260 of those with a master's degree or above. To further illustrate this point, Figure 2 repeats the analysis shown in Figure 1 but separates borrowers by the highest degree attained. Indeed, once the highest degree attained is considered, the cumulative student loan balances associated with delinquent and non-delinquent borrowers are similar, with little discernible difference between the two groups. Note: The table compares student loan balances between student loan borrowers who were never delinquent on their student loan debt against balances of borrowers who were delinquent on their student loan debt at some point in the sample. 467 individuals with missing student loan balances (see Table 3) are dropped from this tabulation.   Table 3) are dropped from this tabulation. Table 6 summarizes student loan delinquency rates by degree completion as well as the school sector last attended. The table shows that, not controlling for other factors, delinquency rates are generally much higher for those who did not complete a degree, irrespective of the sector attended. Still, even among this population, student loan borrowers who last attended a private for-profit school or a public two-year school are associated with relatively higher delinquency rates (54.3% and 46.4%, respectively) than borrowers who last attended a public four-year school (40.9%). The differences in delinquency rates are perhaps even more striking among those who earned a degree: 26.5% and 16.6% at private for-profit and public two-year schools versus 10.3% at public four-year schools. Finally, Table 7 shows the delinquency rate by borrowers' credit score categories and their Pell Grant recipient status. To avoid the confounding effects of student loan repayment behavior on credit scores, a lagged credit score measure relative to school exit is used in the analysis. In particular, scores are lagged on  Figure 1, but splits the student loan densities by borrowers' highest attained degree. Plotted for student loan balances at last repayment below $50,000. average by one year relative to school exit (as reported in Table 3), depending on when we observe TransUnion records and when the school exit occurs for each individual in our sample. Not controlling for other factors, the table shows that the likelihood of a student loan delinquency following the school exit declines monotonically and steeply with borrowers' pre-school-exit credit scores. In particular, the delinquency rate for student loan borrowers with credit scores between 500 and 599 is 21 percentage points Note: The table shows the distribution of student loan balances and delinquency rates by borrowers' credit scores and Pell Grant status. Tabulations are based on borrowers' credit scores that are on average lagged by one year relative to borrowers' school exit. 467 individuals with missing student loan balances (see Table 3) are dropped from this tabulation. higher than for borrowers with credit scores between 680 and 729. Moreover, the table shows that Pell Grant recipients are significantly more likely to become delinquent on their student loans than those who never received Pell Grants, at 33.9% versus 15.2%, respectively."}, {"section_title": "Multivariate Analysis", "text": "In this section, we estimate a probability model (probit) of student loan delinquency on the estimation sample described in the Data section. The binary dependent variable corresponds to our delinquency measure defined in the Bivariate Analysis section. Columns (1) through (7) in Table 8 display the final estimation output for seven baseline regression specifications that are based on the entire sample. Columns (1) through (6) are adjusted for the NSC school type underrepresentation with FSA-based weights (discussed in Appendix A), while column 7is unweighted. Column (8) restricts the analysis to those with a bachelor's degree or less, also adjusting by the FSA-based weights. Coefficients in all regressions represent marginal effects, with the effects being evaluated at the means of the continuous variables. Standard errors are clustered at the school level. 20 Columns (6) through (8) capture our preferred regression specifications. Column 1provides estimates for the model with explanatory variables restricted to borrower's age when entering the last repayment period, whether a borrower has received Pell Grants, the average amount of Pell Grants received, cumulative student loan balances when entering the last repayment period, and yearly time effects (with the time dummy variables taking on a value of one for the fiscal year in which a borrower entered his or her last repayment period). The omitted category is entering repayment in fiscal year 1998. In line with the bivariate relationship shown in Figure 1, the negative and highly statistically significant regression coefficient on the (logged) student loan debt in Column (1) illustrates that, not controlling for additional factors such as degree attainment, borrowers delinquent on their student loan debt tend to be associated with significantly lower cumulative student loan balances than non-delinquent borrowers. 21 This stylized finding challenges the popular press narrative that frequently links borrowers with high student loan debt burdens (and often advanced degrees) to student loan debt repayment difficulties. While such anecdotes undoubtedly capture repayment experiences of some borrowers, the data show that they are not generally representative of the typical student loan borrower experience. 22 Dependent variable defined as ever 120+ days delinquent on student loan debt within 5 years after entering the last repayment period. The omitted variable categories are the \"Fiscal Year 1998\" for the year dummy, an \"Associate's Degree/Certificate\" for college degree, \"Engineering\" for major, and \"Last Attended Public, 4-year\" for the last school sector attended. continued on next page Dependent variable defined as ever 120+ days delinquent on student loan debt within 5 years after entering the last repayment period. The omitted variable categories are the \"Fiscal Year 1998\" for the year dummy, an \"Associate's Degree/Certificate\" for college degree, \"Engineering\" for major, and \"Last Attended Public, 4-year\" for the last school sector attended.  Dependent variable defined as ever 120+ days delinquent on student loan debt within 5 years after entering the last repayment period. The omitted variable categories are the \"Fiscal Year 1998\" for the year dummy, an \"Associate's Degree/Certificate\" for college degree, \"Engineering\" for major, and \"Last Attended Public, 4-year\" for the last school sector attended. The Federal Pell Grant program is a means-tested program that offers financial aid to low-income students. The program is large: Total Pell expenditures for the school year 2013-14 are estimated at about $34 billion, with over one-third of undergraduate students receiving a Pell Grant in that year (College Board, n.d.;2015). While the indicator for Pell Grant recipients is not statistically significant on its own, the average amount of Pell Grants received-itself a function of family resources for dependent students and their own resources for students who are independent, as well as enrollment intensity and educational expenses-is highly significant and positively correlated with future student loan delinquency at a 1% level. While the economic significance falls when additional controls are included in the regressions in Columns 2) through  (8, the statistical significance is unchanged, suggesting that borrowers from underprivileged socioeconomic backgrounds are significantly more likely to become delinquent on their student loan debt. Column 2adds information on attained degrees and college majors, with the omitted categories being an associate's degree/certificate for degrees, and engineering for majors. 23,24 A comparison of coefficients in Columns 1and 2illustrates the important role of degree completion as a correlate of future student loan delinquencies. When educational controls are added in Column 2, the college dropout indicator becomes the most economically significant predictor of future student loan delinquency. 25 In contrast, having a degree beyond an associate's degree or a certificate mitigates delinquency risk. Additionally, when schooling variables are included in the regression, the effect of the average Pell Grants received drops by roughly a third (although it remains statistically significant at a 1% level), largely because Pell Grant controls are positively correlated with the dropout indicator. Indeed, Pell Grant recipients are more frequently associated with socioeconomic characteristics and educational experiences that suggest statistically greater chances of dropping out of college (Wei and Horn, 2002;. 26 Importantly, once educational controls are added, student loan debt becomes positively correlated with student loan delinquency risk. However, the estimated partial correlation between student loan debt and delinquency is economically small and statistically insignificant, and this result holds even as additional controls are added in Columns 3through (8). This weak correlation between student loan balances and delinquency odds reflects that student loan balances, once educational backgrounds are considered, are a poor predictor of student loan delinquency risk. For majors, all the coefficients are positive, indicating that among those with an attained degree, engineering majors are less likely to become delinquent on their student debt than other majors, and several of these coefficients are significant at standard significance levels. 27 Column 3incorporates information on school sectors: public two-year, public four-year, private fouryear not-for-profit, and private for-profit. Individual educational histories are often complicated. While some borrowers attend only one sector, many borrowers attend multiple sectors through a series of lateral, upward, or downward moves. Therefore, besides controlling for the school sector with which a borrower was most recently associated (with public four-year schools being the omitted sector), we also control for other school sectors previously attended. 28,29 Consistent with the bivariate evidence in Table 6, having both last or ever attended a for-profit institution is positively and significantly associated with higher delinquency risk at 1% and 5% significance levels, respectively, even after controlling for several other factors. Similarly, attending a public two-year institution just before entering the last repayment period is also positively associated with future student loan delinquency risk. 30 Column (4) adds information on school-level two-year cohort default rates (CDR) for the last institution attended. The CDR is a metric constructed by the U.S. Department of Education and it is mainly used to sanction schools with high student loan default rates. If the school's CDR exceeds a given threshold, the school becomes Title IV ineligible for a time, thereby losing access to federal grants and student loans. 31 While the CDR of the last institution attended is likely to be highly correlated with a borrower's own future student loan delinquency odds, in the context of our \"predictive\" exercise it is interesting to quantify its predictive power for individual delinquency, in part because CDRs are readily available to the U.S. Department of Education. To be consistent with CDR information that might be available to the U.S. Department of Education at the moment when the borrower enters repayment, and to avoid contaminating the CDR by the borrower's own delinquency behavior, we lag the school-level CDR by three years with respect to the year in which the borrower enters his or her last repayment period. Not surprisingly, the school CDR is highly predictive of individual future student loan delinquency. Moreover, introducing this measure takes power away from the school sector coefficients. In particular, the statistical significance of attending a public two-year institution just before entering the last repayment period dissipates and the value of the coefficient drops by roughly two-thirds, while the economic importance of attending a private for-profit school just before entering repayment decreases almost by a half. The reduction in the predictive power of the last school sector attended variables once the CDR is included is due to the combination of two factors. First, there is a significant correlation between school sectors and CDRs, as reflected in Figure 3. Second, even among the sectors where delinquencies are prevalent, there is significant heterogeneity in CDRs among schools within those sectors, which is why the CDR is a better predictor of future student loan delinquencies than a more generic indicator for school sector. Column 5includes a first subset of credit variables. More specifically, the regression controls for whether the borrower had other types of debt (i.e., auto, mortgage, and credit card debt) just before entering repayment, and whether the borrower was delinquent on any debt different from student loans prior to entering repayment. Interestingly, having credit card and mortgage debt before entering repayment is associated with a lower likelihood of future student loan delinquencies, while having auto debt is statistically insignificant. The lower incidence of student loan delinquencies among those with mortgage or credit card debt prior to entering repayment might in part reflect that borrowers with less risky underlying credit profiles might be more likely to qualify for such debts while in school. Simultaneously, the statistical insignificance of having auto debt prior to entering repayment might reflect that auto debt is generally more widely available to borrowers with less pristine credit records than other types of debt. Finally, being delinquent on other types of debt prior to entering repayment is highly correlated with future student loan delinquency odds. Our preferred regression specification in Column (6) includes (logged) credit scores. As described in the Bivariate Analysis section, credit scores are lagged relative to the school exit. Finally, a dummy variable set to unity for those with missing credit scores (zero otherwise) is included. 32 Once credit variables are introduced in Columns 5and 6, the economic effects associated with dropping out and Pell Grants received decline in value (although they remain significant), suggesting that credit variables-and credit scores in particularare correlated with degree completion and socioeconomic backgrounds. At the same time, lagged credit score becomes the most economically predictive correlate of student loan delinquency odds. The highly predictive nature of lagged credit scores, coupled with the low predictive power of student loan debt, supports the notion that the observed rise in student loan delinquencies may not, in general, be driven by large levels of student loan debt, but rather by other factors that correlate with a borrower's ability to repay (see, for example, Dynarski and Kreisman, 2013;Hillman, 2014;and Hylands, 2014). 33 Finally, turning to the effect of other delinquencies, not surprisingly, being delinquent on other types of debt before entering repayment becomes insignificant when introducing the credit score prior to leaving school. Although the effects of having a mortgage and credit card debt remain significant, part of the effect is absorbed by the credit score. Column 7shows the unweighted estimates presented in Column (6), while column (8) estimates the model on a subsample of borrowers with at most a bachelor's degree. As can be seen, the estimates and their statistical significance are largely unchanged. To illustrate the economic and statistical relevance of credit scores, Figure 4 compares the estimated relationship between credit scores (measured prior to entering the last repayment period) and the student loan delinquency probability for a bachelor's degree holder and a college dropout at a public four-year school, holding other observable characteristics constant. 34 As shown, the predicted probability of becoming delinquent on student loans after entering repayment is significantly higher for those leaving school without a degree across the credit score spectrum. The differential effect ranges from about 10 percentage points for high-credit-score borrowers to 40 percentage points for low-credit-score borrowers. Notably, having no credit score prior to leaving school in our sample is not synonymous with a low score. Observationally, borrowers without scores are about as likely to become delinquent on their student debt as their counterparts with a score of 575. In the same vein, Figure 5 captures the estimated ceteris paribus correlation between student loan balances and the delinquency risk for borrowers with a 700 and 550 credit score, respectively. 35 As illustrated, and consistent with our previous discussion, the economic contribution of student loan debt plays only a relatively small role in predicting future delinquency and is only imprecisely estimated. In particular, the predicted probability of future student loan delinquency is relatively flat across the student loan debt spectrum, with sizable 90% confidence intervals bounding the estimated effects, indicating the limited usefulness of student loan balances in identifying borrowers in high risk of future student loan delinquency. 36 Predictive Power and Policy Implications In this section, we assess the in-sample ability of our preferred specification in Column (6) to identify borrowers in high risk of becoming delinquent on their student loans within five years after entering their last repayment period-our dependent variable. To this end, we construct cumulative delinquency curves, which are an analytical metric commonly used in the mortgage industry to gauge performance of credit risk statistical models. First, we use our model to predict the probability of becoming delinquent on student loans for each borrower. Second, we calculate the cumulative delinquency curve, defined as a function L(P), where P (represented by the horizontal axis) is the cumulative portion of the population ranked by delinquency risk in a descending order, and L (represented by the vertical axis) is the cumulative portion of student loan delinquencies in the sample. Figure 4. Probability of student loan delinquency, by credit score. This figure plots the estimated probability of student loan delinquency in five years following the last school exit (vertical axis) for individuals with varying credit scores (horizontal axis) who did not complete a degree (red line) and for those with a bachelor's degree (blue line). The shaded regions show the 90% confidence bands around the point estimates. Calculations assume that the borrower entered repayment in fiscal year 2005 at the age of 25, attended only a public four-year school with an average (5%) CDR, and received a bachelor's degree in business, management, or marketing. Moreover, the borrower did not receive any Pell Grants, had a student loan debt of $22,000 prior to entering repayment, and had no other debt. Figure 5. Probability of student loan delinquency, by student loan balance. Calculations assume that the borrower entered repayment in fiscal year 2005 at the age of 25, only attended a public four-year school with an average (5%) CDR, and received a bachelor's degree in business, management, or marketing. Moreover, the borrower did not receive any Pell Grants, had a credit score of 700 or 550 (respectively) prior to entering last repayment, and had no other debt. Shaded regions represent 90% confidence intervals. The black line in Figure 6 tracks a perfect prediction for our sample and shows that roughly 25% of borrowers become delinquent on their student loans in our sample. Theoretically, a perfect model would assign these borrowers the highest predicted probability of student loan delinquency and would thus allot them to the bottom quartile of the population ranked by the delinquency risk in descending order, P. In practice, an estimated model is unlikely to fit the perfect prediction line exactly. However, the model's fit relative to the perfect prediction provides a gauge for assessing how well the model separates borrowers in high risk of student loan delinquency from their lower risk counterparts. Figure 6 shows that our fully specified model (represented by the red line) captures 60% of all student loan delinquencies among the riskiest 25% of student loan borrowers ranked by the model-predicted delinquency risk (relative to a 100% of all delinquencies under the perfect prediction). Furthermore, the bottom 15% and 30% of riskiest borrowers (as predicted by the model) account for 40% and 70% of all student loan delinquencies, respectively. While our results point to the fact that a significant amount of heterogeneity related to student loan repayment behavior exists even after controlling for the available observable characteristics, we view the ability of our model to capture an appreciable amount of student loan delinquencies in the bottom tail of the predicted risk distribution as encouraging. shows cumulative delinquency curves, defined by the function L(P), where P (represented by the horizontal axis) is the cumulative portion of the population ranked by delinquency risk in a descending order, and L (represented by the vertical axis) is the cumulative portion of student loan delinquencies in the sample. The black line tracks a perfect prediction for our sample and shows that roughly 25% of borrowers become delinquent on their student loans in our sample. The model's fit relative to the perfect prediction/black line provides a gauge for assessing how well the model separates borrowers in a high risk of student loan delinquency from their lower-risk counterparts. For example, the fully specified model (represented by the red line) captures 60% of all student loan delinquencies among the riskiest 25% of student loan borrowers ranked by the model-predicted delinquency risk (relative to a 100% of all delinquencies under the perfect prediction). Furthermore, the bottom 15% and 30% of riskiest borrowers (as predicted by the model) account for 40% and 70% of all student loan delinquencies, respectively. At this point, it is helpful to compare the predictions of our preferred model against alternative models that could be used by the U.S. Department of Education to target borrowers in high risk of student loan delinquency after entering repayment. In particular, the U.S. Department of Education has a number of initiatives through which it attempts to reach student loan borrowers who might benefit from enrolling in income-driven repayment plans. Unfortunately, only a limited number of early indicators of student loan non-performance are currently available to the U.S. Department of Education to help identify these borrowers, such as high student loan balances. 37 Thus, the figure also shows the explanatory power of several (simpler) alternative models that could be potentially adopted by the U.S. Department of Education to predict future delinquency risk. As illustrated, a model that uses only student loan balances-the blue line-closely tracks a 45-degree line and, as such, is associated with a minimal explanatory power. The green line shows a version of the model that complements student loan balances with additional information potentially readily available to the U.S. Department of Education: the two-year school cohort default rates and Pell Grants controls. 38 Including such information greatly improves the fit of the model over the specification that exclusively relies on student loan balances; however, even such specification is far inferior in terms of its in-sample predictive power to our preferred specification. Given the statistically and economically significant effect of credit scores in our preferred specification, it is interesting to explore whether augmenting the above regressions (which only control for risk factors currently observable by the U.S. Department of Education) might appreciably increase the models' predictive power. The purple line captures the predictive power of a re-estimated model that only includes student loan balances and credit scores (measured prior to a borrower's entering repayment). Introducing borrowers' credit scores greatly improves the model's performance relative to the specifications that rely exclusively on student loan balances, as well as student loan balances, CDRs, and Pell Grant controls. Moreover, once credit scores are introduced, a further inclusion of CDRs and Pell Grants-in addition to student loan balances and credit scores (the orange line)-leads only to a marginal improvement in the predictive power of the model and has essentially no discernible effect on the model's ability to predict student loan delinquencies at the bottom of the risk distribution where the efficiency gains of an improvement in predictive power would be the greatest. Taken together, our results suggest that individuals' credit scores are a potent predictor of student loan delinquency risk. Moreover, once credit scores are included, the contribution of CDRs and Pell Grant controls to the model's explanatory power is somewhat limited. Indeed, once we include credit scores, even the most rudimentary regression specification that relies exclusively on student loan balances and credit score performs comparably to our preferred, fully specified model. In particular, a simple model that includes only student loan balances and credit scores captures about 57% of all student loan delinquencies among the bottom quartile of the riskiest borrowers, essentially the same fraction as the fully specified model, but nearly doubles the fraction of delinquencies captured by its analog that does not employ credit scores."}, {"section_title": "Conclusions", "text": "The increase in student loan delinquencies and defaults in recent data, coupled with increased borrowing volumes, have raised concerns about students' ability to repay their student loan debt obligations. Coinciding with these increases, the U.S. Department of Education introduced new income-driven repayment plans to help borrowers lower monthly payments to manageable levels relative to their incomes. While enrollment in and general awareness of these programs have been on the rise, efficient targeting of borrowers who might benefit from these plans appears to have been difficult, in part due to data limitations. 39 This paper contributes to the literature on predictors of student loan delinquency, with a novel application to credit bureau data. Using new and unique data, we build a series of statistical models designed to predict the probability that individual borrowers become delinquent on their student loans within the first five years after entering the last repayment period. We show that, unlike student loan balances, individual credit scores are highly predictive of future student loan delinquencies, even when measured well before borrowers enter repayment. In particular, even the most rudimentary probit specification that controls only for student loan balances and lagged credit scores captures about 60% of all student loan delinquencies in the sample among the model-predicted riskiest quartile of the student loan borrower distribution. In contrast, a specification based solely on student loan balances-a risk factor that, in absence of other viable alternatives, is readily available to the U.S. Department of Education-is associated with minimal explanatory power and is, therefore, of minimal use for achieving the objective of efficient targeting. Our findings have practical implications. First, exploiting borrower credit information could vastly improve the efficacy of the borrower-targeting process. Second, our analysis used credit scores that were significantly lagged relative to the borrowers' last repayment entry in order to avoid confounding feedback effects of repayment behavior on observed credit controls. Practically, using the most recent credit score available at the moment of targeting is likely to boost the targeting's effectiveness relative to our results. While credit scores are generally not available to the U.S. Department of Education, they could be potentially acquired by making borrowers sign a credit score disclosure form when applying for a loan. Incorporating such a disclosure into the standard student loan application process could thus provide the U.S. Department of Education with the ability to access borrowers' credit scores at a future time, when these borrowers exit school or enter repayment. As discussed in the introduction, our analysis is not designed nor should it be interpreted as suggesting that credit scores be used for student loan underwriting; doing so could undermine the objective of equalizing college access opportunities."}, {"section_title": "Nexus: Connecting Research to Practice", "text": "• Student loan delinquencies do not appear to be driven by high levels of student loan debt, but rather by other factors that affect borrowers' ability to repay it. In particular, borrowers who leave school without a college degree are disproportionately more likely to become delinquent on their student loans, although their student loan burdens are on average relatively low. In marked contrast, graduate degree holders, while generally associated with sizable student loan debt, rarely become delinquent on their student loans. • Attending a for-profit institution, with or without completing a degree, is associated with disproportionately greater risk of future student loan delinquency. • A borrower's credit score (even when measured at a time that precedes the borrower's entry into student loan repayment) is highly predictive of future student loan delinquencies and is correlated with both degree non-completion and for-profit attendance. In part, this might reflect that borrowers with low credit scores at the time of their entry into repayment tend to be less likely to have a degree and are more likely to have attended a for-profit institution. • Our analysis suggests that borrowers' credit scores observed at or shortly before school exit, if made available to program administrators, could be used very effectively to target borrowers for enrollment in programs designed to mitigate delinquency risk. • Our analysis is not designed to, nor should it be interpreted to, suggest the use of credit scores for student loan underwriting; doing so could undermine the objective of equalizing college access opportunities."}, {"section_title": "Appendix A The Data Set", "text": "Our data set pools data from several sources. 40 The data set starts with a nationally representative random sample of credit bureau records picked and provided by TransUnion, LLC, for a cohort of 34,891 young individuals who were between ages 23 and 31 in 2004, and spans the period 1997 through 2010. Individuals were followed biannually between June 1997and June 2003, and then in December 2004, June 2007, and December 2008. The data set contains all major credit bureau variables, including credit scores, tradeline debt levels, and delinquency and severe derogatory records. In order to capture information on enrollment periods and the institutional-level characteristics associated with each period, in the next step we sourced individual educational records through 2007 from the DegreeVerify (for degrees) and Student Tracker (for enrollments) programs by the National Student Clearinghouse (NSC). The NSC educational institution identifiers allow us to further merge institutional records from the Integrated Postsecondary Education Data System (IPEDS), such as tuition, sector (e.g., public, private for-profit and not-for-profit, open admission), and SAT and ACT scores that are summarized at a school level. In addition, the NSC school identifiers allow us to also merge the historical school-level two-year cohort default rates (CDR) collected by the U.S. Department of Education Federal Student Aid (FSA). Finally, for Federal Pell Grant and federal student loan recipients, individual-level information about Federal Pell Grants and federal student loans-sourced from the National Student Loan Data System (NSLDS)-is merged onto the data. Given that only a subset of individuals in the core TransUnion sample have existing postsecondary education records, there are important differences between the TransUnion sample and its NSC subsample. As illustrated in Table A1, out of the 34,891 individuals in the TransUnion sample, 54% (or 18,748 individuals) have an existing NSC postsecondary education enrollment record. While this college-going rate broadly matches the comparable rate of 58% in the nationally representative American Community Survey (ACS) 2007 public files, it understates the rate slightly. 41 In particular, besides never enrolling in college, a NSC record might be missing because the postsecondary education institution in which an individual was/is enrolled does not participate in the NSC Student Tracker or DegreeVerify programs (see . 42 To the extent that the NSC program participation issues could be systematic, it is helpful to next examine the differences in baseline variables between the two samples. Turning to the differences in credit data indicators between the two samples, individuals represented in the NSC subsample are more frequently associated with student loan balances (62.8% versus 44.5% in the core TransUnion sample) as well as other types of debt, including auto debt (77.7% versus 72.8%), mortgage debt (50.8% versus 44.4%), and credit card debt (95.5% versus 87.9%). Mostly in line with our expectations, 120 or more days past due delinquency rates on auto and mortgage debt are lower in the NSC (or college-going) subsample but, perhaps surprisingly, are higher for credit card debt: 1.1% versus 1.5% for auto loans, 4.3% versus 5.0% for mortgages, and 13.3% versus 12.7% for credit card debt. Consistent with these findings, the average maximum credit score per borrower is 36 points greater in the NSC subsample than in the core credit bureau data (712 versus 676). Taken together, the observed differences are in line with those one would expect when comparing the population with a subsample of individuals with at least some postsecondary education. Diving deeper into the potential systematic bias due to reporting issues, we next turn to the group of 3,760 borrowers (or fully 24% of all student loan borrowers in our sample) who have existing student loan debt records in the credit bureau files and/or student loan records in the NSLDS, but do not have NSC records. Comparing the characteristics of these borrowers (shown in Table A2) with characteristics of   Table A1) provides the best available gauge of the type of bias posed in our data set by the NSC reporting issues. As can be seen, in our sample student loan borrowers without NSC records tend to be slightly older than those with existing NSC records (27.9 versus 27.5 years old), are more likely to be Pell Grant recipients (52.3% versus 45.1%), and are associated with greater average Pell Grant balances ($2,679 versus $2,491). 43 Also, individuals with student debt but no NSC records are significantly less likely to have mortgage debt (40.3% versus 50.8%), credit card debt (88.8% versus 95.5%) or auto debt (75.8% versus 77.7%). With the exception of auto debt holdings (which are, on average, slightly higher for this group), debt holdings of borrowers with no NSC records are lower on balance relative to the student loan borrowers with NSC records. Additionally, student loan borrowers with no NSC records are more likely to become delinquent on their student loan debt after entering repayment (38.2% versus 27.3%), and are also more frequently delinquent on their other debt before they start repaying their student loans (3.0% versus 1.4% for auto debt, 14.2% versus 8.4% for mortgage debt, and 24% versus 13.9% for credit card debt). Finally, the average credit score for this subsample is about 80 points lower. Given the salient determinants of student loan delinquency (described in the Conclusions section) and also consistent with the lower student loan delinquency rate in the NSC subsample (shown in Tables A2 and A3), the existing differences in these indicators point to a possible attenuation bias in our results stemming from the elimination of student loan borrowers with no NSC records from our final estimation sample. The existing differences are, in part, caused by systematic differences in NSC coverage by school type, wherein institutions associated with a riskier credit profile of student loan borrowers (such as private for-profit schools) are underrepresented in the earlier years of the NSC coverage. To address the NSC coverage issues, we proceed in two steps. First, whenever available, we augment the NSC enrollment information with enrollment data from the NSLDS for federal student loan recipients. 44 Second, we develop yearly sample weights designed to correct for the underrepresentation of certain school sectors in the NSC data. Panels A and B in Table A3 show the yearly shares of borrowers entering repayment across school sectors in our NSC sample and the nationally representative FSA data, respectively. 45 For each sector, the weights are constructed as the ratio of these yearly shares in the NSC sample and the FSA data by fiscal year. 46 As seen in the panels, private not-for-profit and for-profit institutions are underrepresented throughout the NSC sample relative to the nationally representative FSA data, though their coverage increases significantly in later years of the NSC sample. The coverage issues are particularly severe prior to fiscal year 1998, leading us to eliminate from the sample individuals who entered repayment for the last time before fiscal year 1998. Related to the aforementioned NSC reporting issues, Table A4 compares completion rates by degree attained between the NSC subsample and the ACS 2007. As demonstrated, the NSC records on educational attainment in our data are incomplete for a number of individuals. In particular, in the NSC sample, 55.1% of individuals with at least some college attendance did not attain any degree, relative to only 36% in the ACS sample. This discrepancy suggests that the dropout rate is artificially inflated in our data set and-to the extent that leaving school without a degree is positively associated with delinquency (shown in the Conclusions section)-is likely to introduce a downward bias in the effect of degree on student loan delinquency. Furthermore, there are systematic differences in the reporting of the highest degree attained between the NSC and the ACS. Namely, in the NSC subsample, 5.3%, 23.1%, and 6.5% of college-goers attained an associate's degree, a bachelor's degree, or master's degree or more, respectively-much lower than the comparable rates of 14%, 35.8%, and 14.2% in the ACS data. The lower rates in the NSC subsample are partly accounted for by the fact that 9.9% of individuals with NSC educational records in our sample have a degree but the type of the degree is unspecified/unknown. We treat such individuals in the regression specifications as a separate category. Overall, the observed inaccuracies in the NSC data coverage are likely to reduce the statistical power of variables related to college completion and degree attainment in our econometric analysis. Note*: For federal student loans. Due to a low number of observations, borrowers entering repayment prior to fiscal year 1998 are dropped from the final sample, as specified in the Data section of this paper. Appendix C"}, {"section_title": "Supplemental Tables", "text": "Summary statistics calculated from data based on less than 30 observations are reported as NA.           Note: 664 borrowers are not reported because the exact highest degree obtained could not be determined. 15 In the credit bureau data, we cannot identify borrowers who entered deferment or forbearance after a school exit. This potentially reduces the observed delinquency rate in our sample, and potentially biases our results if borrowers' decisions to exercise these options are correlated with their characteristics. 16 The credit score used in this analysis is the TU TransRisk AM Score and it ranges from 270 to 900 points. 17 Additional criteria for a FICO score apply. The borrower also has to have at least one undisputed account that has been reported to the credit bureau within the past six months, and there must be no indication that individual(s) associated with the credit record is/are deceased. For more information, see http://www.myfico.com/CreditEducation/questions/requirement-for-fico-score.aspx. Scores developed by other companies, such as the score used in this analysis, may differ slightly in the criteria used to score individuals. 18 Severe derogatory events associated with student loan debt, such as federal student debt defaults, are included in our definition of 120+ days past due delinquency measure. Due to federal law, negative information has historically been removed from the credit file after seven years. 19 Some borrowers have interrupted educational periods, meaning that they enter repayment but later reenroll and continue their education. Our dependent variable is thus defined with respect to the last time when a borrower enters repayment in our sample. 20 The fact that CDR varies by school motivated our decision to cluster at the school level. The significance of our regression estimates is essentially unchanged when standard errors are not clustered. 21 We include an indicator variable that takes a value of one (zero otherwise) for 467 individuals who hold student loan debt when entering repayment, but the balance amount is missing in the data. 22 We are not the first to point this out; see, for example, Dynarski, S. (2015, June 11). \"Student loans and defaults: The facts.\" New York Times. For a profile overview of high-debt borrowers, see Kantrowitz, M. (2012, Aug. 1). \"Who graduates college with six-figure student loan debt?\" http://www.finaid.org/educators/20120801sixfiguredebt.pdf 23 We group degrees into the following categories: dropouts (i.e., those with at least some college but no attained degree), associate's or certificate degree holders, bachelor's degree holders, holders of a master's degree or more, and those with a completed degree for which the degree type is unknown due to NSC reporting issues. College majors are available only for those with completed degrees and we aggregate them into 15 different categories (see Appendix B). Additionally, 138 borrowers with degrees have no major information. Thus, the regression specifications include an indicator variable that takes a value of one (zero otherwise) if the individual has a major of an unknown type. 24 Additionally, we considered an alternative specification where student loan balances were interacted with the degree indicators. Given the low predictive power of these interaction terms, we excluded them from the final analysis. 25 Given the non-causal nature of our analysis, this result does not necessarily imply that pushing dropouts to finish their degrees will help them to repay their debt. 26 Examples include delayed postsecondary enrollment, having an independent status and dependents, being a single parent, working full time, or attending part time. 27 Those with degrees in languages, literatures or visual arts; social sciences; education; legal professions; public administration; liberal arts and sciences; communications and journalism; criminal justice; and personal and culinary services are significantly more likely to become delinquent on their student debt relative to engineering majors, all else equal. 28 For example, if a borrower was last associated with a private four-year, not-for-profit institution, but previously also attended a public two-year school and a for-profit school, the total effect of the borrower's sector attendance decisions on student loan delinquency risk can be calculated by adding up the coefficients on Private Four-year Not-for-profit, Ever Public Two-year, and Ever Private For-profit indicator variables in Table 9. 29 Additionally, we considered an alternative specification where we interacted student loan balances with the indicators for the last school sector attended. Given the low predictive power of these interaction terms, we excluded them from the final analysis. 30 As was the case with dropouts, the positive relationship between delinquency risk and attending a forprofit institution is not necessarily causal. However, for the purpose of identifying characteristics predicting future credit risk, for-profit institution attendance is a relevant variable to consider. 31 For sanctions and benefits for schools with high and low CDRs, respectively, see Section 2.4 of https://ifap.ed.gov/DefaultManagement/guide/attachments/CDRMasterFile.pdf. 32 Credit scores for this group are coded as zero. 33 Given the correlation between lagged credit score and degree completion, some of these factors might be related to borrowers' ability to manage debt due to, for example, lack of financial literacy or income effects. 34 For assumptions, see Notes in Figure 4. Again, this results should not be interpreted as causal. 35 To consider the maximum impact that student loan debt could have on predicting future student loan delinquency risk, we used unweighted results-reported in Column 7-for this exercise. For additional assumptions, see Notes in Figure 5. 36 The predictive power of student loans is the largest at low levels of student loan debt. For example, in the panel to the right of Figure 5, an increase in student loan debt from $1,000 to $10,000 dollars is associated with a 15% increase in the baseline probability of future student loan delinquency (from 6.8% to 7.9%). At higher student loan levels, the contribution of additional $10,000 dollars of student loan debt is much smaller. For example, an increase in student loan debt from $30,000 to $40,000 increases the baseline probability by 1.6% (from 8.4% to 8.5%). 37 Borrowers with loans in deferment or forbearance-other indicators that might point to a troubled status-could also be targeted. 38 As in our final specification, the Pell Grant controls include the binary indicator for Pell Grant recipients as well as the average Pell Grants received. 39 As of 2015:Q1, about 17.5% of borrowers and 31.5% of outstanding FDLP balances were enrolled in income-driven repayment plans (https://studentaid.ed.gov/about/data-center/student/portfolio). These figures include those enrolled in ICR, IBR, and PAYE plans. Interestingly, the enrollment figures indicate that those currently enrolled have higher balances, on average, than the average FDLP loan borrower (about $50,000 versus $28,000), suggesting that a significant number of borrowers taking advantage of these plans are borrowers with high balances. As indicated above, these are not the borrowers that are most frequently associated with delinquencies and defaults. 40 All the merges of individual-level information have been performed by TransUnion LLC in conjunction with the National Student Clearinghouse, the College Board, and the U.S. Department of Education. The merges were based on a combination of Social Security number, date of birth, and individuals' first and last names. None of the variables used to merge individuals across sources is available in our data set. 41 The ACS estimate is based on a cohort of individuals between ages 25 to 34 in 2007. In our sample, individuals were between ages 26 to 34 in 2007. 42 An additional reason an enrollment record may not be present in our data is due to data truncation related to the 2007 NSC data collection cutoff that is specific to our data set. However, this channel has no effect on comparability of the college-going rate in the NSC sample with the ACS estimate. 43 The average Pell Grant balance is calculated as the total amount of Pell Grants received divided by the number of disbursements. 44 The NSLDS contains information on enrollment periods that have been funded by federal student loans. 45 The FSA data are available for download at: http://www.ifap.ed.gov/DefaultManagement/press/. Unfortunately, the FSA data do not account for those borrowers entering repayment who exclusively hold private student loan debt. However, according to our data, less than 2% of borrowers hold only private student loan debt and no federal student loans by the time they enter their last repayment period observed in our sample. 46 Fiscal year is defined as the period between October 1 of a given year and September 30 of the following year."}]