[{"section_title": "Abstract", "text": "Observational studies show reduced incidence of Alzheimer dementia (AD) in users of nonsteroidal anti-inflammatory drugs (NSAIDs). One hypothesis holds that the subset of NSAIDs known as selective A␤ 42 -lowering agents (SALAs) is responsible for this apparent reduction in AD risk.\nWe pooled individual-level data from six prospective studies to obtain a sufficient sample to examine AD risk in users of SALA vs non-SALA NSAIDs.\nResults: Of 13,499 initially dementia-free participants (70,863 person-years), 820 developed incident AD. Users of NSAIDs (29.6%) showed reduced risk of AD (adjusted hazard ratio [aHR] 0.77, 95% CI 0.65-0.91). The point estimates were similar for SALAs (aHR 0.87, CI 0.72-1.04) and non-SALAs (aHR 0.75, CI 0.56 -1.01). Because 573 NSAID users (14.5%) reported taking both a SALA and non-SALA, we examined their use alone and in combination. Resulting aHRs were 0.82 (CI 0.67-0.99) for SALA only, 0.60 (CI 0.40 -0.90) for non-SALA only, and 0.87 (CI 0.57-1.33) for both NSAIDs (Wald test for differences, p ϭ 0.32). The 40.7% of participants who used aspirin also showed reduced risk of AD, even when they used no other NSAIDs (aHR 0.78, CI 0.66 -0.92). By contrast, there was no association with use of acetaminophen (aHR 0.93, CI 0.76 -1.13).\nIn this pooled dataset, nonsteroidal anti-inflammatory drug (NSAID) use reduced the risk of Alzheimer dementia (AD). However, there was no apparent advantage in AD risk reduction for the subset of NSAIDs shown to selectively lower A␤ 42 , suggesting that all conventional NSAIDs including aspirin have a similar protective effect in humans. Neurology ® 2008;70:2291-2298 GLOSSARY AD ϭ Alzheimer dementia; aHR ϭ adjusted hazard ratio; BLSA ϭ Baltimore Longitudinal Study of Aging; CCS ϭ Cache County Study; CHS ϭ Cardiovascular Health Study; COX ϭ cyclooxygenases; CSHA ϭ Canadian Study of Health and Aging; FHS ϭ Framingham Heart Study; IRB ϭ institutional review board; MoVIES ϭ Monongahela Valley Independent Elders Study; NSAID ϭ nonsteroidal anti-inflammatory drug; OTC ϭ over-the-counter; SALA ϭ selective A␤ 42 -lowering agent."}, {"section_title": "", "text": "delay or prevent the onset of Alzheimer dementia (AD), especially with prolonged use. 3, 4, 7 In contrast, results from randomized trials of NSAIDs for prevention or treatment of AD or mild cognitive impairment have been discouraging. [8] [9] [10] Laboratory experiments suggest that NSAIDs can reduce Alzheimer pathology by suppressing microglial activation 11, 12 or deposition of amyloid-beta peptide (A␤), 11, 13 possibly through inhibition of cyclooxygenases (COX). 14 Alternatively, a subset of NSAIDs appear to modify ␥-secretase cleavage away from the more fibrillogenic A␤ 42 species toward peptides such as A␤ 40 and A␤ 38 . 15, 16 These findings have provoked speculation that this ␥-secretase effect is key to NSAIDs' apparent ability to protect against AD, with the subset of NSAIDs known as selective A␤ 42 lowering agents (SALAs) being responsible for the reduced AD risk with NSAIDs overall. Accordingly, some have proposed that the lack of benefit in NSAID clinical trials reflects their choice of the \"wrong\" non-SALA compounds 17 -this has motivated the initiation of new trials of the non-NSAID SALA tarenflurbil. 18 Only two epidemiologic studies have investigated the differential association of SALAs vs non-SALAs and AD. The Rotterdam Study found that SALAs were associated with a greater reduction in AD incidence than non-SALAs 19 while the Cardiovascular Health Study found no such difference. 20 To investigate these conflicting findings and to overcome the limitation of small sample size in individual studies, we pooled individual-level data from six cohort studies to clarify whether SALA NSAIDs appear to confer preferential protection against AD.\nMETHODS Settings, subjects, and design. We contacted investigators of prospective cohort studies with specified study inclusion criteria of 1) diagnoses of incident AD made using clinical research criteria, 21 2) systematic data on individual over-the-counter (OTC) and prescription NSAIDs, and 3) exposure measurement(s) collected prior to dementia diagnosis. The six participating studies were the Baltimore Longitudinal Study of Aging (BLSA), the Cache County Study (CCS), the Canadian Study of Health and Aging (CSHA), the Cardiovas-cular Health Study (CHS), the Framingham Heart Study (FHS), and the Monongahela Valley Independent Elders Study (MoVIES). [22] [23] [24] [25] [26] [27] [28] Each study was approved by appropriate institutional review boards (IRBs) or research ethics boards, and the present pooled analysis was approved by the IRB at the Johns Hopkins Bloomberg School of Public Health. Of the seven other study investigators who were contacted but did not participate, one stated that their design was not prospective, two did not systematically collect data on OTC NSAIDs, and four declined participation.\nOutcome and exposure measurement. All studies used a primary outcome measure of incident probable or possible AD, diagnosed using National Institute of Neurological and Communicative Disorders and Stroke-Alzheimer's Disease and Related Disorders Association criteria 21 applied by consensus conferences of expert clinicians after review of extensive data that typically included neurocognitive assessments, detailed clinical evaluations, neuroimaging, and laboratory tests. Use of aspirin, acetaminophen, and NSAIDs was assessed by self-report. We analyzed acetaminophen as a \"control\" medication because it is often used for indications similar to those for NSAIDs (e.g., pain management) but has a different mechanism of action. NSAIDs were categorized as SALAs if found to lower A␤ 42 compared to A␤ 40 using in vitro or in vivo models by Eriksen and colleagues, 16 or non-SALAs if they did not show selective A␤ 42 lowering. 16 SALAs included diclofenac, diflunisal, fenoprofen, flurbiprofen, ibuprofen, indomethacin, meclofenamate, piroxicam, and sulindac. Non-SALAs included celecoxib, etodolac, ketoprofen, ketorolac, mefanamic acid, nabumetone, naproxen, and phenylbutazone. A few participants had reported use of NSAIDs not characterized by Eriksen et al., including oxaprozin, rofecoxib, tiaprofen, and tolmetin. We considered these agents unclassifiable. Dose information was not consistently available and could not be investigated."}, {"section_title": "Statistical analyses.", "text": "We compared baseline demographic characteristics of NSAID user groups using 2 tests. The relationship between NSAIDs and AD was analyzed using two approaches, a pooled participant analysis and a pooled study analysis, to test the robustness of the findings. For the pooled participant analysis we pooled individual-level study data and used extended Cox hazards regression 29 to obtain crude and adjusted hazard ratios (aHRs) with 95% CIs for the association between incident AD and three medications groups: non-aspirin NSAIDs, aspirin, and acetaminophen. In turn, we examined separate models with SALA or non-SALA NSAIDs. All models used chronological age at observation as the time axis (to provide tight control of potential confounding by age), and medication use was modeled as ever-used vs never-used as a time-dependent covariate. Thus, a participant who entered the analysis as a \"never user\" could later switch to an \"ever user\" if NSAID use was initiated during follow-up. To account for potential variability in baseline hazards between studies we stratified all analyses by study. We further adjusted by sex, education, and age at first visit (to additionally control for possible cohort effects). In addition, we used self-report of arthritis as a covariate in the model looking at any NSAID use. Analyses were performed using SAS 8.2. 30 The pooled study analysis obtained separate aHRs for each study which were then pooled using standard inverse-variance weighted fixed-and random-effects meta-analytic models. Because the fixed-and random-effects estimates did not differ substantively, we report only results from fixedeffects analyses. The pooled study analysis allowed for further examination of heterogeneity and degree of influence of each study. We used the Q-statistic to assess heterogeneity and conducted influence analyses by removing one study at a time and re-calculating the aHRs and Q-statistics without that study. Analyses were performed using the meta program in Stata 8.0. 31 Table 1 Qualitative analysis of studies Association between AD and NSAID, aspirin, or acetaminophen use. Table 3 Model 1 shows the results from the pooled participant analysis with any NSAID use. Risk of AD was reduced among those who reported use of any NSAIDs (HR 0.75, CI 0.64 -0.89; aHR 0.77, CI 0.65-0.91). Results were similar for the three previously published investigations (aHR 0.69, CI 0.52-0.91) and the three unpublished studies (aHR 0.83, CI 0.67-1.03). Controlling for arthritis mitigated the observed association between NSAIDs and AD slightly (aHR 0.83, CI 0.69 -0.99) but did not change the overall conclusion. As shown in table 3 Model 2, there was an association between aspirin use and AD, even in those who used aspirin but no NSAIDs (aHR 0.78, CI 0.66 -0.92). Table 3 Model 3 showed no significant association between acetaminophen use and AD (aHR 0.93, CI 0.76 -1.13). Figure 1 depicts the results from the pooled study analysis. There was an inverse association Table 2 Baseline characteristics by NSAID use *For these counts, participants were considered an NSAID user if they reported exposure at any time during follow-up. † 2 p values all Ͻ0.001; results for sex and education did not change when adjusted for age in logistic regression models. NSAID ϭ non-steroidal anti-inflammatory drug. Each model shows the relationship between a medication classification and the risk of incident Alzheimer dementia (AD). All models are stratified by study and adjusted for age, sex, and education. The variables shown within each model are mutually exclusive categorizations of the medication exposure of interest. *Data on aspirin use missing for 13 participants. †Data on acetaminophen use missing for 13 participants. aHR ϭ adjusted hazard ratio; PY ϭ person-years; NSAID ϭ nonsteroidal anti-inflammatory drug.\nbetween AD and NSAID use in five of the studies (BLSA, CCS, CSHA, CHS, FHS) but not in one other (MoVIES). Although the analysis gave a combined aHR of 0.76 (CI 0.64 -0.91), the Q-statistic indicated heterogeneity among the study results (Q 5 10.92, p ϭ 0.05). As expected, influence analysis suggested that the heterogeneity was attributable to results from MoVIES (table e-2). Removing MoVIES changed the aHR to 0.66 (CI 0.54 -0.80), with the Q-statistic no longer significant."}, {"section_title": "Association between AD and NSAID categorized by a␤ 42 -lowering capability.", "text": "The results from the pooled participant analysis with NSAIDs categorized as SALAs and non-SALAs showed similar aHRs for the two NSAID groups (SALA aHR 0.87, CI 0.72-1.04; non-SALA aHR 0.75, CI 0.56 -1.01). These analyses included terms in the model to control simultaneously for the use of the other NSAID type. Figure 2 depicts the results for a corresponding model in the pooled study analysis. The combined aHR for use of any SALA (0.85, CI 0.70 -1.02) was again similar to that for any non-SALA (0.76, CI 0.57-1.03). Heterogeneity and influence analyses suggested that MoVIES contributed to the statistical heterogeneity among the studies in the SALA group (Q 5 There was no meaningful difference between the aHR for use of SALAs alone (0.82, CI 0.67-0.99), non-SALAs alone (0.60, CI 0.40 -0.90), or both (0.87, CI 0.57-1.33) (Wald p ϭ 0.32). What appears in table 4 Models 2 and 3 to be a somewhat stronger inverse association in the pooled participant analyses between AD and use of the most common non-SALA, naproxen, and the most common SALA, ibuprofen, was partially mitigated when we removed MoVIES. Doing so resulted in an aHR of 0.75 (CI 0.58 -0.98) for ibuprofen and 0.52 (CI 0.32-0.83) for naproxen. DISCUSSION Results from this pooled analysis of six prospective studies were consistent with published data as they suggested a 23% reduction in AD incidence with any NSAID use. Three of the six studies (BLSA, CMS, and CSHA) had previously published on the association between NSAIDs and AD and had noted a reduction in risk. 3, 4, 6 Two of the seven contacted studies that declined to participate had also published similarly on the NSAID-AD relationship. 5, 7 Although the results from the CHS, FHS, and MoVIES had not been published prior to our analyses, we found that two of these also supported the notion that NSAIDs reduce the risk of AD. Thus, we saw little evidence of differences between those studies that had been published and other unpublished work.\nOur pooled analyses showed no suggestion of greater risk reduction for those NSAIDs shown in laboratory experiments to lower A␤ 42 (SALAs) vs others that do not. In addition, use of aspirin Forest plot of nonsteroidal anti-inflammatory drug use and Alzheimer dementia Black squares and horizontal lines represent each study's risk estimate and 95% CI. The size of each square is indicative of the weight each study contributed to the meta-analysis. *aHRs result from a model adjusted for age, sex, and education. †Data analyzed using pooled study fixed-effects meta-analysis. NSAID ϭ nonsteroidal anti-inflammatory drug; aHR ϭ adjusted hazard ratio; AD ϭ incident Alzheimer dementia."}, {"section_title": "Figure 2", "text": "Forest plot of nonsteroidal anti-inflammatory drug use and Alzheimer dementia by A␤ 42 -lowering capability\nBlack squares and horizontal lines represent each study's risk estimate and 95% CI. The size of each square is indicative of the weight each study contributed to the meta-analysis. *The aHRs result from one model including variables for any SALA (comparing risk among participants who took a SALA during follow-up vs those who did not) and any non-SALA (comparing risk among participants who took a non-SALA during follow-up vs those who did not), as well as adjusting for age, sex, and education. †Data analyzed using pooled study fixed-effects meta-analysis. aHR ϭ adjusted hazard ratio; AD ϭ incident Alzheimer dementia; SALA ϭ selective A␤42-lowering agent.\n(which does not reduce production of A␤ 42 ), but not acetaminophen, was associated with a reduced risk of AD. Aspirin is a non-SALA but, unlike the other agents, it inhibits COX by irreversibly acetylating the enzyme's binding site. As a result, any new COX activity must be mediated by newly synthesized enzyme. 32 Five prospective studies 3,4,6,33 have reported on aspirin use and all but one 7 have shown a modest reduction in risk of AD. Our results were consistent with previous findings of a reduced risk in aspirin users, and the large sample size enabled us to show that the risk reduction was apparent in those who used aspirin alone, without other NSAIDs. Two individual studies have previously reported on the association of SALAs and non-SALAs with the risk of AD. Data from one of these, the CHS, 20 were included here. Those results were, as expected, consistent with the present findings indicating no advantage in AD risk reduction with SALAs. By contrast, results reported at a scientific meeting from the Rotterdam Study suggested stronger protection with SALAs used for 2 years or more, as compared with non-SALAs. 19 Interestingly, when we included the risk estimates from the Rotterdam group (reported in their abstract) in our pooled study analysis, we saw no change in the overall results, nor did this addition introduce any suggestion of statistical heterogeneity (data not shown).\nOur findings appear to have some implications for the mechanism by which NSAIDs may reduce risk of AD. A current hypothesis holds that this effect is mediated by a subset of agents that modify ␥-secretase activity and reduce production and deposition of A␤ 42. 34,35 If that hypothesis were correct, then only SALA NSAIDs should reduce risk of AD. Our results are not in accord with this prediction of the hypothesis.\nA few randomized trials of NSAIDs in AD have shown a weak suggestion of benefit, 18,36 but others have been null or negative. 8, 9, 37 These trials have tested both SALAs 18, 36, 38 and non-SALAs. 8, 39 The only primary prevention trial, the AD Antiinflammatory Prevention Trial, tested naproxen and celecoxib, both non-SALAs, and failed to show efficacy of either compound, at least within the first years after initiation of treatments. 10 The present results suggest that this discrepancy between the observational and randomized studies does not reflect the trials' choice of NSAIDs, as has been suggested, 17 but may instead be the result of other factors such as timing and duration of exposure, or in other systematic differences in participants of epidemiologic studies vs clinical trials. 40 As with all observational studies, this study faces methodologic limitations. These include differential recall error by those who may be in the prodromal stages of AD, and confounding by factors that have been inadequately controlled such as socioeconomic class or medical conditions such as arthritis that may be \"indications\" for NSAID use but might also be associated with development of AD. Our null findings with acetaminophen may offer some reassurance on these concerns; however, this question is best tested in randomized prevention trials.\nThere were differences in the number of SALA and non-SALA users, and we may not have had adequate power to detect differences in AD risk reduction between the two. These analyses may also have been vulnerable to confounding by \"indication\" or other systematic differences among individuals who used SALAs vs non-SALAs. We did observe some differences in the age and education between the two groups, but we controlled for these in the analyses. We also note that this is the largest sample used to investigate the SALA vs non-SALA issue.\nTo safeguard against the vagaries of metaanalyses, we used two methods to pool data with results that were reassuringly similar. The pooling of individual-level data provides a powerful analytic design, but combining individual data from studies with substantive design differences and participant characteristics can produce mis- leading results. 41 In this instance, a qualitative assessment of the study characteristics suggested that the design features were homogeneous enough to allow pooling of the data. The main source of heterogeneity among the studies was in detection of exposure assessment: three studies assessed current use, 6, 28, 42 one assessed current use plus use over the previous 2 weeks, 20 one assessed use over the prior 2 years, 3 and one defined use as current or former use of four or more doses per week for 1 month or longer. 4 In each of these studies it is possible, but not certain, that recent or current use also serves to indicate prior use. Predictably, the different criteria for \"use\" resulted in varying baseline rates of NSAID use, but they did not appear to affect the relationship between exposure and outcome, which was itself measured with consistent results. One study, the MoVIES, seemed to produce somewhat divergent results, especially for SALAs. We note that this is one of the older studies included, the participants were drawn from a somewhat lower socioeconomic region, and most of the reported exposures were to ibuprofen (a SALA). One may conjecture that individuals with lesser education and financial resources were less likely to purchase and use their NSAIDs consistently, thus reducing their overall exposure, but we lacked data on adherence or frequency of use needed to test this idea.\nBecause of concerns about potential cardiotoxicity 43 and other side effects of NSAIDs 44 as well as discouraging results from ADAPT, enthusiasm for NSAIDs as a potential preventative for AD has diminished. Nevertheless, it is notable that our analysis of three previously unpublished studies suggests in two instances that NSAIDs or other agents with similar activities may protect against AD. A better understanding of these effects will be important, even if the current generation of drugs has limitations. Given current hypotheses about AD pathogenesis, the A␤lowering hypothesis has provided an attractive alternate interpretation of the accumulated observational data on NSAIDs and AD, and this hypothesis will be further tested by a recently completed pivotal trial of tarenflurbil (the r-enantiomer of flurbiprofen), ostensibly having no COX-inhibiting activity but still modifying ␥-secretase activity similarly to SALAs. There is much to learn about the role of NSAIDs in the pathogenesis of AD, including whether the putative neuroprotective effects of NSAIDs depend upon the timing, amount, or duration of their use or on particular characteristics of the subgroups of people who take them."}]