[{"section_title": "Background", "text": "Nearly 20% of the U.S. population resides in a nonmetropolitan or rural area [1], putting estimates of the number of rural cancer survivors at over 3.1 million [2]. Rural residents have an 8% higher cancer mortality rate than those in urban areas and experience poorer survivorship outcomes post-treatment [3]. When compared with cancer survivors residing in urban areas, rural cancer survivors are more likely to report two or more non-cancer comorbidities, fair or poor health, poor mental health, increased psychological distress, and unemployment and financial strain due to health problems [4]. Therefore, addressing rural health disparities across the cancer control continuum has emerged as an important public health priority, as supported by recent position statements from the American Association for Cancer Research, the American Cancer Society, the American Society of Clinical Oncology, and the National Cancer Institute calling for an investment in rural cancer control [3,5]. Disparities in health behaviors, such as physical activity (PA), may partially explain cancer health disparities in rural cancer survivors compared with urban cancer survivors. PA reduces the risk of cancer recurrence as well as the risk of developing comorbidities in cancer survivors [6][7][8][9]. PA can also improve physical and psychological health and well-being [6-8, 10, 11]. Thus, the American College of Sports Medicine (ACSM) recommends that cancer survivors avoid physical inactivity and exercise ≥150 minutes per week and include strength training exercises on at least two days per week [8,12]. However, previous studies have found that rural cancer survivors are less likely to meet cancer-specific PA recommendations than urban cancer survivors [4,13,14]. Despite the overwhelming evidence supporting PA post-cancer diagnosis, more than half (50.7%) of rural cancer survivors report being physically inactive, or not doing any leisure-time PA lasting at least 10 minutes, compared to only 38.7% of urban cancer survivors [4]. Few studies have explored rural-urban differences in PA and self-rated health in cancer survivors. In a nationally representative sample of rural and urban cancer survivors in the U.S., Weaver and colleagues [4] reported that 30.5% of their sample was insufficiently active. Rogers and colleagues [15] found 27.0% of rural cancer survivors to be insufficiently active in their state cancer registrybased sample in Illinois, and Vallance and colleagues [16] reported that 65.3% were inactive in their state-based sample of rural and small town cancer survivors in Alberta, Canada. In an effort to better design PA interventions for rural cancer survivors and to implement interventions within rural community settings, it is important to examine rural-urban differences in meeting PA recommendations and better understand which factors may be driving disparities in rural cancer survivors. Thus, the purposes of this study were to explore 1) rural-urban differences in meeting aerobic and muscle-strengthening PA recommendations and health status in cancer survivors in central Pennsylvania and 2) associations between PA and health status in rural and urban cancer survivors. This study is unique from others in that our study 1) included a representative sample of rural and urban cancer survivors in Pennsylvania, which is home to the fifth largest cancer survivor population in the U.S. [2]; 2) examined differences in meeting both aerobic and muscle-strengthening physical activity whereas others only explored aerobic activity; and 3) explored associations between meeting individual recommendations and physical and mental health status."}, {"section_title": "Methods", "text": ""}, {"section_title": "Design, Sampling and Procedures", "text": "We conducted a cross-sectional study with a population-based sample of cancer survivors in Pennsylvania, home to over 700,000 cancer survivors and the fifth largest cancer survivor population in the U.S. [2]. The Pennsylvania Cancer Registry was used to identify eligible and representative cancer survivors who 1) were ≥20 years of age, 2) had received a breast, lung, colorectal, prostate, or gynecologic (cervical, endometrial, ovarian or uterine) cancer diagnosis between January 1, 2015 and December 31, 2016, and 3) were able to read, speak and write in English and respond to mailed surveys. A random sample of 2500 cancer survivors from 28 central Pennsylvania counties, 500 from each of five cancer sites, were mailed surveys. Of those 28 counties, 18 are categorized as urban/metropolitan and 10 as rural/nonmetropolitan using the 2013 Rural/Urban Continuum Codes (RUCC) [17]. Participants in urban and rural counties were sampled relative to population size, and participants whose registry data were missing age, race/ethnicity, or zip code were excluded from this study. A National Death Index review was conducted before each mailing to avoid sending the survey to the homes of deceased cancer survivors. Figure 1 shows the flow of participants throughout the study."}, {"section_title": "Eligible participants were mailed questionnaires based on questions included in the Behavioral Risk", "text": "Factor Surveillance System (BRFSS) from April-July 2017. Participants were initially sent a study recruitment letter with a brief description of the study and were instructed to opt-in or opt-out of the study by contacting the study team by phone, mail or email. After two weeks, those who did not optout were mailed a consent note and questionnaires with instructions to return in a self-addressed stamped envelope (1 st mailing). Four weeks later, those who had not returned completed questionnaires were re-sent materials (2 nd mailing). Those who had not returned their questionnaires four weeks after the second mailing were sent an additional, identical third mailing. Participants who opted-out by phone, mail or email were no longer contacted. Participants who opted-in after the initial recruitment letter or returned completed questionnaires provided implied consent to participate in the study. All study procedures and materials were reviewed and approved by the Penn State College of Medicine's Institutional Review Board, and all participants provided informed implied consent prior to participation."}, {"section_title": "Measures", "text": ""}, {"section_title": "Demographics and Rural-Urban Residence", "text": "Age, gender, cancer site and county of residence at diagnosis were extracted from the Pennsylvania Cancer Registry. Additional demographic information, including education and annual household income, was collected via self-report. Rural-urban residence was based on county of residence at diagnosis, to which we applied the 2013 RUCC. The RUCC distinguish counties by their population size, degree of urbanization, and how adjacent they are to a metro area [17]. Each county in the U.S. is assigned one of nine codes, allowing for the assessment of trends related to population density and metropolitan influence. Urban counties are designated by codes 1-3 and include counties in metro areas with populations fewer than 250,000 to over one million. Nonmetro and rural counties are designated by codes 4-9 and include counties in nonmetro areas that may or may not be adjacent to a metro area with populations ranging from less than 2,500 to 20,000 or more [17]. [17]. Physical Activity Self-reported leisure-time PA was assessed using questions based on the 2015 edition of the BRFSS [18]. Participants were asked if they participated in any PA or exercises during the past month. Those who responded 'yes' were asked to specify the type of activity, frequency per week or month, and duration. Participants were given the option to provide information for up to two activities or exercises and were asked to report how many times per week of month they performed musclestrengthening activities [18]. Activities or exercises were coded and categorized as aerobic and moderate-or vigorous-intensity [19,20]. Using the BRFSS scoring protocol [20] "}, {"section_title": "Health Status", "text": "Health status was assessed using three items from the 2015 edition of the BRFSS [18]. Participants reported their general health status using a five-point Likert scale ranging from excellent to poor. Those who reported 'Poor' or 'Fair' were categorized as having poor health compared to those who reported their health as good, or reported their health as 'Excellent,' 'Very Good,' or 'Good.' Additionally, pParticipants were asked to report the number of days within the past 30 days that their physical and mental health were not good and the number of days that their poor physical and/or mental health kept them from their usual activities. Participants who reported <7 days on which they experienced poor physical or mental health or <7 days on which their poor physical/mental health impeded their usual activities (e.g., self-care, work, recreation) were categorized as having good health compared to those who reported ≥7 unhealthy days."}, {"section_title": "Statistical Analysis", "text": "Analyses were conducted in SPSS Version 24.0 (IBM SPSS Statistics, Armonk, NY), and statistical significance was set at p<.05. Independent samples t-tests and chi-square tests were used to assess rural-urban differences in demographics. We conducted a series of logistic regression analyses to assess rural-urban differences in meeting PA recommendations (neither vs. aerobic, musclestrengthening, or both), adjusting for cancer type, gender, and income. Lastly, logistic regression models were used to explore the associations between meeting PA recommendations and income was less than $35,000 were half as likely to meet aerobic PA recommendations (OR=0.5, 95% CI: 0.3-0.9) than those who reported high income (≥$75,000 per year). There were no significant associations between rural-urban residence and physical or mental health status."}, {"section_title": "Associations between Physical Activity and Health Status", "text": "Associations between meeting PA recommendations and health status, adjusted for rurality, cancer type, gender, and income, are shown in Table 3. Fully adjusted models (Model 3) showed that cancer survivors who reported meeting aerobic PA recommendations had nearly twice as high odds of reporting good physical health (OR=1.9, 95% CI: 1.0-3.6) and odds 2.3 times higher to report good physical and mental health (OR=2.3, 95% CI: 1.1-4.5) than cancer survivors who met neither aerobic nor muscle-strengthening recommendations. Additionally, lung cancer survivors (OR=0.3, 95% CI: 0.1-0.9) and cancer survivors reporting an annual household income between $35,000 and $74,999 (OR=0.5, 95% CI: 0.3-1.0) were less likely to report good physical health than those with other cancer types and high income, respectively. Rural-urban residence did not significantly moderate the effect of PA on health status in logistic regression models."}, {"section_title": "Discussion", "text": "Although rural-urban differences in PA and health status have been described, previous studies did not examine differences in meeting aerobic and muscle-strengthening PA recommendations. This study extends those findings to highlight disparities in meeting aerobic and muscle-strengthening PA recommendations for cancer survivors and found that urban cancer survivors were two times more likely to meet aerobic PA recommendations than rural cancer survivors. Additionally, cancer survivors who reported meeting aerobic PA recommendations were more likely to report their health status as good. Given that rural cancer survivors are less likely to meet PA recommendations than their urban counterparts, these findings underscore the need for interventions to increase PA and improve health outcomes in rural cancer survivors in an effort to reduce cancer health disparities in this population. Similar to previous studies, the majority of cancer survivors in this study reported not meeting PA recommendations [4,15,16]. We found the prevalence of leisure-time PA to be lower and the prevalence of physical inactivity to be higher among rural cancer survivors than urban cancer survivors in our study and similar to what has been previously reported in the general cancer survivor population in the U.S. [4,22]. Further exploration of the likelihood of meeting aerobic and musclestrengthening PA recommendations showed that rural cancer survivors were less likely to meet aerobic PA recommendations than urban cancer survivors, but not muscle-strengthening guidelines. This suggests that differences in aerobic PA may drive rural-urban differences in leisure-time PA in cancer survivors that have been reported previously and may help inform future PA promotion efforts in rural cancer survivors. There has been a recent focus on distance-and home-based physical activity interventions in rural populations, which typically focus on exercises that can be easily implemented within the home, such as strength-training exercises [23]. Future interventions should test hybrid approaches to both reduce physical inactivity and increase aerobic PA, which may be a valuable starting point toward more comprehensive PA adoption and maintenance in rural cancer survivors. Although we found no significant difference between rural and urban cancer survivors for health status, previous studies have shown substantial rural-urban differences in health status outcomes. A small rural sample size may have limited our power to detect statistically significant differences and limited our ability to complete stratified analyses by cancer type or socioeconomic status, which may help explain disparities in PA and health status [3,24,25]. However, it is important to highlight that 24.3% and 18.9% of cancer survivors in this study reported their physical and mental health, respectively, as 'not good' for one week or more in the past month, regardless of rural-urban residence. Additionally, nearly one-fifth (19.6%) of rural cancer survivors reported that their poor physical or mental health impeded their usual activities for one week or more in the past month. These values are substantially higher than those previously reported by rural adults with no history of cancer and are concerning [26,27]. Consistent with other studies among cancer survivors, we found a significant association between PA and health status [4,[28][29][30][31][32][33]. Our findings extend this work and showed that cancer survivors who reported meeting both aerobic and muscle-strengthening PA recommendations were more than twice as likely to report being in good health than those who did not meet PA recommendations. These findings further demonstrate the individual and complementary roles these activities play in improving health-related quality of life in rural and urban cancer survivors, and suggest that PA intensity and type are important for achieving both physical and mental health [28,30,32]. This study population was drawn from a representative sample of rural and urban cancer survivors in central Pennsylvania. A significant strength of this study is the inclusion of both aerobic and musclestrengthening PA recommendations, consistent with the ACSM exercise guidelines for cancer survivors [12,21]. Previous studies have solely categorized cancer survivors as sufficiently active, insufficiently active, or inactive [4], which may not accurately capture rural-urban differences in meeting components of the PA guidelines. Although this study makes a significant contribution to the existing literature on rural-urban differences in cancer survivors, it is not without limitations. First, this study included a small sample of cancer survivors who were classified as rural/non-metro using the 2013 RUCC codes [17]. Imbalances between groups may have impacted findings and limited our ability to draw conclusions about differences between rural and urban cancer survivors. However, post hoc sample size calculations demonstrated sufficient power (83.3%) to detect an odds ratio of 2.6. Further research is needed to explore additional differences in physical activity and health status by rurality and cancer type. Additionally, although the RUCC codes account for population density and metro influence, they are assigned at the county-level and do not account for commuting areas or medical service areas, which may more accurately capture the heterogeneity in rural areas in Pennsylvania. Alternative definitions of rural, such as the Rural-Urban Commuting Area (RUCA) Codes [34] and the Center for Rural Pennsylvania's definition based on Pennsylvania-specific population density [35], were considered for this study. However, the RUCC codes have been used previously to explore rural-urban differences in cancer survivors and the general U.S. population [1,4,26], lending to consistency and allowing for comparisons to previous studies. Additionally, the use of the RUCA codes did not change study findings. Thus, future studies should explore alternative definitions of rural/non-metro and potentially attempt to oversample rural cancer survivors, which may impact subsample sizes researchers should choose the most pragmatic measure to facilitate intervention implementation. Second, we relied on self-report PA and health status data. Although the over-reporting of PA is welldocumented [36][37][38], there is no evidence to date documenting reporting differences between rural and urban cancer survivors. We relied on previously validated and reliable measures from the BRFSS to further reduce threats to internal validity and allow for comparisons with previous studies. However, these measures do not capture other types of PA, such as occupational or transportationrelated activities, and may not be representative of the types of PA rural cancer survivors do. Future studies should include additional measures to assess PA done outside of leisure-time and using accelerometry should utilize wearable devices and sensors, such as accelerometers, to more objectively assess physical activity. Third, this study used a cross-sectional design to explore associations between PA and health status. Therefore, we cannot determine directionality or causal pathways and whether PA leads to improvements in health status or vice versa. Lastly, this study included a state cancer registry-based sample of cancer survivors. Although this is the first study to our knowledge to report on PA and health status of cancer survivors in Pennsylvania, the use of a state cancer registry-based sample limits the generalizability of findings to rural and urban cancer survivors in other geographic regions, such as frontier populations. Additionally, this study was limited to breast, lung, colorectal, prostate, and gynecological cancer survivors at least 20 years of age or older, limiting the generalizability of findings to other cancer types and age groups."}, {"section_title": "Conclusions", "text": "This study is both innovative and timely, given the recent focus on rural cancer control by the American Association for Cancer Research, the American Cancer Society, the American Society of Clinical Oncology, and the National Cancer Institute [3,5]. Results from this study contribute to the growing literature documenting rural-urban health disparities in cancer survivors and document persistent rural-urban differences in the likelihood of meeting PA recommendations in cancer survivors. Given the strong association between PA and health status in cancer survivors, these findings suggest the need for behavior change interventions to increase PA in rural cancer survivors, which may contribute to improvements in health-related quality of life and aid efforts to reduce cancer health disparities. Additional research is needed to further explore rural cancer survivors' Figures  Figure 1 Flow of participants throughout the study"}]