[{"section_title": "", "text": ".3. Wetland map classes included in Zone 58 in addition to the NLCD 2001 legend. ............................................................................................................................69 Table 3.2. Major Categories of land cover change between 1992 and 2001 in the Onslow Bight. ................................................................................................................107 Table 3.3. Percent land cover change between Ecological Systems between 1992 and2001. .............................................................................................................................108 Table 4.5. Representation of the Ecological Systems of the Onslow Bight in the Southeast ......................................................................................................................145 Table 4.6. Vertebrate species included in the North Carolina State Wildlife Action Plan but not modeled by Southeast GAP. .............................................................................146 Table 4.7. Partners in Flight priority bird species of the Onslow Bight......................... 147 Table 4.8. Land cover scorecard.................................................................................. 148 x                           ...............................................................................................164 Appendix 3.1 Land cover map units for the Onslow Bight area. ...................................165 Appendix 4.1. Model parameters specific to the species distribution models in this study."}, {"section_title": "LIST OF FIGURES", "text": ". ...............................................................................................................................171  Decades after the international community first realized its magnitude, the decline in global biodiversity continues. The number of imperiled species is increasing and the acreage of degraded natural systems continues to rise. During the past twenty years the National Gap Analysis Program (GAP) has been working to provide data and analyses to help guide proactive conservation and management. Based on the assumption that the most effective time to manage for a species is before it becomes imperiled, GAP has been working with partners to develop a framework for conservation of all vertebrate species and the natural systems upon which they depend. My goal in this dissertation was to explore in depth the methods and analyses that can be employed to monitor natural systems and habitats through time. Specifically, I wanted to test the current approaches for land cover mapping and change detection and to use the results of that work in a conservation assessment that could be used by a variety of natural resource management agencies. Chapter one represents a review of the current literature with respect to vegetation mapping in the United States. It details a variety of approaches that are being used and includes a discussion of the national classification systems (National Vegetation Classification System, Ecological Systems Classification) currently in use. Chapter two details the mapping of vegetation of the Onslow Bight of NC. I used Landsat TM satellite imagery and a combination of ancillary datasets to map the Ecological Systems of the area. The change detection described in Chapter three allowed the creation of a two date time series (1992 and 2001) for the Ecological Systems of Onslow Bight. In chapter four I integrated the results of the land cover mapping and the change detection with datasets from the Gap Analysis Program in a conservation assessment. In that assessment we focused on two natural resource agencies, the North Carolina Wildlife Resources Commission (WRC) and Partners in Flight (PIF), to test the approach to conservation assessment and monitoring. That assessment involved the mapping of predicted vertebrate distributions for 139 species. We used lists of priority species from the two groups, the WRC State Wildlife Action Plan (123 species) and the PIF's list of priority avian species (38 species with 18 unique to this list) for the Southeastern Coastal Plain Bird Conservation Region. In chapter four I also summarized the changes in the extent of the Ecological Systems of the Onslow Bight, as well as the predicted distributions for the 123 species for 1992 and 2001. Finally, we compared the areas predicted by the models to be rich in priority species against the existing conservation network and a series of newly acquired easements and determined the level of overlap. This comparison formed the basis for creating \"scorecards\" characterizing the gains and losses for both Ecological Systems and the predicted distributions of priority species both within and outside the conservation network. The scorecards are proposed as an approach to objectively quantifying the conservation status for natural resource agency priorities. The priority species richness maps are proposed as an objective basis for assessing offered acquisition projects and for proactively identifying conservation actions for an area. between national mapping programs has greatly increased the efficiency of land cover mapping in the U.S. Finally, methods for large area mapping (e.g., image stratification, decision tree modeling, and pattern recognition) are providing a solid foundation for mapping the vegetation of the country. In this review we discuss the evolution of vegetation mapping methods during the past decade, describe some of the national programs involved in vegetation mapping, and provide an overview of the current status of vegetation classification systems in the U.S."}, {"section_title": "In a Nutshell", "text": "• The ability to map vegetation over large areas is the basis for effective land management and conservation. • The feasibility of vegetation mapping over large areas is rapidly accelerating."}, {"section_title": "• The National Vegetation Classification System and Ecological Systems", "text": "Classification are evolving to provide a much-needed framework for vegetation mapping in the U.S."}, {"section_title": "Introduction", "text": "Vegetation mapping has undergone a considerable change in the last decade. In particular, integrating the perspective gained from space has made vegetation mapping of large areas possible. Changes in how government programs acquire and distribute remotely sensed data, and advances in computing power and mapping techniques, are removing some of the previously existing barriers to mapping large extents. The application of geographic information systems (GIS) science has also rapidly expanded, with agencies incorporating spatial data into their programs, and universities increasing opportunities for training. As a result, researchers and land managers are increasingly reliant on spatial data for inventory, management, and planning. Today, vegetation mapping is done from local to global scales, and those maps inform studies on global climate change (Freidl et al. 2003), deforestation (Skole and Tucker 1993), desertification (Hanan et al. 1991), habitat management (Scott et al. 1993 and wildfire planning (Falkowski et al. 2005) ( Figure   1.1). Recent innovations in data availability and mapping methodology have allowed the development of a global land cover map (Belward et al. 1999), a standard protocol for rapidly mapping general land cover of the U.S. (Homer et al. 2004), detailed large scale vegetation maps for some National Parks and Wildlife Refuges (Welch et al. 2002), vegetation maps for large regions , and land cover change maps for the coastal regions (NOAA CCAP 2006). Table 1.1 provides a summary of programs currently involved in national mapping efforts in the U.S. Just as important as the advances in mapping techniques, the standard vegetation classification systems that have been developed over the last decade are vastly improving the utility of the maps being developed. The National Vegetation Classification System (NVC; Grossman et al. 1998) was the first attempt at a nationally consistent system for all terrestrial vegetation. That classification and the Ecological Systems Classification  are the most broadly applied classification systems in vegetation mapping in the United States today. The goal of this review is to summarize the recent developments in mapping techniques and vegetation classification specific to current mapping programs in the United States and to discuss some of the common tradeoffs (e.g., among extent, spatial resolution, and thematic resolution) to be considered when planning or evaluating a mapping project. In this review we are aiming for two general audiences, the ecologist considering a vegetation mapping project, and land managers who need to evaluate the land cover and vegetation maps they encounter in the course of their careers."}, {"section_title": "Target Map Classes", "text": "The first step in a successful mapping project is the identification of the target map classes. The intended use of the final map and the limitations of the data being used to create it will determine and constrain the number and definition of these classes.\nWe adopted the NatureServe Ecological Systems Classification  as our target map legend. The goal for the Southeast Regional GAP is a regionally consistent land cover map and this classification was designed as an ecologically meaningful classification that could be mapped using mid-scale remotely sensed data.  . In that effort, the U.S. was divided into a series of mapping zones and each zone was mapped independently. The zones were delineated based on five criteria -size, physiography, land cover patterns, spectral patterns, and natural breaks in land cover that would facilitate edge matching of the map zones . This delineation method overcomes some of the issues of heterogeneity often encountered when the study area is defined using political (e.g., state) boundaries. For Ecological Systems level mapping, even these zones can be relatively heterogeneous. For example, the mosaic for mapping zone 58 (Atlantic Coastal Plain of North and South Carolina) includes a variety of vegetation types from maritime forests to Sandhills longleaf pine woodlands. We dealt with that variability by further dividing the study area into subzones. Preprocessing at EDC included identification of three target image dates using multitemporal normalized difference vegetation index (NDVI; to guide the selection of the imagery for three seasons (leaf on, leaf off and spring). Once the range of target dates was identified, the analysts created seasonal mosaics. In cases where the images from the target dates were of poor quality, imagery from the same season in an alternate year was selected. Portions of 14 Landsat TM images were used to create the image mosaics for Zone 58, with dates ranging from September 1999 to as late as June 2002 (Table 2.2). For each of the seasonal mosaics both the 6 reflectance bands and a three-band (brightness, wetness, and greenness) tasseled cap transformed images were used. This was the case in both the NLCD 2001 mapping effort for this zone, as well as for this study (Huang et al. 2002). For a complete discussion of the preprocessing steps taken at EDC see  Land Cover, Impervious Surface, and Canopy Closure  Table 2.3). We used the NLCD 2001 land cover both as an input layer for mapping some of the Ecological Systems, as well as for masking the anthropogenic types. Canopy closure was used as an input into modeling of managed evergreen cover as well as in the decision tree modeling for several of the Ecological Systems."}, {"section_title": "A priori vs. derived map classes", "text": "There are two general methods for determining the vegetation classes: selecting from an a priori classification scheme or deriving the classes from a study area-specific dataset. In many maps, photo-interpretation is used for gathering data to train image classification or for directly mapping land cover. In those cases, the legend is determined by the ability to distinguish the target classes consistently in the photography. In this case, the photo-interpretation key represents the a priori classification scheme. Other examples of a priori classification systems are the detailed vegetation classification systems (Daubenmire and Daubenmire 1968, Schafale and Weakley 1990) for areas where plant community ecologists have focused their work. Classification systems vary depending on their geographic extent and the resourcespecific objectives of the classification. It was not until 1998 that the U.S. had its first national-level classification of vegetation, the National Vegetation Classification System (NVCS; Grossman et al. 1998). Because of the importance of this a priori classification to national programs we discuss recent developments in detail below. An alternative to a priori map classes is the use of detailed plot sampling and quantitative analysis of species composition to derive a classification scheme. The latter most often rely on cluster analysis and ordination techniques to determine the appropriate number and identity of vegetation classes in a study area. Each derived classification is a reflection of the dataset used in its development; as the datasets become richer with continued sampling, the spatial extent and thematic resolution of the derived classifications increase accordingly (Peet and Allard 1993, Reid et al. 1995, Newell et al. 1997, and Simon et al. 2005."}, {"section_title": "National vegetation classification systems", "text": "As the technology for mapping vegetation over large areas matured in the early 1990s, the lack of a standard classification system became increasingly problematic. The NVCS was developed as a hierarchical classification scheme in an attempt to address the need for a classification scheme that was national in scope and thorough (Jennings 1997). It was developed as a hierarchical classification scheme similar in concept to that used in the United Nations Educational, Scientific, and Cultural Organization international classification of vegetation (UNESCO 1973). The NVCS hierarchy has 7 levels; in the upper five levels it includes physiognomic, structural, growth-form, phenological, and environmental information (Table 1.2). The lowest two levels incorporate species composition information. Dominant and/or indicator species of the uppermost or dominant layer (e.g., the canopy in a forest) determine the alliance classification, and additional subcanopy and/or ground layer species help define the associations. Currently, the Vegetation Subcommittee of the Federal Geographic Data Committee is drafting a revision of the NVCS standard (ESA Panel on Vegetation Classification 2004). If adopted, that revised standard may alter the structure of the hierarchy, while encouraging collaboration toward the evolution of the detailed content of the NVCS through a peer review process. Since 1998 many programs have attempted to implement mapping of the NVCS at various levels of the hierarchy. The most successful of these has been the National Park Service (NPS) Mapping Program (http://biology.usgs.gov/npsveg/). NPS has been systematically mapping many of the national parks at the association level, the finest level of the NVCS. The Park Service has been able to achieve a high thematic resolution with extensive field work and manual interpretation of large scale aerial photography (TNC and ESRI 1994). In the mid-1990s the USGS Biological Resources Division's Gap Analysis Program (GAP) selected the Alliance level of the NVCS as the basis for a state-by-state set of target map classes, but reliable (consistent and accurate) representation of these classes could not be achieved. This was due to an incompatibility between the spatial scale of the vegetation types on the ground and the scale of the available imagery and ancillary data. Scaling back to the Formation (the next highest level in the hierarchy) would have meant a loss of important ecological context. In the short-term this led to a shift in the target map legend for the individual state GAP projects (Pearlstine et al. 1998) and a broader call for an ecologically meaningful and \"mappable\" classification system. With support of groups like The Nature Conservancy and the National Gap Analysis Program, NatureServe ecologists were able to build on the extensive research and data of the NVCS to develop the first draft of this new classification, the Ecological Systems of the United States . Each system is intended to represent a group of associations tied together by landscape level ecological processes. It is important to note that this classification is not hierarchical and, while it is informed by the NVCS, it is a parallel system. The only direct link between the two classifications is at the finest level of the NVCS, the association (Figure 1.2). Because ecological processes (flooding, fire, wind) are central to the definition of the Ecological Systems, ancillary data are often necessary for mapping where spectral data alone would be insufficient."}, {"section_title": "Trends in satellite-based mapping", "text": "In their book \"Vegetation Mapping\", Kuchler and Zonneveld (1988) provided the first broad introduction to the field of satellite-based mapping. In 1994, Zhu and Evans published a forest map for the United States based on 1x1km Advanced Very High Resolution Radiometer (AVHRR) imagery, and, in 1997, Friedl and Brodley tested the use of decision tree modeling for satellite based mapping. By the mid-1990's, the National Land Cover Dataset (NLCD) and GAP state projects were making important advances in large area mapping. Below we present a summary of the traditional methods used in remote sensing and a discussion of recent innovations, including the use of multi-temporal imagery and the integration of ancillary spatial data and remote sensing."}, {"section_title": "Landsat imagery and vegetation mapping", "text": "Currently, Landsat Thematic Mapper (TM) and Enhanced Thematic Mapper (ETM) sensors dominate the field with respect to large area vegetation mapping in the United States. The National Gap Analysis Program, NOAA Coastal Change Analysis Program (CCAP), and the Landfire Project all use Landsat imagery as the base for detailed vegetation mapping for large regions of the U.S. Landsat TM and ETM sensors acquire data for 6 and 7 spectral bands, respectively, at a spatial resolution of 30x30 m. Each of the Landsat sensors acquires data on a 16 day return cycle, although cloud cover and seasonal variability limit the number of those acquired images that might be suitable for mapping. The broad application and reliance on Landsat imagery for vegetation mapping in the U.S. is reflected in the following discussion. For a treatment of the use of Landsat in broader ecological applications see Cohen and Goward (2004)."}, {"section_title": "Manual interpretation vs. automated computer mapping", "text": "The general trend in satellite-based land cover mapping is from manual methods toward an increased reliance on computer assisted and automated mapping methods. Early uses of satellite imagery as the base layer for mapping involved manual delineating and labeling of polygons. For example, the first generation vegetation map for the Washington State GAP project was developed through visual interpretation of Landsat TM imagery and field visits to guide the labeling of polygons (Grue 1997). Similarly, in their assessment of coastal sage scrub, Davis et al. (1994) used Landsat TM to delineate patterns, combined with field reconnaissance, interpretation of aerial photographs, and reference to historic maps in the labeling stage. The success and feasibility of manually delineating patterns in vegetation depend on the skill of the interpreter, the quality of the reference data, and the complexity of the vegetation being mapped. The two traditional automated computer mapping approaches for image classification are unsupervised and supervised classification (Jensen 2004). In an unsupervised classification, each pixel in the image is assigned membership to an image cluster based on the statistical similarity of the pixel to a cluster. Similarity is determined by calculating the mean of all of the pixels currently assigned to a cluster for each band in the imagery. Clustering is an iterative process where pixels are sorted into a predetermined number of bins (clusters) based on the mean of the pixels currently assigned to each cluster. In each iteration, the membership of each pixel is re-evaluated based on the means of the clusters. Labeling of the imagery to generate a map is then done using training data to identify the most likely vegetation type for each cluster. In this case, the clusters represent groupings of the data that must then be interpreted and labeled relative to the map legend. In contrast to an unsupervised method, which requires that data for labeling classes be gathered after the membership of pixels has been assigned, a supervised method utilizes a training dataset, derived in advance and used to train the classification. The goal in developing the training dataset is to select homogeneous training areas that represent the range of variability for each target map class. In the classification stage, each pixel in the study area is compared to the groups of pixels in each area of the training dataset and the pixels are assigned a map class if they are statistically similar to one of the training signatures. With a small study site or a generalized map legend, either a supervised or unsupervised approach is likely to be adequate for mapping vegetation. The accuracy of an unsupervised classification will depend on the target map legend, input imagery, and the analyst's ability to discriminate the land cover classes in the imagery. Supervised classification is most sensitive to the quality of the training data and the algorithm (e.g., maximum likelihood, minimum distance) used to label the land cover classes."}, {"section_title": "Multi-temporal imagery", "text": "As access to imagery and processing power increased, references to the use of multitemporal imagery for mapping became more prevalent in the literature (Egbert et al., 1995;Wolter et al. 1995). A current example of the use of multi-temporal imagery for land cover mapping is the National Land Cover Dataset (NLCD 2001;Homer et al. 2004). That database includes the creation of three seasonal image mosaics (spring, leaf on, and leaf off) for each mapping zone in the U.S. . Such mosaics are also being used for the Gap Analysis Program, NOAA's Coastal Change Analysis Program (CCAP), and the Landfire Project, as well as in mapping for the NLCD 2001. For each of those efforts, the temporal variation is being used indirectly to assist in refining the land cover classifications and treat each date of imagery as an independent source of information. Other approaches use information from the multi-temporal images directly, either by incorporating information about the change vectors (Lunetta et al. 2001) or by selecting which image(s) to use in classifying specific vegetation types. For example, Townsend (1997) used a hierarchical approach in which coarse vegetation types were mapped and then refined by developing unique combinations of multi-temporal image bands and band ratios for refinement of the detailed wetland classes. Wolter et al. (1995) used a similar hierarchical approach with specific band combinations from various image dates to map forest types in northwestern Wisconsin. Incorporating multi-temporal imagery increased the thematic resolution of maps from both Landsat (Mickelson et al. 1998, Wolter et al. 1995, Slaymaker et al. 1996 and Advanced Very High Resolution Radiometer imagery (Stoms et al. 1998, Zhu and. Integrating ancillary data and remote sensing Methods for integrating ancillary spatial data and remote sensing can be generally categorized as image stratification (either pre-or post-classification; , Gao et al. 2004; preponderance of evidence decision rules (Sader et al. 1995, Lunetta et al. 2001, Felicisimo et al. 2002; generalized linear modeling (Moisen and Edwards 1999); gradient nearest neighbor (Ohmann and Gregory 2002); or evidential reasoning approaches, including decision tree modeling (Duguay andPeddle 1996, Homer et al. 2004)."}, {"section_title": "Image stratification by ecological region", "text": "In the Utah and Southwest GAP Projects , ecological regions were used to stratify the study area. In each case the assumption was that variability with respect to the target map classes would be lower within regions than among them. Similar logic was used in the development of the mapping zones for the NLCD 2001 . In that effort, the mapping zones were delineated based on five criteria -size, physiography, land cover patterns, spectral patterns, and the placement of the map zone edges that would later need to be mosaicked with adjoining zones. Large area mapping involved mapping across many satellite scenes. If each scene is mapped individually, adequate training data for each land cover class being mapped must be located within each of those scenes. If however, the imagery is mosaicked and then divided based on ecoregion, the mapper may be able to map the same classes with a lower number of training points overall. Another potential advantage is the reduction in edge matching, assuming the ecoregion boundaries do represent transition lines for the classes being mapped. The potential disadvantage is increased spectral variability within a region if the satellite scenes mosaicked to create a region have high variability in phenological or atmospheric conditions (Homer et al. 1997)."}, {"section_title": "Preponderance of evidence decision rules", "text": "Several projects have found they could improve the accuracy of their vegetation mapping by incorporating preponderance of evidence decision rules, also known as weighting criteria. A decision rule can be based on expert knowledge or can be derived from the data. For example, if floodplain forests only occur within 100 meters of a river, a rule can be established that floodplains can only be mapped within that distance. Similarly, if 95% of the training sites for floodplain forest occur within 100 meters of the river, a probability of 95% can be applied to pixels within 100 m of the river and a 5% probability for pixels at greater distances. Incorporating variables such as elevation, terrain type, and proximity to rivers improved the vegetation map for a site in the Arctic National Wildlife Refuge (Joria and Jorgenson 1996). In that study, the application of GIS-based decision rules to an unsupervised classification produced a better vegetation map than either the unsupervised classification alone, or a supervised classification based on the same training data. Similarly, the Utah GAP Project adopted a two-phase mapping approach in order to improve its vegetation map . Summary statistics for the clusters from the unsupervised classification were used to determine weighting criteria used in ancillary modeling within each ecological region of the state.  found that the majority of cover classes (31 of 36) were improved with the use of this ancillary modeling."}, {"section_title": "Generalized linear modeling", "text": "An early example of using generalized linear modeling to integrate satellite imagery and ancillary spatial data for mapping vegetation is the study of Glacier National Park (Brown 1994). Generalized linear modeling, like traditional linear regression, relies on least squares criteria to model the response variable from the predictor variables. In this study, four vegetation types (open canopy forest, closed canopy forest, meadow, and unvegetated) were modeled from insolation potential, snow accumulation potential, and soil moisture potential. Moisen and Edwards (1999) also used generalized linear modeling to integrate topography, spatial coordinates, and spectral data with traditional forest inventory data for northern Utah, and they were able to improve the precision of forest timber volume estimates over methods based on the plot data alone. Ohmann and Gregory (2002) used gradient nearest neighbor to successfully map forest structure and physiognomy for Coastal Oregon. This method translates the results of traditional direct gradient analysis (Gauch 1982) into a spatial framework by assigning map labels based on nearest neighbor imputation. In Ohmann and Gregory (2002), Landsat TM spectral bands and derivatives were first integrated with ownership, topographic, geologic, and climatic data derivatives and then analyzed using canonical correspondence analysis to model forest types. The map was then created by assigning each pixel in the study site to the class of its nearest neighbor (minimum Euclidean distance) in gradient space. While Gradient Nearest Neighbor has been successfully applied to mapping structure and physiognomy, it had not been previously used to map vegetation type. Currently the approach is being tested with respect to mapping Ecological Systems in the Northwestern U.S."}, {"section_title": "Gradient nearest neighbor", "text": ""}, {"section_title": "Decision tree modeling", "text": "Decision tree modeling is a supervised classification method that has been broadly applied in the social and medical sciences for decades. It was not until the 1990s that the potential for use in land cover applications became apparent (Michaelson et al. 1994, Duguay andPeddle 1996). Decision trees rely on recursive partitioning of the training dataset to create a hierarchical tree in which a series of nodes represent a binary split of the dataset into branches. The method for splitting the data depends on whether the response variable is categorical (discriminant analysis or logistic regression) or continuous (multiple regression). In keeping with the tree theme, the terminal nodes where the map classes are assigned are called leaves (Figures 1.3a and b). Friedl and Brodley (1997) examined the application of the decision tree process to land cover mapping at three scales (AVHRR at 1 x 1 o ; AVHRR at 1x1 km; and Landsat TM at 30x30 m) and found that, in each case, decision trees performed better than either the linear discriminant functions or the more traditional supervised classification approach (e.g., maximum likelihood classification). The adoption of the decision tree classification as a central component of the NLCD 2001 protocol (Homer et al. 2004) means that the approach is being applied throughout the U.S. for land cover mapping. The database includes three components -general land cover (NLCD 2001), canopy closure, and impervious surface estimations. Regression tree modeling is used to generate the estimates of canopy closure, and impervious surface , Homer et al. 2004 and decision tree modeling is used in the development of the 23-class land cover layer. The first large area mapping effort to incorporate decision tree modeling for mapping vegetation types in the U.S. was the Southwest GAP Project , see Case Study)."}, {"section_title": "Pattern recognition", "text": "An additional innovation in mapping is the use of pattern recognition, in which texture or context information for individual pixels is used in combination with the spectral information to create image objects (Figure 1.4). In their discussion, \"What's the matter with pixels? Some recent developments in interfacing remote sensing and GIS\", Blaschke and Strobl (2001) provide a thoughtful summary of the need to pay attention to pattern in land cover mapping. They proposed location and context as \"new paradigms\" in remote sensing. Some of their concepts can be related back to work by Ryherd and Woodcock (1996), who showed the importance of incorporating texture information into image segmentation. In that study, forests of various canopy densities and mixtures of tree canopy sizes were simulated to test the accuracy of forest pattern delineation with and without texture as an input. In southern Montana, Fisher et al. (2002) tested the application of two pattern recognition approaches to mapping. They were able to map 27 cover classes, using supervised classification based on image objects, with overall accuracies greater than 70%. In the same study they found they were able to map five sagebrush and greasewood species with over 90% accuracy using the same methods. The use of pattern recognition in large area vegetation mapping is limited (Fisher et al. 2002, Chapter 2 and 3 this volume). Current applications tend to involve highly structured land cover or land use classes (e.g., roads, buildings) with an emphasis on high resolution imagery (e.g., IKONOS, digital orthophotography; Elmqvist and Khatir 2007). The application of pattern recognition in mapping based on lower resolution imagery for natural resource applications is expanding (Lucas et al. 2007, Fisher et al. 2002, Chapter 2 and 3 this volume)."}, {"section_title": "Future Trends", "text": "We can expect that, over the next few years, decision tree modeling will continue to be the dominant method for large area vegetation mapping. At the same time, it is likely that the application of pattern recognition and higher resolution satellite imagery (hyperspectral and hyperspatial) will become increasingly common as barriers to their use (limited access, high cost, and limited processing capabilities) are removed. The continued evolution of the NVCS, including the adoption of a new hierarchy structure and continued inventory work, will make use of that classification for large area mapping practical. Hierarchy as adopted in the 1997 FGDC standards (Grossman et al. 1998).   (Grossman et al. 1998 and.  Objects displayed over the Landsat TM image used to generate them. Image objects allow for hierarchical classification by incorporating data on both super-object and sub-object characteristics. In this case, shape index might be an important object level character, while variation of the pixels within an object, a sub-object characteristic, may be relevant as well.  ."}, {"section_title": "Level", "text": ""}, {"section_title": "US NVCS Association", "text": "Case Study: Southwest GAP Project Regional Land Cover Map . In this case we highlight the series of choices made by the Southwest Gap Analysis Project for mapping vegetation over a 5 state area. The final map, shown below, includes 125 map classes, with 109 Ecological Systems represented (Figure 1.5). Target Map Classes: For this project a total of 109 Ecological Systems were mapped. Prior to mapping, extensive field work was done to collect vegetation data that would inform the classification system, as well as act as training and assessment data. For a complete description of the 109 map classes based on the Ecological Systems Classification or to download the data, see the Southwest GAP land cover report (http://earth.gis.usu.edu/swgap/landcover.html)."}, {"section_title": "Automated vs. Manual Delineation:", "text": "The decision tree process used for this project is an automated supervised classification method. The training data provide the a priori class labels, and the decision tree model determines the best series of binary splits of the data to predict the labels based on those training data. In this case, over 93,000 training data points were gathered; 20% of those points within each target map class were randomly selected and set aside for the final accuracy assessment, and the remaining 80% were used to \"train\" the decision tree."}, {"section_title": "Satellite-based mapping:", "text": "The base imagery for the project was Landsat Enhanced Thematic Mapper (ETM) imagery acquired within a three year time period (1999 to 2001)."}, {"section_title": "Multi-temporal imagery:", "text": "In order to take advantage of seasonality, three seasons (spring, summer, and fall) of images were used. A total of 237 Landsat scenes were required to cover the study area for the three seasons. Integrating Ancillary Data with remote sensing: Landsat ETM satellite images and image derivatives, including the Normalized Difference Vegetation Index and tasseled cap brightness, greenness, and wetness indices, were used in the decision tree modeling. Digital Elevation Models (DEM) and derivatives including slope, aspect and landform. In this study the researchers had compiled data including geology, State Soil Geographic Database (STATSGO), and 1x1km meterologic data, but decided not to include those data in the modeling because of differences in the scale of the satellite data and those data sources. Image stratification: Twenty five distinct mapping zones were developed for the project. Each mapping zone was treated independently, and once completed, all zones were mosaicked to create the final regional product."}, {"section_title": "Decision tree modeling:", "text": "For each mapping zone, decision tree modeling was used to map the natural vegetation of the zone. Non-modeled classes included land cover types such as agriculture, developed, and water. For the modeled classes, the training data were used as the response variables in a decision tree process, with the satellite imagery and ancillary data sources described above as the predictor variables.  (Wells 1928, Schafale andWeakley 1990). Soils, hydrologic processes, and disturbance (specifically fire, tides, and salt spray) are primary factors in determining patterns in the vegetation of the Coastal Plain (Wells 1928, Wells and Shunk 1938, Boyce 1954, Kologiski 1977, Komarek 1968, Christensen 1988). In addition to the complexity of the vegetation, the long history of human settlement and the rapid rate of land use change make mapping the natural communities in the region especially challenging. According to a World Wildlife Fund assessment ) the Atlantic Coastal Plain of the Carolinas is an endangered ecological region in need of \"immediate protection of remaining habitat and extensive restoration.\" These authors estimated that only about 12% of the Mid-Atlantic Coastal Plain habitats can be considered intact. Wyant et al. (1991) suggested that anthropogenic disturbance (timber harvest and fire suppression) will continue to have the greatest influence on the extent and composition of the forests of the Coastal Plain of North Carolina."}, {"section_title": "Study Objectives", "text": "Our objective was to develop an effective methodology for mapping Ecological Systems of the Atlantic Coastal Plain. Two immediate uses of that map would be a conservation assessment of the Ecological Systems of the area and input into modeling predicted distributions of vertebrate species. The goals of the study included 1) testing the application of the Ecological Systems Classification in mapping in a ecologically diverse but topographically homogeneous area, 2) testing the use of decision tree modeling for mapping Ecological Systems, and 3) quantifying the impact of including soils data, both county-level (SSURGO) and state-level (STATSGO) in the modeling process. The Ecological Systems Classification was recently developed ) in response to a need for a nationally consistent vegetation classification system that could be used as the target map legend for large area mapping. Previous mapping efforts in the Southeast  have shown that the coarse-scale resolution of available imagery and the limited availability of ancillary datasets for mapping have significantly limited our ability to map vegetation at fine levels of thematic detail. In this work we wanted to test our ability to develop a map based on the Ecological Systems Classification, using a hierarchical approach including image stratification with decision tree modeling as the final step in that approach. Specifically we wanted to examine the consequences of incorporating county-level soils data, testing the hypothesis that these detailed data would improve the accuracy and/or thematic resolution of the vegetation map. We were specifically interested in the influence of the SSURGO data because it is not currently available nationwide, so we wanted to understand the potential impact of not including it in our mapping efforts.\nWe were interested in identifying a method for detecting change in a thematica rich land cover map. Specifically, we wanted to use the newly available 2001 GAP Ecological Systems map for the Onslow Bight as a base and perform backcasting to identify the pattern and types of land cover changes that had occurred between 1992 and 2001. Finally, in addition to characterizing the changes in the land cover, we planned to use the change map to describe the patterns of change in the predicted distributions for vertebrate species in the Onslow Bight. In a broader sense, we wanted to identify an approach that could be u G on developing high quality baseline land cover datasets and requires a method for updating those. The cost of land cover mapping is significant and, once complete, the most effective method for updating might be through change "}, {"section_title": "Background", "text": "Status of the Dominant Plant Communities in the Atlantic Coastal Plain. There are seven dominant plant communities in the Atlantic Coastal Plain, all of which are decreasing in area, some more drastically than others. A summary of the current status of each of those communities follows."}, {"section_title": "Longleaf Pine", "text": "The longleaf pine (Pinus palustris) ecosystem is one of the best known examples of an endangered ecosystem in the coastal plain (Jose et al. 2006, Noss et al. 1995, Ware et al. 1993, Noss 1988. The factors that led to its decline include timber harvest, agricultural clearing, grazing, free ranging hogs, and turpentine production (Frost 1995). More recently, fire suppression and the associated invasion of hardwoods has led to a decline in the remaining longleaf stands. Less than 2% of the original distribution of longleaf remains, with less than half of that being managed with prescribed fire )."}, {"section_title": "Pocosin", "text": "One of the distinctive plant communities of the Atlantic Coastal Plain is the peatland pocosin. This nonriverine wetland community often has an open canopy of Pond Pine (Pinus serotina) and a dense evergreen shrub understory (Kologiski 1977, Wells 1928. Historically, pocosins are thought to have occupied as much as 908,000 hectares in North Carolina (Wilson 1962, Richardson 1981. In 1989, 608,000 hectares of pocosin remained, half of which could be characterized as being in a natural state (Richardson and Gibbons 1993). Thus two thirds of the original extent for this plant community has been lost or severely degraded."}, {"section_title": "Nonriverine Wet Hardwood Forest", "text": "Another threatened plant community of the Coastal Plain Region is the nonriverine wet hardwood forest. Based on extensive field survey data, Schafale (1999)  Atlantic White-cedar Forest Atlantic White-cedar forest is another critically endangered wetland type that occurs in the coastal plain of North Carolina (Noss et al. 1995). In his review, Frost (1987) "}, {"section_title": "Carolina Bays", "text": "Carolina bays are a unique type of isolated wetland that occur in the outer Atlantic Coastal Plain from New Jersey to Florida (Sharitz 2003), with the greatest concentrations in the Carolinas. Because of their geomorphology the bays are recognizable from space as elliptical basins of wetlands within a matrix of upland. The substrate, either peat or clay-based, influences the plant communities they support (Schafale and Weakley 1990). Historically, many of these wetlands have been drained for conversion to agriculture or tree plantations. More recently, the interpretation of the Clean Water Act that removes these wetlands from protection makes Carolina bays especially vulnerable (Sharitz 2003). Estimates of the historic number of bays vary widely, making it difficult to estimate the proportion that has been lost (Richardson andGibbons 1993, Prouty 1952   was developed in collaboration with NatureServe and was a precursor to the Ecological Systems Classification  currently being used by GAP and other national mapping programs. Frost and Costanza (2006) Schafale (1999) has developed a map of nonriverine wet hardwood forests. Aerial photo interpretation was used for mapping both of these high conservation priority vegetation types.\nCarolina Bays were photo-interpreted using DOQQs as the base imagery. The dominant land cover from the NLCD 2001 within each bay was then used to distinguish the Atlantic Coastal Plain Clay-Based Carolina Bay Wetland from the Atlantic Coastal Plain Peatland Pocosin -Carolina Bay Wetland. Bays dominated by deciduous wetland forest or water were mapped as clay-based, while those dominated by evergreen wetland forest or shrubs were mapped as the peatland type. We chose not to use the underlying soils data to define clay-based vs. peatland, because altered hydrology or fire regime can result in a shift to a more evergreen dominated community (Schafale and Weakley 1990), although the rate and likelihood of that change is poorly understood."}, {"section_title": "Methods", "text": "\nThere were three major steps in our change detection process. 1. Pre-processing the imagery, determining the change vectors, and identify the potential change areas (Figure 3  . We wanted to test a method that relied on Landsat TM image mosaics available through the Multi-reso C could be impl While the mosaics were developed with the goal of creating a homogeneous seasonal snapshot for each mapping zone, the spatial extent of those zones and local variation in weather conditions (cloud cover, haze, smoke) made that impossible. Therefore, each mosaic contains several different dates of im For a complete discussion of the process for creating the mosaics, see . When combining two mosaics for the purpose of change detection the combinations of image dates might be problematic, depending on the level of detail being sought and the change detection method being applied. Because w were trying to detect change in 42 land cover classes, we chose to treat each date / band combination, 9 in all, as distinct sub-zones for classifying change.\n"}, {"section_title": "Study site", "text": "We included the thirteen counties that intersect the Onslow Bight Landscape as defined by The Nature Conservancy Onslow Bight Rapid Assessment Pilot Project (Figure 2.1). The area covers approximate 250,000 km 2 and intersects portions of the Atlantic Coastal Flatwoods Section and the Coastal Plains and Flatwoods Lower Section of the Forest Service's Ecological Regions Map (Keys and Carpenter 1995). With respect to ecological regions as described by Omernik (EPA 2004), the majority of the study area occurs within the Middle Atlantic Coastal Plain, with a small fraction overlapping the Southeastern Plains Region. Relief in the region is minimal, peaking at 50 meters with most of the area being under 15 meters above sea level. The northeastern corner of the study area was partially submerged in the post-glacial period and is referred to as the embayed region (Robinson 1979). To the south, marine terraces are considered to be a region of emergence, making swamps less common and creating conditions for defined river valleys. The vegetation represents a complex mosaic of wetland and upland plant communities, many of which are fire dependent."}, {"section_title": "Soils", "text": "We derived two soils datasets from the Natural Resource Conservation Service to be used as inputs into the modeling process. The State Soil Geographic Database (STATSGO) is a national database developed at a 1:250,000 scale (NRCS 2007). For each map unit in the STATSGO data, the component soil series and the percentage representation for each of those series in the average soil unit is described in the database. These soils maps were developed by generalizing existing soils information. The Soil Survey Geographic Database (SSURGO) includes detailed county-level soil series maps developed at a scale of 1:24,000 (NRCS 2007). From the SSURGO data we calculated the average percentage organic matter for each soil series using the official soil descriptions. To account for the contribution of organic matter, we adjusted the percentage of each of the mineral fractions (sand, silt, and clay) by subtracting the percent organic matter from 100 percent to determine a correction factor. We derived the percentage sand, silt, and clays for each soil series by translating the soil texture (loam, sandy loam, clay) based on the soil texture triangle (Soil Survey Staff 1990). The adjustment to include organic matter in the soil texture calculation was then applied to the sand, silt, and clay percentages, making the combination of sand, silt, clay, and organic matter percentage total 100%. For each fraction a single data layer was generated (see below). Correction Factor for Mineral Fractions = 100 -Average % Organic Matter To develop the STATSGO data layers, we used the same process for determining the percentage organic matter and the adjusted percentages for sand, silt, and clay for each soil series. The proportional representation of each soil series in a STATSGO unit was then used to weight the contribution of that series to the larger unit. The compositional representation for soil series in each STATSGO unit is reported in the STATSGO database. Our approach is similar to that taken to develop the CONUS-SOIL dataset (www.soilinfo.psu.edu) developed for the conterminous U.S., but we have included organic matter as a fourth soil fraction."}, {"section_title": "National Wetlands Inventory", "text": "We used the National Wetland Inventory in the development of the NLCD 2001 for mapping zone 58, which includes the Onslow Bight study area (U.S.G.S. 2003b). For that effort two data layers were derived from the National Wetland Inventory Data (U.S. F.W.S.): a wetland/upland layer and a layer that corresponded to general wetland classes including palustrine wetlands (forest, shrub, and emergent) and estuarine wetlands (forest, shrub, and emergent). These data layers were used as input layers for decision tree modeling of the wetland vs. upland forest, shrub, and emergent land cover classes for the NLCD 2001. We used an unsupervised classification based on the spring imagery to refine the boundary at the palustrine/estuarine interface. For the systems level mapping, these derived layers were used as input into the decision tree modeling."}, {"section_title": "Landform", "text": "We derived landforms using the National Elevation Dataset (NED) 30 meter elevation data. Preprocessing steps included identifying areas with anomalies (e.g., striping) in the elevation data, replacing those areas with other data if they were available and, if not, using directional filtering. The landform calculations were modeled using the approach outlined by Anderson et al. (1998)."}, {"section_title": "Image Objects", "text": "We used the pattern recognition software eCognition to segment the spring image mosaic into objects. Object boundaries were determined through interactive calculations of homogeneity. In each step the homogeneity of an object after being merged with its neighbor was calculated; if the heterogeneity of the new object exceeds the predetermined threshold level, the objects were not merged. Two indices of homogeneity were used in image segmentation -color vs. shape and smoothness vs. compactness -and they could be weighted by the analyst. In this study we used a color parameter of 0.3 (scaled 0 to 1) and smoothness parameter of 0.5 (scaled 0 to 1). In other words, we weighted spectral homogeneity slightly higher than shape homogeneity and gave equal weighting to smoothness and compactness. The scale parameter determined the size of the objects that can be generated and therefore determined the threshold for the maximum heterogeneity allowed in an object (the higher the scale parameter, the more heterogeneous the objects). In this case we used a scale parameter of 30, which resulted in over 57,000 objects. For a technical discussion of homogeneity calculations for color and shape indices see Zhong et al. (2005). Those objects were used for delineating specific areas of interest, refining boundaries from other datasets so they matched the spectral data, and as input in decision tree modeling. Summary statistics for eight input variables were generated for each object for use in modeling (Table 2.4).\nThe change vector direction and magnitude images were combined to create a four-band image that we used to generate image objects using eCognition Elements 4.0 software (Definiens Imaging 2004). Objects were generated usin re assigned to a single objec subsequent iterations, the characteristics of each object were compared to those of its neighboring objects and if a threshold of similarity is met, the objects were merged (Benz et al. 2004). More specifically, a size threshold (scale) and homogeneity characteristics of the object (shape index and compactness) determined when two neighboring objects are merged. Those objects were used as our analysis unit for detecting change in the non urban areas. The derived image objects represented homogeneous patches w respect to the four bands of data used as input. For change areas, the type of change and the \"from\" and \"to\" categories within an object would be homogeneous as well, as long as the objects being generated were the sam size or smaller than the scale of the land cover changes. We increased the scale of the objects stepwise, so the largest objects used in the analyses represen aggregations of the finest scale objects (scale level 1 = 10, level 2 = 15, leve 20, shape index = 0.3 and compactness = 0.5). Each of the scale 20 objects, t la difference of the pixels within the object, the mean for each of the change vecto (brightness, greenness, wet E Identifying and Labeling Change Areas in Non-Urban Land Cover W image. In other words, the \"to\" category for any change was based on the map. The complexity of the map legend with 42 land cover classes made la the \"from\" categories for change especially challenging. In addition o types in a single few logical land cover changes that would be expected between Ecological Systems. One exception would be the shift from the Atlantic Coastal Plain ( Southern Tidal Wooded Swamp \"to\" or \"from\" ACP Central Salt and Brackish Tidal Marsh. At the same time, many combinations between the anthropogen types and shifts from Ecological Systems into anthropogenic types were likely. For that reason we chose to label change for each land cover class separately. To remove the image objects with little spectral change between 1992 and we used a threshold based on the mean magnitude. We compared the obj represented \"potential\" change areas. In this study, the potential change areas represented a significant proportion of the landscape. In order to characterize the \"true\" change and to label the 1992 land c for those areas, we ran unsupervised classifications for each of the 2001 land cover classes within each of the sub-zones. While this approach meant that many classifications were required, it was necessary in order to capture the level of detail sought. For each unsupervised classification, from 10 to 20 clusters were generated with the pixels from the four-band magnitude and cosine imagery. The fact that we used the cosine imagery in the clustering meant that the inherently contained data on the direction of change between the two dates. For example, for pixels with the same magnitude of change, the direction of chang such as a loss of greenness v each pixel within an image object meant that each pixel within an im within the same cluster in the unsupervised classification. Therefore we were classifying patches of change as opposed to pixels for the non-urban areas. For each cluster, the 1992 imagery, 2001 imagery, and Digital Ortho-Photo Quarter Quads (DOQQs) from 1993 and 1998 were used to identify whether that cluster represented change. For the change clusters, the 1992 land cover classification was assigned if it could be photo-interpreted. For changes from natural vegetation type in 1992 to an anthropogenic type in 2001, the clusters were flagged for mapping with either ancillary data or using the decision tree modeling process described below. Therefore, we had three ways to label the The same thresholds used in the NLCD 2001 process were then applied to map the urb those pixels were identified as change in post-classification ch Areas with less than 20% impervious surface in the 1992 map had to be tr differently. It was possible for an area to represent a natural vegetation t 1992 and an urban category for those areas we ran an unsupervised classification a clusters that represented natural vegetation in 1992. Clusters r anthropogenic types were labeled from the clusters, and the forested pixels tha could not be photo-interp the decision tree process described above. A Because we were interested in both a general asse much as we could about the confusion in the mapped change areas, we used uneven sampling design (Khorram et al. 1994). Specifically, we used a two stage design with the first stratum being the change/no change classification and the second being the 1992 land cover classification. We generated four hundred assessment points within the change areas based on the proportions of the 1992 land cover classification, with a minimum sample of 3 samples per class. Similarly, a stratified random sampling of the no change was done but with fewer points, in this case 150. For each of the assessment points, we used the 1993 black and white DOQQs and 1998 color-infrared DOQQs as reference. With the difference in the acquisition dates between the DOQQs and the Landsat imagery used in the mapping, we checked the points against the imagery as well. We excluded poin where an obvious change had occurred between the image and the photograp "}, {"section_title": "Reference Data", "text": "Training and assessment data were compiled from both field data and aerial photograph interpretation. Digital aerial photographs acquired as a part of the Southeast Gap Analysis Project were interpreted directly to Ecological Systems and their modifiers. The North Carolina GAP reference points were relabeled based on a cross-walk from that classification, an early version of a systems based classification ), to the current Ecological Systems classification. North Carolina Natural Heritage Plant Community data and plot data from the North Carolina Vegetation Survey (Peet et al. 1998) were incorporated by cross-walking the plant community labels to the Ecological Systems (Table 2.5). All points were then carefully screened against the 2001 imagery and 1998 digital orthophoto quarter quads (DOQQs) to check for land cover changes and to apply modifiers to the appropriate classes. Finally, areas with few or no training data reference points were photo interpreted. Once the reference data were compiled, they were stratified by ecological system or cover class and a random sample of at least 25% of the points was removed for use in the final assessment."}, {"section_title": "Ecological Systems and Managed Pine Mapping", "text": ""}, {"section_title": "Riverine Systems", "text": "We mapped the riverine Ecological Systems by intersecting the National Hydrologic Dataset (NHD) streams with image objects derived in eCognition. The object generation was done for the entire study area so the patterns derived from the imagery would be consistent for the entire length of a river or stream. Final editing was done manually to add objects missed by the NHD stream data and to remove objects that were dominated by successional or anthropogenic vegetation types (clearcuts, plantations). Pixels representing non-vegetated types (urban, agriculture, barren) were then removed, leaving only the vegetated pixels within the stream or river corridor. Once the floodplain areas had been mapped, the hydrology data were used to classify the Ecological Systems based on flow accumulation and water type. Using the DEM and NHD data, the flow accumulation for each stream segment was calculated in ArcGIS. In order to \"force\" the modeled flow to follow the NHD stream network, the streams were \"burned\" into the DEM prior to calculating the flow accumulation. More specifically, the elevation for any grid cell that intersected a stream was lowered by 100 meters. A threshold based on the number of grid cells contributing to the flow at each point along the stream network was then used to create three categories of streams: small stream (< 100,000), river (100,000 -1,000,000), and large river (> 1,000,000). Finally, streams and rivers were characterized by water type, blackwater or brownwater. Streams originating in the coastal plain tend to be black water, while those originating in the Piedmont tend to be brownwater, with a higher sediment load (Schafale and Weakley 1990). A blackwater/brownwater classification of streams was done for the entire Coastal Plain, with all streams or rivers originating in the coastal plain being classed as blackwater, and those with origins in the Piedmont being classed as brownwater. In a few cases, sufficient flow contributed from coastal streams overcomes the fact that a river originated in the Piedmont. We used the literature and expert review to reclassify portions of these rivers as blackwater. By intersecting river size with water type, five riverine systems were mapped: issues between the coarse scale ecoregional linework and the imagery were minimized. At the same time, the image objects tied the new line work and boundaries to the base imagery, which was important along the coast, where the shapes of the islands are changing over time. For example, barren land and grassland herbaceous pixels along the outer coast were recoded to the Atlantic Coastal Plain Southern Dune and Maritime Grassland, while inland barren land was mapped as either bare sand, bare soil, or mines (see Inland Barren Classes). There were five dominant Ecological Systems mapped in the maritime region: Atlantic White-cedar Although the Atlantic White-cedar Forest was not treated as a distinct Ecological System, it has been recognized by others as a distinct plant community (Schafale and Weakley 1990) and is considered to be critically endangered (Noss et al. 1995). We therefore decided to map it as a modifier of the Atlantic Coastal Plain Nonriverine Swamp and Wet Hardwood Forest. In the current Ecological Systems Classification, Peatland Atlantic White-cedar Forest is proposed as a provisional Ecological System. We mapped this type using aerial photo interpretation with color infrared digital orthophoto quarter quads (DOQQs) as the base layer. While most of the Atlantic Whitecedar Forest in North Carolina occurs north of the Onslow Bight, several small patches were mapped in the Green Swamp of Brunswick County."}, {"section_title": "Natural Lakeshores", "text": "There are five natural lakes in the Onslow Bight study area. Three of those lakes have occurrences of the Southeastern Coastal Plain Natural Lakeshore. To map those sites, the leaf off tasseled cap image mosaic was used to generate image objects in eCognition (scale 5, shape index 0.1, compactness 0.7) and the objects at the land/water interface with mixed pixel signature were labeled as lakeshore."}, {"section_title": "Managed vs. Natural Evergreen", "text": "Prior to mapping natural systems, the managed pine stands throughout the mapping zone were classified using a decision tree model. Pixels mapped in NLCD 2001 as evergreen forests were subset from the leaf off tasseled cap image mosaic and forty clusters were generated using Imagine Isodata algorithm (Lieca 2003). A stratified random sample of 750 points was then generated based on those clusters for photointerpretation. The stratification by clusters was done to ensure even coverage of interpreted points throughout the different images in the mosaic and throughout the range of conditions for evergreen forests. Each of the 750 points was located on 1998 DOQQs and interpreted as managed or natural. In cases where the cover class in the DOQQ was not evergreen or the point was near a boundary with a non-evergreen type, that point was discarded. In all, 679 points (320 managed, 359 natural) were labeled for use in decision tree modeling. See5 software (RuleQuest Research Release 2.02; Quinlan 1993) was used in the decision tree modeling process. The datalayers used in modeling managed vs. natural evergreen for zone 58 are listed in Table 2.4. In addition to the imagery inputs, image objects generated in eCognition were included with 8 context variables. Object specific mean canopy closure, area, shape index, compactness, border length, as well as mean leaf off tasseled cap brightness (band 1), standard deviation of the leaf off tasseled cap brightness, and mean spring tasseled cap brightness were included as inputs. The decision tree classifier was run with all 679 points, with boosting (10 trials). Boosting is an interactive classification process in which each of the previous run trials is used to identify which training data records are incorrectly classified. A weighting scheme is then used to prioritize decisions that will correctly classify those records in the current trial. For each trial 10% of the points were removed and used in the cross validation for the model. Once the decision trees had been generated, the See5 Classifier version 2.02 was used to translate the decision trees into maps of managed vs. natural evergreen forest."}, {"section_title": "Evergreen and Nonriverine Ecological Systems", "text": "After removing the previously mapped or modeled Ecological Systems and anthropogenic types, there were six forested systems to be mapped (Table 2.6). For these forest types, we had a total of 548 points in the Onslow Bight study area. Of those, 248 were set aside for model assessment and 300 were used as training data in a decision tree modeling process. RuleQuest See5 software was used to test both the decision tree modeling approach and the effects of including a variety of input data layers for mapping these Ecological Systems. Input layers available for modeling are listed in Table 2.4. In each case the See5 Classifier was run with boosting of 10 trials, global pruning of 25%, and a minimum of 2 cases per terminal leaf. Cross-validation was not used because of the limited number of samples for each of the Ecological Systems being mapped and because the independent assessment was to be run. In order to assess the influence of several of the key data layers we ran multiple classifications and varied the input layers included in the model. Of primary interest was the influence of the state level STATSGO soils data, as well as the county level SSURGO data. We ran five variations of the classification including 1) Full model, all input layers were included; 2) No STATSGO, the four texture bands from the state level soils data were also excluded (% sand, % silt, % clay, % organic matter), but all other input layers were the same; 3) No SSURGO, the county level soils data layers were excluded; 4) No STATSGO and No SSURGO, all layers derived from soils data were excluded; and finally 5) No datasets derived from vector data, including soils, National Wetland Inventory, and Image Objects were included in the models. Without vector inputs, the final model would be reliant on imagery and land cover derived from imagery alone. Each decision tree generated was then applied to create a map of the Ecological Systems to be assessed."}, {"section_title": "Inland Barren Classes", "text": "Mines and unconsolidated shore were recoded from the NCLD 2001 barren class using an area of interest. The remaining barren pixels were then classified as bare sand if the reflectance in the leaf on tasseled cap brightness band was greater than 80. Lower reflectance pixels were mapped as bare soil."}, {"section_title": "Successional Shrub and Herbaceous Classes", "text": "We used an unsupervised classification to identify transitional vegetation across zone 58. Clusters were generated from the spring and leaf on image mosaics using the Imagine Isodata algorithm and labeled as transitional based on photo interpretation for each of the clusters. Those pixels were then clumped to create two patch sizes (2 and 10 hectares). The greenness band from the spring image mosaic was then subtracted from the greenness band of the leafon image mosaic to create a greenness difference image. Small patches that showed a relatively large decrease in greenness (< -14.5) and large patches with any loss (< 0) were classified as clearcut shrub or clearcut herbaceous. Shrub and herbaceous pixels not mapped as clearcuts were then labeled as other herbaceous or other shrubland.\nWe were reasonably successful at mapping the successional classes. Other The accuracy of the class relative to the reference data was low (37 percent): 8 of the 10 reference points for this class were misclassified; 4 of those 8 were mapped as the ACP Northern Wet Longleaf Pine Savanna and Flatwoods."}, {"section_title": "Salt/Brackish vs. Fresh Water", "text": "The National Wetland Inventory palustrine/estuarine wetlands data were used as a guide for manually delineating the split between the salt/brackish water and freshwater. In the NLCD 2001 land cover there were many emergent wetland pixels scattered throughout the study area. A large number of those represented wet areas within agricultural fields or other anthropogenic cover classes and not \"true\" wetlands. We allowed those pixels to be recoded based on the majority membership in the image object in which they occurred. For example, palustrine emergent within an object with a majority of member pixels classed as Large River Blackwater Forest was recoded to Large River Blackwater Herbaceous. In another example, objects dominated by herbaceous clearcut pixels would be recoded as herbaceous clear cut."}, {"section_title": "Post Processing", "text": "Individual map classes from the processes described above were combined with the NLCD 2001 urban and agricultural classes to create final land cover map. We then used Smart Eliminate (Ver. 1.0) within the NLCD Mapping Tool to generate the final map with a minimum mapping unit of 4 pixels (0.5 hectares)."}, {"section_title": "Accuracy Assessment", "text": "The models for the evergreen forest and woodland systems were assessed with 248 independent data points that had been set aside prior to modeling. Plant community data from the Natural Heritage Program has been gathered based on inventories for specific plant communities, so we assumed a stratified random sampling design in our assessment. In order to account for the variation in the acreage of the Ecological Systems and the number of assessment points, we used marginal frequencies to estimate map accuracy (Card 1982, Stehman 1997. Formulas for estimating the Kappa coefficient and for testing for differences in models were based on . To assess the managed vs. natural evergreen classification we first combined the two model outputs, with spatial coordinates (XY) and without spatial coordinates (NOXY), into a single image with four classes. They were: (1) agree managed, (2) agree natural, (3) XY classified it as managed when the NOXY model classed it as natural and (4), XY classified it as natural when NOXY mapped it as managed. The two categories of disagreement were then used to generate a stratified random sample of 100 points based on their extent in the map, and those points were used to assess the areas of disagreement in the models. The accuracy for the final land cover map was assessed using a combination of independent assessment points for natural systems and a stratified random sampling for the anthropogenic classes. To account for potential shifts in the imagery, a buffer of 85 meters was used summarize the land cover for each reference point. We used the Hawth's Analysis Tools extension for ArcMap to generate the buffers and summarize the land cover within those buffers. If the land cover type was the majority cover type in the buffer it was considered correct; if not, the majority cover class was reported as the offdiagonal cover class. We again used marginal frequencies to estimate the overall accuracies and per class statistics. Overall accuracy, the proportion of the map correctly classified, was estimated at 77 percent and the Kappa statistic based on marginal frequencies was 0.75 (Table 2.7)."}, {"section_title": "Results", "text": "\n"}, {"section_title": "Vegetation", "text": "The four accuracy estimates derived from the marginal frequencies are similar to the producer's and user's accuracies, and the commission and omission errors from a standard error matrix, but they represent the data as proportions of both the row totals and column totals of the population of pixels mapped. By \"conditioning\" the accuracy estimates based on the relative acreage of each class, the estimates of overall accuracy, commission estimates, and Kappa are improved. Stehman (1997) provides a thorough discussion of the advantages of incorporating marginal proportions in accuracy measures. In this study we reported two measures of accuracy for each cover class. A third (commission error) and a fourth estimate (omission error) can be derived from the information provided. π -Probability that a site is correctly mapped given the reference data; λ -Probability that a site is correctly classified given the map class; φ -Commission error (1 -λ); θ -Omission error (1-π). As with most thematically complex maps, the accuracy of individual classes varies "}, {"section_title": "Evergreen Forests and Nonriverine Ecological Systems", "text": "We Longleaf Pine Woodland tended to be present, so commission errors were low. The main source of omission error for this upland pine type was confusion with the wet longleaf pine, \"other shrub\", and the \"other herbaceous\" map classes. The confusion between several of the longleaf types and the map class \"other herbaceous\" is worthy of consideration and we cover that in the discussion section. The primary issue for the nonriverine systems is the commission error in the ACP Nonriverine Swamp and Wet Hardwood Forest -Taxodium (φ = 50%). In many cases, this nonriverine type was mapped where ACP Tidal Wooded Swamp, Pocosin, and Salt and Brackish Marsh actually occur."}, {"section_title": "Managed vs. Natural Evergreen Decision Tree Modeling", "text": "The boosted and cross-validated (10 fold) error rates were 24.8% (standard error 1.9) for the model with x,y coordinates (XY), and 22.8% (standard error 1.0) without spatial coordinates (NOXY). Spatially, there was 87% agreement between the areas mapped as managed and natural by the two decision tree models. When compared visually across the entire mapping zone, date band artifacts in the model that excluded the x,y coordinates were apparent. While the cross-validation numbers indicated a similar error rate between the two models, the inclusion of the coordinates in the model seemed to compensate for date band issues in the image mosaics. In addition to the visual inspection, the independent assessment using 100 points showed that for the areas of disagreement between the two models, the model with XY included did slightly better (Table 2.8). The XY model had lower error rates for both the managed and natural class when compared to the NOXY model."}, {"section_title": "Evergreen and Nonriverine Ecological Systems Decision Tree Modeling", "text": "The Kappa statistics for all the models tested were reasonable, ranging from 0.313 to 0.513. The model with the full complement of input variables performed the best as measured by the proportion correctly classified (65%) and the Kappa statistic (0.512). The worst model with respect to Kappa was the model that excluded the SSURGO data Table 2.6). When both soils datasets were excluded, the model performed better than when only one or the other was included as input, indicating some advantage of using both scales of information. Finally, when all vector inputs were excluded, including both soils layers, the proportion correctly classified (54%) and the Kappa statistic (0.36) were low but slightly better than those of the No SSURGO model. and states will be determined by future applications and research."}, {"section_title": "Image Stratification", "text": "Previous mapping experience in the Gap Analysis Program, as well as preliminary trials for mapping the NLCD 2001 land cover in the southeast showed that stratifying the study area either by ecological boundaries or by land cover category (riverine/nonriverine; wetland/nonwetland) improved mapping results McKerrow and Earnhardt 2004). In this study it is impossible to tease apart the influence of stratifying the study area directly, but the assessment of the individual classes mapped and the natural vs. managed pine models give an indication of the utility of the approach. Even within the decision tree process, incorporating the vector datasets improved the models with respect to three of the six evergreen and nonriverine classes being mapped. Decision tree modeling -Managed vs. Natural Decision tree modeling was a useful approach for two of our critical mapping steps, discriminating managed vs. natural evergreen, and for modeling the evergreen and nonriverine wetlands. In the managed vs. natural evergreen modeling we found that, by incorporating the x,y coordinates in the decision tree model, the accuracy of the final binary map was improved by removing date band artifacts. While both models performed equally well according to the cross-validation, the distribution and type of the errors warranted the selection of one model (XY) over the other (NOXY). While we have not specifically tested differences in the spatial configuration of the mapped cover classes with and without image objects as a model input, when we examined preliminary models we saw that speckling within the patches of managed or natural stands was reduced. Because we expect most stands to be relatively homogeneous (either all managed or all natural), we decided to incorporate the image object data."}, {"section_title": "Decision tree modeling -Evergreen and Nonriverine Systems", "text": "Once the list of cover classes and the number of pixels to be mapped as evergreen and nonriverine systems were narrowed down, the approach worked well for mapping five of the six classes we tried. It is possible that results could be improved using a stepwise modeling approach, perhaps using evergreen types as a single model and nonriverine as its own model. We felt we had segmented the image to such an extent already that running two levels of models would be overly complicated. Also we thought the differences in the types (upland/wetland, evergreen/deciduous) should be distinguishable given the input data. One potential improvement to our process would be to address the commission error of the Other Herbaceous class in the three longleaf pine Ecological Systems. In this effort we did not post-process the Other Herbaceous pixels in order to assign them to an Ecological System as a modifier. The commission error indicates that we should develop an approach to accurately assign herbaceous and shrub pixels to an Ecological System based on context or proximity. Comparing the impact of including a variety of input datasets into the decision tree modeling, removing the SSURGO data had the highest negative impact on Kappa. Interestingly, removing all soils related information (SSURGO and STATSGO) resulted in a higher Kappa value than when either soil layer was used alone. This indicates an interaction between the large scale SSURGO data and the small scale STATSGO data in the modeling. When STATSGO was excluded, the Peatland Pocosin System was less accurately mapped, and, given the extent of that class, its influence on the Kappa statistic was high. Even with the relatively unbalanced set of training data for these systems, the decision tree model did well. While the ideal would be to have a more even distribution of training data, that ideal is often not feasible when mapping land cover. In this study, we had an excellent source of high quality training data for the natural vegetation communities of the Onslow Bight; however, even then the number of points (9) for the high priority ACP Upland Longleaf System was limited, due to the few known occurrences in the study area."}, {"section_title": "Conclusion", "text": "Given the complexity of land cover and vegetation in the Onslow Bight, we chose to take a hierarchical approach to mapping. Pattern recognition allowed us to incorporate some contextual information in our classification steps and was successfully integrated with decision tree modeling for mapping the managed stands of the Coastal Plain. Decision tree modeling was successful for mapping five of the six Ecological Systems, once the areas to be mapped and the number of cover classes were reduced. As we discovered, decision tree modeling did not map all of the target map classes well and the choice of input data greatly influenced the accuracy and spatial patterning of the final map. For this area, the interaction between the county-level and state-level soils data is especially important, and we found it was best to remove both from the model rather than include one or the other, an important finding given the fact that the county-level soils data are not yet available nationally. The map developed using our approach will serve as a good baseline for assessing most of the Ecological Systems and for modeling the predictive distributions for vertebrate species of the Onslow Bight. Some types will require further work, specifically the Atlantic Coastal Plain Upland Longleaf. Future work could include developing two models for mapping the Ecological Systems we modeled with a single decision tree, incorporating additional ancillary data as input into the models, and testing non-decision tree approaches to mapping the ACP Upland Longleaf.   (1,2,3,4,5,7) Landsat Leaf on ab Continuous  6 reflectance bands (1,2,3,4,5,7) Landsat Spring ab Continuous 6 reflectance bands (1,2,3,4,5,7 Table 2.7. Per class acreage and accuracy statistics for the Onslow Bight land cover. Note: π -probability that a site is correctly mapped given the reference data; λ -probability that a site is correctly classified given the map class; θ -omission error (1π) and φ -commission error (1-λ) can be derived from the information provided.   "}, {"section_title": "Abstract", "text": "Effective conservation planning requires information on both the content and context for the resources to be conserved. Land cover mapping and change detection are one set of tools that provide both the content (spatially explicit land cover) and the context (land cover changes). Our goal was to develop an approach to change detection that could be used with a thematically rich land cover map. We used the 2001 Ecological Systems map developed by the Southeast Gap Analysis Project as our baseline dataset. Our study area was the Onslow Bight in the Middle Atlantic Coastal Plain of North Carolina. The method combined Change Vector Analysis (CVA), image segmentation (image objects), and regression tree modeling to back cast to a 1992 era land cover map. The overall accuracy based on marginal frequencies was 95% with a Kappa of 0.78. There was a 21% probability that a point that did not change was misclassified as one that had changed, and a 17% probability that a change was missed. Thirteen percent of the study area was mapped as having changed. Most of the land cover changes were between anthropogenic land cover types, but the approach provided the context necessary to map the changes in the Ecological Systems of the Onslow Bight. Using this approach we were able to accurately map change in a complex landscape and to avoid a common mistake of over-mapping change in the agricultural classes. In future work we hope to find methods for automating portions of the process, specifically: (1) setting the initial change thresholds based on the magnitude of change between image dates; and (2) classifying the class-specific types of change.  Analysis (CVA). In PCA a linear transformation of the data is performed and the derived components represent the major axes of variability in the dataset. In change detection applications, the first PCA axes generally represent the variability across the study area, while the higher order axes tend to represent subtle variations. The goal is to use those higher order components to identify the change areas. For example, Mas (1999) used a Selective Principal Component Analysis (SPCA) in which the bands from two dates of imagery were combi (stacked) to create a single image and the principal components derived for that image. Band 1 of the SPCA image represented the majority of the variation in imagery and therefore explained variability common to the two dates of imagery, while band 2 captured variation between the two dates and was used to identify change areas. In Change Vector Analysis the direction of chang magnitude of the difference between two images are used to classify change (Chen et al. 2003, Hayes and Sader 2001, Johnson and Kasiscke 1998. For t case of a two band image, the vector represents the line that connects a common point on the ground in two-dimensional space (Figure 3.1). The directio line can be used to identify the type of change that has occurred and the length o the line represents the magnitude of the change. For example, in Figure 3.1 line represents a large difference in band 1 and a moderate difference in band For the (n Post classification change detection is most appropriate when the two land cover maps are developed with a common methodology. If that is not the case, differences in approach often overwhelm true differences in land cover (Lunetta 1998, Singh 1989).\nThe National Gap Analysis Program (GAP) has as its mission \"keeping common species common\". In support of that mission the program has conducted and funded research during the past decade with the goal of providing three key datasets used to assess conservation status: detailed land cover, predicted distributions of terrestrial vertebrate species based on application of habitat models, and land stewardship. We explored the use of these datasets in combination with a change detection analysis to assess the conservation status of Ecological Systems and vertebrate species of the Onslow Bight Landscape. We modeled predicted distributions for 141 priority vertebrate species identified in the North Carolina State Wildlife Action Plan (SWAP) and by Partners in Flight (PIF) as the basis for our conservation assessment. We were specifically interested in three general questions: • Were there gains or losses in the extent of Ecological Systems and species predicted distributions between 1992 and 2001? • When translated to a spatial framework, was there agreement on the ground between agency priorities? • How well did the conservation network do with respect to capturing priority areas? By integrating species models from the two dates, we were able to quantify the gains nd losses of the priority species for the two programs. Using the 2001 version of the redicted distribution models, we mapped richness hotspots for the two agency lists. The h nd areas with at least 13 of the PIF priority species, included nearly one-third (32%) of the landscape. Forty-seven percent of the area did not meet the hotspot criteria for either list and twenty-one percent met the criteria for one agency or the other. When we compared the hotspot maps to the existing conservation lands and new acquisitions, we found that both existing conservation lands and the newly acquired easements were biased toward the hotspots, with 70% of the existing conservation network on lands that met the hotspot criteria for both agencies, and 50% of the new acquisitions doing the Once listed, the cost to maintain a species can be high and long-lasting. As Scott et a (2005) summarized, recovery is best described as a continuum; once endangered, a species may be \"conservation -reliant\", requiring constant intervention. Unfortunately, for many species an accurate understanding of their status is impossible to assess. Wilcove and Master (2005) suggest that the data for 85% of the species (plants, animals, and fungi) in the United States are insufficient to determine their status accurately. Without a complete inventory, conservationists rely on surrogates for biodiversity (e.g., indicator species, keystone species, and species guilds) to identify conservation priorities. ster 005) suggest one alternative favored by many conservation biologists -the use of a n. nty years, the National Gap Analysis Program has been advocating a Scott et al. saw the power of is two dicators of biodiversity (Scott et al. 1993, Scott and. Since the ate the gap data into their gency-specific analyses. Two of the most promising collaborations include State Given the level of the threats, the rate of change, and the lack of a complete assessment, we need proactive approaches to conservation. Wilcove and Ma (2 \"coarse-filter\" approach to protection, with ecological communities acting as the scree For nearly twe coarse filter approach to planning. As early as 1993 analyzing biodiversity data in a spatial context. In the preface to the 2000 issue of the special edition of Landscape Ecology devoted to the use of gap analysis, Burke (2000) suggested that the intersection of landscape ecology and conservation biology was the most promising front for effective species conservation. Assuming the cost of conservation is lower for intact systems, the National Gap Analys The PIF planning process is a two stage proce e (Panjabi et al. 2005). Each species is assessed based on size criteria related to population trends, species distribution, and threats (Table 4. outside the existing conservation network as priorities for conservation (Scott et al. 1 Kiester et al. 1996). A \"gap\" represented an area in the landscape that was not being managed for biodiversity but did represented habitat for a high number of terrestrial vertebrates. Over time the GAP datasets have evolved to better address the needs o natural resource agencies, each of which have their own prioritization schemes or mandates. O for monitoring and r species common, while at the same time tailoring the analyses to our partners. We wanted to design an approach based on Gap Analysis Program datasets that could be applied to a variety of conservation questions. Specifically, we wanted to test the applicability of the GAP datasets and a change analysis in addressing questions speci to the priority species lists for the North Carolina Wildlife Resources Commission and"}, {"section_title": "P", "text": "The majority of satellite based change detection experiments rely on pixel to pixe comparisons , Lunetta 1998 of approaches for identifying change exist (Lunetta 1998), but e application of those approaches across large areas and at the level of detail of . Currently, NOAA's Coastal 1998, Dobson et al. 1995). More recently, experiments implementing patch based change detection are becoming more common (Blaschke 2005, Al-Khudhairy et al. 2005, Laliberte et al. 2004, Bruzzone and Fernandez Prieto 2000a). Bruzzone and Fernandez Prieto (2000b) used a patch-based approach to change detection to reduce the errors introduced by spectral variability in imagery, as wel as the registration errors inherent in multi-date analyses. Blaschke (2005) argue that the context of a pixel, a characteristic ignored in pixel to pixel based comparisons, provides significant information to help in accurate mapping. He also asserted that using such information would, in some cases, go further in resolving issues of accurately mapping mixed pixels than an increase in the spatial resolution"}, {"section_title": "Change Ve", "text": "We used tasseled cap (TC) transformed images so the vectors be dates of imagery would represent gains or losses in brightness, greenness, and wetness. This transformation has been u studies for similar reasons (Sohl 1999, Johnson and Kasischke 1998, Dwye 1996. This transformation is essentially a principal c re 976). The name tasseled cap comes from the hat-like pattern that is often when the distribution of pixels is graphed along two of the new axes ed , we agnitude = Square root [(TC92 Brightness -TC01 Brightness) 2 + s) 2 ] g a gion-merging technique (agglomerative approach), where each pixel was t in the first iteration of the image segmentation. In 1 observed (Figure 3.7). The transformation is accomplished by providing a transformation matrix specific to the image source, where the coefficients have been deriv using training sites representing the full range of brightness, wetness, and greenness (e.g., soil, vegetation, and water; Huang et al. 2002). In this study used the tasseled cap transformed image mosaics developed by the MRLC (Huang et al. 2002) to calculate the change vectors based on differences in brightness, greenness and wetness between 1992 and 2001 image mosaics. Below are the formulas for calculating the magnitude and direction (cosine) of change (Chen et al. 2003). "}, {"section_title": "Amount and distribution of change", "text": "Total change in the land cover between 1992 and 2001 was estimated at 334,06 hectares, representing 13.3% of the Onslow Bight. In general, change was dispersed evenly throughout the study area (Figure 3.8) Of the 550 assessment points generated, 547 could be interpreted with respec change based on the available DOQQs. When considering the binary change/n change assessment for the Onslow Bight, an overall accuracy based on the marginal proportions (Card 1982) was 95%, with a kappa statistic of 0.78 (Table   3 estimator for Kappa specific to a stratified random sampling design . For areas mapped as \"changed\" the accuracy (lambda) was estimated be 79%; conversely, the omission error for changed areas was 21%. For the areas mapped as \"no change\", lambda was 97%, indicating 3% omission error. The probability that the map was correct given the \"true\" class or a reference site  (Table 3.5). With proportional sampling, many of the map classes had a low number of assessment points. We have included all of the cover classes in  Acevedo 2006, Loveland et al. 2002). Auch (2006) estimated the annual rate of change at 1.1% for the period between 1992 and  Table 3.1. Thresholds used to categorize urban land cover classes fro rvious surface estimates. Categories and definitions used by the Nationa Cover Dataset 2001 (Homer et al. 2004)."}, {"section_title": "an Category Impervious", "text": "High Intensity Urban > 80 Includes highly developed areas where peop reside or work in high numbers. Examples include apartment complexes, row houses and commercial/industrial. Impervious surfaces account for le 80 to100 percent of the total cover."}, {"section_title": "Medium Intensity Urban", "text": "50 -79.9 Includes areas with a mixture of constructed materials and vegetation. Impervious surfaces account for 50-79 percent of the total cover. These areas most commonly include single-family housing units. Low Intensity Urban 20 -49.9 Includes areas with a mixture of constructed materials and vegetation. Impervious surfaces account for 20-49 percent of total cover. These areas most commonly include single-family housing units."}, {"section_title": "Open Space Developed < 20", "text": "Includes areas with a mixture of some constructed materials, but mostly vegetation in the form of lawn grasses. Impervious surfaces account for less than 20 percent of total cover. These areas most commonly include large-lot single-family housing units, parks, golf courses, and vegetation planted in developed settings for recreation, erosion control, or aesthetic purposes.  ----------------------------- anges reported as a re, urban) summarized in the \"Other\" ategory.                  Alexa J. McKerrow, Thomas R. Wentworth, Jaime A. Collazo, Martha J. Groom, George R. Hess, and Heather M. Cheshire."}, {"section_title": "Partner", "text": ""}, {"section_title": "Study Area", "text": "The Onslow Bight study area includes parts of 13 counties in Coastal North Carolina a covers an area of 250,000 km 2 . Eight of Omernik's Level IV ecoregional boundar intersect the study area (Figure 4.1; EPA 2004). Having been settled for hundred years, the area has undergone tremendous change. Much of the landscape today is dominated by agriculture and timber production (Auch 2006), with concentrations of urban growth centered in Wilmington, New Bern, and along the transportation corrido The Onslow Bight supports a diversity of plant communities, some of which have had their extents reduced dramatically by the history of settlement in the area. Historically the Carolina Flatwoods region supported a matrix of longleaf pine woodland Frost 1993. The Mid-Atlantic Floodplains and Low Terraces (EPA 2004) "}, {"section_title": "Land Cover Mapping", "text": "Land cover th using Landsat TM satellite imagery as the baseline dataset. In that map, the general land cover classes (for example, water, agriculture, and urban) were incorporated from the National Land Cover Dataset (NLCD 2001), while the vegetated classes were mapped using a combination of expert derived decision rules, image objects, and decision tree models (Chapter 2 this volume). The Ecological Systems Classificati  was the basis for the map legend. A total of forty two land cover classes were included in the final map legend. Overall accuracy was 77% and the Areas of change in non-urban areas were then labeled with respect to the types of change that had occurred by one of three methods, aerial photo-interpretation, dec rules based on ancillary data, or decision tree modeling. Urban areas identified as potential change areas were mapped using impervious surface estimation, similar to t approach used in the 2001 NLCD land cover dataset (Homer et al. 2004. We estimated a net change of 13% for the study area Based on the North Carolina GAP data, more than 300 terrestrial vertebrate species had a portion of their range within the study area . As a part of the later regional effort, the Southeast GAP modeled distributions for 47 amphibians birds, 53 mammals, and 63 reptiles that had with some portion of their distribution predicted to occur in the Onslow Bight. In this study, we used Southeast GAP's vertebrate database to create two models for each species of interest, one based on the 1992 land cover and another based on the 2001 land c s 2001) for use in the habitat modeling. For ancillary data layers not derived from the cover (e.g., species range maps, landforms), we assumed no change had occurred in the 9 year period. The only model parameters that did change were those derived f the 1992 and the 2001 land cover maps."}, {"section_title": "Land Stewardship Data", "text": "We used the Southeast Regional GAP Stewardship dataset for land ownership and management information. That dataset covers nine southeastern states and docu state and federal ownership and management. The G S addition to informat four Status categories as defined by GAP (Table 4.4). A gap status is assigned for e parcel based on a series of decisions that characterize the permanence of protection, management intent, and the scope and extent of management activities (Figure 4.2). The assignment of the gap status was based on information gathered from publish descriptions of agency mandates, management plans, or interview with key perso responsible for management of a parcel. We wanted to study the new land acquisitions with respect to their placement relative through agreements with the full range of land owners (e.g., private, non-governmental organization, local government), but the easement is held by the state of North Carolin Therefore we restricted our analysis of the new acquisitions to only the properties with conservation easements acquired by the state since 1992."}, {"section_title": "A", "text": ""}, {"section_title": "Gap Analysis", "text": "In a separate effort, a preliminary gap analysis of the Southeastern Regional land cove types was conducted by intersecting the regional Stewardship database with the nine state land cover map (Table 4.5). We used a threshold of 10% of the mapped distribution to identify gap cover types. From that analysis, eight of the Ecological Systems in the Onslow Bight were identified as gaps with less than 10% of their mappe distributions on GAP Status 1 and 2 lands throughout the region. Those maps were then summed to create a map with values of 0, 1, or 2 representing the num he advantage of these maps is a study area wide re mation regarding hot spots, we recognized the lack of information with respect to the species being served by any one site. Therefore we report the species specific changes in the scorecard process and propose a complementarity analysis for the Onslow Bight as a follow-up to this study. The thresholds established are subjective. A 5 % change in either direction was considered insignificant due to the variability inherent in classifying two dates of i Changes between 5 and 20% were considered significant but minor relative to those where more than 20% of the 1992 areal extent was lost or gained. We wanted to highlight those species and Ecological Systems whose distributions were changing a felt that a loss of more than 20% represented a substantial threat to a species a 20% gain indicated success that would warrant further exploration.  "}, {"section_title": "Priority Species Hotspots", "text": "The spatial distributions of the hotspots for the 123 SWAP species and the 38 PIF species are similar within the Onslow Bight (Figure 4.10). Concentrations occur for both agency lists along the river corridors and the large remaining peatland areas of th Onslow Bight. In the inner coastal plain, the hotspots are linked to the remaining fore patches. Figure 4.11 presents the hotspot maps for the two agencies, based on threshold of one-half of the maximum number of species predicted to occur at any one site. For SWAP, the maximum richness was 56 species and for PIF the maximum richness was 26 species, so thresholds were set at 28 and 13 respectively. H Figure 4.12 shows the areas where managed lands and habitat rich areas co-occur. 27% of the landscape was identified as a hotspot for both the SWAP and PIF priorities (         * indicates the species is NOT a gap species within the study area at a 10% threshold.   * indicates the species is NOT a gap species within the study area at a 10% threshold.  * indicates the species is NOT a gap species within the study area at a 10% threshold.       4.12. New state acquisitions relative to hot spots for SWAP and PIF priority species richness. Existing managed lands are outlined in black, state easement acquired after 1992 are outlined in re as with zeros represent areas that had fewer than half of the priority species fo r agency list predicted to occur. Areas with ones met the hotspot criteria agency, but not the other, and areas with twos represent hotspots for both y lists.  To 2001  2  4  6  8  9  10  11  14  16   X FW SV 0 NE 0 not 0 n 0 0 0 n 0 0 '-0 0 n BADWSA n n 0 0 Y 30 Y 0 X FW SV 0 0 NE 0 not n 0 0 0 n 0 0 '-0 0 n BAEASP n 30 30 n 250 X FW SV 0 0 NE 0 not 0 n 0 0 0 n 0 0 '-0 0 n Y 250 Y 250 BAFOSA n Y 30 0 Y 30 0 Y 0 X FW SV 0 0 NE 0 not 0 n 0 0 0 n 0 0 '-0 0 n BAGOFR n n 0 0 Y 500 0 n 0 0 FW V 0 0 NE 0 not 0 n 0 0 0 n 0 0 '-0 0 n BAGRSI n Y X 30 Y 0 30 Y 0 X FW SV 0 0 NE 0 not 0 n 0 0 0 n 0 0 '-0 0 n BALESI n 30 Y 0 X FW SV 0 0 NE 0 not 0 n 0 0 0 n 0 0 '-0 0 n Y 0 30 Y 0 BAMASA n n 0 0 Y 250 0 n 0 0 W V 0 0 NE 0 not 0 n 0 0 0 n 0 0 '-0 0 n BAMBSA n n 0 0 n 0 0 Y 250 X FW V 0 0 NE 0 not 0 n 0 0 0 n 0 0 '-0 0 n BAMLSA n Y 60 0 Y 60 0 n 0 0 FW SV 0 0 NE 0 not 0 n 0 0 0 n 0 0 '-0 0 n BANRWA n Y 0 X n 0 0 0 FW V 0 0 NE 0 not 0 n 0 0 0 n 0 0 '-0 0 n 3 n 0 BAOATO n n 0 0 0 FW V 0 E 0 0 '-0 0 Y X 30 n 0 N 0 not n 0 0 0 n 0 0 n BAOCFR n n 0 0 Y 60 30 Y 0 X FW V 0 0 NE 0 not 0 n 0 0 0 n 0 0 '-0 0 n BAPBTR n Y 60 0 Y 60 0 Y 60 X FW SV 0 0 NE 0 not 0 n 0 0 0 n 0 0 '-0 0 n BASDSA n Y 60 Y 60 0 Y 0 X FW SV 0 0 NE 0 not 0 n 0 0 0 n 0 0 '-0 0 n 0 BASPSA n n 0 Y 2 X FW V 0 0 NE 0 n 0 '-0 0 n 0 Y 250 0 50 0 not 0 0 0 n 0 BASRFR n n 0 0 Y 30 30 Y 30 X FW V 0 0 NE 0 not 0 n 0 0 0 n 0 0 '-0 0 n BATHSA n Y 60 0 Y 60 0 Y 60 X FW V 0 0 NE 0 not 0 n 0 0 0 n 0 0 '--47 1000 n BATISA n n 0 0 Y 250 0 Y 0 X W V 0 0 NE 0 not 0 n 0 0 0 n 0 0 '--47 3350 n BBAMBI n Y 500 30 Y 500 30 Y 500 120 FW V 0 0 NE 0 not 0 n 0 0 0 n 0 0 '-0 0 n BBAMKE n n 0 0 n 0 0 n 0 0 W V 0 0 NE 0 not 0 Y 13 0 0 n 0 0 '-0 0 n BBAMOY n Y X 30 Y X 30 Y 0 X BW V 0 0 NE 0 not 0 n 0 0 0 n 0 0 '-0 0 n BBAMWO n n 0 0 n 0 0 n 0 0 W V 0 0 E 250 not 0 n 0 0 0 n 0 0 '-0 0 n BBANHI n Y 250 1000 Y 250 1000 Y 250 1000 W V 0 0 NE 0 not 0 n 0 0 0 n 0 0 '-0 0 n BBBACS n n 0 n 0 0 n 0 0 W V 0 0 NE 0 not 0 Y 3 0 0 n 0 0 '-0 0 n 0 BBBAEA n Y 500 X Y 500 X n 0 0 W V 0 0 NE 0 AFI 120 Y 10 0 1000 n 0 0 M 0 0 n 172 n 60 Appendix 4.1 continued. BBBANO n n 0 0 n 0 n 0 0 W V 0 0 NE not 0 Y 100 0 n 0 '-0 BBBHNU n n 0 n 0 n 0 W V 0 0 NE not n 0 0 n 0 '--47 n BBBLRA X E not n n 0 Y 250 0 Y 25 W V 0 0 N 0 0 n 0 0 n 0 0 '-0 0 n 0 BBBLSK 0 0 E n n n Y X 500 Y X BW V 0 0 N 0 ot 0 n 0 0 0 n 0 '-0 0 n 0 BBBNST n n 0 Y 250 Y 0 X W V 0 0 NE 0 not 0 n 0 0 0 n 0 0 '-0 0 n 0 0 BBBRPE n n 0 n 0 0 n 0 0 W V 0 0 NE 0 not n 0 0 0 n 0 0 '-0 0 n 0 BBBTNW Y 0 n 0 0 0 0 0 '-0 n 0 n 0 W V 0 0 NE 0 not 0 Y 100 0 n 0 0 0 n BBCATE n n 0 Y X 50 Y 0 0 0 0 '-0 2 X BW V 0 0 NE 0 not 0 n 0 n 0 0 0 n 0 BBCHSW Y 0 n 0 0 0 0 0 M 0 n 0 n 0 0 W V 0 0 NE 0 not 0 n 0 n 0 0 0 n BBCOHA n 0 n 0 0 0 0 0 '-120 n 0 n 0 0 W V 0 0 NE not 0 n 0 n 0 0 0 n BBCOMO n 0 Y 120 60 120 0 0 0 '-0 n 0 Y X FW V 0 0 NE 0 not 0 n 0 n 0 0 0 n BBCONI n 0 n 0 0 0 0 0 '-0 n 0 n 0 0 W V 0 0 NE 0 not 0 n 0 n 0 0 0 n BBCOTE n 0 Y X 00 0 0 0 '-0 n 0 10 n 0 0 BW V 0 0 NE 0 not 0 n 0 n 0 0 0 n BBCWWI n 0 n 0 0 W 0 0 0 '--518 0 n 0 n 0 0 W V 0 0 ES 500 not 0 n 0 n 0 47 n BBDICK n 0 n 0 0 0 0 0 0 '-0 n 0 n 0 W V 0 0 NE 0 not 0 Y 1 0 n 0 0 0 n BBEAKI n 0 n 0 0 0 0 0 '--914 0 n 0 n 0 0 W V 0 0 E 250 not 0 n 0 n 0 47 n BBEAME n 0 n 0 0 0 6 0 0 '--1219 60 n 0 n 0 W V 0 0 NE 0 not 0 Y 0 n 0 47 n BBEAWP n 0 n 0 0 0 0 0 '--1371 0 n 0 n 0 0 W V 0 0 NE 0 not 0 n 0 n 0 47 n BBFISP n n 0 n 0 0 n 0 2 0 0 M 30 0 0 W V 0 0 NE 0 not 0 Y 0 n 0 0 0 n BBGBTE Y 0 Y 500 00 Y 0 0 0 0 '-0 n 0 5 X BW V 0 0 NE 0 not 0 n 0 n 0 0 0 n BBGLIB n 30 120 30 0 0 0 '-0 Y 120 Y n 0 0 W V 0 0 NE 0 not 0 n 0 n 0 0 0 n BBGRSP Y 0 n 0 0 0 0 0 0 H 0 n 0 n 0 W V 0 0 NE 0 not 0 Y 5 0 n 0 0 0 n BBHAWO n 0 n 0 0 0 2 0 0 '-0 n 0 n 0 W V 0 0 NE 0 not 0 Y 0 n 0 0 0 n BBHESP n 0 n 0 0 0 0 0 0 '-0 n 0 n 0 W V 0 0 NE 0 not 0 Y 3 0 n 0 0 0 n BBHOLA n 0 n 0 0 0 0 0 '-0 n 0 n 0 0 W V 0 0 NE 0 not 0 n 0 n 0 0 0 n BBHOWA n 0 n 0 0 0 0 5 0 0 '--12 0 n 0 n W V 0 0 NE 0 not 0 Y 1 0 n 0 47 00 n BBKEWA n 0 n 0 0 n 7 0 0 '--1150 3467 1 0 n 0 0 0 W V 0 0 NE 0 not 0 Y 1 0 n 0 47 2 9101 BBKIRA n 0 Y 250 0 Y 250 0 0 0 '-n 0 X W V 0 0 NE 0 not 0 n 0 n 0 0 0 n 0 BBLBHE n Y 30 X 30 Y 0 0 0 0 '-0 X Y X W V 0 0 NE 0 not 0 n 0 n 0 0 0 n BBLEBI n Y 30 500 30 Y 500 E 0 0 0 '-0 500 Y 120 W V 0 0 N 0 not 0 n 0 n 0 0 0 n BBLETE n 0 Y 50 0 0 0 '-250 Y X 25 X 2 Y 0 X W V 0 0 NE 0 not 0 n 0 n 0 0 0 n BBLOSH n 0 n 0 0 0 0 2 0 0 '--600 0 n 0 n W V 0 0 NE 0 not 0 Y 5 0 n 0 47 n L St SC S2,G5, Q X"}]