[{"section_title": "Abstract", "text": "A comprehensive account of the molecular and cellular mechanisms of action of sex steroids on the CNS is beyond the scope of this article; and several recent reviews of the area are available [3, 4] . Nevertheless, in the attempt to describe the biological plausibility for the hypotheses that estrogen and progesterone (PROG) deeply affect aspects of brain function, the mechanisms that are likely the most relevant will be briefly described here.\nThe vast majority of in vivo and in vitro studies, performed using laboratory animals, clearly demonstrate that estradiol (E2) is critical in the development, maintenance and recovery of normal neural structures and function. Estrogen is important in preserving normal neuronal morphometry, synapse formation and function, as well as morphological and functional relationships among neurons, astrocytes and microglia [5, 6] . Furthermore, these findings demonstrate that E2 is a potent neuroprotective factor that attenuates neuronal cell death and the proliferation of new neurons, while helping to maintain normal neural function in the face of injury or disease.\nDue to changes in lifespan, there is the need for new therapeutic strategies to promote successful aging, defined as low probability of disease, high cognitive and physical capacity and active engagement in life. Thus, brain vitality is essential to quality of life and survival in old age.\nDuring the menopause transition and the aging process, neurotransmitters, neuropeptides and neurosteroids undergo important changes as a consequence of the failure of gonadal hormone production, at a time when many CNS activities deteriorate, particularly those associated with hippocampal functions such as memory, attention, cognition and autonomic control [1] [2] [3] .\nThe neuropathological cascade of events contributing to the clinical diagnosis of brain impairment and dementia begins many years before the onset of overt memory dysfunction. These findings have led to a new appreciation of dementia and Alzheimer's disease (AD) as a chronic illness, rather than as a disease with a sudden onset late in life. The separation in time between early neural markers of brain aging and later memory dysfunction presents challenges to the study of midlife therapeutic interventions, aimed at modifying later clinical effects. For that reason, the evaluation of strategies to analyze and quantify the spectrum of brain symptoms throughout the menopause transition is becoming a major urgency in the women's health.\nIn the aftermath of the Women's Health Initiative studies, both the clinical and basic science communities had to sort out divergent results among experimental findings, observational data and randomized controlled trials in order to establish a shared analysis. The scientific community formally debates the role of different HRT formulations, hormone doses, time of treatment initiation since the menopause and the age of treated women. Basic scientists demonstrated that the multiple neuroprotective effects of estrogen on brain cells may induce a differential biological response according to the time of treatment. Progesterone (but not all synthetic progestins) also has pivotal neuroactive functions in animal models of reproductive aging. Additionally, epidemiological surveys provide information regarding the detrimental role of hypogonadism on mental well-being. The present article briefly summarizes current evidence supporting the neuroactive role of estrogen, with reference to the clinical finding sustaining the intriguing hypothesis of the early female brain senescence as a highly responsive period to estrogen treatment."}, {"section_title": "", "text": "A comprehensive account of the molecular and cellular mechanisms of action of sex steroids on the CNS is beyond the scope of this article; and several recent reviews of the area are available [3, 4] . Nevertheless, in the attempt to describe the biological plausibility for the hypotheses that estrogen and progesterone (PROG) deeply affect aspects of brain function, the mechanisms that are likely the most relevant will be briefly described here."}, {"section_title": "Estrogens", "text": "The vast majority of in vivo and in vitro studies, performed using laboratory animals, clearly demonstrate that estradiol (E2) is critical in the development, maintenance and recovery of normal neural structures and function. Estrogen is important in preserving normal neuronal morphometry, synapse formation and function, as well as morphological and functional relationships among neurons, astrocytes and microglia [5, 6] . Furthermore, these findings demonstrate that E2 is a potent neuroprotective factor that attenuates neuronal cell death and the proliferation of new neurons, while helping to maintain normal neural function in the face of injury or disease.\nDue to changes in lifespan, there is the need for new therapeutic strategies to promote successful aging, defined as low probability of disease, high cognitive and physical capacity and active engagement in life. Thus, brain vitality is essential to quality of life and survival in old age.\nDuring the menopause transition and the aging process, neurotransmitters, neuropeptides and neurosteroids undergo important changes as a consequence of the failure of gonadal hormone production, at a time when many CNS activities deteriorate, particularly those associated with hippocampal functions such as memory, attention, cognition and autonomic control [1] [2] [3] .\nThe neuropathological cascade of events contributing to the clinical diagnosis of brain impairment and dementia begins many years before the onset of overt memory dysfunction. These findings have led to a new appreciation of dementia and Alzheimer's disease (AD) as a chronic illness, rather than as a disease with a sudden onset late in life. The separation in time between early neural markers of brain aging and later memory dysfunction presents challenges to the study of midlife therapeutic interventions, aimed at modifying later clinical effects. For that reason, the evaluation of strategies to analyze and quantify the spectrum of brain symptoms throughout the menopause transition is becoming a major urgency in the women's health."}, {"section_title": "Review", "text": "Menopause and mental well-being: timing of symptoms and timing of hormone treatment Nicola Pluchino †1 , Fiorella Bucci 1 , Vito Cela 1 , Alessandra Cubeddu 1 & Andrea Riccardo Genazzani 1 In the aftermath of the Women's Health Initiative studies, both the clinical and basic science communities had to sort out divergent results among experimental findings, observational data and randomized controlled trials in order to establish a shared analysis. The scientific community formally debates the role of different HRT formulations, hormone doses, time of treatment initiation since the menopause and the age of treated women. Basic scientists demonstrated that the multiple neuroprotective effects of estrogen on brain cells may induce a differential biological response according to the time of treatment. Progesterone (but not all synthetic progestins) also has pivotal neuroactive functions in animal models of reproductive aging. Additionally, epidemiological surveys provide information regarding the detrimental role of hypogonadism on mental well-being. The present article briefly summarizes current evidence supporting the neuroactive role of estrogen, with reference to the clinical finding sustaining the intriguing hypothesis of the early female brain senescence as a highly responsive period to estrogen treatment.\nSeveral laboratories have shown that E2 exerts neuroprotective actions in adult animals and protects against a broad spectrum of injuries, such as cerebral contusion [7] , hypoxia [8] , administration of excitatory amino acids [9] and drug-induced toxicity [10] . Results from animal studies have provided particularly strong evidence that E2 is a neuroprotective factor that attenuates the degree of ischemic brain injury [11] [12] [13] [14] [15] [16] . Estrogens appear to protect against b-amyloid-induced cell death [10, 17, 18] as well as act to enhance memory [19] in animal models and in vitro culture models.\nThe effects of estrogens occur via two main mechanisms: one through the putative membrane receptor and a second through direct modulation neurotransmitter, neurotrophins and neurosteroids. E2 receptors a (ERa) and E2 receptors b(ERb) have been localized in the amygdale, hippocampus, cortex, basal forebrain, cerebellum, locus coeruleus, midbrain, rafe nuclei, glial cells and central gray matter; thus proving an involvement of the estrogens in the control of the well-being, cognitive functions and memory processes, both under physiological as well as pathological conditions [20] . In these genomic mechanisms, steroids induce relatively long-term actions on neurons, such as modulating the synthesis, release and metabolism of many neuropeptides and neuroactive transmitters, as well as the expression of their receptors [21] . Moreover, sex steroids bring to bear very rapid effects in the brain that cannot be attributed to genomic mechanisms [22] . These 'nongenomic or nonclassical' effects are likely to be mediated by receptors integrated or associated with the plasma membrane; and by an activation of distinct intracellular signaling cascades [23] . The variety of nongenomic estrogen effects includes: • Rapid actions on excitability of neuronal and pituitary cells;\n• Activation by estrogens of cyclic adenosine monophosphate and mitogen-activated protein kinase pathways that affect activity of such targets as kainate and IGF-1 receptors;\n• Actions that involve modulation of G protein coupling and affect calcium currents;\n• Effects on calcium channels and calcium ion entry;\n• The protection of neurons from damage by excitotoxins and free radicals [24] [25] [26] [27] [28] .\nThe effects of estrogen on the serotonergic, cholinergic, dopaminergic and noradrenergic systems may contribute to many aspects of brain function that are affected by ovarian hormones, including affective state, movement disorders and cognitive function, thus evoking an essential pathogenic role in neurodegenerative diseases [29] . CNS estrogen effects that may modulate mood include monoamine oxidase inhibition at high levels, tryptophan displacement from plasma albumin-binding sites and effects on 5-hydroxytryptamine 2 (5-HT2) receptor binding and downregulation [30, 31] . When administered to oophorectomized monkeys, estrogens increased the synthesis of tryptophan hydroxylase and the expression of tryptophan hydroxylase mRNA in the dorsal raphe [32] . Acute administration of E2 to oophorectomized rats also increased the density of 5-HT2A receptors in brain areas that are thought to be involved in mood and cognition: the anterior frontal, anterior cingulate and pyriform cortices, the olfactory tubercle, the nucleus accumbens and the lateral dorsal raphe nucleus [33] . These findings suggest that estrogens may affect mood by increasing the concentration of 5-HT receptors in key areas of the brain. In rats, E2 decreases monoamine oxidase activity in the amygdala and basomedial hypothalamus and induces serotonin receptors in forebrain regions involved in cognition and behavior, including the frontal lobe, cingulated cortex and nucleus accumbens [34] .\nNormal aging is associated with a reduction in cholinergic functional markers, such as choline acetyltransferase (ChAT), but a relative preservation of cholinergic cells and terminals [35] . Studies in experimental animals have indicated that estrogens may influence brain function through effects on the cholinergic system. Receptors for gonadal hormones have been identified in the nuclei of the basal forebrain, the major source of cholinergic innervation to the cerebral cortex, hippocampus and hypothalamus [36] . Estrogen is known to provide trophic support to cholinergic cells and to regulate various markers of cholinergic function, including ChAT and acetylcholine release [37] . Experiments with ovariectomy plus estrogen replacement therapy revealed an induction of ChAT, the rate-limiting enzyme for acetylcholine formation, within 6-24 h in the basal forebrain of female rats. In addition, estrogen treatment increased ChAT activity in projection areas of the basal forebrain 10 days after hormone injection, suggesting that estrogeninduced ChAT was transported from cell bodies to nerve endings in the cerebral cortex and hippocampus [38, 39] ."}, {"section_title": "Menopause & mental well-being -Review", "text": ""}, {"section_title": "Progesterone & progestins", "text": "In the CNS, PROG receptors (PR)-A and PR-B have been localized in many of the same brain areas as estrogen receptors, including the amygdala, hippocampus, cortex, basal forebrain, cerebellum, locus ceruleus, midbrain rafe nuclei, glia cells and central gray matter thus confirming an involvement of PROG in modulating well-being, cognitive and memory processes both in physiological and pathological conditions [40] . PR-A and -B are colocalized in most tissues and their expression is upregulated by E2, while PROG downregulates its own receptor expression. In vivo and in vitro evidence of differential transcriptional activities and comodulator interaction between PR-A and PR-B predicts that these isoforms could present different functions in mediating signaling pathways within steroid-sensitive neurons [41] . Through the classical genomic mechanism, steroids induce slower long-term action on neurons by activating specific intracellular receptors, which regulate gene-transcription as well as protein-synthesis, thus modulating the synthesis, release and metabolism of many neuro peptides, neurotransmitter and their receptors. Membrane effects, involving interactions of steroids with ion channels, neuro transmitter receptors or peptidic hormone receptors have also been described. These effects are rapid, suggesting nongenomic actions. Concerning the nonclassical pathway, several research groups have established that PROG is able to interact with membrane receptors, such as the PROG receptor membrane component (PGRMC)1, sigma 1 receptor and γ-aminobutyric acid receptor-A (GABA-A), through its neurometabolite allopregnanolone; PGRMC1 is localized on the membrane of hypothalamic spinal neurons [42, 43] and its expression was shown to be induced by E2 treatment, suggesting a role in the activation of female sex behavior [42] . A role for PGRMC1 in mediating the protective effects of PROG in the nervous system is also supported by the observation that its mRNA and protein were upregulated by PROG treatment in dorsal horn neurons of spinal cord-injured male rats [43] . In addition, PROG may exert CNS membrane effects through the opioidergic, cholinergic and GABA systems. The nicotinic receptor of acetylcholine is also a target of PROG and this steroid inhibits the activity of the receptor independently of the membrane potential [44] . PROG promotes the survival of ventral motoneurons in the wobbler mouse [45, 46] and also increases the survival of facial motoneurons after axotomy [47] . Interestingly, the protective effects of PROG have been documented in the rat brain after traumatic injury. This data could explain why female rats have significantly less edema and show better cognitive recovery than males after traumatic brain injury [48] . PROG was still effective in reducing edema when treatment was delayed for 24 h after injury [49] . In addition to the reduction in edema, treatment with PROG also prevented secondary neuronal degeneration and reduced the behavioral impairments resulting from contusion of the medial frontal cortex [50] . PROG has also been shown to offer neuroprotection after axotomy, contusion injury of the spinal cord and cerebral ischemia [47, 51, 52] . Another positive central role of PROG is in myelination. It has first been observed in peripheral nerves, where PROG synthesized by Schwann cells promotes the formation of new myelin sheaths after lesion. This function of PROG is of significance for the aging brain and peripheral nerves, characterized by the loss of myelin [53] . PROG upregulates expression of antiapoptotic proteins such as Bcl-2 [54, 55] , reduces inflammation by repressing the activation of microglial cells and inhibiting the production of proinflammatory cytokines [56] and upregulates the expression of neurotrophins such as brain-derived neurotrophic factor [57] , a neurotrophin involved in neuronal plasticity processes and the levels of which are influenced by the hormonal variation of the menstrual cycle [58] .\nNeurons and glial cells express all the enzymes necessary for PROG, testosterone and E2 metabolism into neuroactive metabolities (aromatase, 5-a reductase [5a-R], mainly in neurons, 3-a-hydroxysteroid dehydrogenase [3a-HSD], mainly in type 1 astrocytes [59] ).\nThe CNS is also able to synthesize steroids from cholesterol, at least in part independently of peripheral steroidogenic gland secretion [60] , leading to the production of a series of potent steroidal compounds. These brain-produced steroids have been named 'neurosteroids' [61] . Several studies have shown that some psychological functions and symptoms such as depression, anxiety, irritability and affectivity can be related to the fluctuation of the synthesis and the release of the neurosteroids, in particular allopregnanolone and dehydroepiandrosterone (DHEA). Allopregnanolone is a 3-a, 5-a reduced metabolite of PROG and his major sources of circulating levels are gonads and adrenal cortex, more than the CNS [62, 63] . Allopregnanolone acts as an agonist on GABA-A receptor, modulating stress, mood and behavior with anxiolytic, sedative and antiepileptic effects [63] . Allopregnanolone brain levels increase during acute stress, pregnancy, antidepressant and anxiogenic drugs; however, they decrease during chronic stress, parturition and depression."}, {"section_title": "Menopause & mood disorders: depression & anxiety", "text": "Epidemiologic data suggest an increased incidence and prevalence of depressive symptoms in women in their mid-40s and women between the ages of 55 and 64 years. E2 deficiency has been suggested to be the cause of this increased prevalence of depressive disorders in women and the menopausal transition appears to be a period of vulnerability to depressive symptoms in women with or without a history of depression [64] [65] [66] [67] . It has been demonstrated that psychological distress appears to increase in early perimenopause compared with premenopause and vasomotor symptoms further increase the risk of psychological distress [68] . The Study of Women Across the Nation (SWAN), a large multirace study of midlife women, indicated that 40.5% of participants reported increased irritability, nervousness, mood changes and dysphoric mood in the previous 2 weeks in early perimenopause compared with premenopause [69] . Additionally, 14.3% reported feeling depressed 6 or more days within the past 2 weeks [70] . Considering that the perimenopause can last some years, the risk of developing depression during this phase can be as high as 14 times that of premenopausal women [71] . Depression is the second leading cause of disability in developed countries [72] and the potential burden of illness experienced by depressed perimenopausal women is significant. In particular, women experiencing long transitions to menopause were at greater risk of depression than those having short transitions [73, 74] . The association between a long perimenopause and depression appeared to be explained by increased menopausal symptoms rather than by the menopause status: the presence of vasomotor symptoms appears to be associated with a higher prevalence of depressed mood, and anxiety is a significant predictor of hot flashes among women in the late reproductive years [75, 76] .\nAdditionally, Brown et al. in a populationbased cross-sectional study of 639 women, determined significant links between depressive symptoms and several menopausal symptoms including hot flashes, sleep disturbance and irritability (the Harvard Study of Moods and Cycles). In particular, Brown et al. found a twofold increase in the risk of developing depressive symptoms during the perimenopause among women who reported nocturnal hot flashes, without a history of depression [77] . The experience of hot flashes at baseline was significantly more frequent among women who reported severe depressive symptoms during an 8-year follow up as compared with women who did not exhibit mood symptoms during the follow up period. Additionally, participants with severe mood symptoms during follow up were 2.16 times more likely to report hot flashes at the same visit.\nThe effect of the menopausal transition and sex hormones on anxiety disorders and symptoms is much less commonly studied than depression, even though nearly half of midlife women experience anxiety and stress symptoms. Data from the Penn Ovarian Aging Study (POA) strongly support that anxiety was strongly associated with hot flashes in a community-based cohort of African-American and white women. The most anxious women had the most severe and most frequent vasomotor symptoms [78] . The relationship between hot flashes and anxiety persisted after adjusting for menopause transition stage, depressed mood symptoms, smoking, BMI, E2, age, race and time since the baseline measures in the study.\nInteresting data on the relationship between sex steroids, menopause and mood disorders came from the Mayo Clinic Cohort Study of Oophorectomy and Aging by Rocca et al. [79] . This study involved a population-based cohort of women residing in Olmsted County (MN, USA) who underwent oophorectomy before the onset of menopause for a noncancer indication during the 38-year period from 1950 to 1987. For a median follow-up period of 24 years, the risk of anxiety symptoms increased significantly in women who underwent bilateral oophorectomy compared with referent women (adjusted hazard ratio [HR]: 2.29; 95% CI: 1.33-3.95). The increased risk of anxiety symptoms was particularly evident among women who underwent surgery before the age of 48 years (adjusted HR: 2.66; 95% CI: 1.39-5.09). Bilateral oophorectomy was also a risk factor for depression diagnosed by a physician (adjusted HR: 1.54; 95% CI: 1.04-2.26).\nNeurobiologically, both vasomotor symptoms and mood disorders are regulated by the monoamine neurotransmitters serotonin, norepinephrine and dopamine. As a result, dysregulation of these systems can lead to depression, when that dysregulation occurs within brain areas deputed to mood control (prefontral cortex, limbic system) and can lead to vasomotor symptoms when the dysregulation involves the hypothalamic centers deputed to thermoregulatory body mechanism.\nIn the previous paragraph we evaluate the positive neurobiological effect that estrogens have in brain monoamine turnover; thus, it is theoretically possible that treating vasomotor symptoms using estrogens could prevent depression or reduce the depressive mood in vulnerable women. In addition, remission from symptoms of mood disorders such as anxiety, depression and sleep disturbance without a full reduction of vasomotor symptoms could be a signal that estrogen fluctuation in the brain continues to create vulnerability for relapse in mood disorders [80] .\nA role for neurosteroids in central menopausal symptoms has recently also been hypothesized. Menopause transition is associated with decreased allopregnanolone levels, mainly due to reduced ovarian synthesis of PROG, supporting its role in mood disorder physiology during the climacterium. Indeed low circulating allopregnanolone levels are associated with the onset of depression and anxiety during reproductive aging.\nIn postmenopausal women, hormonal replacement therapy (HRT) is able to modify circulating levels of neurosteroids, determining an increase in allopregnanolone levels and a decrease in DHEA [65] . These data indicate a main role for these compounds as neuroendocrine mediators of the effects of estrogens on the CNS and that the effect exerted by HRT on allopregnanolone levels might be related to the anxiolytic and sedative effects of HRT in menopausal women. However, synthetic progestins available in the clinical setting have different effects on central neurosteroidogenis, supporting the concept that synthetic progestins may show differential activity on brain biology. This feature involves the synthesis of brain allopregnanolone and the specific activity on the GABA-A receptor of progestins, rather than the activation of PRs [81] .\nHowever, certain women experience negative mood symptoms as a result of the addition of PROG or progestagens in sequential hormone therapy (HT). This phenomenon is believed to be mediated via the action of the PROG metabolites on the GABA-A system.\nIt has been suggested that several GABA-A receptor modulators, including allopregnanolone, have biphasic effects, in that low concentrations increase an adverse, anxiogenic effect, whereas higher concentrations decrease this effect and show beneficial, calming properties. The severity of negative mood symptoms in certain women may be related to the allopregnanolone serum concentrations during HT -negative mood symptoms occur when the serum concentration of allopregnanolone is similar to endogenous luteal phase levels, while low and high concentrations have a positive effect on mood [81] .\nCertainly, the study of neurosteroids in menopausal-related mood changes may offer several new perspectives to allow a greater understanding of the brain pathophysiology of the climacterium and hormonal strategies to cure it.\n• Estrogen deficiency has been suggested as a cause of the increased prevalence of depressive disorders and anxiety in women and the menopausal transition appears to be a period of vulnerability to depressive symptoms, with or without a history of depression, and vasomotor symptoms further increase the risk of psychological distress. • Both vasomotor symptoms and mood disorders are regulated by the monoamine neurotransmitters serotonin, norepinephrine and dopamine and a role of neurosteroids in central menopausal symptoms has been also recently hypothesized. • In postmenopausal women, hormonal replacement therapy is able to modify circulating levels of neurosteroids, determining an increase in allopregnanolone levels and a decrease in dehydroepiandrosterone with anxiolytic and sedative effects."}, {"section_title": "Menopause & cognitive decline: early symptoms for an early treatment", "text": "The detection of early neural markers of brain aging and cognitive dysfunction is one of the main challenges for the climacterium and the initial postmenopause period; thus, the degree of cognitive vitality during the aging process could also depend on early clinical interventions.\nThe evidence that estrogen has several neuro protective effects brings new meaning to the potential impact of the prolonged postmenopausal hypoestrogenic state on learning and memory, as well as to the possible increase of vulnerability in brain injury and neurodegenerative diseases in aging women.\nThe apparent dichotomy between the beneficial actions of E2 on the brain of experimental animals and findings from randomized controlled trials in women (mainly Women's Health Initiative Memory Study [WHIMS]) also finds a solution through the critical analysis of clinical data that definitely supports the neurotrophic effect of estrogen.\nResults from the Mayo Clinic Cohort Study of Oophorectomy and Aging provide the level of the long-term influence that sex steroid deprivation has on cognitive vitality. Particularly, women who underwent either unilateral or bilateral oophorectomy reported an increased risk of cognitive impairment or dementia compared with others who underwent natural menopause (adjusted HR: 1.46; 95% CI: 1.13-1.90) [82] . In another study, the risk of Parkinson disease was higher in women who underwent either unilateral or bilateral oophorectomy (adjusted HR: 1.68; 95% CI: 1.06-2.67) [83] . In both studies, a younger age at menopause was associated with increased risk of neurological impairment (i.e., the linear trend was significant). In this regard, Rocca et al. also observed significant linear trends of increasing risk for either outcome with younger age at oophorectomy [83] .\nAs a conclusion, estrogen deficiency can be defined as the initial step of a chain of causality, which determines the increased risk of cognitive impairment or dementia. In support of the neuroprotective effect of estrogen, women who underwent bilateral oophorectomy before 49 years of age, but were given estrogen treatment until at least 50 years of age, reported no increased risk.\nEpidemiological surveys, prospectively monitoring women through the menopause transition, have suggested that self-reports of decreased concentration and poor memory are frequent accompaniments of climacterium and of postmenopause. In the SWAN, more than 40% of perimenopausal and postmenopausal women endorsed forgetfulness on a symptom inventory compared with 31% of premenopausal women [84] . In the Seattle Midlife Women's Health Study, approximately 62% of midlife women reported an undesirable change in memory [85] .\nMaki et al. investigated the relationship between objective measures of hot flashes and one particular domain, verbal episodic memory, in a sample of midlife women. In this regard, the presence of objective hot flashes is a negative predictor of verbal memory in midlife women with moderate-to-severe vasomotor symptoms. This relationship appears to be primarily due to nighttime rather than daytime hot flashes, thus supporting the concept that hot flashes and sleep disturbances are a sign of brain vulnerability to sex steroid withdrawal, with a negative impact of cognition [86] . Hypothalamic and hypothalamic pituitary gonadal axis senescence induces vasomotor symptoms and hypogonadism that could trigger menopause-related mental decline in other brain areas, before deficits in learning and cognition start to become evident. The epidemiological data on the neuroprotective effects of E2-based therapy were reviewed by Leblanc and colleagues [87] : women who were symptomatic from the menopause had improvement in verbal memory, vigilance, reasoning and motor speed when they received HRT [88] [89] . The same meta-ana lysis of observational studies examining HRT and cognitive function also suggests a significant reduction of the risk of developing dementia among women who have ever used HRT [87] . Specifically, the strongest evidence for an association between HRT and AD comes from two cohort studies: the Manhattan Study of Aging [90] and the Baltimore Longitudinal Study of Aging [91] . The two prospective cohort studies that reported a significantly reduced risk of AD in estrogen users are particularly compelling due to the fact that they avoid both recall and prescribing-practice bias. In the Italian Longitudinal Study on Aging, estrogen replacement therapy was associated with a reduced prevalence of AD in 2816 women (OR: 0.24; 95% CI: 0.07-0.77) [92] . Analysis of observational data from the Cache County Study suggested a reduction in the risk of AD for past HRT users for 3-10 years. In the same study, the 'excess' risk of AD, when compared with ageequivalent men, disappeared among women who received HRT for more than 10 years [93] .\nIn this regard, the fact that the WHIMS, the largest randomized controlled trial to date, failed to find that estrogen therapy had a protective effect against cognitive aging becomes biological comprehensible. WHIMS findings do not address the possible role of HRT initiated before the age of 65 years [94] [95] [96] [97] . Group differences in preexisting risk factors (hypertension, obesity and diabetes) partly explain the increased rates of adverse vascular effects among women taking HRT [98] . Moreover, WHIMS conclusions, like those of the earlier reports of WHI study, are related to the specific strength formulation of HT and not to different formulations or routes of administration. The oral HT used in WHIMS was either unopposed conjugated equine estrogen or continuous combined conjugated equine estrogen and medroxy progesterone acetate. Previous reports also suggest that medroxyprogesterone acetate counteracts the beneficial effects of estrogen [99] .\nThe most persuasive explanation for the failure of WHIMS to find a beneficial effect of estrogen on cognition, is that the women were too old at the time when treatment was initiated to have any protective effect.\nIndeed, the majority of studies and meta-analyses evidencing cognitive benefits during HRT analyzes young symptomatic postmenopausal women, supporting the concept of the existence of a 'window of opportunity' for estrogen neurotrophic effects [100] [101] .\n• Estrogen deficiency can be defined as the initial step of a chain of causality that determines the increased risk of cognitive impairment or dementia and hot flashes and sleep disturbances, signs of brain vulnerability to sex steroid withdrawal, have a negative impact on cognition. • Symptomatic women have improvement in verbal memory, vigilance, reasoning and motor speed when given HRT."}, {"section_title": "Conclusion", "text": "In the aftermath of the WHI studies, both the clinical and basic science communities were required to analyze and build a consesus on divergent results emerging from these randomized controlled observational and translational studies. The different nature of HRT formulations and additional variables were discussed and critical issues including the time of initiation of the treatment and the age of the subjects were observed and analyzed.\nBasic scientists demonstrated that the multiple neuroprotective effects of estrogens on brain cells may induce a differential biological response according to the time of treatment; PROG (but not all synthetic progestins) also has critical neuroactive functions in animal models of reproductive aging.\nAdditionally, epidemiological surveys provide information regarding the detrimental role of hypogonadism on mental well-being, thus stratifying findings related to patients' characteristics as well as symptoms both for time of steroid withdrawal and subsequent exposition [79] .\nThese analyses are able to reconcile findings from basic research and clinical data, thus supporting the concept of a positive role of sex steroids in mental well-being, as well as a powerful therapeutic tool for those women for whom ovarian steroids are critically involved in the regulation of affective, cognitive and behavioral adaptation to aging.\nEvidences sustaining the intriguing hypothesis of early symptoms of hypothalamic and HPG axis senescence (i.e., vasomotor symptoms) might indicate the vulnerability of other brain areas (i.e., amygdale, hippocampus and prefrontal cortex) in developing future dysfunctions during the aging process. The identification of the initial role of estrogen deficiency in the chain of causality of lifelong increased risk of mood disorders and cognitive impairment in vulnerable women solidly supports the early temporal initiation of estrogen therapy."}, {"section_title": "Future perspective", "text": "A critical ana lysis of the available literature may reconcile findings from basic research and clinical data, thus supporting the concept of a positive role for sex steroids in mental well-being, as well as the potential of being a powerful therapeutic tool for those women for whom ovarian steroids are critically involved in the regulation of the affective, cognitive and behavioral adaptation to aging. In the future, data from ongoing studies, specially designed for these end points, will provide additional evidence on one of the most discussed issues in women health."}, {"section_title": "Executive summary", "text": ""}, {"section_title": "Pleiotrophic effects of sex steroids on the brain: lessons from basic science & translational research", "text": "• During the menopause transition and the aging process, neurotransmitters, neuropeptides and neurosteroids undergo important changes as a consequence of the failure of gonadal hormone production, at a time when many CNS activities deteriorate, particularly those associated with hippocampal functions such as memory, attention, cognition and autonomic control. • Estradiol is a potent neuroprotective factor that attenuates neuronal cell death and the proliferation of new neurons, while helping maintain normal neural function in the face of injury or disease. • The effects of estrogens occur via two main mechanisms: one through the putative membrane receptor and a second through direct modulation of neurotransmitter, neurotrophins and neurosteroids. • In the CNS, progesterone is involved in modulating well-being, cognitive and memory processes both in physiological and pathological conditions. • Progesterone acts through genomic and nongenomic mechanisms such as: progesterone receptor membrane, SIgMA 1 receptor and gABA-A receptor, through its neurometabolite allopregnanolone."}, {"section_title": "Conclusion & future perspective", "text": "• Basic science communities demonstrated that the multiple neuroprotective effects of estrogen on brain cells may induce a differential biological response according to the time of treatment; and that progesterone (but not all synthetic progestins) also has pivotal neuroactive functions in animal models of reproductive aging. • The identification of the initial role of estrogen deficiency in the chain of causality of lifelong increased risk of mood disorders and cognitive impairment in vulnerable women solidly supports the early temporal initiation of estrogen therapy."}]