[{"section_title": "Introduction", "text": "Tropical cyclones (TCs) are one of the major meteorological hazards as a cause of flooding, landslides, damaging winds, high waves, and storm surges. Depending on their size, intensity, track, and translation speed, TCs affect wide regions in the tropical, the sub-tropical, and the mid-latitude regions. After reaching a certain intensity, TC is specifically called a typhoon in the western North Pacific, a hurricane in the northeastern Pacific and in the North Atlantic, and a cyclone in the north Indian Ocean. Such intense TCs have spawned devastating damages from the past up to the present; recent examples include Hurricane Katrina in 2005, Cyclone Nargis in 2008, Typhoon Morakot in 2009, Hurricane Sandy in 2012, Typhoon Haiyan in 2013, and Tropical Cyclone Pam in 2015. For the purpose of mitigating and preventing disasters due to such intense storms, timely and proper warning based on accurate numerical weather prediction is prerequisite. Although numerical weather prediction of such destructive TCs is still a scientific challenge, some studies have recently shown that extended-range predictions of TCs beyond two weeks can be conducted under certain synoptic-scale conditions (Nakano et al., 2015;Xiang et al., 2015). Given the progress in quantitative weather forecasting of the track and intensity of TCs, the accuracy of warning for anticipated disasters will be improved. From the perspective of mitigating and preventing disasters, long-term projections of TCs under climate change are also important. Global warming in the future is expected to affect the characteristics of TCs, in particular their frequency, intensity, and track. Such future changes of TCs would give significant impacts on natural disasters. Therefore, in order to mitigate and prevent TC-related disasters in the long term we need to assess the characteristics of TCs under global warming and the resulting impacts of future TCs on natural disasters. Among the intense TCs in recent years, Cyclone Nargis (2008), Hurricane Sandy (2012), Typhoon Haiyan (2013), and Tropical Cyclone Pam (2015) caused significant coastal disasters. Because most of the major urban areas in the world are located in the coastal regions, intense TCs that make landfall or pass near the coastal regions affect a large number of people and social infrastructures. With the continuous growth of populations and social infrastructures in coastal urban regions in the future, intense TCs will increasingly be a threat to the human society especially in coastal regions. The impact assessment of coastal hazards due to anticipated changes of intense TCs under future climate change is of great concern. Because of the rapidly growing population in Asia (United Nations, 2012), TCs in the western North Pacific and in the Indian Ocean more significantly affect the economic and industrial activities as well as human lives than those in other ocean basins. Here we focus on TCs in the western North Pacific, i.e., typhoons. The direct consequence of sea-level rise is inundation of lowlying coastal areas, which is a long-term concern and a gradual process of climate change effects. The Intergovernmental Panel on Climate Change (IPCC) the Fifth Assessment Report (AR5) (2013) Contents lists available at ScienceDirect journal homepage: www.elsevier.com/locate/wace states that climate change exacerbates the vulnerability of coastal regions to other extreme and impulsive physical processes, such as storm surges and storm waves. Future changes in storm surge and ocean wave climates are a dynamic side issue of how climate change influences coastal regions (e.g. Mori et al., 2010;Hemer et al., 2013). If extreme weather events become stronger in the future, it is necessary to seriously consider the effects of these dynamic phenomena to prevent and reduce the impact of coastal disasters. The wave hindcasts in the Atlantic Ocean show more significant wave height increase in the region off the Canadian coast and the northwest of Ireland but less significant change in the North Sea and in the region off the Scandinavian coast. In addition, the long-term changes to storm surge and storm waves are important considerations for structures near the coastal zone. For example, a coastal breakwater is designed with a maximum storm surge level and pressure from a maximum wave condition, a so-called design wave, for a predetermined design lifetime. Generally, coastal areas that will be most affected by increases in storm surge are the heavily populated mega-delta regions of East Asia, South-East Asia, South Asia and the Gulf of Mexico. Tropical cyclone (TC) activity has major impacts on the delta regions located in the subtropical to mid-latitude zones. In these regions, 1-hPa decrease in atmospheric pressure corresponds to 1-m change in the barotropic effect to storm surge, and wind-induced surge is proportional to the square of wind speed (e.g. Nielsen, 2009). Also, wind induced surge is related to the moving speed and duration of a storm, and to the bathymetry of the bay. Therefore, storm surge is not only sensitive to TC intensity, but also to the track of the cyclone. Moreover, a certain number of TC tracks is necessary to make an assessment of storm surge risk at a particular location. Future storm surge projections have been conducted for particular places such as Europe and East Asia. For example, Lowe and Gregory (2005) and Woth (2005) have analyzed future storm surges around the UK and in the North Sea regions, and they showed significant increases in storm surge elevations for the UK coast and the continental North Sea coast resulting from increases in the intensities of mid-latitude storms. Yasuda et al. (2014) and Zhao et al. (2014) show the impact of future storm surge changes in East Asia. For the subtropical to mid-latitude zones, however, future storm surge projections are limited due to the lack of knowledge of how TCs in these regions will change. furthermore, in these latitudes the majority of coastal regions measuring a few hundred kilometers in area have limited historical records of TC landfall. Therefore, assessing the TC risk in a particular region is difficult even considering the present climate alone. One way to overcome the limited amount of actual events is to use statistical modeling of TC events and another way is pseudo global warming experiments by a regional climate model. Combining dynamic and statistical climate models gives a useful tool to assess the risks of future TCs and related coastal hazard. This study describes a brief review of future projections of TC characteristics due to global climate change. Then, we provide a review and ongoing research on the impact assessment of tropical cyclones for both dynamic downscaling and statistical models. Finally, we describe how TC characteristics change in the future climate changes coastal hazard based on the different approaches. A schematic flow chart of projection and impact assessment of climate change is shown in Fig. 1 (the numbers in Fig. 1 indicate the sections subsections in the manuscript)."}, {"section_title": "Past and future changes of tropical cyclones", "text": "In this section, we briefly overview the current understanding on the changes in the characteristics of TCs in the past and in the future. The current status of the understanding which has gained consensus among the broad scientific community is found in IPCC AR5 (2013). Based on the results included in IPCC (2013) and from other recent studies, we describe the characteristics on TCs in the western North Pacific from an impact assessment perspective."}, {"section_title": "Past changes of tropical cyclones", "text": "First, we give an overview on the changes of TCs in the past. For the assessment of the long-term changes in the TC activities, quantitative information on the intensity and track of TCs is necessary. Such reliable data have been available since the beginning of the satellite era starting from around the 1970s. Weather surveillance geostationary satellites give reliable data on TCs over each ocean basin, although the starting point of such observations depends on each ocean basin. For example, the observations by the Japanese Geostationary Meteorological Satellite \"Himawari\" over the western half of the Pacific started in 1977. Before the satellite era, aircraft observations played a role in quantifying the activity of TCs. However, without aircraft or satellite observations it is quite difficult to gain quantitative information on TCs. Therefore, data availability imposes a strong limitation on the assessment of the long-term changes in past TC activity. Although efforts have been made to archive long-term data on the TC activity back to the middle of the 19th century (International Best Track Archive for Climate Stewardship (IBTrACS), which is maintained by The National Oceanic and Atmospheric Administration (NOAA)), data that have uniformity in time and space are not available. Because of the limited data availability, the confidence level in assessing the centennial-scale, long-term changes in TC activity in AR5 is overall low. An exception is for the activity of TCs in the North Atlantic; it is assessed in AR5 as virtually certain (i.e., the probability of 99% or greater) that the frequency of strong hurricanes in the North Atlantic has increased since the 1970s. However, firm conclusions on the changes in the frequency and intensity of TCs in the western North Pacific have not been obtained. In Kunkel et al. (2013), it is concluded that robust detection of trends in the TC activity in the Atlantic and the western North Pacific is significantly constrained by data heterogeneity and deficient quantification of internal variability, and that attribution of the past changes is challenged by a lack of consensus on the physical linkages between climate forcing and TC activity. As far as the TCs in the western North Pacific are concerned, Fig. 2 indicates the temporal variation of the number of named TCs (which attained typhoon intensity) in the western North Pacific, based on the best-track data archived at the Japan Meteorological Agency (JMA)/ Regional Specialized Meteorological Center (RSMC) Tokyo. There is no discernible trend in the frequency of TCs that attained a typhoon intensity. If we focus only on the strongest typhoons, the trend in the frequency of such strongest storms is also not clear. For example, the number of the strongest typhoons which attained a lifetime maximum intensity of 920 hPa or lower, corresponding roughly to the Category-5 storms by the Saffir-Simpson scale (Knaff and Zehr 2007), does not indicate a longterm trend for the past 60 years (Fig. 3). From both Figs. 2 and 3, it is seen that there is a large interannual variability of the number of typhoons. In the western North Pacific regions (and in the Indian Ocean), the influences of the coupled atmospheric and oceanic system play an important role in controlling the interannual variability of weather and climate phenomena. The activity of TCs in the western North Pacific as well as in the Indian Ocean is related to the interannual variability such as El Niño/La Niña and Southern Oscillation (ENSO) (Chia and Ropelewski, 2002;Wang and Chan, 2002;Camargo et al., 2007;Li and Zhou, 2012) and Indian Ocean Dipole Mode (Yuan and Cao, 2013;Mahala et al., 2015) and to the intraseasonal variability such as the Madden-Julian Oscillation (Liebmann et al., 1994;Frank and Roundy, 2006;Camargo et al., 2009;Huang et al., 2011;Tsuboi and Takemi, 2014;Tsuboi et al., in preparation) and other intraseasonal phenomena (Yoshida et al. 2014). Furthermore, it is suggested that intraseasonal variation would provide conditions for the increase in the number of landfalling typhoons over Japan (Nakazawa, 2006). Because the longterm trend in the TC activity over the western North Pacific is affected not only by climate change but also by interannual and intraseasonal variability, long-term data with high quality and reliability are indispensable to detect the long-term TC trend in the past."}, {"section_title": "Future changes of tropical cyclones", "text": "Compared with the past trend of the TC activity, the statement of AR5 on future changes in the TC activity is more advanced. It is concluded in AR5 that the increase in the activity of intense TCs in the western North Pacific and the North Atlantic has a likelihood of 50% probability or greater, although the confidence level depends on the ocean basins. Future projections on the changes in TC activity are conducted by performing numerical experiments with general circulation models (GCMs) or regional climate models (RCMs) nested in GCMs. ITo represent TCs in climate models, proper settings on computational domain, spatial resolution, and physics parameterization are required. Because TCs travels over a vast region from the tropical oceans to mid-latitude areas under the influence of large-scale atmospheric circulations, higher-resolution GCMs are more appropriate than RCMs for future projections of TC activity. With the development of a high-resolution atmospheric GCM (Mizuta et al., 2006(Mizuta et al., , 2012, the assessment of future changes of TC activity has been significantly advanced since an earlier study by Oouchi et al. (2006).  investigated the effects of model resolution on projected climatological features of TCs by changing the resolution from 180 km down to 20 km, and showed that a resolution of 60 km or finer is required for projecting future changes in the frequency of intense TCs. The horizontal resolution of 20 km of the Meteorological Research Institute (MRI)-AGCM captures not only the TC activity (Murakami et al., 2012a) but also climatic characteristics in general (Mizuta et al., 2012). In addition to the resolution issue, prescribing sea surface temperature also affects the representations of projected future climate (Mizuta et al., 2014). In the context of TCs, Murakami et al. (2012b) investigated uncertainties for projected future changes in TC activity by performing multi-physics and multi-SST ensemble experiments, and suggested that the differences in SST spatial patterns prescribed in GCMs would cause substantial variations and uncertainties in projected future changes of TG frequency at oceanbasin scales. The sensitivity of the projected TC activity to different climate models is summarized in Knutson et al. (2010). Murakami et al. (2014) further investigated influences of model biases on projected future changes in the frequency of TC occurrence using MRI-AGCM under various emission scenarios including the Special Report on Emissions Scenarios (SRES) A1B emission scenario and the representative concentration pathway (RCP) 4.5 and 8.5 scenarios and showed that model biases introduce an uncertainty of approximately 10% in the total future changes. It was also indicated that the influence of biases depends on the model physics rather than on model resolutions or emission scenarios. For TCs in the western North Pacific, the biases result of TC frequency occurrence in the underestimate in the western North Pacific. Owing to the remaining uncertainties in model simulations, the confidence level in the future projections of TC activity is not high. Despite these deficiencies, the global frequency of TC occurrence is projected to decrease (Oouchi et al., 2006;Sugi et al., 2009), while the activity of intense TCs is projected to increase in some basins. Based on the study by Knutson et al. (2010) and previous studies, AR5 concludes that under the SRES A1B emission scenario the global frequency of TCs will either decrease or remain unchanged while the mean intensity of TCs will increase. In contrast to such changes in the global-scale characteristics of TCs under global warming, regional-scale assessments of TC activity have a lower confidence level. Using the climate simulations with the 20-km mesh MRI-AGCM under the SRES A1B scenario, Murakami et al. (2011) investigated the changes in TC activity in a projected future at the end of the 21st century. They indicated that there is a significant  reduction by about 23% in the numbers of TC genesis and occurrence and that fewer TCs will form in the western portion of the western North Pacific while more TCs will form in the southeastern part of the western North Pacific. Owing to the changes in the genesis location of TCs and in addition to changes in largescale steering flows for the TC movement, an eastward shift in the prevailing northward-recurving TC tracks during the peak TC season, i.e., from July to October, was found. With the recurving TC tracks shifted eastward, there is a significant reduction by 44% in the frequency of TCs that approach coastal regions of Southeast Asia. However, it was indicated that future changes in the number of TC landfalls were not statistically significant. Murakami et al. (2011) noted that the changes in large-scale circulation would critically depend on the spatial pattern of future sea surface temperature. In the study of Murakami et al. (2011), the analyses were made for the outputs from a single simulation case. Therefore, Murakami et al. (2012b) further investigated the effects of SST spatial patterns as well as cumulus parameterizations on the future climate simulations with the use of AGCM at the 60-km resolution. It was shown that all the ensemble experiments consistently project reductions in the frequency of TC genesis and occurrence in the western North Pacific. The genesis and occurrence of TCs were shown to increase over the central Pacific; this was also found in Li et al. (2010). By taking into account the result indicated in Murakami et al. (2011), the decrease of TCs in the western Pacific and the increase in the central Pacific seem to correspond to the eastward shift of recurving TCs. Murakami et al. (2012b) indicated that the spatial contrast in projected future changes in the TC frequency between the western North Pacific and the central Pacific is primarily due to the global warming. By using an updated version of MRI-AGCM (Mizuta et al., 2012), Murakami et al. (2012a) demonstrated that the new MRI-AGCM successfully simulates a more realistic present-day global climate of TCs and that it is able to reproduce extremely intense TCs corresponding to Categories 4 and 5. The projected frequency of TC occurrence was shown to consistently decrease in the western part of the western North Pacific while increase in the central Pacific. Furthermore, it was indicated that the global frequency of intense TCs is projected to increase. From a viewpoint of impact assessment, it is important to note that in Murakami et al. (2012a) all coastal regions were indicated to suffer from an increasing intensity by 1-7% in terms of maximum surface winds due to TCs and it was suggested that damages due to TCs may become more severe under global warming, particularly in the northern part of the western North Pacific, despite the projected decrease in the frequency of TCs that approach coastal regions. Future projections of typhoons were conducted also with a coupled atmosphere-ocean model. Mori et al. (2013) performed ensemble numerical experiments of near-future projections targeted for the period of 2016-2035 by using a number of the coupled atmosphere-ocean global climate model, the Model for Interdisciplinary Research on Climate (MIROC) (Nozawa et al., 2005;Watanabe et al., 2010;Sakamoto et al., 2012), and indicated that significant reductions (approximately 14%) in TC number are found especially in the western part of the western North Pacific. Although their results are based on the near-future climate scenarios when global warming signal is less pronounced than at the end of the 21st century, the results are consistent with the long-term future projections on typhoons. From these recent studies the understanding on the future projections of tropical cyclones over the western North Pacific has advanced. With such advanced projections, meteorological hazards due to typhoons have been studied. In Table 14.3 of IPCC (2013), it is summarized that extreme precipitation is projected to increase near the center of tropical cyclones that make landfall in Japan and along the coasts of the East China Sea, Sea of Japan, South China Sea, Gulf of Thailand, and Andaman Sea. Mechanisms for the decrease in the frequency of TCs are attributed to the weakening of tropical circulation and convective activity with the stabilization of the atmospheric stratification under global warming (Sugi et al., 2002(Sugi et al., , 2012. Satoh et al. (in press) further investigated the mechanisms for the reduction in the global frequency of TCs under global warming and suggested it is a result of future intensification of TCs under the constraint that the contribution of convective mass flux of TCs remains the same or smaller. Although it is still difficult to make quantitative estimates of the strengths of future TCs, other macroscopic characteristics of TCs should be known for impact assessment. As described above, the track of TCs is projected to shift due to changes in the genesis location and to changes in large-scale steering flows for the TC movement (Murakami et al., 2011;Mori, 2012). Here we show the results of analysis of TC track shift based on two MRI models, MRI-AGCM-3.1S and MRI-AGCM-3.2S in CMIP5 and six AOGCMs (CCCMA CGCM3, CSIRO 3.0 and 3.5, GFDL CM2.0, MIROC3.2hires, ECHAM5) in CMIP3. The TC-detection method employed six criteria to identify TCs and compare the simulated annual globalmean TC genesis number with observed data (see . The TC genesis locations were counted for each 5 Â 5°g rid area over the global domain. This detection method identifies observed TCs reasonably well. The TC positions were counted over 2 Â 2°grid points every 6 h. The total count is defined as the frequency of TC occurrence, which indicates the probability of a TC occurring in a designated basin. The TC processes examined in this study include cyclogenesis, cyclolysis, translation speeds, directions, and central pressure changes. To identify how these processes change from present-day climates to future projected climates, the mean and standard deviation were analyzed to identify signatures in TC changes. Significant changes were observed in the cyclogenesis number, cyclogenesis location, cyclolysis location and average central pressure but here we only focus on track changes for the sake of brevity. Fig. 4 illustrates the weighted ensemble-averaged centroid shifts for cyclogenesis and their corresponding deviations for each ocean basin. The upper and lower panels indicate shifts in the cyclogenesis centroids in the longitudinal and latitudinal directions, respectively. The wider vertical column illustrates the ensemble-averaged shift between present and future climates, and the narrower vertical column indicates the relative difference in the cyclogenesis centroid between the IBTrACS and the ensembleaveraged centroids of the present climate as an expected error for model reproducibility in the present climate. Additionally, the two vertical bars illustrate the standard deviation for the present climate (left) and future climate (right), respectively. The simple ensemble-averaged centroid shift was estimated as the mean of the centroid of each model. A clear trend the cyclogenesis centroid shifts in future projections is observed in Fig. 4. Future cyclogenesis centroids move toward the center of the ocean basin in the longitudinal direction and toward the poles in the latitudinal direction. The future centroid shift in the longitudinal direction is several times greater than the centroid shift in the latitudinal direction. For example, the cyclogenesis centroid in the WNP moves toward the east-northeast direction, and the centroid in the ENP moves toward the west-northwest direction. Second, the future cyclogenesis centroid shift has the same order of relative error which defines the difference between the observed (IBTrACS) centroid and the model ensemble averaged centroid for the present climate condition. The relative errors are higher for the future cyclogenesis centroid shifts in the NIO, WNP and ENP. Specifically, the future centroid in the WNP is expected to shift eastward but the relative error shows a westward bias. The uncertainty associated with these cyclogenesis characteristics in these basins is significant and nontrivial. Therefore, the changes in the expected future cyclogenesis locations has sufficient uncertainty to warrant careful projections of future tropical cyclones, and discussions should be conducted quantitatively basin by basin. 3. Impact assessment of tropical cyclones 3.1. Dynamical downscaling approach 3.1.1. A methodology of downscaling typhoon hazards for impact assessment studies For the purpose of assessing the impacts of typhoons on natural disasters, high-resolution data are necessary. The horizontal resolutions of GCMs are getting higher and higher on the order of 10 km. With the advances in resolutions of GCM simulations, the representations of TCs in GCMs have been significantly improved, as described in Section 2.2. However, cumulus clouds and cumulus-scale processes play important roles in generating and forming TCs, which mean that a resolution of higher than 10 km is required in representing quantitatively the intensity and evolution of TCs. By conducting sensitivity experiments of TCs to resolutions, Bryan and Rotunno (2009) indicated that convergence in the numerical solutions of TCs is achieved when radial grid spacing is on the order of 1 km. Furthermore, from the meteorological hazard perspective, quantitative estimations of rain and wind are important. Kanada et al., (2010) clearly demonstrated that the representation of rainfall in a higher-resolution (i.e., 5 km) regional climate model (RCM) outperforms that in the 20-km-mesh MRI-AGCM. Jimenez et al. (2008) and Takemi (2009Takemi ( , 2013 indicated a benefit of higherresolution simulations in quantitatively representing wind speed in complex terrain. Oku et al. (2010) conducted 1-km resolution, regional-meteorological simulations of a severe typhoon that spawned damaging strong winds in the western part of Japan, where complex terrain features are evident, and compared the simulated results with those obtained by a different regional meteorological model. The comparison of simulated surface winds in the two regional models indicated that slight differences in the model topography significantly affect the representations of the wind speed extremes in each model; a sharper representation of topography leads to higher wind extremes in the simulation. They insisted that differences in the reproduction of topography in the model induce differences in the representations of extreme weather. From these studies, it is considered that a higher-resolution simulation will benefit not only from a better representation of convective-scale processes but also from a better reproduction of topography. Therefore, RCM simulations at higher resolutions on the order of 1 km are quite useful for the impact assessment studies on TCs. A high-resolution RCM developed by MRI, called Non-Hydrostatic Regional Climate Model (NHRCM) (Sasaki et al., 2008(Sasaki et al., , 2012Nakano et al., 2012;Murata et al., 2015), is one example. Nakano et al. (2010) conducted 5-km-resolution regional simulations using NHRCM for a warm-season climate of Japan from June to October in 2002-2006 to simulate 57 typhoons during the period and examined precipitation characteristics directly and indirectly influenced by those typhoon; direct (indirect) precipitation was defined as that occurred within (outside) the 300-km radius from the centers of typhoons. It was shown that for precipitation of intensity exceeding 5 mm h À 1 , direct precipitation is more frequent than indirect precipitation. The effects of topography on the precipitation characteristics due to TCs were investigated in detail for the case of Typhoon Morakot (2009) that spawned devastating landslides in complex terrain (Zhang et al., 2010;Fang et al., 2011;Xie and Zhang, 2012;Hall et al., 2013;Wu, 2013). Minamide and Yoshimura (2014) examined the effects of complex terrain in the Philippines on the distribution of precipitation due to a severe typhoon that caused significant disasters in the region and indicated orographic enhancement of precipitation. Another point to be considered in assessing the impacts of TCs on meteorological hazards is that rain and wind extremes are quite dependent on the track, intensity, and translation speed of TCs. The characteristics of rain and wind due to TCs would significantly vary if the track, intensity, and translation speed of TCs are different. This imposes a severe limitation on the impact assessment for TCs, because the number of damaging TCs in the history is limited. In other words, we are not able to assess the impacts of TC hazards on natural disasters in a certain area if the area has not suffered from significant TC disasters in the past, or even if the number of the historical events is only a few. A sufficient amount of samples is required for the assessment of TC impacts. To increase the number of severe TC samples, numerical experiments capable of controlling the track and intensity of TCs are useful. By examining the sensitivity of rain and wind caused by TCs to TC track and intensity from a large number of simulated TCs in the numerical experiments, we are able to use the simulated data to investigate the spatial and temporal features of rain and wind extremes in response to a certain track and intensity of a simulated TC. In order to control the track and intensity of TCs, a TC bogus scheme that can extract a TC vortex and relocate it to a different position has been developed (Yoshino et al., 2008;Ishikawa et al., 2013;Shimokawa et al., 2014). Potential vorticity (PV) is a useful meteorological parameter for extracting and relocating a TC vortex, because PV values within the core of a TC are significantly higher than those in the tropospheric surroundings. A TC signature is easily separated from the environmental troposphere with the use of PV. In the procedure, all the meteorological variables such as pressure, temperature, and wind are first converted to PV. After extracting a high PV region associated with a TC, the high PV region is relocated to a different position. Relocating the TC position, meteorological variables are then obtained by inverting the PV, conducted using an approach by Davis and Emanuel (1991). With this PV inversion technique, Ishikawa et al. (2013) examined the impacts of a severe typhoon reproduced in the future climate simulation under the SRES A1B scenario by conducting downscaling numerical experiments through controlling the TC track, and they investigated the influences of rainfall induced by different typhoons on river discharge to assess a possible maximum flood event in the Tone River basin near Tokyo. Oku et al. (2014) used the PV inversion technique of Ishikawa et al. (2013) to investigate sensitivities of orographic rainfall induced by Typhoon Talas (2011) to the track and intensity of the typhoon. Typhoon Talas (2011) was a slowly moving storm that affected the Kii Peninsula, a mountainous region in Japan, for a long period of time causing a significant rainfall amount estimated to be over 2000 mm for this specific event (JMA, 2011). By conducting a large number of downscaling experiments, they successfully identified the worst-case scenarios on the track and intensity of the typhoon that spawned the maximum amount of rainfall over the Kii Peninsula. With the present typhoon bogus scheme, we are able to develop an idea of worst-case scenarios on typhoon hazards. In the following, we describe the results of the downscaling simulations for two severe typhoon cases which caused significant coastal disasters. One is a historical severe event: Typhoon Vera (1959) which caused disastrous storm surges in the coastal region of the Ise Bay, Japan in September 1959. The other example is a recent event: Typhoon Haiyan which spawned devastating disasters due to storm surges in the Leyte Gulf in November 2013."}, {"section_title": "A case study of typhoon Vera (1959)", "text": "Typhoon Vera (1959) was one of the most disastrous meteorological phenomena in the modern history of Japan. Typhoon Vera gained its maximum intensity, in terms of central pressure, of 895 hPa on 23 September 1959, and made landfall on 26 September. The central pressure at the time of the landfall was 929 hPa, the 2nd lowest on record since 1951. The typhoon caused storm surges, strong winds, heavy rainfall, and flooding, which killed more than 5000 people. Storm surges spawned devastating damages in the Ise Bay, which is the reason why the typhoon is also named the Isewan Typhoon. In order to better reproduce Typhoon Vera in numerical simulations, better reanalysis data for use as initial and boundary conditions of a regional model are needed. Recently JMA released a long-term reanalysis data for the period starting from 1958, i.e., the Japanese 55-year Reanalysis (JRA-55) (Ebita et al., 2011;Kobayashi et al., 2015), which enables us to conduct downscaling numerical simulations of meteorological events dating back to 1958. The JRA-55 data used here have a spatial resolution of 1.25 degrees and a temporal interval of 6 h. The overall performance of JRA-55 was described in Kobayashi et al. (2015). As far as TCs are concerned, Murakami (2014) demonstrated that the characteristics of TC frequency and structure are reproduced better in the JRA-55 dataset than in other reanalysis datasets. Using JRA-55 as the initial and boundary conditions, we perform regional-scale simulations of Typhoon Vera in September 1959. The model used here is the Weather Research and Forecasting (WRF)/Advanced Research WRF model, version 3.3.1 (Skamarock et al., 2008). The computational domains on the Lambert conformal map projection are set with the use of the twoway nesting capability; the outer domain (Domain 1) has an area of 4875 km by 4150 km at the 5-km grid spacing, and the inner domain (Domain 2) has an area of 400 km by 400 km at the 1-km grid (Fig. 5). The center of Domain 1, which covers the Japanese Archipelago and most of the western North Pacific, is set to be at 140°E and 27°N, while Domain 2 covers a central part of the Japanese main island including the Ise Bay. The model top is set to the 20-hPa level, and there are 56 vertical levels, whose intervals are stretched with height. Physics parameterizations employed in the simulations are a single-moment 6-class scheme for cloud microphysics, the Kain-Fritsch scheme for cumulus clouds (applied only for Domain 1), the Yonsei University scheme for boundary-layer turbulent mixing, a Monin-Obukhov similarity scheme for surface fluxes, a 5-layer thermal diffusion scheme for land-surface processes, and a short-wave and long-wave radiative transfer scheme. The details of these schemes can be found in Skamarock et al. (2008). For the purpose of the simulated fields mainly holds the JRA-55 analysis fields, we impose nudging toward the analysis fields during the time integration. The nudging terms with a time constant of 0.00028 s À 1 are applied to the east-west and the northsouth component of winds above the 700-hPa level. With these settings described above, we perform numerical simulations of Typhoon Vera under real conditions in September 1959. In the simulations, we examine the uncertainties of the simulated typhoon to the initial condition by changing the initial time of the time integration. The initial times examined here are 1200 UTC 22 September (CASE001), 0000 UTC 22 September (CASE002), 1200 UTC 21 September (CASE003), 0000 UTC 21 September (CASE004), and 1200 UTC 20 September (CASE005). In addition, we perform simulations of Typhoon Vera under an assumed warming climate. The idea for this is to consider how the natural hazards caused by a typhoon with a Vera-class intensity would change under a warming climate condition. Because Typhoon Vera caused one of the worst natural disasters in Japan, the assessment of natural hazards due to such a worst-class typhoon under global warming is important from a viewpoint of disaster prevention and mitigation. If such a worst-class typhoon is simulated in GCMs, direct downscaling from the GCM outputs should be promising. However, it is not expected that the futureclimate simulations with a GCM can reproduce a severe typhoon with track and intensity very similar to Typhoon Vera in 1959, because the genesis and movement of TCs are sensitively affected by slight changes in atmospheric circulation and vertical stability. Therefore, direct downscaling from future-climate simulations of GCM is quite difficult. An effective approach for assessing the impacts of future warming on regional-scale weather and climate was developed by Sato et al. (2007), referred to as a pseudo global warming experiment. The pseudo global warming experiment is designed to add climate change components to the analysis field for the real atmosphere. Climate change components here are defined as the deficits of the future climate states to the present climate states represented in GCM simulations. We employ this pseudo global warming experiment to assess the impacts of global warming on a Vera-like typhoon. The global warming deficits are computed from the presentand future-climate simulations of the 20-km-mesh MRI-GCM under the RCP8.5 scenario (Mizuta et al., 2014). In the present study, we compute the mean global warming deficits averaged for the month of September under the present and the future climate. We add the warming deficits for mean temperature, pressure, and geopotential height to the JRA-55 analysis fields during the Typhoon Vera event in September 1959. We do not add the warming deficits for relative humidity and horizontal wind components; the reasons being that there is no significant difference in relative humidity between the present and the future climate (e.g., Takemi et al., 2012), and the differences in winds would significantly change the tracks of the simulated typhoons in the future climate from those in the present climate, which will make the future assessment for the specific regions difficult. In the present pseudo global warming experiments, the model settings are exactly the same with those for Typhoon Vera under the real condition of September 1959. The simulations initialized at 1200 UTC 22 September, 0000 UTC 22 September, 1200 UTC 21 September, 0000 UTC 21 September, and 1200 UTC 20 September are referred to as CASE101, CASE102, CASE103, CASE104, and CASE105. The intensity of the simulated typhoons under the September 1959 condition and the future September condition are compared in terms of the central surface pressure and the maximum surface wind within the TC core in Figs. 6 and 7, respectively. The differences of the typhoon intensity among the cases with different initial times are also shown in Figs. 6 and 7. In Fig. 6, the best estimates on the central pressure according to the best-track data of JMA are also exhibited. Compared with the best-track central pressure, the simulations for the 1959 condition well reproduce the temporal change of the typhoon intensity especially after 1200 UTC 24 September. Although CASE005 seems to fail to capture the deepening of the central pressure, it captures the intensity evolution after 1200 UTC 25 September. Based on the favorable performance of the simulations under the 1959 condition, we can assess the typhoon changes under the assumed future climate change. Comparing Figs. 6 and 7, it is clearly seen that the typhoon intensity during the simulated time period in all the cases with different initial times is overall stronger in the future climate condition than in the 1959 condition. It is also found that there are some sensitivities of the evolution of the typhoon intensity to the initial times; this suggests that the initial conditions for the numerical simulations are one of the uncertainties that should be taken into account in order to assess the impacts of climate change on typhoon evolution and intensity. Table 1 further compares the differences of the simulated typhoon intensity between the 1959 and the future condition. Both the central surface pressure and the maximum surface wind indicate that the simulated intensity is unanimously stronger in the future condition than in the 1959 condition, despite the sensitivities to the initial times. In other words, it is anticipated that the intensity of a typhoon which has features similar to Typhoon Vera   Fig. 6, except for the maximum surface wind. Note that there are no wind data in the JMA's best-track data. (1959) will be stronger in an assumed future September condition than in the actual September 1959 condition. This result seems to be robust irrespective of the initial conditions. This further suggests that the resulting natural disasters would be worse in a future climate condition than in the past if a similar extreme typhoon develops."}, {"section_title": "A case study of typhoon Haiyan (2013)", "text": "Typhoon Haiyan (2013) developed in November 2013 and caused devastating damages over the Philippines. In particular, severe storm surges swept over the coastal areas of the Leyte Gulf. The central surface pressure of Typhoon Haiyan deepened to 895 hPa at its mature stage (according to the JMA's best-track data) and was a Category-5 storm. For its extreme intensity, Lin et al. (2014) proposed that Category-6 should be added to the existing Saffir-Simpson scale to respond to anticipated intensification of TCs in a warming climate. Mori et al. (2014) quantitatively evaluated the storm surge level over the Leyte Gulf by conducting numerical simulations. To compute the storm surge, simulated outputs of the WRF model downscaled from the National Centers for Environmental Prediction (NCEP) Final Analysis data were used. In the WRF simulations, they examined a number of model settings to investigate the impacts of the uncertainties due to meteorological model simulations on quantitative assessment of storm surges and found that small changes in the simulated track and intensity of the typhoon in the meteorological model significantly affect the storm surge simulations. Similar to the WRF model settings of Mori et al. (2014), we conducted another numerical simulation of Typhoon Haiyan. In this experiment, the time integration for both the 3-km-mesh domain (Domain 1, 4000 km by 2000 km area) and the nested 1-km-mesh domain (Domain 2, 2000 km by 700 km area) was initiated at 0000 UTC 5 November 2013. This case reproduced the minimum central surface pressure of 896.6 hPa during the lifetime of the simulated typhoon, which is regarded as the best performance among all the cases examined. Fig. 8 demonstrates the spatial distribution of the maximum surface wind speed diagnosed at the 10-m height during the simulated time period of the WRF model for this simulation case. It is seen that the regions with high wind speeds are very concentrated along the typhoon track, corresponding to a compact structure of the typhoon core. Such a concentrated region of high wind speeds is considered to significantly influence the storm surge assessment using the meteorological model outputs, because the uncertainties in representing the typhoon track and intensity in the meteorological simulations cannot be ignored in assessing the storm surge at a regional coastal scale. The uncertainties in meteorological model simulations are still large in comparison to the spatial scales of the regions for impact assessments. Takayabu et al. (in press) investigate the effects of climate change on a worst-case storm surge by examining the case of Typhoon Haiyan and indicated that the worst-case storm surge would be worse owing to the effects of global warming on the intensification of an extreme typhoon. Similar to the study of Mori et al. (2014), downscaling experiments at the 1-km resolution were conducted with the use of the WRF model in Takayabu et al. In their study, the 1-km resolution simulations were performed for 16 cases each in the actual 2013 condition and in an assumed natural condition without global warming. Excluding the 6 sensitivity experiments to the initial time, Fig. 9 shows the track and intensity of the 10 simulated typhoons in the actual condition and the natural condition. It is seen that the typhoons are stronger in the actual case than in the natural case particularly in the longitudinal region between 125 and 130°E. These stronger TCs simulated in the actual environments led to more severe storm surge under the influences of climate change that evolved since the preindustrial era. Developing the idea of worst-case scenarios as natural hazards due to extreme weather events is an important issue for the assessment of climate change impact on natural disasters. Recently, Huang et al. (2015) suggested that a suppressive effect of subsurface oceans on the intensification of future TCs projected by a large number of state-of-the-art climate models and indicates that future subsurface ocean environments may be more suppressive than the existing subsurface ocean environments, which varies from region to region. Atmospheric and oceanic coupling is a key to further enhance our understanding on the changes of TCs under climate change.\nAs described in Section 3.1.2, Typhoon Haiyan is the most severe landfall typhoon in the last 30 years. The combination of several storm surge factors causes extreme changes in water surface level at particular locations. To understand these characteristics for Super Typhoon Haiyan in detail, to evaluate the current performance of typhoon and storm surge prediction systems, and to guide reconstruction efforts of devastated areas, it is necessary to validate models and determine the local properties of storm surge. Based on WRF model hindcast for Haiyan in Section 3.1.3, storm surge was simulated using the surge-wave coupling model (Su-WAT). Three-domain two-way nesting was performed with spatial resolutions from 0.1°(D1) to 0.0067°(D3). The final domain (D3) size was 2.0°Â 2.0°with a resolution of 670 m. Fig. 13 shows the maximum surge forced by WRF with land inundation survey data (Tajima et al., 2014). The pressure-driven storm surge was approximately 1.1 m and was limited to within 50 km of the eye of the TC. However, the area affected by wind-driven storm surge was several times larger than that affected by the pressure-driven surge. Areas where maximum storm surge exceeded 3 m were mainly limited to the Tacloban area. The maximum water level at Tacloban was estimated to be 5.15 m and is in good agreement with the post-survey data measured from watermarks remaining on the land. Although the local increasing of water level due to local topographic effects, the simulation gave reasonably accurate results of the increase and decrease of maximum water surface level near the Tacloban area. However, the maximum water surface level is very sensitive to NWP results and the mean error of maximum water surface level between the numerical results and the post-survey data ranged from 1.08 to 4.15 m depending on the NWP model configuration. The WRF series indicate that the sensitivity of hindcast maximum water surface level, the error for which was 38-219%, depends on the configuration of the numerical setup. These factors make it difficult to quantitatively forecast or hindcast the storm surge during typhoon Haiyan."}, {"section_title": "Statistical downscaling approach", "text": "Statistical projections of TCs have been examined in engineering and insurance industries. There are two different approaches to design structures and assess the risks of TCs. The primitive engineering approach estimates landfall rates along the coastline based on historical records. This is called a site-specific approach or a local model that provides TC statistics for a particular location of interest (Russell, 1971). The statistics or probability density functions (pdfs) of TC parameters include central pressure, radius of maximum winds, direction, moving speed, and distance of closest approach; these are analyzed in the site-specific approach. Applying a site-specific approach to climate change is difficult because all TC parameters at all locations need to consider the influences of climate change. The second approach to statistical projection of TCs involves a stochastic tropical cyclone model/storm track method (Vickery et al., 2000;James and Mason, 2005;Emanuel et al., 2006;Nakajo et al., 2014) which is a type of Monte Carlo simulation. The stochastic tropical cyclone model (denoted STM hereafter) simulates a TC track by random draw from a temporal-spatial pdf of Table 1 The maximum intensity of the simulated typhoons initialized at the five times for the conditions of September 1959 and the future September climate. The maximum intensity refers to the central surface pressure (in hPa) and maximum surface wind (in m s À 1 ) of the typhoons.  Fig. 8. The spatial distribution of the maximum surface wind speed (color shading, in m s À 1 ) during the simulated time period of the WRF model at each grid point. The solid line indicates the observed track according to the JMA's best-track data. cyclogenesis locations based on a historical data set of TCs; it is possible to expand this approach to a basin-wide scale. The STM simulates the full track of a tropical cyclone, from cyclogenesis to cyclolysis, where cyclolysis includes the transition from a TC to an extra-tropical system. The cyclogenesis and cyclolysis indicate generation and weakening of low pressure circulation physically. However, these are simply used for generation and dissipation of TC in the study of statistical projection of TC. The STM models TC translation as a function of TC location and moving speed at each time step. Fig. 10 shows one such historical TC data set, IBTrACS, and simulated TC data using the STM by Nakajo et al. (2014). The changing ratios of TC direction, speed and central pressure are provided in pdf format based on the historical record of TCs as shown in Fig. 10. The STM has biases due to an inadequate or missing depiction of physical processes, but it shows good agreement with the local model if the target area has relatively few landfalls. Qualitatively, the overview of the TC tracks in each basin is reasonably distributed. The simulated peak in the WNP shows good agreement with observed data, and simulated distributions in other basins also show reasonable reproducibility. The global grid averaged error against the historical data is 0.06 #/year (# indicates number of TC per 3°by 3°grid) and indicates reasonable accuracy. The direction, moving speed and intensity were verified against both spatial patterns and local characteristics, respectively (Nakajo et al. 2014). Using an STM for future climate projections is one option to assess tropical cyclone risks. If the STM satisfies the TC characteristics in the present climate condition, then a sufficient number of TC events can be obtained at arbitrary locations. If appropriate future TC conditions are provided, the future projection of TCs using an STM provides a tool to quantitatively evaluate risk along a given coast line. The future projection of TC track and intensity can be estimated by the STM. The statistical properties of TCs in the future climate are summarized as follows. 1. Cyclogenesis frequency decreases (Section 2.2). 2. Cyclogenesis centroids shift toward the center of a basin (Fig.4 in Section 2.2). 3. Cyclolysis centroids shift toward the center of a basin (Fig.4 in Section 2.2). 4. Central pressures of TCs decrease quadratically in the polar direction (Section 2.2). 5. Remaining TC characteristics are unchanged in the future climate. The TC track shifts are assumed to be changed linearly from cyclogenesis to cyclolysis centroid changes over the ocean. All of these statistical changes are assumed to be the results of future TCs based on the GCM model ensemble averaged values analyzed based on CMIP3 and CMIP5 (Mori, 2012). The changes listed above were computed by the STM over a time-frame of 10,000 years on a global scale. The difference between the future condition and the present condition amounts to significant changes in both TC frequency and intensity. However, the extreme change in central pressure in the future climate shows different characteristics. The extreme minimum TC central pressure with a 100 year return period is calculated by extreme value analysis using 10,000 years simulated data as shown in Fig. 11. In the future climate condition the minimum central pressure with a 100 year return value shows both positive and negative changes, and the spatial distribution of extreme minimum central pressure is different from the averaged central pressure. Overall, the extreme minimum central pressure will be smaller (i.e., stronger TCs) at latitudes above 30°N and 30°S. The extreme value of minimum central pressure shows positive change from subtropical to mid-latitudes around 30°, and it shows negative change in the polar direction. These complex changes in the extreme values result from a combination of assumed future changes described above. Although the cyclogenesis and cyclolysis shifts and the mean central pressure changes in the latitudinal direction reduce the central pressure of TCs in the middle latitudes, the cyclogenesis and cyclolysis shifts in the longitudinal direction either enhance or reduce the extreme central pressure change of TCs in the future climate. The statistical projection presented here is limited to the numerical values of the mean and extreme central pressures of the TC. We showed the averaged results but it is possible to evaluate standard deviation as an indicator of uncertainty of protection, which is another advantage of using a stochastic model. The STM can increase the number of TCs, and thus it is possible to apply it to a regional study of storm surge projection due to climate change. This will be presented in the next section."}, {"section_title": "Expected changes of coastal disasters", "text": "4.1. Storm surges 4.1.1. A case study of typhoon Vera (1959) As described in Section 3.1.2, the Ise Bay including Nagoya, Japan, suffered from the most severe storm surge disaster in 1959. A storm surge projection with inundation over the land was conducted targeting the Ise Bay considering projected climate change. Future changes of typhoon characteristics are analyzed to estimate possible changes in intensity, generation numbers, and tracks in the Pacific Ocean, and the influence of climate change on storm surges in the Ise Bay are simulated as a case study. Storm surge simulation is conducted using fully-coupled Surge-Wave-Tide model (SuWAT) developed by Kim et al. (2008). The SuWAT model consists of a storm surge module using the nonlinear shallow water equations and a wave module using the spectral wave model SWAN considering tidal effects at the lateral boundary. The details of the model are described by Kim et al. (2008). In order to simulate inundation, the model was modified to take into account overflow into the land with bottom roughness based on land use data. In this study the wave model was basically not used and the atmospheric forcing was given by an empirical typhoon model to reduce computational cost. The atmospheric pressure field is estimated using the Mitsuta and Fujii (1987) model, and the wind field is simulated by Myers and Malkin (1961). The storm surge model employs four domain nesting for the historical analysis. The spatial resolution of the coarsest domain is 12,150 m and the finest domain resolution is 450 m. The maximum storm surge result and the surge height time series show good agreement with observation (not shown). It is confirmed that the maximum leading edge of flooding into the land, and maximum surge height of 3.24 m at Nagoya port, respectively. The storm surge and inundation area by the hindcast show good agreement with historical record. Furthermore, the storm surge in the pseudo global warming scenario with the worst course of typhoon Vera was simulated. A series of simulations was carried out using the intensified central pressure obtained from analysis of CMIP5 and the changed typhoon track considering the analyzed typhoon characteristics changes as the pseudo global warming experiments. The worst course of typhoon Vera was estimated by shifting and rotating the track. First, Vera was simulated under the present depth and sea wall condition and compared with the historical record. Fig. 12  (a) shows the numerical results of maximum surge height and inundation area. The storm surge ran up along the river and was source of flooding upstream. A series of storm surges by extreme typhoons considering the track changed worst course was simulated by pseudo warming experiments. The results of these worst course extreme typhoons show that the maximum surge height becomes larger and inundation area increases significantly as shown in Fig. 12(b). The result indicates that the storm surge disaster increases when the typhoon is intensified in the future climate condition. When the typhoon intensifies, the maximum surge heights will increase in the range of 1.3-1.0 m. The future change of inundation area due to storm surge will increase significantly by about 30%."}, {"section_title": "Application of stochastic tropical cyclone model with neural network for storm surge", "text": "The pseudo global warming experiments and related application to storm surge and others are powerful tools for regional impact assessment under the assumed conditions. However, it is important to estimate probabilistic information of extreme events considering uncertainty of tracks, speed, etc. Therefore, the application of stochastic tropical cyclone for storm surge provides supplementary information of future changes of storm surges at particular location. As an example application, we selected Osaka Bay which faces the Pacific Ocean in the western part of Japan. Synthetic TCs were generated over 5000 years using a stochastic tropical cyclone model with historical conditions. The total number of TC is greater than 2000, thus we selected 100 potentially high impact TCs for storm surges based on their tracks, minimum central pressures, and speeds. The selected tracks were selected to minimize distance from bay center and an angle of incidence to bay center, respectively. Fig. 14 shows selected simulated typhoon tracks of the stochastic tropical cyclone model for Osaka bay. All selected TC tracks are basically passing from southwest to northeast over Osaka bay. The dynamical storm surge simulation was conducted for the 100 selected TCs by surge-wave-tide coupled model (Su-WAT) as shown in Section 4.1.1. Using the dynamically simulated storm surge based on the selected synthetic TC data, a neural network model was applied as a function of minimum central pressure, distance to bay, angle of incidence to bay and moving speed. Fig. 15 shows training, validation and test of storm surge height based on the stochastic tropical cyclone model and neural network model. The blue bar is input training data and sky-blue bar is validation of storm surge height. The root-mean-square error of validation phase is less than 0.2 m, and therefore, the evaluated neural network model works well for the estimation of maximum storm surge using TC information without required a dynamical storm surge model. Given the cheap computational cost of the neural network model, it is possible to estimate storm surge height over this 5000 year period based on the synthetic TCs from the stochastic tropical cyclone model. The estimated return periods of storm surge heights are 60, 100, and 300 years for 3, 4, and 5 m surge height, respectively. Although it is difficult to validate these values due to a lack of historical data, it is important to estimate long-term return value of extreme storm surge for impact assessment and adaptation strategies. In addition, the synthetic TC data can estimate the longterm return period of pseudo global warming experiments  estimation of joint probability of similar TC tracks, intensity and speed. The combination of synthetic TC data and pseudo global warming experiments are a powerful tool to estimate probabilities and worst case scenarios of extreme storm surges."}, {"section_title": "Extreme ocean WAVES", "text": "Understanding future changes of storm waves and storm surges is important for assessing and mitigating the impact of climate change on coastal, marine and ocean environments and on engineering problems. For example, coastal breakwaters are designed for a maximum storm surge level and dynamic pressure from a maximum wave condition over a predetermined design lifetime. Therefore, it is important to discuss future wave climate change from the present to the future (Mori et al., 2010, Hemer et al., 2013. As a case study, future extreme wave climate is projected based on an AGCM and spectral wave model. The future extreme wind and wave values are analyzed using extreme value analysis, and the characteristics of extreme values and the influence of TCs on the future wave climate around the NWP are discussed in detail. The ocean wave projection uses the product of global climate projections from a high-resolution AGCM, MRI-AGCM-3.1S. The MRI-AGCM-3.1S has a horizontal resolution of T959L60 (corresponding to about 20 km), and the future climate is simulated under the A1B scenario (Kitoh et al., 2009). As shown in the previous section, one major target of developing MRI-AGCM-3.1S (denoted hereafter as GCM) was to quantitatively resolve TCs in the Pacific Ocean. Time-slice experiments were conducted for three computational periods for 1979-2004 (present climate), 2015-2031 (near-future climate), and 2075-2100 (future climate), respectively. External forcing of the GCM is from mean SST of CMIP3 AOGCM projections and observed SST is used in the present period. Global wave climate projections were simulated by the spectral wave model SWAN (Booij et al., 1999), using sea surface winds at 10 m height U 10 of the GCM. Global wave computations were carried out using spherical coordinates in the latitude range 80N-80S with 1.25°resolution. Extreme values of significant wave height H s were analyzed by fitting candidate distribution functions to the data of present and future climates respectively. The Mann-Kendall rank test was applied and extreme values is analyzed by the peak over threshold approach (POT) and the General Pareto Distribution (GPD) following the standard methodology of extreme value analysis. Fig. 16 shows differences in the 50-year return values of H s between the present and future climate. There are clear increases in 50-year return values in the TC-dominant regions around the middle latitudes of the western North Pacific, the eastern North Pacific, the North Atlantic, and off the coast of Madagascar. These results indicate that future TCs will become stronger, and the range of their tracks in the low to middle latitudes will be larger than in the present climates. This is consistent with other climate projection studies (e.g., Knutson et al., 2010;. The spatial patterns of H s in both the present and future climates are characterized by larger values off the south and east coasts of Japan. The extreme values of H s are caused by TC passing through this area. Similar peak extreme values of H s can be observed in the west North Pacific, the North Atlantic, and off the coast of Madagascar. As Fig. 16 shows, a significant increase in extreme values can be observed in the future climate around Japan. Remarkable increases of U 10 are found to the south and west off the coasts of Japan. This area is related to TC generation and propagation in the summer season. The significance of increased H s in this region is larger than that of wind speed due to characteristics of wind wave generation. Namely momentum transfer from wind to ocean is proportional to U 10 so the impact of TC to H s is larger than the wind field. A series of individual TC tracks is extracted from the source GCM data set. The future TC number is decreased significantly around the western part of the west North Pacific at the lower  latitudes and is increased slightly in the eastern part of the midlatitude west North Pacific (off the coast of Japan). These futures include two changes in TC characteristics, namely that TC genesis decreases and that TC tracks shift to the east side of the west North Pacific. This is consistent with previous studies as described in the previous section. The combination of reduced cyclogenesis and shifted tracks means that in the future more TCs will pass off the coast of Japan in the future climate depending on the region. As discussed in the previous section, future change in TC intensity is a key issue pertaining to extreme wind and wave climate change. Fig. 17 shows future change of the minimum central pressure, ΔP min , both for the NWP at a global scale. There is a deeper striped pattern for ΔP min at 15-20N latitude. The spatial distribution of ΔP min in the NWP is different in the lower latitudes between 15-20N. TC wind speed depends on radius and intensity, and projected ΔP min exceeds À 30 hPa, which roughly corresponds to a 10-25 m/s wind speed increase. Future change of extreme TC intensity has a remarkable impact on extreme wave conditions. A similar significant decrease of ΔP min is observed in the Atlantic Ocean, the Southern Indian Ocean and the Western South Pacific Ocean, where significant increases in future extreme wave height are expected. It can be concluded that projecting future extreme waves requires an accurate description of TC by GCM. This is one weakness of the climate model, whose uncertainties make future changes of middle latitude extreme wave climate difficult to project at regional scales, quantitatively."}, {"section_title": "Conclusion", "text": "Impact assessment of future coastal hazard due to climate   (2075( -2099( minus 1979( -2004. change requires accurate descriptions of tropical cyclones (TCs) using GCM in the TC influenced regions, but this is difficult task. The performance of GCM and future changes in the dynamic and thermodynamic conditions in tropical oceans will influence TC genesis frequency and a locational shift toward the center of the basin. This study reviews and shows the latest related research and original results of impact assessment of TCs and related coastal hazards. First, we briefly overviewed the current understanding on the changes in the characteristics of TCs in the past and in the future. We summarized the characteristics on TCs in the western North Pacific in the future climate from an impact assessment perspective. Second, we presented a review and ongoing research of impact assessment of tropical cyclones using both dynamical downscaling and statistical models. The dynamical downscaling simulations for two severe typhoon cases which caused significant coastal disasters were demonstrated as an example of dynamical downscaling of a super typhoon with a regional meteorological model. One example was Typhoon Vera (1959), known as Isewan Typhoon, that hit the coastal regions in central Japan, i.e., the Ise bay, in September 1959. The other example was Typhoon Haiyan in 2013, intended to show an example of event attribution like technique. Furthermore, a stochastic tropical cyclone model was introduced to increase the number of TCs which is useful for regional impact assessment. Assessing the impacts of such extreme TCs on coastal hazards emphasizes the importance of considering worst-case typhoons as a scenario basis in order to investigate the consequences of extreme weather events to natural hazards and disasters under a changing climate. This worst-case approach should be promising for impact assessment studies. Finally, several examples of impact assessment of storm surge and extreme wave changes were presented. The future changes of storm surge are not only sensitive to TC intensity but are also needed to consider future changes of cyclogenesis and tracks. Both statistical and dynamical downscaling are important for the projection of storm surge height on regional scales. Future increases in extreme waves were also detected at the middle latitudes, the west North Pacific Ocean, the east North Pacific Ocean, the North Atlantic Ocean and the South Indian Ocean, regions mainly influenced by tropical cyclone activity. Changes in the return values of H s in the Northwest Pacific Ocean over the next 50 years are significantly increased present climate values. Changes in both TC intensity and track are linked to future changes in extreme storm surge and wave climate in middle latitude. The combination of reduced cyclogenesis and shifts in TC track will increase the number of changes and uncertainties in quantitatively assessing the impacts of future TC changes on storm surge and extreme characteristics. Further study is required to reduce the uncertainty of extreme coastal hazard projections due to climate change, with the natural variability of wave climate for both present and future climates being especially important for assessment, and these remain as topics for future study."}]