[{"section_title": "Abstract", "text": "The Action Lecture program is an innovative teaching method run in some nursery and primary schools in Paris and designed to improve pupils' literacy. We report the results of an evaluation of this program. We describe the experimental protocol that was built to estimate the program's impact on several types of indicators.\nData were processed following a Differences-in-Differences (DID) method. Then we use the estimation of the impact on academic achievement to conduct a costeffectiveness analysis and take a reduction of the class size program as a benchmark.\nThe results are positive for the Action Lecture program."}, {"section_title": "Introduction", "text": "It is well known that pupils who are good at reading and writing at school are also those who practice at home and like books (see PIRLS -Progress in International Reading Literacy Study results in 2001 -Mullis, Martin, Gonzalez, and Kennedy (2003 -Mullis, Martin, Kennedy, and Foy (2007 ). Many teaching specialists consider that motivation for reading is central to acquiring literacy skills. Hence, they call for innovative teaching methods that induce positive attitudes towards reading. In this study we report a cost-effectiveness evaluation of one such method. The program we are interested in is a French educational project called Action Lecture, which is run in some nursery and primary schools in Paris. In practice, it takes place in volunteer schools in which pupils do not have any courses for two weeks, but work together on a specific topic with different activities (reading, research, museum visits, writing, etc.) . The goal of this program is to develop the taste for reading and for discovery in order to promote academic achievement and to increase motivation for attending school. The main idea is to improve pupils' reading by a combination of learning activities and cultural activities in which schoolchildren are pushed to be active and to work collectively.\nThis evaluation has two aspects. First we perform an estimation of the impact. Second, we run a cost-effectiveness analysis and take a reduction of the class size program as a benchmark. As is often the case with innovative teaching methods, the bold ambitions of the Action Lecture program differ from official academic standards and this renders the evaluation problematic. Indeed, no assessments of pupils' achievements are routinely carried out during these programs, which we can rely on. Thus, to estimate the impact of this program we have to design a specific protocol. We focus on two kinds of indicators: academic standards with three different exercises related to different reading skills stemming from the French national evaluation scheme, and measures of attitude to reading following the PIRLS' study. To estimate the impacts, we compare the progression of the pupils from the schools participating in the program with the evolution of pupils from a control group. We compute Differences-in-Differences to estimate the program's effect. As we find that Action Lecture has a significant and positive impact, we develop a cost-effectiveness analysis (Levin (1995) ).\nFor the education system, the main costs of this program are the employment costs of the teachers appointed to the program. Therefore, we can relate one teaching job to its impact in terms of marks in the national evaluation scheme. It is useful that we also have data about class-size effects, provided by the study of Piketty and Valdenaire (2006) . These are also expressed in terms of marks in France's national evaluation scheme. Thus, we can examine whether the resources devoted to the Action Lecture program could be used more efficiently by reassigning the teachers to classrooms. This is a topical subject since the French government intends to cut public spending and is reducing the number of teachers in the public school system, though the favored policy is to eliminate jobs which are not in the classroom, as such cuts are less visible for public opinion.\nWe find that the project studied here does have a positive impact on literacy. This is true for both types of indicators i.e., academic standards and attitude scores to reading. The level of progress is quite important and we find that for the skills studied, these two weeks of teaching are equivalent to 40% of the average annual progress. Furthermore, compared to a class-size program, our conclusions concerning the efficiency of Action Lecture are positive.\nThe outline of this article is as follows: in Section 2 we present our methodology (data collection, evaluation methods); in Section 3 we show the main characteristics of our sample; in Section 4 we perform an estimation of the impact and a cost-effectiveness analysis; and Section 5 concludes."}, {"section_title": "The Methodology", "text": "In this section we start with a short presentation of the Action Lecture, then we describe the experimental protocol that we use and finally we present our methodology."}, {"section_title": "A French Educational Project", "text": "The Action Lecture project is an educative program focused on reading that is jointly managed by the education system and the City of Paris, for nursery and primary schools."}, {"section_title": "1", "text": "The teaching methods used in this program are non-traditional and belong to problem oriented learning methods. They refer to the pedagogy promoted by Freinet (1896 Freinet ( -1966 , a French educationalist influencial in some French educational circles (Reuter (2007) ). The main principle is to make the pupils active in their training and to leave them some freedom. In the case of the Action Lecture program, the idea is to associate culture and academic learning within one project. Reading is seen as a tool both to help pupils 1 One specific aspect of the French education system is that local politicians as well as parents are not involved in teaching methods. This program, over which local authorities have some control, is uncommon.\nto obtain some specific academic skills and to develop cultural tastes. The underlying assumption is that there exists a link between learning and culture.\nIn practice, this program takes the following form: each volunteer school chooses a topic (for example: Why are we writing?, Art, What is it for?, etc.) and for two weeks the pupils do not have any other courses but work full-time on the project, in small teams (with a maximum of 15 pupils). Teams are heterogeneous with pupils from all grades working together. Presentations by teachers working only for the Action Lecture are also scheduled. These two weeks end with the production of a book that summarizes what was done. Even if the themes are school-related, the set-up is standardized: research on the topic (books, a museum, etc.) is done in the morning; teachers hold a meeting at lunch time to assess progress; and afternoons are devoted to technical work (writing, oral expression, methodological exercises, etc.).\nThe aims of the Action Lecture are to help pupils to be familiar with many books, to speak with expert readers, to have free time to read, to check their understanding of their readings, to write daily, and to improve their abilities in reading and writing exercises."}, {"section_title": "The Experimental Method and Data", "text": "Since, the program does not include any evaluation of pupils' achievements, it was necessary to build an ad hoc method to estimate the program's impacts. The method includes a control group and consists in surveys administered before and after the project. Since the survey was computerized, only pupils from 2nd to 5th grades were included. The questionnaires used include several indicators as well as questions about individual characteristics.\nTo measure the impact of the project, several types of indicators were considered: the attitude toward reading (taste of reading, practice of reading, knowledge about books and authors, etc.), the attitude during school life (attitude during class, school life activities, self-evaluation, etc.), and academic abilities. For reading and school attitudes we re-used some questions from PIRLS. We will report two aggregated scores (on 10): the Student's Attitude Toward Reading (SATR) and the Student's Reading Self Concept (SCRC).\n2 Measuring academic abilities is done using exercises issued from French national evaluations 2 SATR is based on students' agreement with the following statements: I read only if I have to; I like talking about books with other people; I would be happy if someone gave me a book as a present; I think reading is boring; I enjoy reading. The SCRC is based on students' agreement with the following statements: reading is very easy for me; I do not read as well as other students in my class; and reading aloud is very hard for me.\nthat are set at the beginning of 3rd and 6th grade. We use the 3rd grade evaluation exercises for 2nd and 3rd grade pupils and the 6th grade evaluation exercises for 4th and 5th grade pupils. Three types of skills have been studied: identifying the nature or the type of a text, processing information, and making inferences. These three skills represent 10% of the national evaluation of reading, which is marked out of 100 and thus we use a score out of 10 for these skills.\nThe collection of the individual characteristics was limited since it was not possible to send a questionnaire to families. A few individual characteristics were gathered directly from pupils: sex, age, month of birth, language spoken at home (the variable French principally says that the pupil 'always speaks' or 'almost always speaks' French at home, the variable African languages says that the pupil knows a sub-Saharan African language and similarly for Arabic and Asian languages), housing conditions (the variable Own bedroom says that the pupil has his/her own bedroom). Furthermore we have some overall data on the social composition of each school and this indicator is a good measure of pupils' social environment.\nThis data collection has been done with a set of three questionnaires completed on-line during school time. The timeline was the following: pupils replied to the first questionnaire one week before the implementation of the project, to the second in the week following its execution and to the third about two months later. Our analysis is focused on schools which followed the project between November 2007 and March 2008. Six schools were concerned and we gathered data on more than 400 pupils with around 100 pupils for each grade. In order to take into account this time gap in the data collection, we have used a variable time of passage which indicates the month during which the data was collected: it takes a value of 1 for September and 12 for August; furthermore if the date of passage was t for the first questionnaire, it takes the value t + 1 for the second and t + 3 for the third. The same timing has been respected for participating and control groups.\nThe first questionnaire was the longest, with 40 questions and 3 exercises. The second was the shortest with only 8 questions and 2 exercises, and the third contained 27 questions and 1 exercise. The exercises were different in each round, and to take into account differences in difficulty, the order of passage was randomized such that half of each class had the first order and the other half the second order.\nLet us precise now how we select the treatment schools and the control schools. To benefit from an Action Lecture program, schools apply voluntarily then a selection committee chooses which schools to admit. Application to the program is open to all nursery and primary schools in Paris. The head teacher and his colleagues have to propose a project that is consistent with the Action Lecture guidelines (2 weeks without classes, intervention of external professors,). During the year of the evaluation, the number of applicants was very low and all applicant schools were admitted into the program. Thus for the selection of the school, it was not possible to apply a standard randomized process to select the treatment schools and the control schools (see Duflo, Kremer, and Glennerster (2008) for the randomized methodology in evaluation). The control group was constituted by classes in non concerned schools, from which we had to seek agreement. As this evaluation was quite intrusive for the class, the control group was relatively small. We were limited to three classes (3rd, 4th and 5th grades) that we chose in three different schools that were similar to the treated schools in terms of socio-economic characteristics."}, {"section_title": "The Econometric Model", "text": "The evaluation of this program is based on the Differences-in-Differences (DID) method which, since its development by Ashenfelter and Card (1985) , has been mainly used in empirical economics (see Imbens and Wooldridge (2009) for a presentation of the different econometric models, and Bertrand, Duflo, and Mullainathan (2004) for a critical survey of the DID used in evaluation). The basic principle is to observe the values of outcomes for two groups (the group participating, affected by the program and the control group) between two periods (before and after the program) and to compute a double difference in the evolution of the outcomes: the average improvement of the control group over time is subtracted from the average improvement of the participating group. This double differencing allows correction of a twofold bias: first, the bias in the post-participation period between participating and control groups, which could be due to permanent differences between these two groups; second the bias from comparisons over time in the participating group, which could be due to the effect of time, unrelated to the participation. According to Cameron and Trivedi (2005) , the Differences-in-Differences estimation allows to estimate the causal effect of the treatment if the time effects are common across treated and untreated individuals and if the composition of the treated and untreated groups is stable before and after the treatment.\nThe basic equation of the model is the following:\nwhere Y it is the outcome, T it a dummy with a value of 1 if the subject belongs to the participating group, A it a dummy of 1 if we are in post-participation period, and A it T it the interaction of the two effects which captures the real impact of participation. An OLS regression of β 3 gives us an estimation of the participation effect. Table 1 shows the principle of the DID estimation:\nBefore participation After participation Differences Participating group In order to estimate the effect of the participation, we use different models with the integration of multiple groups (different schools), multiple levels (2nd and 3rd versus 4th and 5th), and multiple periods (different times of execution of the program). We improve our analysis step-by-step by estimating the following equations with fixed effects:\n(1)\nModel (1) is the basic estimation of the impact of participation, taking into account the order of exercises (o i is a dummy variable); in Model (2) we add the time effects (v t is a time variable which takes the value of the month of the program's execution plus 12 months for the 3rd and the 5th grades: this supplementary information allows the variable of period A it to be suppressed), along with level effects (l i is a dummy of 1 if the pupils are in 4th and 5th grades). Model (3) takes into account school effects (u i is a set of dummies for each school: likewise this supplementary information leads to the deletion of the treatment variable T it ). Model (4) puts the individual characteristics into the regression (X it contains the following variables: sex, progression in school years, lagging in school years, languages spoken at home, having an own room). Finally, Model (5) differentiates the impact of the program according to the level with some cross variables. On the basis of the estimated impact, we try to find which groups of pupils have obtained the most benefits from this program with the help of some cross variables. Model (6) is thus an extension of the Model (4):\nwhere G n is a dichotomous variable with k modalities (e.g. sex, languages, levels, etc.) and β n 3 gives the estimated effect for each type of pupil."}, {"section_title": "The Cost-Effectiveness Method", "text": "Cost-effectiveness analysis is an evaluation tool used to examine different alternatives in which costs and efficiencies are taken into account, and to determine which alternatives are the most appropriate with respect to the goals of a project. This methodology is little used in the field of education (Levin (2001 ), Behrman (1996 ). As we are able to rely on results from two French studies (Piketty (2004) , Piketty and Valdenaire (2006) ), which estimate the class-size effect on marks scored in the French national evaluation scheme, we design our evaluation so as to obtain results that permit a cost-effectiveness comparison between the Action Lecture program and a class-size reduction program. Class-size reduction is one of the most discussed educational programs. Many empirical studies find that diminishing class size leads to an increase pupils' results ( Akerhielm (1995) , Angrist and Lavy (1999) ). The methodology used by Piketty and Valdenaire (2006) is similar to Angrist and Lavy and their results are robust and pertinent. They used data from a French panel -the 1997 primary panel -which follows a national sample of around 9600 pupils who started their 1st grade in 1997. Their main result is that each additional pupil in a 2nd grade class leads to a 0.339 point fall in the evaluation rating for reading, at the beginning of 3rd grade. These evaluations are based on a score of 100 points and the three skills studied in the Action Lecture represent 10% of the overall score. Therefore, the impact on skills that we measure with a score out of 10 is directly comparable to this class-size effect. The costs of the Action Lecture program stems from the teaching jobs it requires. If the teachers who work in this program were reallocated to classroom teaching, this would permit the opening of new classes and a reduction of class sizes in general. Furthermore, we can compute a cost-effectiveness ratio respectively for the Action Lecture program and for a class-size reduction program, because all the measurement units are marks per teaching job. This comparison is only possible under the assumption that the results of Piketty and Valdenaire based on 2nd grade are also valid for the other levels: 3rd, 4th and 5th grades. Two reasons justify this hypothesis: first Piketty and Valdenaire also estimate the class size effect for 6th to 9th grades and find a value of 0.2, which is not too different from the class-size effect for 2nd grade (0.339 points).\n3 Furthermore the observed standard errors for the results in 3rd, 6th and 9th grades are quite similar with values between 15 and 20 and our results have standard errors between 1.8 and 2, similar to the previous standard errors if we take into account the factor 10 in the scores' gap. Reading marks in national evaluation are relatively homogeneous for all grades."}, {"section_title": "Overview", "text": "We will first present the main individual characteristics of our sample and pupils' initial results in terms of academic results. Then we will control the quality of our control group. Table 2 shows the individual characteristics of the pupils. The first thing to note is that the schools present an important degree of social heterogeneity. Concerning the language spoken at home, only 64% use only French and the three main other languages are African languages, Arabic and Asian languages. The percentage of socially-privileged schools is equally distributed across the participating schools; for the control group we have a bias of underprivileged pupils, but the effect should be compensated by the importance of the part of the Chinese community which is known to have good academic results. In Table 3 we give some statistics concerning the three indicators' initial results (all noted out of 10), depending on different individual characteristics."}, {"section_title": "Descriptive Statistics", "text": "The reading results are quite as expected: better results for girls, and worse results for lagging pupils and for pupils of immigrant origin (except for pupils from the Chinese community). In Table 4 , we report the initial reading results according to the level of the attitude toward reading (SATR), and self-evaluation (SCRC).\nThese results were also expected. "}, {"section_title": "Participating Schools", "text": ""}, {"section_title": "Control Schools", "text": ""}, {"section_title": "The Quality of the Control Group", "text": "As the procedure of selection of the control group is not optimal, we check if the two groups are not too different in terms of initial results. We first carry out a simple OLS regression of the following model (a):\nthen we introduce the effect of time and academic levels in Model (b) and the individual characteristics in Model (c). If the coefficient (β ′ 1 ) of the participation variable is not significantly different to 0, we can consider that the control schools are similar to the schools participating. For all specifications of the model and for the three variables of interest (aggregated results to exercises; SATR and SCRC scores) we find no significant differences between the control schools and the participating schools in terms of initial levels. Furthermore, the composition of the two groups are similar in terms of individual characteristics. In tables not reported here we have no significant differences in terms of percentage between the two groups for gender, academic progress, lag in school years, to speak only French at home, and the fact of having his/her own room. Another crucial point is to see if control and treatment schools have not been affected by specific reforms during the evaluation time. We run some interviews in each school to control for potential shocks during the time of the evaluation and we found no significant changes (no head teacher change, no teacher substitution for long term sick leave ...). We also find that there was no specific reasons that would have induced the treated schools to apply to the Action Lecture: the staff is stable and running project is part of the normal life of these schools. In the control group, we observed the same staff stability before, during and after the evaluation.\nWe can conclude that the treatment and the control groups have mainly the same initial trends and that our estimation by Differences-in-Difference will not be affected by a selection bias."}, {"section_title": "The Results", "text": "We first show the project's impact, estimated by the method of Differences-in-Differences (DID). Then we present the cost-effectiveness analysis with a comparison of this project and a policy of decreasing class size."}, {"section_title": "The Impact on Reading Skills", "text": "In Table 6 , we detail the impact estimation for the three academic reading skills (with marks also out of 10) and the aggregate reading score, according to the DID method and for the four models that we have specified previously: Models (3) and (4) are the most robust, and we observe a statistically significant impact for two skills out of three: To identify the nature or type of a text and To make inferences. For all models, the positive impact is significant for the aggregate result. We can also observe that the coefficients seem to not be very sensitive to different modelizations. For the two skills which presented a significant positive impact we test Model (5), in order to differentiate by levels the impact of the project. Table 7 shows that, even if the 4th and 5th grades seem to make greater progress in terms of the first skill and inversely for the second skill, the overall difference between levels is not significant. Likewise, it is not pertinent to distinguish the effect of time, according to level, as we found no statistically significant differences.\nIt is known that some individual characteristics affect the pupils' abilities (see the impact of gender on reading abilities in Brown (1991) ); thus it would be interesting to see if this project is more beneficial for some types of pupils. As most of the subgroups that we can define according to individual characteristics are too small, we focus only on two aspects: the gender and the language spoken at home. To estimate this we introduce some cross variables in the Model (4) concerning individual characteristics and the variable estimating impact. The results presented in Table 8 show that there are no significant differences.\nTo conclude, we can note that the impact of the program is large. Indeed, we may compare it to the average estimated progress of the reading score given by the coefficients' value of the time variable in the OLS regression of Model (4). This mean progress is equal to +0.949 and thus the Action Lecture represents 40% of the annual increase in these three skills. These impacts are also positive for the two scores that capture the pupils' reading attitude. We do not detail the results here for all the models, but just report the DID's results for Model (4) in Table 9 . Table 9 : Estimation with DID of the program's impact on the attitude toward reading (SATR) and self-evaluation (SCRC)\nThe Action Lecture program's effect is equivalent to 21% of the variance of initial score for SATR and 13% for SCRC (see Table 3 )."}, {"section_title": "Cost-Effectiveness Analysis", "text": "The previous results show that the project Action Lecture has a positive impact on academic results and reading attitudes. But it may be asked if it is enough to justify that resources should be used for it. Reassigning the teachers involved in the Action Lecture program in classrooms could be an alternative option that permits new classes to be opened and so reductions in class size. On the one hand, the Action Lecture program increases reading marks by +0.383 per pupil. On the other hand, a one-pupil reduction of the class size increases reading marks by 0.339 points, according to Piketty and Valdenaire (2006) . To make the comparison effective, we estimate the potential class-size reduction generated by reassigning Action Lecture teachers to classrooms. We can compare this impact with the effect of the assigning teachers working in the program to new classes. We compute this effect in the following way:\n• in the 6 schools we considered, a total of 36 classes followed the Action Lecture program,\n• for 5 of these projects, 2 teachers participated and for the last project there was only 1 teacher out of a total of 11 teachers interventions,\n• each teacher intervenes 9 times per year,\n• the cost in terms of a teaching position is equal to 11/(9 × 36) per class,\n• the mean class size in our sample was 24.8 pupils,\n• with a reassignment of the teachers, the mean class size in these classes would fall to 24.8/(1 + 11/(9 × 36)) ≈ 24 i.e. a decrease of 0.8 pupils per class.\nIn the following table we summarize the different impacts estimated:\nEffect of Action Lecture teachers impact reassignment +0.271 +0.383 Table 10 : Impact over evaluation results\nWith the reassignment of the teachers to different classes, the impact will only be of 0.8×0.339 = 0.271 points at best, out of an overall 100 points, in terms of the results found in the reading evaluation. The impact of the Action Lecture program is estimated at 0.383 points out of 10% for the reading evaluation. Thus, this cost-effectiveness analysis does favor Action Lecture. The cost-effectiveness ratio expressed in terms of reading marks per teacher job can be computed.\n• The cost-effectiveness ratio for a one point class-size reduction in a class that has X pupils is equal to (X × 0.339)/(1/X), since the total effect will be X × 0.339 in terms of reading marks and 1/X in terms of teacher cost. For X = 24.8, the cost-effectiveness ratio for a class size reduction program is 208.5 points per teaching position.\n• The cost for each class involved in the Action Lecture program is equal to 11/(9×36) job positions and it produces 24.8 × 0.383 points in reading marks. Thus the costeffectiveness ratio for an Action Lecture program is (24.8×0.383)/(11/(9×36)) ≈ 280 points per teaching position.\nIt should be noted that the cost-effectiveness ratio for a class size reduction program is a quadratic function of the initial class size and it will equalize the Action Lecture cost-effectiveness ratio for a mean class size of 28.8.\nThis result holds under the assumption that the Action Lecture program does not have any negative impacts on other academic skills (mathematics, etc.). We may hope that even if other subject matters were dropped for two weeks, there are no negative effects on other skills. Indirect benefits may come from the progress in pupils' motivation observed for SATR and SCRC.\nOne limit of this cost-effectiveness analysis is that we use staff time instead of full costs. Since in the French education system, wages depends mainly on teachers' seniority, it would have been misleading to use the real wage costs. It was not possible to gather data on administrative costs but we guess that the administrative costs linked to a teacher position does not differ a lot whether the teacher is involved in the Action Lecture program or is in a classroom. If this difference exists, it is certainly small compared to a teacher cost."}, {"section_title": "Discussion", "text": "In this study, we conclude that the impacts of the Action Lecture program were positive and that it is more efficient than a class-size reduction program. One obvious question that this study raises concerns the scope of such results and their robustness. First, our cost-effectiveness analysis is expressed in terms of the marks used in France's national evaluation scheme. The results may be different according to other ways of measuring the achievement of academic standards. Indeed, compared to international evaluations such as PIRLS or PISA, French national evaluation proceeds quite differently: the definition of skills is broken down more and the skills tested are less sophisticated. It is therefore reasonable to think that the Action Lecture program will perform even better according to international forms of evaluation. A second reason that may limit the scope of our results is the particular class-size impact estimation we use. Wößmann and West (2006) show that there is an important heterogeneity in the level of this impact regarding school systems (their results are based on the equivalent of PIRLS for mathematical skills: i.e. TIMMS -Trends in International Mathematics and Science Study). In France, a common view is that class-size reductions are ineffective unless teachers also change their teaching methods. But as the results by Piketty and Valdenaire (2006) show, this is not true. Nevertheless, their results are probably peculiar to the French education system. Hence, our results only make sense for education systems similar to France's one. One common criticism made of French teaching methods is that they are too directive and do not promote pupils' self-development. This may explain the observed efficiency of an innovative teaching program. In other countries, the Action Lecture program may appear to be less innovative and more similar to usual teaching methods.\nThis discussion shows that the economics of education is far from being able to provide cost-effectiveness ratios of a large scope, such as found in health economics. Indeed, education practices are far from being standardized, as is the case for medicine. It is also hard to find a common indicator of efficiency, such as Quality Adjusted Life Years, for instance. In this evaluation, we consider several indicators, and the fact that the impacts are positive for various indicators shows that it was not by chance that the impact was positive for the main indicator we chose."}]