[{"section_title": "Abstract", "text": "Background: The aging of the United States population poses significant challenges to American healthcare and informal caregiving systems. Additional research is needed to understand how health promotion programs and policies based on a socio-ecological perspective impact the health and well-being of older persons. The purpose of this study was to investigate personal characteristics and supportive environments associated with poor health among older individuals aged 65 and over. Methods: This study used a cross-sectional design and was guided by a conceptual framework developed by the authors to depict the relationship between personal characteristics and environments associated with poor health status. Environment types included in this study were family, home, financial, neighborhood, and healthcare. The sample was comprised of 1319 adults aged 65 years and older residing in Central Texas. From a random selection of households, participants were administered a mail-based survey created by a community collaborative effort. Descriptive statistics and three binary logistic regression models were fitted to examine associations with poor health status (i.e., physical, mental, and combined physical/mental). Results: Two personal characteristics (number of chronic conditions and educational level) were consistently related (p < 0.05) to health outcomes. Supportive family, home, financial, neighborhood, and health care environmental factors were shown to be related (p < 0.05) to various aspects of physical or mental health outcomes. Conclusions: Multidimensional factors including personal characteristics and protective environments are related to health status among older individuals. The unique roles of each environment can help inform public health interventions to create and enhance support for older adults to engage in healthful activities and improve their physical and mental health."}, {"section_title": "Introduction", "text": "The aging population in the United States has reached 43 million persons and is growing rapidly with the aging of the baby boomer cohort [1] . Currently, one out of seven Americans is aged 65 years and older, but by 2030 one out of five individuals in this country will be an older person [2] . The average life expectancy of this age group is 19.2 additional years [2] , an increase of almost 3 years since 1980 [3] . This demographic shift represents a significant challenge for the healthcare system and public health "}, {"section_title": "Materials and Methods", "text": "\n"}, {"section_title": "Study Participants and Procedures", "text": "Data from the 2013 Regional Healthcare Partnership-Region 17 Health Assessment were used for this study [45] . Data were collected from adults residing in one of the following Texas counties: Brazos, Burleson, Grimes, Leon, Madison, Montgomery, Robertson, Walker and Washington. The household survey was conducted in 2013 using a 24-page survey instrument developed by 39 community stakeholders. The targeted number of participants was determined per each county, to facilitate county-specific analyses. A random sample of 36,000 households was selected to participate in the region. To recruit participants, letters were sent to the household. A week later, telephone calls were made to solicit participation. Participation within the household was randomized by using the \"next birthday method\" among adult residents. Following the telephone call, a packet was mailed to the identified recipient, which included the survey instrument (in English or Spanish), instructions, and a self-addressed stamped envelope. No additional incentives were provided for participation. Of the 36,000 households selected, 24,768 were reached by telephone. Of those, 12,177 households agreed to complete an instrument; however, 5230 actually returned a completed instrument [45] .\nOf the 4965 participants who reported age in the dataset, we initially omitted those younger than age 65 years based on the study purposes (n = 3367). Of the remaining 1598 adults aged 65 years and older, cases were omitted for missing data on variables of interest. More specifically, cases were omitted for missing data on days physical/mental health not good (n = 76), education (n = 17), marital status (n = 4), number of people living in the household (n = 46), neighborhood support (n = 86), and healthcare access (n = 238). Because some cases had missing data on more than one of these variables, the final analytic sample was 1319 adults aged 65 years and older.\nInstitutional Review Board approval was granted for this secondary data analyses from Texas A&M University and The University of Georgia (#00004540).\nData from the 2013 Regional Healthcare Partnership-Region 17 Health Assessment were used for this study [45] . Data were collected from adults residing in one of the following Texas counties: Brazos, Burleson, Grimes, Leon, Madison, Montgomery, Robertson, Walker and Washington. The household survey was conducted in 2013 using a 24-page survey instrument developed by 39 community stakeholders. The targeted number of participants was determined per each county, to facilitate county-specific analyses. A random sample of 36,000 households was selected to participate in the region. To recruit participants, letters were sent to the household. A week later, telephone calls were made to solicit participation. Participation within the household was randomized by using the \"next birthday method\" among adult residents. Following the telephone call, a packet was mailed to the identified recipient, which included the survey instrument (in English or Spanish), instructions, and a self-addressed stamped envelope. No additional incentives were provided for participation. Of the 36,000 households selected, 24,768 were reached by telephone. Of those, 12,177 households agreed to complete an instrument; however, 5230 actually returned a completed instrument [45] .\nOf the 4965 participants who reported age in the dataset, we initially omitted those younger than age 65 years based on the study purposes (n = 3367). Of the remaining 1598 adults aged 65 years and older, cases were omitted for missing data on variables of interest. More specifically, cases were omitted for missing data on days physical/mental health not good (n = 76), education (n = 17), marital status (n = 4), number of people living in the household (n = 46), neighborhood support (n = 86), and healthcare access (n = 238). Because some cases had missing data on more than one of these variables, the final analytic sample was 1319 adults aged 65 years and older.\nInstitutional Review Board approval was granted for this secondary data analyses from Texas A&M University and The University of Georgia (#00004540)."}, {"section_title": "Data and Measures", "text": "\n"}, {"section_title": "Dependent Variables", "text": "The three dependent variables used in this study were comprised of responses from two separate items from the CDC Healthy Days Scale [46] . Participants were asked, \"Now thinking about your physical \nThe three dependent variables used in this study were comprised of responses from two separate items from the CDC Healthy Days Scale [46] . Participants were asked, \"Now thinking about your physical health, which includes physical illness and injury, for how many days during the past 30 days was your physical health not good?\" Participants' responses could range from 0 day to 30 days [46] . Then, participants were asked, \"Now thinking about your mental health, which includes stress, depression, and problems with emotions, for how many days during the past 30 days was your mental health not good?\" Again, participants' responses could range from 0 day to 30 days. These continuous variables were dichotomized to indicate poor health (~50% or more of the past month). Those who reported their physical or mental health was not good for 0 to 13 days were considered to be in non-poor health. Those who reported their physical or mental health was not good for 14 to 30 days were considered to be in poor health. Then, these two continuous items (i.e., poor physical health days, poor mental health days) were summed and recoded to create a single variable ranging from 0 day to 30 days indicating the number of days the participant reported physical and/or mental health being not good. Again, this continuous variable was dichotomized (i.e., 0-13 days = non-poor health; 14-30 days = poor health). The CDC recommends that cut-points for these measures be determined by researchers based on hypothesized severity or other rationales (see http://www.cdc.gov/hrqol/ faqs.htm#11), and these cut-points of 14 days have been used previously [47, 48] ."}, {"section_title": "Family Environment", "text": "Participants were asked to report their marital status, which was then dichotomized into the categories of married and not married. Participants were also asked to report the number of people living in their house (including themselves). This variable ranged from 1 person (self) to 9 people and was treated continuously in analyses."}, {"section_title": "Home Environment", "text": "To assess the conditions in the home in which participants resided, they were asked to respond to seven items. Participants were asked, \"In the past 12 months has this house, apartment, or mobile home had a severe problem with any of the following: plumbing, heating/cooling, electricity (24 h without that service); mice, rats, or cockroaches; holes in floor; broken plaster or peeling paint (interior); roof (such as holes, leaks, or sagging); broken windows; mold.\" All items the participant endorsed were summed to create a continuous variable (range 0 to 7 house-related problems)."}, {"section_title": "Financial Environment", "text": "Participants were asked to report the number of financial-related services used in their household. When answering these items, participants were informed the items related to \"you and all those living in your household.\" Participants were asked, \"In the past 12 months, each community service listed below, circle 1 if household members did not need this service, 2 if any household member needed and used this service, or 3 if any household members needed, but did not use this service.\" Items were collapsed to form two categories, \"did not need\" and \"needed.\" Participants responded to items related to: Financial assistance or welfare (unemployment, TANF, social security disability-SSI); Utility assistance; Financial assistance for auto, appliance, or home repair; or weatherization; and Food, meal, and nutrition services (such as Meals-On-Wheels). All items the participant endorsed were summed to create a continuous variable (range 0 to 4 financial services needed)."}, {"section_title": "Neighborhood Environment", "text": "Based on Rural-Urban Continuum Codes (RUCC), counties in this region were coded as rural or urban [49, 50] . Participants were also asked three questions to assess their perceptions about neighborhood support. Participants were asked to rate the following using a 4-point Likert-type scale (strongly agree to strongly disagree): \"People in this community are willing to help their neighbors;\" \"this is a close-knit community;\" and \"People in this community can be trusted.\" The internal consistency reliability coefficient (Cronbach's alpha) for this 3-item scale was 0.834. These scores were summed to create a composite Neighborhood Support Scale, which ranged from 3 to 12, with higher scores indicating better neighborhood support."}, {"section_title": "Healthcare Environment", "text": "Participants were asked, \"Is there a specific doctor, nurse practitioner, physician assistant, or alternative health provider (chiropractor, homeopath, acupuncturist, curandero, etc.) that you consider to be your regular health care provider?\" Responses choices were no and yes. Participants were also asked four questions to assess their access to healthcare. Participants were asked to rate the following using a 6-point Likert-type scale (very poor to excellent): \"Your access to healthcare whenever you need it;\" \"Your ability to make an appointment with and see specialists if needed;\" \"Your access to hospital care if you need it;\" and \"Your access to mental health care if you need it.\" The internal consistency reliability coefficient (Cronbach's alpha) for this 4-item scale was 0.924. These scores were summed to create a composite Healthcare Access Scale, which ranged from 4 to 24, with higher scores indicating better healthcare access."}, {"section_title": "Personal Characteristics", "text": "Participant characteristics of interest in this study included age (range 65 to 96 years), sex (male, female), race/ethnicity (non-Hispanic white, African American, Hispanic, other/multiple), and education (less than high school, high school graduate or higher). Participants were also asked, \"Has a medical care provider (physician, nurse practitioner or physician assistant) ever told you that you had any of the following health problems?\" Participants were also asked to self-report their chronic conditions from a list of 16 health problems (scored no/yes). Examples of health conditions included hypertension, congestive heart failure, diabetes, cancer, asthma, arthritis, depression. All items the participant endorsed were summed to create a continuous variable (range 0 to 16 conditions)."}, {"section_title": "Statistical Methods", "text": "All analyses were performed using SPSS version 24 (IBM, Armonk, NY, USA). Frequencies and descriptive statistics were calculated for all variables of interest and compared based on the dependent variable categories. Chi square tests were used to assess distribution differences for categorical variables. Independent sample t-tests were used to assess mean differences for continuous and count variables. Then, three binary logistic regression analyses were performed. The first model examined personal characteristics and environmental factors associated with reporting poor physical health. The second model examined personal characteristics and environmental factors associated with reporting poor mental health. Then, the third model examined personal characteristics and environmental factors associated with reporting poor combined physical/mental health. For all binary regression models, participants who reported 0 to 13 days of poor health (i.e., physical, mental, physical/mental) served as the referent group. For all analyses, alpha less than 0.05 were considered to represent statistical significance. Table 1 presents sample characteristics for the current study. Over 15% of participants self-reported having 14 to 30 days of poor physical health in the past month, 7.5% reported having 14 to 30 days of poor mental health in the past month, and 20.3% reported having 14 to 30 days of poor combined physical/mental health in the past month. On average, participants were aged 70.19 (±5.13) years. A majority of participants were female (59.1%), non-Hispanic white (91.4%), and had at least a high school education (70.1%). On average, participants self-reported having 3.45 (±2.11) chronic conditions. Approximately 73% of participants were married and lived with 2.00 (±0.82) other people, on average. The majority of participants lived in a rural area (67.2%) and had a regular healthcare provider (91.3%). When comparing participant and environmental characteristics by poor physical health, a larger proportion of participants who had less than a high school education (χ 2 = 21.08, p < 0.001), were unmarried (χ 2 = 9.97, p = 0.002), resided in a rural area (χ 2 = 4.70, p = 0.030), and did not have a regular healthcare provider (χ 2 = 5.17, p = 0.023) reported poor physical health. On average, participants in poor physical health were older (t = −1.98, p < 0.049) and reported more chronic conditions (t = −8.71, p < 0.001). On average, participants in poor physical health reported significantly more house problems (t = −4.19, p < 0.001), more financial support needs (t = −5.09, p < 0.001), and worse neighborhood support (t = 3.35, p = 0.001)."}, {"section_title": "Results", "text": "When comparing participant and environmental characteristics by poor mental health, a larger proportion of participants who had less than a high school education reported poor mental health (χ 2 = 19.50, p < 0.001). On average, participants in poor mental health reported more chronic conditions (t = −7.19, p < 0.001), more house problems (t = −3.87, p < 0.001), more financial support needs (t = −3.98, p < 0.001), and worse neighborhood support (t = 3.94, p < 0.001).\nWhen comparing participant and environmental characteristics by poor combined physical/mental health, a larger proportion of participants who reported a race/ethnicity other than non-Hispanic white (χ 2 = 8.85, p = 0.031), had less than a high school education (χ 2 = 25.41, p < 0.001), were unmarried (χ 2 = 12.34, p < 0.001), and resided in a rural area (χ 2 = 4.15, p = 0.042) reported poor combined physical/mental health. On average, participants in poor combined physical/mental health reported more chronic conditions (t = −10.42, p < 0.001). On average, participants in poor combined physical/mental health reported significantly more house problems (t = −4.99, p < 0.001), more financial support needs (t = −5.85, p < 0.001), worse neighborhood support (t = 4.96, p < 0.001), and lower healthcare access (t = 2.30, p = 0.022). Table 2 reports findings from three binary logistic regression models examining the associations of personal characteristics with poor physical, mental, and combined physical/mental health in the 30 days (i.e., reporting 0 to 13 days of poor health served as the referent group for all models). In the first model, participants who were female (OR = 0.61), married (OR = 0.64), had more than a high school education (OR = 0.61), and had a regular healthcare provider (OR = 0.49) were less likely to report poor physical health. For each additional chronic condition (OR = 1.29), house problem (OR = 1.14), and financial support need (OR = 1.39) reported, participants were significantly more likely to report poor physical health.\nIn the second model, participants who had more than a high school education were less likely to report poor mental health (OR = 0.58). For each additional chronic condition (OR = 1.36) and house problem (OR = 1.19), participants were significantly more likely to report poor mental health. Conversely, for each additional unit increase in neighborhood support, participants were significantly less likely to report poor mental health (OR = 0.86).\nIn the third model, participants had more than a high school education were less likely to report poor combined physical/mental health (OR = 0.66). For each additional chronic condition (OR = 1.35), person living in their household (OR = 1.23), house problem (OR = 1.15), and financial support need (OR = 1.37), participants were significantly more likely to report poor combined physical/mental health. Conversely, for each additional unit increase in neighborhood support, participants were significantly less likely to report poor combined physical/mental health (OR = 0.90). "}, {"section_title": "Discussion", "text": "The purpose of this study was to investigate personal characteristics and supportive environments associated with health status in older individuals aged 65 and over. Our study examined several factors explored in other research examining the role of multilevel health determinants, demonstrating the continuing relationship between these factors into later life.\nConsistent with previous research [51] [52] [53] [54] [55] [56] [57] [58] [59] , this study confirms that chronic disease is an important factor influencing physical and mental health of the older individuals. According to CDC, chronic conditions are the costliest, common health issues affecting Americans, but are also preventable.\nFurther, as in other studies, we found that older persons with higher education were less likely to be in poor physical and mental health. There is considerable research documenting the strong association between education and health outcomes [60] [61] [62] [63] [64] . Having a higher education attainment is associated with an increased health-related knowledge, healthier lifestyle and environments, and a sense of personal control over circumstances [10] . A study with a large sample size from the National Health Measurement Study found that persons aged 35 to 89 years with lower education level had worse health-related quality of life than those with higher education level [19] .This study showed that participants who were female were less likely to report poor physical health. The literature on gender differences and physical health shows conflictive results [14] [15] [16] [65] [66] [67] [68] . Possible explanations for the discrepancy may include differences in the measurement of physical health as well as variations in the sex-ratio and disability-related conditions among samples. Our study did not investigate gender differences in prevalence of chronic diseases; thus findings discrepancies warrant further examination.\nThis study is unique because it examines the associations of 5 different types of environments on physical and mental health. All environments (family, home, financial, neighborhood, and healthcare environments) were significantly associated with poorer health in our study population. Consistent with the literature [69] [70] [71] , results in this study indicate that those who were married were less likely to report poorer physical health than those not married.\nIn our study participants that had a regular healthcare provider were less likely to report poorer physical health than those experiencing opposite circumstances. Other authors found a negative association between health and healthcare utilization [72] [73] [74] [75] [76] [77] . These discrepancies may be related to health-status measurements and disability-related conditions among samples. Our study found that higher financial needs were significantly associated with poorer physical health, which is consistent with previous research [17, [78] [79] [80] . An intriguing finding in our study was that for each additional person living at home, participants were significantly more likely to be in poorer physical and mental health. There are two possible explanations for this result. One explanation is that the elders in the household are carrying the burden of financially supporting others in the family. Research conducted in California indicates that when an older adult supports one adult child at home, their cost of living increases by at least 50% [81] . A second explanation is that because of their poor health older persons tend to live with family members, besides the spouse, as a safety net strategy. For instance, The Chinese Longitudinal Healthy Longevity Survey found that for older individuals living with family members was positive for their self-rated health, but it was associated also with a higher risk of functional and cognitive impairment [82] . Other studies found an association between functional impairment and not living alone at home [83] .\nOur findings indicate that participants perceiving to live in a neighborhood with trusted and helpful neighbors were less likely to report poor mental health. This is consistent with previous research [84] [85] [86] [87] [88] [89] [90] . A study conducted using data from the 2010 National Outcome and Assessment Information Set found that living alone and insufficient social support were predictors of hospitalizations and poor health among elderly individuals [53] . Research in Australian rural communities discovered that increased community support and personal support were predictors of well-being [23] .\nStudy findings related to housing conditions and physical and mental health resonate with previous research [40] [41] [42] [43] . One study conducted with adults determined a positive impact between housing improvements and physical and mental health [90] .\nGiven, our findings surrounding social ecological factors [91] and structural and social determinants of health [44] being significantly associated with poor physical and mental health, we suggest further research in this area. For example, previous work in Texas has looked at health behaviors predictive of poor health, namely physical activity as it relates to older adults [92, 93] . These findings show the importance of both perceived and objectively measured characteristics of one's environment, especially as environments perceived as more cohesive or measured objectively as walkable [92] have been shown to be associated with a greater likelihood of meeting certain thresholds of physical activity through walking. Walking is particularly important for older adults, as it has been shown to be the most common form of physical activity among this age group [94] ."}, {"section_title": "Limitations", "text": "This study was based on a cross-sectional design; therefore, causal inferences cannot be made. Future research should incorporate longitudinal data to determine causal associations throughout the life course. Although one of the strengths of this study is the use of a large data set, due to the sampling technique used and because data were collected in only one region in Texas, findings of this study may be generalized only to older adults living in areas with similar demographic characteristics to the study participants. It should be noted that there was considerable case attrition when applying inclusion criteria for this study (approximately 400 cases were omitted because of missing data). About half of cases omitted were missing data related to their access to healthcare, which may have biased our sample towards those with some form of health insurance (lack of insurance is typically associated with those of less education, less affluence, and certain races/ethnicities). Further, given the vast majority of older adults in the target area reported being white, these results are limited in generalization to other more diverse racial or ethnic groups. Future research should incorporate a more diverse group of individuals for greater generalizability. Although health status was measured using a valid, reliable instrument, dependent and independent variables were measured using a self-report instrument, which could have led to some biases. For instance, data was not collected to determine if study participants were actually receiving social services they reported needing. In addition, not all variables were asked that would give context about each environment (independent variables) and its contribution to the health status of participants. Measures of family and neighborhood environments did not elicit additional information from participants which could have been useful to investigate more in depth the association between these constructs and health status. Finally, other potential protective environments relevant to health status of older individuals, such as the built-environment and social network, were not included in this study."}, {"section_title": "Conclusions", "text": "Despite its limitations, this study shows that multidimensional factors including personal characteristics and protective environments, such as family, home, finances, neighborhood, and access to healthcare, all come into play to determine poor or good physical and mental health of older individuals. Given the growth in older adults [1] , this study is especially timely for policy makers and other stakeholders seeking to identify risk factors for poor health among older adults. This study provides relevant information that may inform public health interventions aiming to improve physical and mental health among older adults. Our study findings suggests a need for chronic disease-self management interventions tailored for older adults, which have been shown to be effective in reducing and controlling chronic conditions [95, 96] . Families could also be exposed to programs educating and empowering them to become a strong, positive support for their older adult co-habitant. Community and public health efforts could focus activities and events at local venues to promote neighborhood cohesion, capacity building, and social support for older persons. Finally, access to healthcare could be increased by providing mobile clinics or telehealth services, as well as providing elders with low-cost transportation to attend physician visits."}]