[{"section_title": "Abstract", "text": "Abstract The causes of natural variation in alkalinity in the North Pacific surface ocean need to be investigated to understand the carbon cycle and to improve predictive algorithms. We used GLODAPv2 to test hypotheses on the causes of three longitudinal phenomena in Alk*, a tracer of calcium carbonate cycling. These phenomena are (a) an increase from east to west between 45°N and 55°N, (b) an increase from west to east between 25°N and 40°N, and (c) a minor increase from west to east in the equatorial upwelling region. Between 45°N and 55°N, Alk* is higher on the western than on the eastern side, and this is associated with denser isopycnals with higher Alk* lying at shallower depths. Between 25°N and 40°N, upwelling along the North American continental shelf causes higher Alk* in the east. Along the equator, a strong east-west trend was not observed, even though the upwelling on the eastern side of the basin is more intense, because the water brought to the surface is not high in Alk*. We created two algorithms to predict alkalinity, one for the entire Pacific Ocean north of 30°S and one for the eastern margin. The Pacific Ocean algorithm is more accurate than the commonly used algorithm published by Lee et al. (2006) , of similar accuracy to the best previously published algorithm by Sasse et al. (2013) , and is less biased with longitude than other algorithms in the subpolar North Pacific. Our eastern margin algorithm is more accurate than previously published algorithms."}, {"section_title": "Introduction", "text": "Total alkalinity, hereafter referred to as alkalinity, is typically determined as part of seawater carbonate chemistry observations. Alkalinity is the excess of proton acceptors over proton donors [Wolf-Gladrow et al., 2007] . It is one of four measurable carbonate chemistry variables, with the others being dissolved inorganic carbon, pH, and the partial pressure of carbon dioxide (pCO 2 ). We can calculate the entire carbonate system with any two of these variables, along with temperature, pressure, salinity, phosphate, and silicate concentrations. Alkalinity is useful because it behaves in a conservative manner when water masses mix and is independent of changes in temperature and pressure, unlike pCO 2 and pH [Dyrssen and Sillén, 1967; Wolf-Gladrow et al., 2007] . This allows us to develop linear relationships to predict alkalinity from common hydrographic measurements, like temperature and salinity. These relationships can then be used to constrain the carbonate system from standard measurements when a carbonate variable is unavailable. This approach is more difficult for pCO 2 and pH due to their nonlinear relationship with temperature and salinity.\nThe main causes of variation in surface ocean alkalinity are dilution and concentration as a result of precipitation, evaporation, river discharge, and sea ice formation and melt [Millero et al., 1998; Friis et al., 2003; Cai et al., 2010] . Since these processes also strongly influence ocean salinity, alkalinity is often considered a function of salinity due to its strongly conservative nature [e.g., Chen and Millero, 1979; Millero et al., 1998; Lee et al., 2006; Land et al., 2015] . However, alkalinity is also affected by nonconservative processes, for example, biological organic matter production and calcification [Brewer and Goldman, 1976; Wolf-Gladrow et al., 2007; Kwon et al., 2009] . It is therefore important to determine the causes of local nonconservative deviations in alkalinity (variations from the relationship with salinity) to improve our understanding of the controls on ocean carbonate chemistry and its role in climate change and ocean acidification.\nPhysical processes are known to be important drivers of surface ocean alkalinity, including for example, upwelling of deep water with enhanced alkalinity [Fry et al., 2015] . To capture these physical processes, Takatani et al. [2014] included sea surface height as an independent predictor variable for alkalinity in the Pacific Ocean. This is because sea surface height can be used to distinguish between water bodies with potentially different alkalinities. The relationships in Takatani et al. [2014] improved on Lee et al. [2006] and reduced bias in the western North Pacific from a mean difference between the measured and predicted values of À12.7 mol kg À1 (rootmean-square error (RMSE) of 16.7 μmol kg À1 ), obtained using the relationship presented by Lee et al. [2006] , to a mean difference of À0.2 μmol kg À1 (RMS of 6.2 μmol kg"}, {"section_title": "À1", "text": "). For the subpolar North Pacific (north of 30°N and <20°C), these authors also used two equations, where Lee et al. [2006] used only one. Longitude was not included explicitly as a predictor variable, but the application of one equation in the east and one in the west allowed the effect of longitude to be included indirectly. Therefore, the increased accuracy of Takatani et al. [2014] could be caused by the use of additional variables and equations (allowing a greater degree of tuning of the algorithm), rather than because sea surface height is a superior predictor variable. Sasse et al. [2013] improved on Lee et al. [2006] by using more predictor variables (temperature, salinity, dissolved oxygen, silicate, and phosphate), while dividing the ocean into the same regions as Lee et al. [2006] . They compared the results of their multiple linear regression with a Self-Organizing Multiple Linear Output (SOMLO); however, this did not improve the prediction of alkalinity in the North Pacific. The accuracy of the SOMLO was only 2.7% greater in the North Pacific (temperature <20°C; salinity between 31 and 35) and was 2.1% less accurate in the equatorial Pacific. They commented that there are few nonlinearities in the carbonate system; therefore, using a nonlinear model does not provide an improvement. Henceforth, we only refer to the multiple linear regression by Sasse et al. [2013] .\nIn the tropical ocean, both Millero et al. [1998] and Lee et al. [2006] noted that the eastern equatorial upwelling region had a higher salinity-normalized alkalinity than the rest of the tropical oceans. Fry et al. [2015] and Ishii et al. [2004] , on the other hand, did not observe any longitudinal variation in salinity-normalized alkalinity in these ocean regions. However, it is possible that a different relationship from the rest of the tropical region is still required. Some of the predictor variables may be affected by the equatorial upwelling, and although alkalinity is not, the relationship between alkalinity and the predictor variables is changed by the upwelling. For example, if upwelling waters are colder than nonupwelling waters but do not contain elevated Alk* values (see below for Alk* definition), then the relationship with the predictor (temperature) may change and a new equation is necessary even though Alk* values are not different from those outside the upwelling region.\nThe study of the factors controlling variability of the oceanic carbonate system is important because of its central role in climate change and ocean acidification. There is, however, a limited amount of alkalinity data compared to other hydrographic measurements such as temperature, salinity, and nutrients (GLODAPv2 has about 42,000 casts, whereas the World Ocean Database contains over 3,000,000 casts). As a result of the insufficient temporal and spatial coverage of the global ocean, algorithms are employed to predict alkalinity values using commonly measured variables such as temperature and salinity. These algorithms therefore provide greater alkalinity coverage of the ocean and are also of importance for verification of biogeochemical models as it is difficult to model alkalinity fields with a high level of accuracy.\nWe have recently introduced Alk* (equation (1)) as a tracer of calcification, dissolution of calcium carbonate, and the movement of the dissolution products via physical circulation [Fry et al., 2015] . Alk* illuminates these processes as it removes other common controlling factors of variation, namely, evaporation and precipitation, river inputs, and biological uptake and release of ions.\nwhere Alk m is the measured alkalinity (μmol kg\n), Nit is the nitrate concentration (μmol kg À1 ), Alk r is the identified river alkalinity (μmol kg À1 ) in ocean areas affected by river inputs, and Sal is the salinity.\nThe aim of our work is to determine the factors controlling alkalinity in the surface waters of the North Pacific Ocean. We test a series of hypotheses that explore longitudinal variations in Alk* in the zonal bands 45°N-55°N , 25°N-40°N, and 15°S-10°N. We then derive two algorithms that predict alkalinity in surface waters, for both the entire Pacific Ocean north of 30°S and also in the eastern margin of the North Pacific. Each algorithm consists of three equations and the relevant definitions of how to choose which equation to use for each location.\n, standard deviation = 0.4 mL L À1 ) than in the east (mean = 6.5 mL L À1 , standard deviation = 0.6 mL L\n). The east and west North Pacific between 45°N and 55°N have different oxygen concentrations at all depths (two-sample t tests; p < 0.001). However, the difference at 100 m is opposite to what is required for hypotheses 1.3 to be accepted (oxygen is higher in the west than the east). There is a band of low oxygen concentrations along the Aleutian Arc at about 200 m, a region where sulfate reduction in sediments has been observed [Hein et al., 1979; Elvert et al., 2000] . However, the Aleutian Arc is not where the highest Alk* is observed and the area seems to have decreased oxygen levels (<2 mL L À1 ) only below 200 m.\nThe east-west Alk* gradient occurs in measurements from many cruises. The gradient is therefore unlikely to be an artifact caused by measurement error on any single cruise. However, all Japanese cruises in GLODAPv2 had a systematic adjustment applied to their alkalinity data of +6 μmol kg\n. This was done in order to make the deepwater values of the Japanese cruises consistent with data from other countries at crossover stations. If this adjustment was incorrect then it could have created the observed east-west trend, as the Japanese cruises took place mainly in the western North Pacific. To test this possibility, we subtracted 6 μmol kg À1 from all the Japanese alkalinity data, reversing the adjustment in GLODAPv2. This reduced the mean Alk* value in the west from 95.8 (Table 1) to 89.9 μmol kg À1 and the mean Alk* value in the east from 72.2 to 71.0 μmol kg\n. Therefore, a significant east-west gradient remained, showing that the adjustment in GLODAPv2 was not the cause of the east-west trend.\nOur data suggest that the alkalinity variation in the surface waters of the North Pacific, between 45°N and 55°N, is caused by denser isopycnals with higher Alk* occurring at shallower depths on the western side than on a Data were interpolated using a smoothing spline, where the smoothing parameter is p = 0.5.\n) and the salinity and alkalinity are low (about 32 and 2180 μmol kg\n, respectively), suggesting that this enhanced Alk* is caused by unaccounted for riverine inputs. But in the area of interest along the coast (25-40°N), the salinity and alkalinity are both higher than the average of all the data between 25 and 50°N (33.5 versus a mean of 32.7 and 2244 μmol kg À1 versus a mean of 2216 μmol kg À1 ) and the temperature is lower than offshore (14.3°C versus 17.9°C offshore). This indicates that the enhanced Alk* is caused by upwelling.\nWe partitioned the eastern data into four groups to represent subpolar, tropical, upwelling, and riverinfluenced waters (Table 3 and Figure 7 ). The properties of offshore subpolar and tropical water were derived by using data within regional boxes and calculating the mean and standard deviations. These boxes were defined as between 45°N and 55°N and 130°W and 150°W for the subpolar box and between 15°N and 25°N and 120°W and 150°W for the tropical box. Water was flagged as subpolar or tropical influenced if its salinity, alkalinity, and Alk* were all within 1 standard deviation of the mean of the defined box. Figure 7 shows that the groups are distributed in geographical clusters according to where each set of forcing factors had the strongest influence. For example, river-influenced points are situated in the coastal region. This provides evidence that all three factors enhance Alk* in different areas. Away from the coast, a small amount of mixing between subpolar water and tropical gyre waters takes place (hypothesis 2.3). In the coastal region, upwelling increases Alk* in the south (25-42°N) and river inputs increases Alk* in the north (42-50°N; Figure 7) . However, the river-influenced waters are to the north of the area we have highlighted as anomalous, hence ruling out hypothesis 2.1 for the latitudinal region under investigation.\nPhenomenon 2 is unlikely to be due to random error because it is derived from a large and coherent data set from a range of cruises. The different surface waters identified in this data set also agree with those reported by Jiang et al. [2014] : low-temperature, high-salinity water upwelling off the tropical coast and water from the Columbia and Fraser Rivers (both with alkalinities of about 1000 μmol kg À1 [Park et al., 1969; Dahm et al., 1981; Amiotte Suchet et al., 2003; de Mora, 2008] ), influencing regions near the coastline further north. Jiang et al.\n[2014] also reported lower salinities (<32.5) in the California Current than in the open ocean (>32.5), which is in agreement with our definitions of subpolar and tropical waters (Table 3) .\nFigures 1 and 2 show a few anomalously high Alk* values adjacent to the East China Sea at 30°N (21 points with an Alk* greater than 100 μmol kg\n), although the average is not much different from elsewhere, unlike toward the eastern side. Alk* in the East China Sea is likely to be influenced by the river alkalinity inputs from the Yangtze and Yellow Rivers [Chen, 1996; Tsunogai et al., 1997; Kang et al., 2013] and sulfate reduction due to eutrophication [Chen and Wang, 1999; Chen, 2002; Lin et al., 2002; Cai et al., 2011] .\nIn conclusion, we find that Alk* is enhanced in the eastern North Pacific around 30°N through upwelling of deeper waters with enhanced dissolved calcium carbonate concentrations (Alk* > 50 μmol kg À1 ; hypothesis 2.2). Previous research indicated that the upwelling may be seasonal in spring and summer around 35°N [Huyer, 1983; Hauri et al., 2013] and is caused by Ekman transport from wind stress [Huyer, 1983] and is linked to the North Pacific Gyre Oscillation [Di Lorenzo et al., 2008] . Studies project that strengthening of the North Pacific Gyre Oscillation, caused by climate change, will increase future wind stress [Bond et al., 2003; Douglass et al., 2006; Cummins and Freeland, 2007] . This implies that enhanced Alk* may occur in this region in the future due to increased upwelling. \n) between El Niño (ENSO index > 0.5) and La Niña years (ENSO index < 0.5), which is also observed in the nitrate and silicate concentrations (Table 4) . However, there is only a weak correlation between ENSO index and Alk* (R 2 = 0.12, N = 810) while temperature (x) is a strong predictor (R 2 = 0.63, N = 810) of Alk* (y) (equation (2)). This strong correlation between Alk* and temperature indicates that sea surface temperature is a better indicator than the ENSO index for the upwelling strength in this region.\nVariations in nutrients and Alk* concentrations can be observed in a meridional section across the known area of upwelling (Figure 8 ). The absence of a meridional increase in Alk* (decrease of 10% in the grey area in Figure 8 compared with outside the grey area (20-15°S and 10-20°N)) despite a significant increase in nitrate (increase of 490%) in the equatorial region supports hypothesis 3.2 that the upwelling is not usually from a sufficient depth to supply significant Alk*. There is also little increase in silicate concentration \n, which is 4 μmol kg À1 less than the magnitude of the original gradient in alkalinity in the subpolar North Pacific. The increase from west to east is because our algorithm underpredicts in the high alkalinity north-west and overpredicts in the lower alkalinity north-east. The direction of our bias is similar to the bias from the algorithm by Sasse et al. [2013] but opposite to the algorithm by Lee et al. [2006] , which underpredicts the low alkalinity in the west. We Lee et al. [2006] and (e and f) the same areas using our algorithm for the entire Pacific Ocean algorithm. The solid red lines are the best fit straight lines.\nto À0.04 μmol kg À1 ). These statistics show little bias, and therefore, our entire Pacific Ocean algorithm models the natural variation in these regions.\nFor the eastern margin, our algorithm is more accurate than previous algorithms; the r increased from 0.912, 0.945, and 0.953 (for the algorithms by Millero et al. [1998] , Lee et al. [2006] , and Sasse et al. [2013] , respectively) to 0.991, and RMS error decreased from 27.1, 22.1, and 13.0 μmol kg À1 to 7.03 μmol kg À1 . This is partly because our algorithm is designed specifically for the area, whereas the others were not."}, {"section_title": "Hypotheses", "text": "The Alk* distribution in the surface waters of the North Pacific shows distinct longitudinal gradients at different latitudes (Figure 1 ): (1) between 45°N and 55°N, Alk* is higher in the west than the east ( Figure 2a) ; (2) between 25°N and 40°N, Alk* at the eastern edge of the Pacific is higher than further west ( Figure 2b) ; and (3) in the eastern equatorial Pacific there is only a minor increase in Alk* despite a pronounced reported increase in salinity-normalized alkalinity [Millero et al., 1998; Lee et al., 2006] (Figure 2c ). The differences between east and west in all three latitudinal bands are significant (Table 1 ). The divide is situated further east for the 30°N zonal band as we are looking to explain a localized feature and a more central divide would bias the t test results. We developed a series of hypotheses for each of the phenomena (the gradients just described) and tested the hypotheses using observational data. For all three latitudinal bands, we considered the alternative possibility of the patterns being caused by errors in data such as a bias of one cruise or random error in a few data points.\nPhenomenon 1: Between 45°N and 55°N, Alk* is higher in the northwest Pacific than in the northeast Pacific. Hypothesis 1.1. Winter mixing yields higher Alk* values to the west, as it reaches greater depths than on the eastern side. Hypothesis 1.2. Denser isopycnals with older water containing elevated Alk* are closer to the surface on the western side. Hypothesis 1.3. Anaerobic processes in shelf sediments (which enhance Alk*) exert a stronger influence on the western side.\nPhenomenon 2: Between 25°N and 40°N, Alk* is higher toward the eastern edge of the Pacific than further west. Hypothesis 2.1. Previously unidentified outflow from North American rivers affects Alk*. Hypothesis 2.2. Upwelling increases Alk* along the North American coast. Hypothesis 2.3. High Alk* waters are transported southward from the northeast Pacific by the California Current, but this process does not occur in the northwest Pacific, where the northward flowing Kuroshio Current dominates.\nPhenomenon 3: In the equatorial Pacific region, there is little increase in Alk* from the west to the east. Hypothesis 3.1. In the majority of phases of the El Niño-Southern Oscillation (ENSO) there is limited upwelling of Alk*. Hypothesis 3.2. The upwelled waters do not come from a sufficiently great depth to contain enhanced Alk*. "}, {"section_title": "Global Biogeochemical Cycles", "text": "\n\n\n\n\n\n"}, {"section_title": "10.1002/2016GB005398", "text": "Hypothesis 3.3. High Alk* waters are upwelled, but calcification and export rapidly remove Alk* from the surface ocean.\nstrength of the ENSO were tested using a Multivariate ENSO Index from NOAA [http://www.esrl.noaa.gov/ psd/enso/mei/]. The index is produced monthly and calculated using the current and previous month.\nUnless otherwise stated, the areas analyzed are 45°N to 55°N for phenomenon 1, 25°N to 40°N for phenomenon 2, and 15°S to 10°N for phenomenon 3. The chosen area for phenomenon 3 (equatorial region) is asymmetrical across the equator because the peak in nitrate occurs south of the equator in the Pacific Ocean [Garcia et al., 2014b] as a result of geographic asymmetry [Xie and Philander, 1994] .\nthe eastern side (hypothesis 1.2). This east-west difference is likely driven by Ekman pumping, which brings deeper water closer to the surface on the western side [Talley, 1985 [Talley, , 1988 .\n\n(<1%), which indicates that the upwelled waters are derived from depths where remineralization of organic matter has supplied nitrate, but the depths are not sufficient to provide enhanced Alk* (derived from sinking calcium carbonate) and silicate (derived from sinking opal). These results can be compared to those in Table 4 . The surface concentrations of silicate and Alk* are typically low and similar to those outside the area of upwelling. However, strong upwelling during negative ENSO phases supplies waters from greater depths, increasing surface silicate and Alk*.\nThis finding is different to that for the eastern North Pacific margin around 30°N, where upwelling has a stronger effect on Alk* than in the eastern equatorial Pacific. This is because the upwelled waters are older in the eastern North Pacific margin around 30°N. Feely et al. [2008] reported that the upwelled waters are derived from the potential density layer of 26.2-26.6, which has a depth of about 175 m offshore. Water at this depth has high nitrate and silicate concentrations, unlike at the equator (Figure 8 [Garcia et al., 2014b] ).\nIn contrast to reports of a short turnover time (<10 days) for calcite in the surface ocean [Balch and Kilpatrick, 1996] , there is little increase in Alk* in the surface compared with nitrate concentration (Figures 8 and 9 ), hence ruling against hypothesis 3.3. It is unlikely that waters high in both nitrate and Alk* are upwelled and then calcification and export rapidly remove the Alk* before the nitrate.\nAn increase in nitrate is apparent at around 200 m depth in the meridional section (Figure 9 ), whereas Alk* increases more gradually with depth. It is therefore likely that waters are usually upwelled with enhanced nitrate concentrations but low Alk*.\nIn conclusion, the evidence indicates that the cause for the small average increase in Alk* from west to east (10 μmol kg À1 ) is that the shallow depths from which waters are usually upwelled contain low concentrations of Alk* (hypothesis 3.2). The significant difference between El Niño and La Niña conditions (Table 4) indicates that stronger upwelling during La Niña years brings up deeper water, resulting in increased surface Alk* (hypothesis 3.2). These findings are similar to observations by Ishii et al. [2004] , who observed no increase in normalized alkalinity from west to east, possibly because the years they sampled featured positive ENSO index values (lowest ENSO index = À0.21 but most months above 1).\ndensity, as a predictor variable rather than temperature alone. Subsurface potential density is likely to give more accurate results because physical processes acting on the surface (e.g., evaporation, precipitation, warming, and cooling) can change the water density; however, the algorithm would be more difficult to apply if it depended on variables obtained at other depths.\nOur analysis of 30°N shows that upwelling of deep waters increases surface alkalinity and highlights the difficulty in predicting alkalinity in regions where multiple water bodies meet, such as offshore of California and Mexico, as shown by Jiang et al. [2014] . More complex algorithms should be used in order to accurately predict the alkalinity when studying this area. Previous attempts to characterize the carbonate system have been made in this region using temperature, oxygen, salinity, and potential temperature [Juranek et al., 2009; Alin et al., 2012] . However, these algorithms did not include surface waters because they are more difficult to predict.\nFinally, in the equatorial Pacific we argued that the surface Alk* is affected only by the strength of upwelling as this determines the depth from which the upwelled water is derived. Because nitrate and silicate are also affected by the strength of the upwelling (as indicated by the ENSO index; e.g., see Table 4 ) it is possible to parameterize the variations in Alk* using more commonly measured nutrient concentrations.\nUsing the GLODAPv2 database, we created two algorithms using predictive equations; one algorithm of three equations covers the entire Pacific Ocean between 30°S and 65°N, and another separate algorithm, also of three equations, covers the region between 25°N and 50°N and 140°W and 110°W (Table 5) .\nWe divided each algorithm into regions with different equations. For the basin-wide Pacific Ocean algorithm, we first split the basin into above or below 10°N. We then optimized the way to divide each area into two regions by sequentially splitting all the data by temperature for every degree from 0°C to 30°C and calculating the Pearson's r correlation coefficient (r) of a simple multiple linear regression (using nitrate, phosphate, silicate, salinity, potential density, and temperature) for each temperature. In the eastern North Pacific margin, we separated the areas into river influenced (salinity < 32), upwelling influenced (salinity > 33 and temperature < 20°C), and open ocean (remaining data) as identified in section 4.2.\nWe transformed the nitrate, phosphate, and silicate concentrations to a normal distribution by taking natural logarithms. We transformed the other predictor variables by subtracting the mean values from salinity, potential density, and temperature (34.02, 23.4, and 21.20°C, respectively, for the Pacific Ocean algorithm or 32.76, 24.6, and 12.80°C, respectively, for the eastern margin). All subsequent analysis was performed on the transformed variables. a In which S is the salinity minus the mean (34.14 for the North Pacific and 32.76 for the eastern margin), N is the natural logarithm of the nitrate concentration, and σ θ is the surface potential density minus the mean (23.2 or 24.6 for the North Pacific or eastern margin, respectively).\nb n is the number of data points, RMSE is the root-mean-square error, and r is the Pearson's product moment correlation coefficient. c From 30°S to 65°N and <30 m depth. d From 25 to 50°N and 140 to 110°W and <30 m depth. e Equations for the North Pacific, the (sub)tropics, the equatorial Pacific, and Southern Ocean depending on latitude, longitude, and temperature. f Equations for the North Pacific, the gyres, and the equatorial Pacific depending on latitude, longitude, and temperature.\nGlobal Biogeochemical Cycles\nIn the entire region (north of 30°S), we tested for collinearity between the predictor variables by calculating the variance inflation factor (VIF). A lower VIF signifies less collinearity between the tested variable and the other predictor variables, and we deemed values lower than 4 to be acceptable. The collinearity of variables was high so we removed temperature and phosphate. The final VIFs were 3.24 for nitrate, 2.47 for surface potential density, 1.46 for salinity, and 3.55 for silicate. We then correlated the combinations of predictor variables with longitude in the subpolar North Pacific (north of 40°N) and chose to include potential density squared as it had the most significant (furthest from zero) correlation with longitude in this region (r = À0.362). This value supports our conclusions in section 4.1 that the variation in Alk* is influenced by denser, deeper water containing dissolved calcium carbonate products. When using the predictor variables of nitrate, salinity, surface potential density, potential density squared, and silicate all the coefficients are significant with a probability value smaller than 0.001, which reduces to less than 1 × 10 À10 when silicate is removed due to the covariance between nitrate and silicate. These probabilities indicate that all the predictor variables help to constrain alkalinity; however, there is moderate covariance between nitrate and silicate. Table 6 summarizes the input variables and their uncertainty.\nThen in each region for each algorithm, we ran a tenfold cross validation using least squares multiple linear regression both with and without silicate. This was done to produce a robust fit of the predictor variables to alkalinity. For the tenfold cross validation, we randomly split the data 10 times into two groups. Group 1 consisted of 90% of the data in the region, and this was used to produce the multiple linear regressions both including and excluding silicate. Group 2, containing 10% of the data in the region, was used to test the accuracy of the equations which we measured using the root-mean-square (RMS) deviation and the r coefficient. The inclusion of silicate did not improve the fit of the multiple linear regression, so we used the equation without it. We also increased the multiple linear regression coefficient of salinity in the northern lowtemperature region to reduce the bias with longitude. This increased the RMS; however, it also increased the r in the region. The final statistical results were then compared with previously reported algorithms by Millero et al. [1998] , Lee et al. [2006] , and Sasse et al. [2013] using the GLODAPv2 database (Table 5) .\nOur prediction for the Pacific Ocean accounts for more variability than the algorithms by Lee et al. [2006] and Millero et al. [1998] but not more than the algorithm by Sasse et al. [2013] . For the entire Pacific, the r of our algorithm is 0.970 compared to 0.928, 0.969, and 0.977 for algorithms by Millero et al. [1998] , Lee et al. [2006] , and Sasse et al. [2013] , respectively, and the RMS of our algorithm is 14.1 μmol kg À1 compared to 25.0, 14.2, and 12.4 μmol kg À1 for algorithms by Millero et al. [1998] , Lee et al. [2006] , and Sasse et al.\n[2013], respectively.\nThe algorithm for the whole Pacific is also an improvement in terms of simplicity; it uses only three equations to cover the Pacific Ocean north of 30°S, rather than the four equations used by Lee et al. [2006] and Sasse et al. [2013] . The ability to make predictions of similar accuracy (first two significant figures of the r value are the same) as previous attempts, with fewer equations, and without using longitude as an artificial predictor as used by Lee et al. [2006] , suggests that our algorithm corresponds more closely to the underlying mechanistic reality. Because our algorithm for the Pacific Ocean has fewer equations, it is also simpler and therefore easier to apply. (Figures 10c and 10d) increase from east to west even in the subpolar North Pacific where longitude was used as an additional variable to reduce this bias. Figure 11 shows the relationship between the residuals and longitude in the areas of each of the phenomena. The subpolar North Pacific (45-55°N) has the strongest bias (r = 0.635) with longitude despite the use of squared potential density and an increased salinity coefficient to specifically reduce bias in this region. This bias is still less than the bias of the Sasse et al. [2013] algorithm in the same region (r = 0.874). The resulting gradient in the residuals from west to east is an increase of 19 μmol kg\nconclude that using in situ parameters may limit the ability of a predictive algorithm to capture the east-west gradient in the subpolar North Pacific; therefore, model-based approaches could improve the coverage of data in this region in the future. The regions of phenomenon 2 and 3 have little bias with longitude (r < 0.001 and 0.047, respectively), the gradient in residuals at 30°N is a decrease from west to east of 2 μmol kg À1 (from 7.1 μmol kg À1 to 5.3 μmol kg À1 ), and the residuals along the equator increase by 0.56 μmol kg À1 (from À0.6 μmol kg"}, {"section_title": "Methodology", "text": "Alkalinity and other variables were obtained from the GLODAPv2 database [Olsen et al., 2016] . Data from depths of less than 30 m were defined as being from the surface mixed layer. Alk* was calculated using equation (1), and no correction for riverine alkalinity inputs was applied because no substantial areas influenced by rivers have previously been identified in the North Pacific [Fry et al., 2015] . Shelf areas are included in our approach, which is different to our previous study [Fry et al., 2015] . The typical accuracy of alkalinity measurements is 3 μmol kg À1 [Dickson et al., 2003 ] and 3.02 μmol kg À1 for Alk* [Fry et al., 2015] . Annual mean dissolved oxygen and nitrate gridded to 1°were obtained from the World Ocean Atlas 2013 [Garcia et al., 2014a [Garcia et al., , 2014b . Mixed layer depth data were obtained from the National Oceanic and Atmospheric Administration (NOAA) [Monterey and Levitus, 1997] . The mixed layer depth data were gridded to 0.5°for each month, and mixed layer depth was defined using a variable potential density criterion corresponding to a change in temperature of 0.5°C [Monterey and Levitus, 1997] . The maximum mixed layer depth used was the largest of the monthly values for each grid point. The resulting maximum mixed layer depths occurred in the northern hemisphere winter, with February the most common month for the deepest mixed layer. The effect and a Probability with the null hypothesis for each band is that the means of both boxes are equal. b Two-sample, two-tailed t test."}, {"section_title": "Results and Discussion", "text": ""}, {"section_title": "Alk* Variations Along Approximately 50°N in the North Pacific", "text": "The maximum mixed layer depths at 40°N are greater in the west than the east ( Figure 3 ). However, the area of interest (the black box) is to the north of the region of the greatest maximum mixed layer depths. The relationship between maximum mixed layer depth and the surface Alk* is weak (R 2 = 0.0578, N = 3889) ( Figure 4 ).\nTherefore, surface Alk* appears to be unrelated to the maximum mixed layer depth (refuting hypothesis 1.1).\nAlk* appears to follow the lines of potential density, with denser waters containing higher Alk* occurring closer to the surface in the west than in the east (right side of Figure 5a compared to right side of Figure 5b ). The depths of isopycnals and Alk* concentrations in the west and the east are presented in Table 2 . These show that the mean depth of isopycnals is shallower in the west than the east of the North Pacific, and this is matched by shallower mean depths of Alk* concentrations in the west than in the east. Further, the Pearson's r correlation coefficient between potential density and Alk* is 0.890 in the region of phenomenon 1, which shows that there Global Biogeochemical Cycles\nis a strong positive correlation. These observations confirm hypothesis 1.2; Alk* in the surface ocean is affected by entrainment of waters from dense isopycnal layers.\nSulfate uptake affects alkalinity by changing the charge balance of seawater. This causes alkalinity to increase in order to counteract the change [Wolf-Gladrow et al., 2007] . Sulfate reduction is an anaerobic process; therefore, if this process contributes to phenomenon 1 (hypothesis 1.3), we would also expect lower dissolved oxygen concentrations in the western region of the North Pacific zonal band compared with the eastern region. However, anoxia is not prevalent in surface waters due to rapid exchange processes of oxygen with the atmosphere. Using the World Ocean Atlas, the dissolved oxygen concentrations in the surface waters in the west are higher (mean = 7.1 mL L"}, {"section_title": "Alk* Variations Along About 30°N in the North Pacific", "text": "Between 25°N and 40°N, Alk* concentrations are higher in the eastern coastal region than in the open ocean ( Figure 6 ). Along the coast at about 45°N, the Alk* is elevated (approximately 80 μmol kg"}, {"section_title": "Alk* Variations in the Equatorial Pacific", "text": "In the equatorial Pacific, the Alk* increases from the west to the east by 9.1 μmol kg À1 (Table 1 ). There is a significant difference in Alk* (greater than the uncertainty in Alk*: 3.02 μmol kg"}, {"section_title": "Improved Predictive Algorithms", "text": "Our investigation shows that the enhanced Alk* in the northwestern compared with the northeastern subarctic Pacific at about 50°N is associated with denser isopycnals (e.g., σ θ = 27.0) reaching closer to the surface, which is probably caused by more intense Ekman pumping [Talley, 1985 [Talley, , 1988 . A predictive algorithm for surface alkalinity that identifies supply of deep waters should therefore improve predictive skill compared to an algorithm that does not identify recently entrained deep waters. To incorporate this mechanistic understanding into predictive algorithms, we propose potential density (σ θ ), or some other measure of seawater "}, {"section_title": "Residuals for our", "text": ""}, {"section_title": "Possible Future Changes in Alkalinity", "text": "An improved mechanistic understanding of carbonate chemistry in the North Pacific will be helpful for estimating future changes in alkalinity and calcium carbonate saturation state. There is evidence that climate change is causing winds to strengthen, which may increase upwelling along the North American coast [Bakun, 1990; Hauri et al., 2013; Sydeman et al., 2014] . Upwelled waters in this area have enhanced Alk* from dissolution of calcium carbonate minerals at depth ( Figure 6) ; therefore, future increases in wind strength could cause a local increase in Alk*. Changes in ocean circulation could also affect alkalinity concentrations in the equatorial Pacific; climate change may cause El Niño conditions to occur more frequently by strengthening of the equatorial thermocline [Timmermann et al., 1999; Yeh et al., 2009] . Because upwelling of alkalinity seems to occur only during La Niña events, if they occur less frequently in future then it is likely that less alkalinity will be upwelled in the equatorial Pacific."}, {"section_title": "Conclusions", "text": "Analysis of data from GLODAPv2 and other data sets allowed us to test a series of hypotheses on the causes of longitudinal variations in Alk* in the North Pacific. At 50°N, the major cause of variation was found to be denser isopycnals (with higher Alk*) coming closer to the surface on the western side. At about 30°N, the higher Alk* close to the eastern margin is caused predominantly by upwelling off the North American continent. But in the eastern equatorial Pacific, upwelling does not increase the surface Alk* to significantly higher than in the west. Alk* is, however, higher in the east during La Niña years, probably because stronger upwelling during these periods brings water to the surface from greater depths, depths at which Alk* is elevated.\nWe created two algorithms (entire Pacific Ocean and eastern margin of the North Pacific) to predict alkalinity using salinity, nitrate, and potential density. The Pacific Ocean algorithm is of similar accuracy to the best previous algorithm by Sasse et al. [2013] (r value of 0.970 for our algorithm versus 0.977 for their algorithm). However, our algorithm is less biased with longitude in the subpolar North Pacific (north of 40°N) with an r Global Biogeochemical Cycles Sasse et al. [2013] )."}]