[{"section_title": "I. Introduction", "text": "Scientists and engineers are the core of the high-skilled labor force in the United States. They are key inputs in research and development (Kapur and McHale, 2005), patent at much higher rates than other professionals (Hunt and Gauthier-Loiselle, 2010), and are relatively likely to create high-technology companies (Zucker and Darby 2009). 1 Recent theories of economic growth suggest that expanding the science and engineering (S&E) talent pool would raise the long-run growth rate of the US economy (Jones, 1995a,b). 2 Foreign students comprise the most rapidly growing segment of the US S&E labor force. Over the last several decades, the share of S&E PhDs granted by US universities going to the foreign born rose sharply, from 23% in 1970 to 56% in 2007. Whether newly minted degree holders choose to stay in the US after graduation or to return home largely determines how quickly the US S&E labor force expands. Yet, we know relatively little about the factors governing the location choices of these individuals. Existing work examines how the supply of foreign graduate students affects research output by US universities (Stuen, Mobarak, and Maskus, 2010) and the earnings and employment of US graduate students (Borjas, 2009;Lan, 2011). Other research considers how the inflow of scholars to the US following the collapse of the Soviet Union altered the career trajectories of US academics (Borjas and Doran, 2012a,b). 3 But little work considers who stays in the US upon completion of a PhD. 4 In this paper, we examine the post-degree location choices of foreign-born students receiving PhDs from US universities. We use data from the NSF Survey of Earned Doctorates (SED), which contains information on the characteristics of all individuals receiving a PhD from a US university from 1958 forward. Our data span the period 1960 to 2008. Crucially, the SED asks individuals if they intend to stay in the United States in the year following degree completion. Intent-to-stay rates reported in the SED closely track actual stay rates of foreign PhD graduates derived from earnings reported to the Social Security Administration in the years following degree completion (Finn 2010). During the last half century, obtaining an advanced degree in science and engineering, especially for individuals from lower-income countries, usually meant studying in the United States (Freeman, 2009). In 1975, the share of science and engineering PhDs graduating from US universities was 47% of the total among students from major Asian nations and advanced European economies. This share fell to 25% in 2004, reflecting the internationalization of higher education and post-9/11 restrictions on student visas (Bound, Turner, and Walsh, 2009). The United States, however, remains a major destination for S&E training. We analyze the link between foreign students' intent to stay in the US and their observed characteristics. Substantial literature finds evidence consistent with the positive selection of migrants in terms of skill. 5 We examine whether there is positive selection even among the very highly educated. 6 While we do not observe test scores for students, we do observe other correlates of ability including parental education, whether a student receives fellowships or scholarships during the course of study, and the rankings of a student's PhD program and university. Along most of these dimensions, students who appear to be more able are more likely to desire to stay in the United States. This is suggestive evidence that the stayers among foreign PhD students are positively selected in terms of ability. We also analyze the link between foreign students' intent to stay in the US and macroeconomic conditions both in the US and in their home country. We find that, controlling for time trends and for birth-country fixed effects, foreign-born students are more likely to desire to stay in the United States, the higher is the recent rate of US GDP growth, the lower is the recent rate of GDP growth in the birth country, and the higher is the level of development in the birth country. Booms in the United States thus help keep foreign PhDs from departing, whereas booms in the birth country work to draw students home. Relatedly, when a student's birth country becomes more democratic, as measured by increases in Polity IV scores that indicate a shift away from authoritarianism (Marshall and Jaggers, 2002), the likelihood that a graduate returns home increases. Political opening thus appears to induce the return of highly skilled labor from abroad. 7 Our results mesh with recent literature that documents how economic conditions at the time of labor-market entry affect long-run employment and earnings for high-skilled individuals. Oyer (2008) finds that better stock-market conditions while MBA students are in graduate school positively affect the likelihood of their finding employment in investment banking. Graduates who initially take jobs on Wall Street tend to have higher long-run income. Similar findings hold for economists (Oyer, 2006). The correlation between business cycles and PhD location choices that we find suggests the possibility of a virtuous cycle for developing countries. Having a good run of GDP growth may help a country lure home highly skilled individuals who have been studying abroad. The return of these workers may enhance prospects for future economic growth, which then may attract additional PhDs in later periods. Such self-reinforcing processes are similar to the mechanisms underlying theories of economic development featuring poverty traps and their cessation (Azariadis and Stachurski, 2005). 8 In section II, we describe the data used for the project and discuss broad trends regarding the location choices of foreign PhD students educated in the United States. In section III, we present our empirical specification and results on the intent to stay in the US. In section IV, we use our empirical results to decompose variation in stay rates for PhDs for the four largest source countries. And in section V, we offer concluding remarks."}, {"section_title": "II. Data and Empirical Setting", "text": "The Survey of Earned Doctorates covers all individuals receiving a PhD from an accredited US institution from 1958 forward. We have data through 2008, which include 1.6 million observations. From this sample, we drop individuals who were born in the United States or in US territories (N=1.1 million); obtained degrees before 1960, years for which we lack national economic data (N=2,000); obtained PhDs from non-research universities (N=9,000); are missing data on place of birth (N=56,000); or are missing data on post-graduation plans (N=6,000). We further drop individuals 45 years of age or older at time of degree (N=28,000), which consists primarily of those who complete their PhDs over multiple decades and who may not be comparable to the full-time students that constitute the bulk of the sample. Table A1 gives summary statistics on the SED and other data used in the empirical estimation. We focus the analysis on graduates in science and engineering fields, though in some regressions we also consider students in other fields of study. S&E fields are those most closely linked to innovation. Using data from the 2003 US National Survey of College Graduates, Hunter and Gauthier-Loiselle (2010) find that foreign-born scientists and engineers are substantially more likely than other college graduates or post-graduates to have produced a patent and more likely still to have produced a patent that has been commercialized. S&E fields include life sciences (agricultural, biological, and health sciences), physical sciences (atmospheric, earth, and ocean sciences; chemistry; mathematics and computer science; and physics), and engineering. The non-S&E fields we consider are economics and management, education, humanities and law, and social sciences other than economics."}, {"section_title": "II.A. Rising Presence of the Foreign Born among US PhD Recipients", "text": "The rising presence of foreign students among new US PhD degree recipients has brought with it a change in the composition of the birth countries represented by these students. Figure 1 shows the share of the foreign born among all new PhDs from US universities with the birth countries of these students grouped by low, middle, or high-income status. 9 In the 1960s, the three income groups each accounted for roughly equal shares of new US PhDs. Over time, the share of PhDs from high-income countries has been flat, due in part perhaps to the strengthening of graduate education in Australia, Canada, Europe, and Japan (Freeman, 2009). Essentially all of the growth in foreign-born PhDs has come from low and middle-income nations. Student flows from middle-income countries expanded first, rising from 6% of new US PhDs in the late 1960s to 22% by the late 1980s, before stabilizing. Low-income countries expanded next, with their share of new US PhDs rising from 8% in the early 1980s to over 25% in the early 2000s. Among low-income countries, China and India are by far the largest sources of PhD students to US universities, as seen in Figure 2a. Over the period, they account for an average of 84% of students from low-income nations completing US science or engineering PhDs. 10 Among middle-income countries, shown in Figure 2b, Korea and Taiwan are the largest source countries, accounting for an average of 42% of PhD recipients from this income group. The next largest middle-income source countries for S&E PhDs are Russia, Iran, and Turkey. China and India are large source countries for PhD students in part because they have large populations. Additionally, students from these two countries exhibit relatively high propensities to pursue PhD education in the United States. A crude measure of this propensity is the number of new US S&E PhDs (a flow) divided by the birth country's population (a stock). New US S&E PhDs per capita reached a peak late in the sample period of 3.0 per 10,000 inhabitants in China and 1.7 per 10,000 inhabitants in India but remained at only 0.6 per 10,000 inhabitants in other low-income countries. Korea and especially Taiwan stand out for having very high propensities to pursue US PhD training. Over the period, new US S&E PhDs averaged 13.0 per 10,000 inhabitants in Korea and an astounding 30.0 per 10,000 inhabitants in Taiwan, nearly as high as the 34.0 per 10,000 inhabitants for the United States. Thus in the 1990s, individuals born in Taiwan were nearly as likely to complete a science and engineering PhD in the United States as were US-born individuals. For comparison, new US S&E PhDs per 10,000 inhabitants averaged 1.5 for other middle-income countries and 2.0 in non-US high-income countries (many students from which may pursue advanced training closer to home)."}, {"section_title": "II.B Post-Degree Location Decisions for Foreign PhD Recipients", "text": "The SED asks PhD recipients about their post-graduation plans. For our analysis, the 10 In Figure 2a, the shares for China may be inflated in the early 1970s (and in Figure 2b the shares for Taiwan may be deflated) owing to the fact that during this period some individuals born in China and who obtained US PhDs may have been citizens of Taiwan, having moved from mainland China to Taiwan in 1949 or shortly thereafter. question of primary interest is: \"In which country do you intend to live after graduation (within the next year)?\" Figure 3 shows that the majority of foreign-born PhD recipients intend to stay in the United States, with average affirmative responses of 87% for those from low-income countries, 67% for those from middle-income countries, and 70% for those from high-income countries. 11 For foreign-born students on a temporary residence visa, which is 70% of the foreign-born sample, staying in the United States past completion of the PhD requires that they obtain employment, such that they can transition from a student visa to an employment visa (e.g., a H-1B temporary visa for high-skilled workers or an employer-sponsored green card). 12 Figure 3 shows non-monotonicity in the relationship between the desire to stay and birthcountry income levels. If highly skilled individuals choose locations based on the proportional (i.e., Mincerian) return to skill, as in Borjas (1987), one would expect the probability of staying in the United States to be higher for PhDs from other rich countries, where returns to skill tend to be relatively low (e.g., Hanushek and Zhang, 2006). If individuals instead choose locations based on absolute differences in income between countries, as in Grogger and Hanson (2011), one would expect the opposite. What we see in Figure 5  Finally, part of the motivation for a recent PhD graduate to stay in the United States after obtaining his degree may be to obtain a post-doctoral fellowship, which in many fields serves as an apprenticeship necessary for graduates to succeed in launching independent careers. One might wonder whether intending to stay in the US is synonymous with seeking a postdoc. The SED includes a question about whether graduates intend to take a postdoc, but only for years 2003 and later. Among all foreign-born S&E graduates, 53% intend to take a postdoc (compared to 51% of US-born graduates). Among just those foreign-born S&E PhDs planning to stay in the United States, 55% intend to take a postdoc. These patterns suggest that the choice to stay in the United States is not dictated by a student's desire for a postdoctoral fellowship. Table 1 shows the fraction of S&E PhD recipients intending to stay in the US broken down by individual characteristics. One important factor affecting student intent to stay in the United States is visa status (Black and Stephan, 2004). The SED reports whether foreign-born students are naturalized US citizens, have a legal permanent residence visa, or have a temporary residence visa (e.g., a student visa). Being a citizen or having a green card guarantees that a graduate can work in the United States. There are two primary channels through which individuals obtain green cards: being sponsored by a family member who is a citizen or legal permanent resident or being sponsored by a US employer. 13 Having a green card (or already being a citizen) therefore indicates the strength of the graduate's ties to the US, either through family linkages or through connections to a US company. Obtaining a green card often takes six or more years (and becoming a citizen an additional five years), meaning that these connections must have been established well before the date at which we observe the student completing the PhD degree."}, {"section_title": "II.C Location Decisions and Individual Characteristics", "text": "In Table 1, the likelihood that a foreign-born graduate intends to stay in the US is much higher for those who are citizens or who are legal permanent residents. The likelihood is also higher for those who attended high school or completed their BA in the United States (a result that holds whether or not we restrict foreign-born students to those on temporary visas). We have three measures of the academic ability of the PhD recipient: her success in obtaining graduate fellowships or scholarships, the quality of her university and of the academic department awarding her PhD degree, and the education level of her parents. The first two measures indicate the ability of the student as perceived at the time she begins graduate school (when most graduate funding decisions are made). The third is an indication of the student's family background (an interpretation that depends on conditioning on average educational levels in the birth country, which we do in the regression analysis by virtue of controlling for average education in the birth cohort of the student's parents). Over the sample period, the primary sources of financial support for students are university research assistantships or teaching assistantships (52%), US fellowships or scholarships (11% of students), foreign fellowships or scholarships (4%), family support or own funds (11%), and other or unnamed sources of support (19%). In Table 1, individuals with fellowships, scholarships, RAships, or TAships are more likely to intend to stay in the United States. The exceptions are individuals on foreign fellowships or scholarships or fellowships from the Ford Foundation, the Fulbright Program, the Mellon Foundation, or the Rockefeller Foundation, each of which imposes restrictions that are meant to compel the graduate to return to the home country after completing the PhD. We interpret the positive correlation between university financial support and intent to stay in the US as an indication that students with higher academic ability are less likely to desire to return home after their studies. A large literature documents intergenerational persistence in schooling, earnings, and other economic outcomes (e.g., Solon, 1999;Black and Devereux, 2010). Intergenerational persistence in schooling may reflect better educated parents raising their children to value education, passing along genes that are associated with academic success, or being better able to provide financially for the higher education of their children. PhD recipients whose mother or father has a BA degree are more likely to intend to stay in the United States. These correlations provide further evidence of positive selection of stayers in terms of potential academic performance. Regarding department quality, Table 1 shows that individuals graduating from higher ranked departments are modestly more likely to desire to stay in the US. Table 2 provides a look at the relationship between intent-to-stay rates, the income level of the PhD recipient's home country, and the state of the business cycle both at home and in the US."}, {"section_title": "II.D Location Decisions and Macroeconomic Conditions", "text": "We again divide countries according to low, middle, or high-income status (see note 9). For each country in the SED, we classified each year in our sample period as falling into a period of low, medium, or high growth. Economic growth is defined in terms of GDP growth over the three years prior to graduation, which we term lagged GDP growth. Within each country, we then standardized lagged GDP growth by the within-country standard deviation of lagged GDP growth. This was done to deal with the substantial heterogeneity across countries in GDP growth volatility. Finally, we classify all years into low, medium, or high-growth periods depending on whether the standardized growth rate is below the 25 th percentile of the standardized growth distribution, between the 25 th and 75 th percentiles, or above the 75 th percentile. To account for the state of the US business cycle, we simply classify years according to quartiles of the lagged US GDP growth rate distribution. 14 Table 2 reports stay rates for low-and high-growth periods; stay rates during medium-growth periods generally fell between the two. Looking down the columns of Table 2 expands on the lesson from Figure 2: the stay rate for low-income countries not only exceeds the stay rate for middle and high-income counties, but does so largely independent of the state of economic growth either in the home country or the US. Comparing the first and second columns, we see that stay rates tend to be higher when homecountry growth is higher. The exception is middle-income countries, but for the most part, this is the opposite relationship from what we would expect. The expected relationship shows up quite strongly when we compare the third and fourth columns. This shows that, regardless of income level, S&E PhD graduates are more likely to stay in the US when US GDP growth is high. The relationship is particularly strong for PhD recipients from middle-income countries, who are almost 15 percent (e.g., 8.5 percentage points) more likely to stay in the US during periods of strong economic growth than during periods of weak economic growth."}, {"section_title": "III. Results", "text": "In the empirical analysis, we estimate a linear probability model of the intent to stay in the United States for science and engineering PhD recipients born outside of the US. We pool observations across time and include as regressors measures of the student's ties to the US (whether a naturalized citizen, whether has a green card, whether received BA from a US college), the student's academic ability (whether father has a BA, whether mother has a BA, whether student received graduate fellowships or scholarships), the quality of the student's graduate degree program (whether university was ranked in 2003 among the top 40 US universities, whether PhD program was ranked in 1995 by the National Research Council among the top 10 US programs in the field), recent economic conditions (average growth in log per capita GDP in the US and in the birth country over the previous three-year period, average log per capita GDP in the birth country over the previous three-year period), political conditions in the birth country (average Polity IV score in the previous three-year period), demographic controls for the student (gender, marital status, quadratic in current age, quadratic in age at completion of BA degree), average education of the parents' birth cohort for the student (fraction of adults in the student's birth country approximately 25 years older than the student completing primary, secondary, or tertiary education), a time trend, dummies for the PhD degree field, and dummies for the birth country. Standard errors are clustered by the country of birth of the graduate. We see that intent to stay in the US is positively associated with being a US citizen, having a green card, or having received a BA from a US university. Each of these variables is an indicator of the strength of the graduate's ties to the United States (Black and Stephan, 2004). Not surprisingly, intent to stay is more likely among those with stronger US connections, be they family or professional, which facilitate finding a job and obtaining a visa. In column (2), being a US citizen is associated with 19.5 percentage point higher stay rate, having a green card is associated with an 15.3 percentage point higher stay rate, and having graduated from a US college is associated with a 3.6 percentage point higher stay rate."}, {"section_title": "III.A Intent to Stay in the United States", "text": "Intent to stay is more likely for a graduate whose father has a BA but is uncorrelated with whether the graduate's mother has a BA. 15 In many lower-income countries, educational attainment of women lags well behind that of men, especially in earlier decades of the 20 th century when the parents of most of the students in the SED sample would have completed their schooling. In the SED sample, 52% of students have a father with a BA, compared to only 33% who have a mother that has graduated from college (see Table A1). The father's education may therefore be a stronger indicator of the student's inherited ability, wealth, professional connections, or other attributes that affect educational outcomes. Because we control for average education in the parents' birth cohort, the effect of the father's educational attainment is relative to the average in the student's origin country. Having a father who has completed college is associated with a 1.8 percentage point higher desired stay rate. Not surprisingly, intent to stay is less likely among students receiving their primary financial support from a foreign government or other foreign institution or from US donors whose support tends to be conditional on students returning to their home countries after completing the PhD. 16 Students with foreign funding are 26.7 percentage points less likely to desire to stay in the United States and students with restrictive support from a US donor (Ford, Fulbright, Mellon, or Rockefeller) are 13.5 percentage points less likely to desire to stay. A further indication of student ability is the quality of the student's PhD program. Students from higher ranked PhD programs are more likely to desire to stay in the United States, though the correlation is not always precisely estimated. Students graduating from programs ranked in the top 10 in their field (in terms of faculty quality) are 0.9 percentage points more likely to intend to stay in the United States. After controlling for the quality of the PhD program, there is essentially zero correlation between the intent to stay and the overall ranking of a student's PhD-granting university. There is, however, a positive correlation between intent to stay and the quality of a student's undergraduate college. Students obtaining a BA from an institution that is ranked in the top 400 worldwide are 0.3 to 1.8 percentage points more likely to stay, though this effect is precisely estimated in only one regression. The imprecision of the results for department and university rankings may be due in part to measurement error. We lack time varying measures of program or university quality. For PhD programs, we use National Research Council rankings from 1995 (and obtain similar results for NRC rankings from 2005); for overall university rankings, we use the Academic Rankings of World Universities from 2003. These are the earliest years for which we can obtain comprehensive rankings on departments and universities. 17 We miss any changes in the quality of academic departments and universities over time, which may be especially important for disciplines that are relatively young (e.g., neuroscience, computer engineering). Our results thus may understate the association between program quality and intent to stay. Turning to economic conditions, intent to stay in the United States is weaker in years following higher per capita GDP growth in the birth country and stronger in years following higher per capita GDP growth in the US. These findings suggest that recent business-cycle conditions affect PhD recipient location choices, with students favoring the country with the stronger recent growth record. In the regressions in Table 3, we use growth rates averaged over the three years prior to a student's degree completion (i.e., for 2000 we use growth rates averaged over 1996-1997, 1997-1998, and 1998-1999); results are similar if we use growth rates averaged over the previous five years. Our findings echo Oyer's (2008) results for MBA graduates. He shows that the state of the stock market just prior to entering the labor market has enduring effects on the sector in which business graduates work. We find effects of business-cycle conditions on the initial country in which a PhD graduate intends to reside. Because of persistence in location choices, the choice of initial country after the degree is likely to matter for a student's long-run location. Finn (2010) finds that the fraction of those working in the United States five years past the PhD (65%) is only six percentage points lower than the fraction working in the US one year past the PhD (71%). Our results are thus suggestive of long-lasting effects of business cycles on the stock of PhDs in a country. The coefficient estimates indicate that intended stay rates are sensitive to changes in GDP growth. Both the US and home-country coefficients are significant, although stay rates are more sensitive to business-cycle fluctuations in the US than at home. Based on the results in column (2) of  (Kortum, 1997), making the desire to return home increasing in the level development. Over time, this result is suggestive of a feedback mechanism, in which the number of S&E PhDs locating in a country positively affects its rate of economic growth, thereby increasing the attractiveness of the country to PhDs in the future, which may have further beneficial effects on growth. Such feedback effects are prominent in theories of economic growth that attempt to explain why countries transition from low-growth to high-growth states (e.g., Azariadis and Drazen, 1990;Ciccone and Matsuyama, 1996;Durlauf and Quah, 1999). Finally, we find that there is a negative association between democracy in the birth country and the desire to stay in the United States. Marshall and Jaggers (2002)  18 With a time trend in the regression, we cannot separately identify the impact of the level of US per capita GDP (as US average income is nearly perfectly predicted by the trend). standard deviation increase in the Polity IV score (6.6) 19 in the three years prior to graduation would be associated with a 4.0 percentage point decrease in the intent to stay in the United States. Democratic openings thus appear to induce recently-minted PhD's to return to their countries of origin. While existing research documents the impact of political upheaval on foreign student flows (e.g., Stuen, Mobarak, and Maskus, 2010), we are not aware of research on the impacts of democratic transitions on return migration. 20"}, {"section_title": "III.B Variation across Academic Disciplines", "text": "So far, we have pooled data across S&E fields and ignored disciplines outside of science and engineering. In Table 4, we replicate the regressions in the second column of When we examine the impact of economic conditions on location decisions, economics and management is the only non-S&E discipline for which lagged US GDP growth, lagged birthcountry per capita GDP growth, and lagged birth-country average income each has a statistically significant impact on the intent to stay in the United States. In the three other non-S&E fields, the link between economic conditions and location decisions for recent PhD recipients is weaker. For humanities and education, in particular, the magnitude of these coefficient estimates is much smaller, though standard errors are too large to reject equality of coefficients across fields. It is intriguing in Table 4 that the two fields with the largest coefficients on lagged US GDP growth -engineering and economics -are ones with relatively strong ties to the private sector. Does the degree of integration between a PhD field and the private-sector job market matter for the impact of business-cycle conditions on graduate location choices? In column (6) of Overall, engineering accounts for 15 of the top 25 PhDs fields in terms of private-sector orientation (there are 313 total fields). The least private-sector oriented S&E fields tend to be biological sciences that study entire organisms (evolutionary biology at 0.8%, anatomy at 1.0%, plant pathology at 1.2%, and zoology at 1.4%). Turning back to Table 3, column (6) restricts the sample to graduates of S&E fields that have above-median shares of private-sector orientation. Comparing columns (2) and (6) of Table 3, we see that the coefficient on lagged US GDP growth is one-third larger for private-sector oriented fields than it is for all fields, with this difference being highly statistically significant. Results are similar when we define the privatesector orientation of a field to be above the mean or to be in the top tercile. It thus appears that foreign student stay rates are more sensitive to the US business cycle in fields that are more oriented toward the private sector in terms of PhD employment. Coefficients do not differ significantly across fields for lagged birth-country GDP growth or per capita GDP."}, {"section_title": "III.C Robustness Checks", "text": "One set of concerns about the regressions in Tables 3 and 4 is that the results on lagged GDP growth or lagged per capita GDP may not reflect the true impact of these variables but the impact of some omitted variable that is correlated with these outcomes. We proceed to examine the robustness of our results to the inclusion of additional variables that capture economic conditions in the birth country. To see if stay rates are a function of specific aspects of economic development rather than simply average income, we include measures of economic openness (exports plus imports over GDP, inward foreign direct investment over GDP), technological sophistication (cellphone subscriptions per capita), or industrial sophistication (share of manufacturing in GDP). In each case, we define these variables as the average over lagged values in the previous three periods. Adding these variables has no impact on the coefficient estimates for birth country GDP growth or per capita GDP. Further, none of these variables, except for the manufacturing share of GDP, is precisely estimated. A second possibility is that results are being driven by strengthening economic linkages between the United States and the birth country, which may contribute to economic development or expand job prospects abroad for US-trained PhDs. Over the sample period, there is a dramatic expansion in foreign activities by US multinationals, with employment in the foreign affiliates of US parent firms increasing by 68% between 1983 and 2007. We include measures of the presence of US multinational enterprises in the birth country (defined to be the level or change in employment in foreign affiliates owned by US multinationals in the three years previous to a student's graduation). These variables are neither economically nor statistically significant. A third possibility is that stay rates are affected by changes in US government funding for scientific research. Whereas the inflation-adjusted budgets of the National Science Foundation and related agencies have been essentially flat since 1992, funding for the National Institutes of Health increased sharply between 1996 and 2003 (Clemins, 2012), reflecting increased support for the life sciences. Unfortunately, we do not observe NSF or NIH funding by PhD discipline. As a crude control for changes in funding priorities by the federal government we allow for a flexible time trend in stay rates for individuals obtaining PhDs in the biological sciences. The addition of these terms has no impact on our main results. As further robustness checks, we have controlled for non-linear time trends; replaced our measure of GDP growth with H-P filtered GDP growth; included lagged sector-specific GDP growth in the US (for agriculture, construction, government, manufacturing, retail and wholesale trade, and services); included lagged Gini coefficients for the birth country; and allowed for interactions between our ability measures (father's education, having an RAship or TAship) and business-cycle conditions in the US or the birth country. The additional variables are generally insignificant and do not materially change the main results reported in Table 3."}, {"section_title": "IV. Business Cycles and Location Choices for PhD Graduates from", "text": "China, India, Korea and Taiwan Considering how important business cycle conditions are for PhD recipients' intentions to stay in the US, we provide a graphical depiction in this section of the link between lagged GDP growth and graduates' stay rates. For reasons of space we restrict attention to the four largest sending countries: China, India, Korea, and Taiwan. Together, these countries accounted for 60.7 percent of all US S&E PhD's awarded to non-US students in 2007. For each country in Figure 5, we plot three lines over time: the actual stay rate, the predicted stay rate from the model in column (2) of Table 3, and the simulated stay rate. The simulated stay rate is the predicted value from column (2) of Table 3 in which we have replaced both lagged home-country GDP growth and lagged US GDP growth with their mean values over the sample period. Comparing predicted and simulated stay rates provides a depiction of how business cycle conditions affect the share of S&E PhD recipients who remain in the US after graduating. 21 Before focusing on the effects of the business cycle, we compare actual and predicted stay rates, depicted as dashed and unmarked solid lines, respectively. The model predicts a shallower and shorter dip in stay rates in Korea during the early 1990s, which we discuss further below. Otherwise, the regression model does a reasonably good job capturing the time-series variation in stay rates, particularly since we do not include variables sometimes used to improve a model's time-series fit, such as lagged dependent variables or high-order polynomials in time. Now, comparing predicted and simulated stay rates, we see that business cycles differ in their importance in different sending countries. In China and India, stay rates are high, and the simulated stay rates are nearly constant. This indicates that almost all of the variation in the actual stay rate over time can be attributed to the business cycle. In Korea and Taiwan, the difference between the predicted and simulated stay rates shows that the US recession of the early 1990's had a pronounced effect on location decisions, reducing stay rates among Koreans by roughly 8 percentage points (in 1993) and among Taiwanese by nearly 10 percentage points. At the same time, other factors were driving the fluctuations in stay rates in these countries. In Korea, the transition from military rule to democracy in 1988 seems to have reduced sharply the share of S&E PhD's who sought to remain in the US, an effect that is only partially captured by the regression model. That is, PhD recipients born in Korea appear to be more responsive to shifts away from authoritarianism in their home country than students from elsewhere (whose average responsiveness is captured by the regression coefficient). In both Korea and Taiwan, the Asian financial crisis, which began in 1997, led to a steep rise in the share of S&E graduates seeking to stay in the US. In the case of Korea, the country's GDP initially plunged, falling by seven percent from 1997 to 1998, but then recovered quickly with growth with our finding above that stay rates were generally more strongly affected by US GDP growth than by home-country GDP growth. rates above four percent in each of the following six years. Again, Korea-born PhDs appear to be relatively responsive to changes in the environment, in this case lagged GDP growth, when compared to the average foreign-born PhD. Consequently, predicted stay rates for Korea fluctuate less around the Asian Financial Crisis than do actual stay rates. These findings highlight possible limitations in using lagged GDP growth to capture how uncertainty about the macroeconomic environment may affect PhD location decisions. However, after considerable experimentation we did not find alternative measures that performed better than lagged GDP growth. With lagged growth in the regression, measures of recent birth-country financial, banking, or currency crises from Reinhardt and Rogoff (2008a) or \"sudden stops\" in capital inflows from abroad from Reinhardt and Rogoff (2008b) were statistically insignificant in nearly all cases. Lagged growth rates are the strongest and most robust predictors of the location choices for foreign-born PhDs."}, {"section_title": "V. Final Discussion", "text": "If innovation is the key to sustaining positive rates of long-run economic growth, highly skilled labor with training in science and engineering is the input that makes innovation possible. Graduates in S&E fields have relatively high propensities to produce and to commercialize patents and the stars among these graduates have relatively high propensities to launch hightechnology business ventures. Over the last half century, the United States has been the most important training ground for the global supply of science and engineering talent. Where S&E PhDs choose to locate after they have completed their education is likely to affect the global distribution of innovative capacity. We find that S&E graduates with the strongest academic ability, measured in terms of their attributes and performance at the time they enter graduate school, are those most likely to intend to stay in the US and to find employment in the US job market. These results are consistent with a growing body of evidence that finds positive selection in emigration from low-income countries (e.g., Grogger and Hanson, 2011). The United States attracts the best and brightest to study at its universities and lures the best and brightest among these to stay in the US after their studies are completed. We know less about the long-run location choices of these individuals in terms of how many end up remaining in the US as permanent residents or becoming citizens. Policies surrounding student visas also shape the post-degree location choices of PhD recipients. Students receiving support from foreign institutions, or from private foundations that provide incentives for graduates to return to their home countries after the degree, are less likely to intend to stay in the US. This finding does not necessarily mean that restrictive scholarship funding is an effective means for low-income countries to produce a highly skilled labor force. At the application stage, such funding strategies could dissuade individuals from pursuing restrictive funding options or from seeking to study abroad at all. Economic conditions are perhaps the most important factor shaping the location choices of recent PhD recipients in S&E fields. A stronger US economy makes it more likely that graduates will intend to stay in the US and to find a job. A weaker economy in the graduate's home country has the same effect. The responsiveness of PhD location choices to business-cycle conditions may create a link between the volatility of output and cycles in long-run economic growth. More short-run volatility appears to produce greater fluctuations in the supply of highly skilled labor, possibly contributing to variation in long-run growth rates. Business-cycle considerations aside, we do see that as countries develop they become more attractive locations for PhDs in science and engineering. There is obvious potential for a virtuous cycle in education and innovation, with returning S&E PhDs increasing innovation in the home country, thereby enhancing prospects for economic growth and raising the attractiveness of the home country as a location for future PhD recipients. Korea and Taiwan are possible examples of self-reinforcing processes. Less is known about how such cycles begin.   Planning to stay in US   Note: Economic growth is defined in terms of quartiles of standardized rates of GDP growth, where standardization is carried out within each country. Low growth pertains to the first quartile; high growth pertains to the fourth quartile. -0.000 -0.000 -0.000 0.000 0.000 0.000 -0.000 (0.000)* (0.000)* (0.000) (0.000) (0.000) (0.000) (0.000) Age at BA -0.027 -0.017 -0.032 -0.012 -0.011 -0.014 -0.005 (0.009)** (0.010) (0.009)** (0.013) (0.012) (0.008) (0.010) Age at BA squared 0.001 0.000 0.001 0.000 0.000 0.000 0.000 (0.000)** (0.000)* (0.000)** (0.000) (0.000) (0.000)* (0.000) Time trend 0.005 0.009 0.005 0.008 0.003 0.002 0.005 (0.001)** (0.001)** (0.001)** (0.001)** (0.001)** (0.001) (0.001)** Share of parents' cohort with -0.006 -0.004 -0.006 -0.005 -0.002 -0.001 -0 "}]