[{"section_title": "Abstract", "text": ". High resting metabolic rate among Amazonian forager-horticulturalists experiencing high pathogen burden.\nObjectives-Resting metabolic rate (RMR) reflects energetic costs of homeostasis and accounts for 60-75% of total energy expenditure (TEE). Lean mass and physical activity account for much RMR variability, but the impact of prolonged immune activation from infection on human RMR is unclear in naturalistic settings. We evaluate the effects of infection on mass-corrected RMR among Bolivian forager-horticulturalists, and assess whether RMR declines more slowly with age than in hygienic sedentary populations, as might be expected if older adults experience high pathogen burden.\nMaterials and Methods-RMR was measured by indirect calorimetry (Fitmate MED, Cosmed) in 1,300 adults aged 20-90 and TEE was measured using doubly labeled water (n= 40). Immune biomarkers, clinical diagnoses and anthropometrics were collected by the Tsimane Health and Life History Project.\nResults-Tsimane have higher RMR and TEE than people in sedentary industrialized populations. Tsimane RMR is 18-47% (women) and 22-40% (men) higher than expected using six standard prediction equations. Tsimane mass-corrected TEE is similarly elevated compared to Westerners. Elevated leukocytes and helminths are associated with excess RMR in multivariate regressions, and jointly result in a predicted excess RMR of 10-15%. After age 40, RMR declines by 69 kcal/decade (p<0.0001). Controlling for lean mass and height accounts for 71% of agerelated RMR decline, and adding indicators of infection minimally affects the age slope. The residual level of age-related decline from age 40 is 1.2% per decade.\nConclusion-High pathogen burden may lead to higher metabolic costs, which may be offset by smaller body mass or other energy-sparing mechanisms.\nMaterials and Methods\nThe Tsimane are forager-horticulturalists (population ~15,000) living in the Beni Department of the Bolivian Amazon, dispersed across 90+ villages ranging in size from 40-550 inhabitants. Many Tsimane are isolated from modern society and have not yet undergone an epidemiological and technological transition. Only two villages have any electricity (albeit intermittent), and there is no running water, sanitation, or waste management. Below we highlight relevant details about diet, physical activity and infection.\nTsimane diet remains largely traditional, with 66% of calories derived from cultivated staples (plantains, rice, manioc, corn), 17% from wild game, 7% from freshwater fish, and 6% from fruits and nuts. Estimated dietary contributions from carbohydrates, protein and fat Gurven et al.\nStudy participants were adults aged 20+ years (mean±SD= 45.8±13.9, range: 20-90) across 46 villages visiting the THLHP mobile (within-village) health clinic for medical Gurven et al. "}, {"section_title": "Introduction", "text": "The size and allocation of an organism's daily energy budget reflects its evolved strategies for growth, reproduction and maintenance, though trade-offs and integration of these functions across diverse environments in free-living organisms are poorly understood. In humans, roughly 60-75% of total energy expenditure (TEE, kcals/day) is spent on resting metabolic rate (RMR, kcals/day) (Manini 2010; Speakman and Selman 2003) . RMR reflects the energetic costs of maintaining homeostasis. The sum of estimated RMR, activity energy expenditure (FAO/WHO), and dietary-induced thermogenesis is a common means of estimating TEE. However, these RMR and TEE estimations may be inappropriate in non-Western settings. Direct studies of TEE and RMR in humans and other species suggest that individuals adapt to increased activity levels via behavioral and physiological energy-sparing mechanisms, reducing RMR, other non-muscular activity, and TEE within narrow ranges (Dugas et al. 2011; Heini et al. 1991; Pontzer 2015) . Further, standard RMR equations do not incorporate immune response and other maintenance costs that are commonly elevated outside of socioeconomically developed countries. The impact of prolonged immune activation from infection and enhanced baseline immunity on RMR in human populations facing high pathogenic burdens and energetic limitation is not currently known.\nOne set of vital metabolic challenges faced by all organisms including humans includes acute and chronic immune activation, and other maintenance functions that help tolerate or defend against pathogenic assault. Species such as primates with slow life histories specialize in energetically expensive specific defenses like cell-mediated and antibodymediated immunity, rather than cheaper non-specific defenses like inflammation (Lee 2006) . While maintenance of the immune system can be metabolically expensive, immune activation in particular is costly; a number of studies using avian and rodent models have quantified the energetic costs of infection or immune activation, while others have shown that energetic stress compromises certain immune function components (Frankenfield et al. 1994; Lochmiller and Deerenberg 2000; Nieman et al. 1990; Schmid-Hempel 2003; Zuk and Stoehr 2002) . In humans, RMR increases by 8-14% in university students during an acute respiratory infection (Muehlenbein et al. 2010) . RMR increases by 30% with sepsis (Carlsohn et al. 2011; Kreymann et al. 1993 ). Even vaccinations (e.g. typhoid fever) can raise RMR by 16% (Cooper et al. 1992) . In humans and other species energetic costs of immune activation from infection or tissue injury may trigger \"sickness behavior\", a broad coordinated adaptive response to promote energy conservation and reallocation (Hart 1988; Stieglitz et al. 2015b ).\nThese estimates of acute immune response suggest that daily energy requirements vary depending on local pathogen burden, and all else equal may be higher in populations with chronically high pathogen load. Alternatively, such populations may adapt metabolically and/or behaviorally to chronic immune system activation and maintain TEE similar to that in other, less pathogenically burdened populations. Metabolic response to pathogens may also change with age, as maintenance becomes increasingly costly, and in response to other external pressures. Human metabolic adaptation and inherent energy allocation trade-offs may be less severe when more food is available (Pontzer et al. 2016) . Similarly, the widely documented 1-2% per decade decline in adult RMR in industrialized populations (Elia et al. 2000; Fukagawa et al. 1990; Manini 2010; Van Pelt et al. 2001; Vaughan et al. 1991) may not generalize to pre-industrial populations with higher pathogen burden. Such populationlevel differences in metabolic adaptation and age-related decline could contribute to differences in obesity, chronic disease, and premature mortality (Fabbri et al. 2014; Ruggiero and Ferrucci 2006) . To date, however, there have been few studies of human RMR in a freeliving, energy-limited population with high rates of infectious morbidity. While RMR has been measured among Siberian Evenki, Keto and Yakut (Katzmarzyk et al. 1994; Snodgrass et al. 2006) , Bolivian Aymara (Kashiwazaki et al. 1995; Kashiwazaki et al. 2009 ) and in low income countries (see Dugas et al. 2011) , none of these studies have related RMR to indicators of infection or immune activation.\nHere we estimate RMR among the Tsimane, a physically active population of foragerhorticulturalists inhabiting a pathogen-rich environment in Amazonian Bolivia. We first assess the extent to which RMR measured by indirect calorimetry differs from RMR estimated from common prediction equations, and then test whether differences can be explained by a combination of environmental, anthropometric and health variables indicating infectious burden. We test whether indicators of infection are associated with higher RMR controlling for potential confounders, and then assess whether Tsimane RMR declines more slowly with age compared to hygienic, sedentary industrialized populations. We also measure TEE in a subset of our sample to examine the proportion of total daily energy requirement accounted for by RMR. By examining age-related changes in anthropometrics (e.g. fat and fat-free mass) and infection status, we test whether accounting for these conditions substantially attenuates the decline in Tsimane RMR with age. are 72%, 14% and 14%, respectively (Martin et al. 2012) . Less than 10% of calories come from market-derived foods. Obesity is rare in adulthood; Tsimane have 8-10 times lower levels of obesity than age-matched US peers (Gurven et al. 2009 ).\nTsimane are physically active throughout adulthood, spending roughly 5-6 hours/d in moderate activity; male and female estimated physical activity levels (PALs), using a combination of accelerometry and heart rate, are 2.15 and 1.85, respectively . Tsimane living near the local town are not less active than Tsimane from other regions, perhaps because of the physical activity required for common wage labor options (e.g., logging, cash cropping). Men have higher PALs than women, although men's activity exhibits more seasonal and age-related variation. Older Tsimane adults remain active but generally engage in less physically demanding activities with age because of greater infirmity. This is especially apparent for men, as their PAL declines by 10%-20% from the peak (achieved in the late 20s) to older adulthood (age 60+ years). Tsimane VO 2 max matches that of other subsistence populations, and is higher than estimates from industrialized populations. Their VO 2 max also declines more slowly than age-matched Canadians using a similar measurement method (Pisor et al. 2013) . Tsimane also show reduced vascular aging (e.g. low rates of hypertension), perhaps due to their relatively high level of physical activity (Gurven et al. 2012a) .\nTsimane are frequently diagnosed with an infection during annual clinical exams conducted by the Tsimane Health and Life History Project (THLHP) (respiratory: 20-30%, gastrointestinal: 10-30%, skin: 5%) (Gurven et al. 2012b ). Elevated levels of white blood cells (WBCs) (>10,000 cells/mm 3 ) are 10 times more prevalent among Tsimane than in the US. WBCs also decline with age among Tsimane, particularly lymphocytes and eosinophils, suggesting increasing maintenance costs because older adults are not less likely to experience infection than younger adults (Gurven et al. 2009 ). Systemic immunity shows many indications of chronic activation from infection with helminths, with 70% of Tsimane infected at any given time (Blackwell et al. 2011; Blackwell et al. 2015; Blackwell et al. 2016 ); coinfection is not uncommon Martin et al. 2013) . Serum immunoglobulins are two orders of magnitude higher than among US adults, especially for IgE (highly indicative of infection with helminths) (Blackwell et al. 2011 ). On average, 20% of WBCs are eosinophils, also indicative of intense parasitic infection, compared with the normal US reference range of <5%, with >90% of Tsimane adults in the clinically high range. Natural killer cells and B cell counts are approximately twice as high as typical US values (Blackwell et al. 2016 ). Tsimane also demonstrate higher levels of inflammation than those found in industrialized populations. C-reactive protein (CRP) is elevated in children, consistent with immune activation due to chronic exposure to acute infections, and increases with age (Gurven et al. 2009 ). Erythrocyte sedimentation rate (ESR) is also extremely high (Table 1) , with mean levels of 27 mm/hour for males and 37 for females, compared with US reference ranges of <15 and <20, respectively. consultation by project physicians. This clinic was also composed of laboratory technicians trained to analyze biomarkers of infection, and bilingual (Spanish-Tsimane) research assistants conducting interviews. THLHP participation rates are ~85% of the sampled population (random sampling for ages 20-39 and near-complete sampling for ages 40+). Figure 1 provides a flowchart describing the sampling and participant recruitment. Data collection occurred from January 2012 through November 2014, including 445 adults age 20-39 (53% female) and 855 adults age 40+ (48% female). Tsimane total fertility rate is 9.1 births, breastfeeding duration is 19.2±7.3 months, and interbirth intervals are 30.7±10.6 months (McAllister et al. 2012; Veile et al. 2014) ; we thus estimate that 62% and 29% of women age 20-39 in our sample are breastfeeding or pregnant, respectively."}, {"section_title": "Resting metabolic rate (RMR)", "text": "RMR was measured using the Fitmate MED indirect calorimetry system (Cosmed, Italy). The seated participant relaxed while wearing an RMR mask during an initial habituation phase (~5 minutes), which was followed by 10 minutes of continuous data acquisition. The Fitmate employs a turbine flowmeter for measuring ventilation and a galvanic fuel cell oxygen sensor for analyzing the fraction of oxygen in expired gases. Sensors measure humidity, temperature, and barometric pressure for use in internal calculations. The Fitmate uses standard metabolic formulas to calculate oxygen uptake. Fitmate monitors oxygen uptake (VO 2 ), ventilation (Ve), respiratory frequency (Rf), heart rate (HR) and fraction of O 2 expired (FeO 2 ). RMR (kcal/day) is estimated by a modified Weir equation: RMR = [5.675×VO 2 + 1.593×VCO 2 −21.7], where VO 2 is the volume of oxygen in the breath (ml/ min), and VCO 2 is carbon dioxide output (ml/min) (Weir 1949) . VCO 2 is not measured directly but estimated assuming a fixed respiratory quotient (RQ) of 0.85, which has been shown to introduce little error in RMR estimation (Nieman et al. 2005; Nieman et al. 2003 ). The Fitmate is portable, easy to use, and has been validated against the Douglas bag system (Nieman et al. 2006) , and it shows very high inter-and intra-day test-retest reliability for RMR measurement (Campbell et al. 2014 ).\nDue to field conditions, a number of deviations from standard protocol were necessary. First, standard protocol requires 12 hours of fasting, which we could not guarantee, especially as measurements were taken throughout the day during THLHP surveillance (3.1% of RMR assessments began <8am, 61.4% between 8am-noon, 4.9% noon-2pm, 26.2% 2pm-5pm, 4.4% >5pm). 75.1% of participants reported having last eaten within 5 hours, 3.9% between 5-10 hours, and 20.9% 10+ hours prior to RMR testing. Time of day and time since the patient last ate were thus used as controls in all analyses. Second, temperature varied across days, and maintaining a temperature-controlled setting was not possible. Daily ambient temperature, humidity and precipitation were obtained from meteorological measures taken at the nearby San Borja airport (http://www.wunderground.com/history/airport/SLRY), and used as additional controls. Third, it was not possible to prevent physical activity during the 12 hours prior to RMR assessment. We also conservatively control for season (52.2% sampled in \"dry\" from May to August; 15.5% in \"wet\" from December to March; 32.3% in \"other\" during April and from September-November) because activity, pathogen burden, diet and climate can vary throughout the year.\nEstimated RMR was based on six standard prediction equations devised for settings where direct or indirect calorimetry is unavailable: Oxford (Henry 2005) , FAO (FAO/WHO/UNU 1985), Cunningham (Cunningham 1980) , Harris-Benedict (Harris and Benedict 1918) , Mifflin-St. Jeor (Mifflin et al. 1990) , and Owen Weight (Owen et al. 1987; Owen et al. 1986 ) equations. These all use age, sex and anthropometric measures to estimate RMR, and a number of analyses have shown that different equations have varying degrees of accuracy depending on the age, ethnicity, physical fitness, body size and composition of the study sample (Frankenfield et al. 2005) . Anthropometric measures include weight and height (except for Owen, which uses only weight) in all but the Cunningham equation, which instead uses fat-free mass; its reliance on fat-free mass has led some researchers to argue that Cunningham is more relevant for active populations than the other equations (Carlsohn et al. 2011; De Lorenzo et al. 1999 ). The Oxford equations were developed due to oversampling of Italians and undersampling of people from the tropics in formulation of the FAO equations, and tend to generate lower RMR estimates than the other equations (Henry 2005) ."}, {"section_title": "Total Energy Expenditure (TEE)", "text": "TEE (kcal/day) was measured in a subset (n=40, 44% male; mean±SD age: 48.6±14.2) using the doubly labeled water method (Speakman 1997) . After providing a baseline urine sample, subjects ingested 114g (males) or 79g (females) of water enriched to 6% 2 H 2 O and 10% H 2 18 O. Six urine samples were collected over the subsequent 12 days, and sent frozen to the Pontzer Lab (Hunter College, New York, USA) for determination of isotope concentrations ( 2 H and 18 O) via cavity ring down spectrometry (L2120i, Picarro Inc., Santa Clara CA, USA). Isotope dilution spaces and elimination rates were calculated via the slope-intercept method and used to calculate the mean rate of carbon dioxide production using equation 17.15 in Speakman (1997) . Carbon dioxide production was converted to TEE using the modified Weir equation, assuming a respiratory quotient of 0.93, following dietary macronutrient estimates described in Martin et al. (2012) . Isotope dilution was also used to determine fat-free mass for these subjects.\nPhysical activity was measured by accelerometry counts based on a three-day sample with an Actigraph GT3X accelerometer (Actigraph LLC, Pensacola, FL) in a subset of participants (n=28) in order to assess the relative impact of physical activity on TEE (see Gurven et al. 2013 for additional details)."}, {"section_title": "Anthropometrics and biomarkers of infection", "text": "Height and weight were measured during medical exams using a Seca 213 portable stadiometer and Tanita scale (BF680). The scale also recorded body fat percentage by bioelectric impedance, which was used to calculate fat-free mass (FFM) and fat mass based on proprietary prediction equations. The TEE subsample permits a validation of the Tanitabased anthropometric measures. Correlations between Tanita-based and isotope dilution methods for FFM, fat mass and weight are 0.91, 0.74, and 0.91, respectively (all p's<0.0001).\nIn-field blood analysis of fasting venous samples using the QBC Diagnostics dry hematology system (Drucker Diagnostics Inc., Port Matilda, PA) provided estimates of hemoglobin (Hb) and WBC. ESR was measured via the Westergren method (Westergren 1957) . THLHP project physicians diagnosed illnesses and trauma presented by patients with the aid of bilingual Tsimane assistants. Diagnoses from the International Classification of Disease (ICD-10) are grouped into several categories, including respiratory ailments, back pain, and intestinal helminths. The latter category was based on having clinical symptoms of intestinal infection, and supplemented by laboratory confirmation from fecal samples analyzed by direct microscopy when possible (30.1% of cases) )."}, {"section_title": "Ethics", "text": "Informed consent was obtained for all protocols from the Tsimane government that represents Tsimane interests and oversees research projects, from village officials for each participating village, and from all study participants. Consent procedures and protocols were approved by the University of California, Santa Barbara and University of New Mexico Institutional Review Boards."}, {"section_title": "Statistical Analyses", "text": "Multiple linear regressions of RMR and TEE were performed using SAS 9.3. Stepwise regressions using Akaike's Information Criterion (AIC)-based stop criterion were used to determine best-fit models. Comparative analyses of RMR and TEE were performed by ordinary least squares (OLS) regression using 185 indirect calorimetry studies compiled by Dugas and colleagues (Dugas et al. 2011) . To assess age changes in RMR, a series of regression models were conducted on adults age 40+, although some data were missing resulting in varying sample sizes (see Figure 1 ). Controlling for age and sex, cases with missing data had only slightly lower RMR (est=−42.6, p=0.065, β=−0.05). Nonetheless, analyses were run on several datasets created to insure that missing data did not skew results. These four datasets include: a) listwise deletion (n=471); b) raw data (n=471 to 855); c) imputed data using stochastic regression (n=855); and d) multiple imputations using Markov Chain Monte Carlo (MCMC) (n=855)."}, {"section_title": "Results", "text": "Mean±SD RMR for men and women age 20+ is 1988±353 and 1642±325 kcals/day, respectively (Table 1) . Men have higher RMR than women at all ages; RMR plateaus from ages 20-39, then declines with age thereafter (Figure 2) . TEE for men and women is 3065±422 and 2186±366 kcals/day, respectively. The proportion of TEE that is RMR is higher in women (β=−0.33, p=0.05) and by age (β=0.31, p=0.07, n=32); predicted RMR/TEE from ages 20 to 80 is 63.7-78.6% for women and 56.3-71.1% for men."}, {"section_title": "TEE and RMR", "text": "We examine whether RMR is associated with TEE, and whether the association is independent of FFM and physical activity. RMR is highly correlated with TEE (Pearson r=0.63; p<0.0001, df=36). Mean ± SD ratio of RMR/TEE is 0.71±0.12 for women (range: "}, {"section_title": "Do Tsimane have elevated RMR and TEE?", "text": "Tsimane measured RMR is 18-47% higher in women and 22-40% higher in men than BMR estimated using the six standard prediction equations (Supporting Information Table S1 ). RMR is only 55 (n=65) and 82 (n=77) kcals/day lower in women and men, respectively, after conservatively eliminating samples within 5 hours of eating, during mid-day and afternoon from noon-5pm and during dry season months; these lower RMR measures remain 14-42% higher (in women) and 17-35% higher (in men) than expected based on the five prediction equations.\nTsimane RMR is high relative to other studies where RMR is similarly measured by indirect calorimetry. Using energetic and anthropometric data from a recent meta-analysis, we compare Tsimane RMR with samples from \"high\" and \"low\" socioeconomic development as assessed by the Human Development Index (HDI) (Dugas et al. 2011) . We find that Tsimane women's RMR is higher than 11/11 of low or middle HDI samples, and 71/79 (90%) high HDI samples; men's RMR is higher than 9/9 of low HDI samples, and 46/48 (96%) high HDI samples. Most strikingly, Tsimane RMR is higher by 482 kcals (p<0.0001) than RMR in 31 countries from 150 samples, after controlling for sex, mean age, body mass and physical activity (PAL) (generalized linear model, n=148, Adj R 2 =0.88) (Supporting Information Table S2, Figure 3 ).\nTsimane TEE is also high relative to other populations (Supporting Information Table S3 ). Tsimane TEE is 284 kcals/day higher relative to other populations (β=0.06, p=0.10) when controlling for weight, age and sex. When PAL is included in the models as an additional covariate, the Tsimane \"excess\" TEE reduces to 177 kcals/day (Supporting Information  Table S3 : Model 3). If RMR is added instead of PAL to the models, the Tsimane no longer appear different than other populations (p=0.88) (Supporting Information Table S3 : Model 2)."}, {"section_title": "Predictors of excess RMR", "text": "We first assess whether groups of variables summarizing anthropometric status, weather conditions at time of study, and medical diagnoses predict \"excess\" RMR, i.e. the deviation of measured RMR from its estimation based on the most conservative prediction equation (Cunningham) , after controlling for age, sex, season, time of day, and time last eaten. Being taller, and having greater fat mass but lower weight are associated with having excess RMR ( Stepwise regression with AIC stop criterion to yield a best-fit model starting with all variables, suggests that variables from all three macro-categories are associated with excess RMR ( Information Table S4 ). We use average regression coefficients from the full models of sex-specific excess RMR to derive a \"conservative\" estimate of RMR by subtracting the effects of season, time of day, time since last meal and precipitation from an individual's measured RMR, and then construct a loess smooth of \"conservative\" RMR in Figure 2 . \"Conservative\" RMR is substantially lower than measured RMR, especially in men, where values overlap in late adulthood with predicted RMR based on the Cunningham equation.\nElevated WBCs (β=0.08-0.10), intestinal helminths (β=0.11-0.13) and greater back pain (β=0.07-0.09) were consistently associated with excess RMR across all six best-fit models. Based on the full regression models in Supporting Information Table S4 , an adult diagnosed with helminths and marked WBC elevation (additional 3.0 × 10 6 cell/uL) can expect to have excess RMR of 143-168 kcals/day, depending on the prediction equation used. This amount reflects increases of 10-12% and 11-15% above predicted mean RMR in men and women, respectively, which are independent of other covariates. No interactions between anthropometric variables and WBC count, helminths or ESR are significant when added to the best fit models. The best fit models retained a number of the control variables: recent eating is associated with excess RMR of 140-160 kcals/day, dry season sampling with 105-129 kcals/day, and mid-day sampling with 117-136 excess RMR kcals/day. Despite the size and number of significant effects, our best-fit models explain only 9-19% of the variance in excess RMR, depending on which estimation equation is used as the baseline (Supporting Information Table S4 ).\nWomen's lactation (proxied by having an infant <18 months) is associated with 223 kcals/d higher RMR (p=0.025) when controlling for age, time of day, last eaten, ambient temperature, precipitation, and season. However, the effect of lactational status is reduced to 170 kcals/d (p=0.067) in models that include anthropometric variables, and loses significance when additionally controlling for indicators of infection or immune activation (est=129, p=0.225). Because of this confounding with other variables, lactation did not appear in any of the best-fit models. Pregnancy was not significant in any of the models of RMR. Rather than being unimportant variables, we instead suspect that there is too little variation in pregnancy or lactation status among Tsimane women age 20-39 as 91% of women are either pregnant or breastfeeding. Unfortunately we do not have data on pregnancy trimester nor on breastfeeding intensity to obtain more fine-grained results."}, {"section_title": "RMR Decline with Age", "text": "RMR changes minimally from ages 20-39, but then declines starting by age 40 years ( Figure  2) . We test the extent to which this age decline diminishes after controlling for other timevarying factors that are associated with RMR. Supporting Information Figures S1 and S2 show the age profiles of anthropometric and biomedical variables for men and women. FFM, height, weight and WBC count decline with age in both sexes. Fat mass tends to decline after age 50 in women; fat mass and body fat percentage tend to increase with age in men. Serum hemoglobin tends to increase with age in women, but decreases with age in men. ESR shows a greater increase in men than women, though it remains higher in women overall.\nWe add covariates in a stepwise fashion to regression models of RMR on age for adults aged 40+ years and examine the change in the age slope (Table 3, Supporting Information Tables  S6-S8 ). The baseline model controlling for sex shows a 69 kcal/decade decline in RMR (p<0.0001). Adding controls for ambient weather, time of day, and time since last eaten reduces the baseline age slope by 9%. It reduces further by 71% after considering FFM and height. Consideration of biomedical variables slightly improves overall model fit in Models 5-9 and reduces statistical significance of the age effect, but does not substantially alter its magnitude (range: 67-89% below baseline age effect). A stepwise regression model with AIC stop criterion using all the variables of Model 9 in Table 3 shows an age effect that is 68% below the baseline estimate. This level of decline is about 1.2% per decade from an initial 1,826 kcals/day average from ages 20-39. Overall, at least two-thirds of the decline in RMR with age is due to changes in other aspects of phenotypic condition indicating nutritional and health status. Results vary only minimally when not restricting the dataset to non-missing cases (Supporting Information Table S6 ) or when imputing missing data using two different methods ( Supporting Information Tables S7 & S8 )."}, {"section_title": "Discussion", "text": "Tsimane RMR is much higher than predicted by standard equations that rely only on age and anthropometric measures. Standard equations are often poor predictors of RMR in select samples, such as professional athletes. For example, Harris-Benedict and Cunningham equations have grossly underestimated RMR in male heavyweight endurance athletes (Carlsohn et al. 2011) . Prediction equations underestimated RMR in male rowers and canoeists by 133-202 kcals/day (Carlsohn et al. 2011 "}, {"section_title": "Author Manuscript", "text": "Author Manuscript\nAuthor Manuscript often accounts for the majority (~50-80%) of intra-population variation in daily RMR, a high level of intra-species variation in RMR not explained by differences in FFM, age and sex suggests the importance of other processes (Henry 2000; Weiss et al. 2012) .\nOne source of additional variation in RMR that we isolated was the high burden of pathogens in a tropical environment. The high RMR is surprising given that RMR is expected to be lower in tropical climates with higher mean temperatures (Froehle 2008; Leonard et al. 2005) . The costs of immune activation can be substantial: Tsimane adults with clinical symptoms of intestinal helminth infection have excess RMR of 116-138 kcals/d (Table S4 ). Elevated WBC counts are 10 times more prevalent among Tsimane than Americans; Tsimane WBCs are 2,600 cells/uL higher on average than US levels among adults age 18-49 (Blackwell et al. 2016) , which in our model adds 23-28 excess RMR kcals/ day. These findings build upon results from studies in Western populations showing RMR increases with infection (Muehlenbein et al. 2010 ). However, the role of infection on energy balance and maintenance costs in community-dwelling populations is still underappreciated. It has been estimated that quiescent WBCs require approximately 382 kcals/ day, whereas activated WBCs responding to an infection require an additional 36-118 kcals/day from glucose, glutamine, ketone bodies and fatty acid sources (Straub et al. 2010) .\nChronic inflammation due to chronic infection and/or repeated acute infections often induces an 'energy appeal reaction' (i.e. redirection of energy-rich fuels from stores to activated immune cells) to fuel sustained immune activation, resulting in elevated RMR via hypothalamic-pituitary-adrenal axis and sympathetic nervous system-directed activity.\nWith sustained immune activation, a number of co-morbid conditions can result from prolonged energetic allocation to immune defenses, including sickness behavior, cachexia, osteopenia, dyslipidemia and anemia (Straub et al. 2010 ). These energy allocation decisions are regulated by circadian rhythms of interacting neuroendocrine and immune systems, which help coordinate the storage and utilization of energy throughout the day (Straub et al. 2010 ). Sickness behavior is common with a pro-inflammatory state, and is associated with more sedentary behavior (Dantzer et al. 2008) . Depressed affect has been associated with higher inflammatory cytokines and reduced physical activity in Tsimane (Stieglitz et al. 2015b) . Consistent with these and other associations of prolonged immune investment, osteopenia (Stieglitz et al. 2015a ), low HDL, LDL and total cholesterol (Gurven et al. 2009 ) and anemia are prevalent conditions among Tsimane. Despite their relatively active lifestyle and traditional diet, Tsimane bone mineral status, HDL, LDL and total cholesterol are substantially lower than among age-matched US peers. One hypothesis to be tested in future work is that these conditions may represent consequences of high RMR due to diversion of energy to maintain sustained immune responses.\nHigh RMR in older age has been identified as an indication that greater energetic investment is needed to repair damage and maintain functional homeostasis. The expectation in \"healthy aging\" is that RMR should decline with age, due to lower FFM and physical activity, but also after considering the effects of changing body composition and fat composition (Luhrmann et al. 2010) . Several organs decrease in mass at later ages, as do the metabolic rates of some tissues. These changes with age may be the result of tradeoffs meant to fuel other maintenance functions. If aging involves increasing costs of maintaining homeostasis, higher RMR should be associated with increasing multisystem dysregulation, physical frailty and cachexia-like muscle loss due to insufficient energy to meet the high metabolic needs of muscle homeostasis (Ruggiero and Ferrucci 2006; Straub et al. 2010) . Some evidence is consistent with the idea that high RMR in older adults is associated with health deterioration. Older US adults from the Baltimore Longitudinal Study of Aging (BLSA) with no functional limitations or medical conditions had 109 kcals/day lower RMR than those suffering from chronic conditions and comorbidities . Other studies show positive associations between RMR, morbidity and mortality (Ruggiero et al. 2008) , leading some to label RMR a \"candidate biomarker of global health status\" (Ruggiero and Ferrucci 2006; Schrack et al. 2014) . We found that RMR makes up a greater proportion of TEE with age and for women (whereas in the same limited sample, activitybased expenditure did not vary with age (p=0.73)), consistent with greater metabolic needs at later ages and lower relative energy available for other allocations. RMR declined with age among Tsimane over age 40 at a similar rate as in other populations, but most of this cross-sectional age effect was reduced after controlling for variation in anthropometric and health status. Additionally accounting for variation in hemoglobin levels eliminated the age effect altogether (Table 3 ). The lack of a robust age decline in RMR could suggest a higher level of frailty and morbidity among older Tsimane adults relative to other populations.\nAuthor Manuscript\nAuthor Manuscript Effects of adding additional covariates to regression models on the rate of RMR decline with age. Model 1 is the baseline model controlling only for age. \"\nStep\" model is a stepwise regression with AIC stop criterion starting with all variables from Model 9."}, {"section_title": "Study Limitations", "text": "Field conditions limited our ability to obtain RMR measures in a completely standardized manner that is temperature controlled with participants abstaining from food and activity for 12 hours. In the current study, we show that field conditions were responsible for some of the excess RMR as would be expected; time of sampling and recency of food consumption combined account for a maximum of up to 297 excess RMR kcals/day (Supporting Information Table S4 ). But on average, we conservatively estimate that these effects account for at most 26-46% of the excess RMR in women and 54-85% in men (Figure 2 , Table S1 ). We also do not report estimates of diet-induced thermogenesis, which are likely to be greater in diets high in protein and carbohydrate, and lower in fat (Westerterp et al. 1999) . Additionally, RMR is about ~70 kcals/day higher in a seated rather than supine testing position (Compher et al. 2006; Levine et al. 2000) . Despite these limitations, \"resting state\" can be difficult to define, and minimal metabolism will be sensitive to many other factors, including menstrual cycle, wakefulness and nervousness (Ruggiero and Ferrucci 2006) . Our data on breast feeding are limited, and the estimated cost of lactation reported here (223 kcal/day) is lower than previous estimates (Butte and King 2005) . Similarly, our pregnancy status data are limited and show no significant increase in RMR while other studies in wellnourished populations report a 90-470 kcal/day increase in RMR depending on trimester (Butte et al. 1999) . Under energy-limited conditions, BMR has been observed to slightly decrease or change only minimally during pregnancy as an energy-sparing strategy, along with lowering activity expenditure or increasing dietary intake (Jasienska 2009; Lawrence et al. 1987; Poppitt et al. 1994) . Another possibility is that we were unable to find an effect because there was not a large enough sample of individuals who were not pregnant or lactating (only 9% of women aged 20-39 years). Additionally these women may have underlying pathologies impeding their reproductive state, and thus may not be comparable. Lastly, the cross-sectional design limits causal inference about age changes in RMR."}, {"section_title": "Conclusion", "text": "Tsimane RMR is high in comparison with other human populations, even after adjusting for body mass and other covariates. These results are confirmed by DLW analyses showing that high Tsimane RMR is consistent with their higher mass-and age-adjusted TEE. Tsimane TEE is similar to that of other populations when controlling for their higher RMR. Bolivian highland agropastoralists show similar TEE and lean body mass as Tsimane, but lower RMR and higher PAL (Kashiwazaki et al. 1995; Kashiwazaki et al. 2009 ). Our findings are consistent with TEE being constrained within a relatively narrow range (Pontzer 2015) , whereas, given their physically active lifestyle, an additive, unconstrained model of energy expenditure would predict even higher Tsimane TEE than we document here. If greater immune surveillance and activation require higher resting energetic expenditure in a high pathogen tropical environment, we should expect reduced allocations towards other activities and physiological processes in populations like the Tsimane, including physical activity and cognitive performance (Ezeamama et al. 2005; Gurven et al. 2013; Trumble et al. 2014) . It is noteworthy that energetic limitations do not appear to shunt energy away from reproductive effort, given the high fertility, short interbirth intervals, early menarche and intenstive breastfeeding patterns observed among Tsimane (McAllister et al. 2012; Veile et al. 2014) . Future studies of the patterning and causes of RMR variation with age in different populations should help provide important insights about the changing maintenance costs affecting senescence."}, {"section_title": "Supplementary Material", "text": "Refer to Web version on PubMed Central for supplementary material. Measured and estimated RMR by age and sex. Estimations based on six prediction equations that have been widely applied to different populations. Tsimane 'conservative' RMR is a loess spline of adjusted raw data, using average regression cofficients of excess RMR across the six equations, correcting for season, time since last meal, time of day and precipitation. Mean±SD \"conservative\" RMR is 1678±354 for men and 1526±322 for women. Table 2 Predictors of \"excess\" RMR. Note: Excess is defined as measured RMR -estimated RMR from Cunningham prediction equation. Models consider variables on anthropometrics, weather, infection/ medical status, with age, sex, time since eaten, and time of day as controls. Each model employs stepwise selection method with AIC selection criterion. Additional variables in the models that were excluded from the stepwise selection include fat-free mass, fever, giardia (1=yes), respiratory ailment (1=yes), gastrointestinal ailment (1=yes). \"est.\" refers to unstandardized parameter estimate;\nβ is the standardized regression coefficient Am J Phys Anthropol. Author manuscript; available in PMC 2017 November 01."}]