[{"section_title": "Abstract", "text": "Abstract: Self-control emerges in early childhood and is shown to be strongly related to poor adulthood outcomes. The development of self-control was long believed to be homogeneous among individuals and stable in rank. The purpose of the current study was to (1) examine if multiple growth trajectories of self-control existed in early childhood by using growth mixture modeling approach, (2) investigate if growth trajectories of self-control were the function of child, family, and school characteristics. Using data from the Early Childhood Longitudinal StudyKindergarten Cohort of 2011 (ECLS-K:2011), we found (1) three distinct growth trajectories of self-control existed in the ECLS-K sample, namely, the high, medium, and low level of self-control; (2) self-control levels in all groups were relatively stable during early childhood; (3) teacher expectation and teacher-student relationship significantly predicted growth trajectories of self-control above and beyond certain child and family characteristics."}, {"section_title": "Introduction", "text": "Self-control refers to an individual's ability to control his/her current desires to achieve more valued long-term goals. It entails regulating one's actions, thoughts, and emotions to work ABOUT THE AUTHORS Qianqian Pan recently received her Ph.D. from the Research, Evaluation, Measurement, and Statistics program at the University of Kansas. She has been trained in the psychometrics and quantitative methodology with research interests in academic achievement assessments and growth modeling.\nQingqing Zhu is a school psychology doctoral candidate at the University of Kansas. She has been trained in the cognitive, behavioral, and social emotional assessment and intervention for school age children. Her research interests include social emotional learning and provision of mental health services in the school setting. The current study is within a larger scope of applying novel quantitative methodology in studying the social emotional development of school age children."}, {"section_title": "PUBLIC INTEREST STATEMENT", "text": "Many researches have demonstrated that selfcontrol in early childhood can predict later outcomes, such as academic achievement, physical and mental health, income, etc. This study aimed to describe the development growth of selfcontrol in early childhood as well as to investigate factors that could influence it. We found three distinct growth trajectories of self-control in early childhood (from kindergarten to second grade), namely the high, medium, and low level of selfcontrol. More importantly, the current study found that the teacher-student relationship and teacher expectation were significantly related to the growth of self-control above and beyond some background variables (e.g., gender, race, SES, etc). Therefore, we recommend that educators maintain high levels of expectation of their students and cultivate good relationships with them to facilitate the growth of self-control in early childhood.\ntoward longer-term rewards at the expense of immediate gratification (Duckworth & Steinberg, 2015) . Self-controlled behaviors have been found to emerge in early childhood and continue to develop till adulthood. Low levels of self-control at early stages were found to be associated with both concurrent problems, such as poor concentration (Howse, Lange, Farran, & Boyles, 2003) , lower academic achievement (Cooper, Moore, Powers, Cleveland, & Greenberg, 2014; Ng-Knight et al., 2016; Tangney, Baumeister, & Boone, 2004) , lower subjective well-being (Ronen, Hamama, Rosenbaum, & Mishely-Yarlap, 2016) , and more externalizing problems (Fergusson, Boden, & Horwood, 2013) , as well as poor adulthood outcomes, such as poor physical and mental health, low income, and high rates of crime (Daly, Delaney, Egan, & Baumeister, 2015; Daly, Egan, Quigley, Delaney, & Baumeister, 2016; Moffitt et al., 2011) . In the developmental psychology literature, self-control and self-regulation are used roughly interchangeable (Vohs & Baumeister, 2016, p. 3), in the current study, we adopted \"selfcontrol\" to keep the consistency with the measures we used. Also, following the convention, we defined the early childhood from birth to 8-year old (The Center for High Impact Philanthropy, 2015)."}, {"section_title": "Developmental trajectory of self-control", "text": "In the field of development of self-control, it is a long-standing belief that children's self-control develops dynamically till the ages of 8-10, from which point on it remains relatively stable across the lifespan (i.e., higher levels remain higher, lower levels remain lower) (Gottfredson & Hirschi, 1990) . Only few studies examined the development of self-control during early childhood. Using data from the Early Childhood Longitudinal Study, Kindergarten Class (ECLS-K), Beaver and Wright (2007) tested the stability of self-control from kindergarten through first grade in over 17,000 children via a structural equation modeling approach. The findings suggested that self-control was a stable trait with high stability coefficients (0.84 to 0.96) during this age range. Different from Beaver et al.'s (2007) study which assumed a homogeneous developmental trajectory of self-control, Coyne, Vaske, Boisvert, and Wright (2015) , Coyne & Wright (2014) hypothesized that heterogeneous developmental trends might exist. They employed a Latent Growth Class Modeling approach to analyze the growth trajectories of twins (N = 360) and paired singletons (N = 423) from kindergarten to fifth-grade also using the ECLS-K data. Results showed two growth trajectories existed: consistently high and consistently low, which also supported the stability hypothesis. In the follow-up study, Coyne et al. (2015) found self-control was relatively stable in both male and female populations of the same ECLS-K sample.\nHowever, other studies have found self-control exhibited rank changes in certain samples. Hay and Forrest (2006) analyzed five waves of a national sample of US children aged 7-15. Using a semiparametric group-based method, they found that in a small subsample (less than 10%) selfcontrol lacked relative stability. Diamond, Morris, and Piquero (2015) applied the Growth Mixture Modeling approach and analyzed self-control in a community-based sample of children aged 5 to 26. They found four growth trajectories of self-control, all of which changed rank orders across the 20 years period. Results of these studies failed to support the relative stability hypothesis and indicated the development of self-control was heterogenous and varied by the group."}, {"section_title": "Risk factors associated with low self-control", "text": "Several risk factors were found to be associated with low self-control in early childhood, including genetic factors (Beaver, Wright, DeLisi, & Vaughn, 2008; Boutwell & Beaver, 2010) , family factors, school factors, and social contexts (Buker, 2011) . Using a sample of 452 dizygotic and 289 monozygotic twin pairs who were middle and high school students at the time, Beaver et al. (2008) found genetic factors accounted for 52%-64% of the variance in self-control. Gender differences were also commonly found in self-control literature, such that females usually had a higher level of self-control than males (Chapple, Hope, & Whiteford, 2005; Gibbs, Giever, & Martin, 1998; Gibson, Sullivan, Jones, & Piquero, 2010) . Moreover, some studies found race could predict self-control even when controlling parenting and other social factors (Chapple et al., 2005; Lynskey, Winfree, Esbensen, & Clason, 2000; Perrone, Sullivan, Pratt, & Margaryan, 2004; Pratt, Turner, & Piquero, 2004) .\nFamily factors were widely related to the level of self-control with parenting practices the most researched factors. Past research contended that parental socialization, management, and parentchild relationships play a major role in determining the level of children's self-control (Bernier, Carlson, & Whipple, 2010; Gottfredson & Hirschi, 1990; Li-Grining, 2007) . Moreover, family income, maternal education, and mental health could also influence the development of self-control of young children (Sektnan, McClelland, Acock, & Morrison, 2010) . For example, single parenthood, low SES, and high family stress were related to lower self-control. (Bennett, Elliott, & Peters, 2005; Brannigan, Gemmell, Pevalin, & Wade Terrance, 2002; Chapple et al., 2005; Sarsour et al., 2011; Vaughn, DeLisi, Beaver, & Wright, 2009 ). Influence of family factors might also increase over time. For example, Gajos and Beaver (2016) found the impact of home adversity became a stronger predictor of self-control levels after ages 8 or 9.\nSchool factors, such as teacher-student closeness and teacher support have been found to be related to higher levels of self-control for students (Turner, Piquero, & Pratt, 2005) . Social contexts, including neighborhood environment, peer group affiliation, were also related to children's selfcontrol development (Bennett et al., 2005) . Gottfredson and Hirschi (1990) argued levels of self-control become relatively stable after age 10. The majority of previous research on the development of self-control focused on older children or adolescents (older than 10) and partially supported Gottfredson et al.'s theory in that self-control exhibited rank stability in for the majority population during early childhood, though their rank orders did change in a small number of samples and over a wider age range. Also implied in Gottfredson et al.'s theory (Gottfredson & Hirschi, 1990 ) is that children's selfcontrol develops dynamically before age 8, and therefore, may be more susceptible to intervention. However, few studies examined the development of self-control during early childhood, and the existing few all analyzed the same dataset (Beaver & Wright, 2007; Coyne et al., 2015; Coyne & Wright, 2014) . Given that mixture growth modeling is a data-driven approach (Abenavoli, Greenberg, & Bierman, 2017) , further studies using other samples are needed to validate previous results."}, {"section_title": "Motivation for the current study", "text": "Moreover, if different growth trajectories of self-control exist during early childhood, it is important for educators and researchers to understand what factors may predict membership of each trajectory during early childhood. Although past studies have identified risk factors related to low self-control, few of these studies examined these risk factors in the context of multiple growth trajectories of self-control. Therefore, the characteristics of children who exhibit different patterns of self-control growth early on are still unclear.\nThe purpose of the current study was to (1) examine if multiple growth trajectories of self-control existed in early childhood using a newly released national representative sample, and (2) investigate which child, family, and school characteristics could predict growth trajectories of self-control."}, {"section_title": "Research questions:", "text": "(1) Do heterogeneous growth trajectories of self-control exist during early childhood among current US children?\n(2) What is the developmental trajectory of self-control among current US children?\n(3) What child, family, and school characteristics could predict growth trajectories of selfcontrol for the current US children?"}, {"section_title": "Method", "text": ""}, {"section_title": "Dataset", "text": "This study used data from the Early Childhood Longitudinal Study-Kindergarten Cohort of 2011 (ECLS-K:2011). The ECLS-K:2011 used a multistage probability sample design to select a nationally representative sample of US children who attended kindergarten during the 2010-2011 school year. A total of six waves of data have been released to the public (K-fall, K-spring, Grade 1-fall, Grade 1-spring, Grade 2-fall, and Grade 2-spring). The ECLS: K:2011 provides nationwide representative data on children's development, learning, and performance at school. Background variables including family, school, and community characteristics were also included, which could provide opportunity to investigate the relationship between these variables and the development of self-control. The ECLS database was also commonly used in the current literature of self-control development (e.g., Coyne et al., 2015; Coyne & Wright, 2014; Vaughn et al., 2009) . Therefore, using the ECLS: K:2011 dataset allows more readily comparison between the findings in the current and previous studies."}, {"section_title": "Samples", "text": "All six waves of data from the ECLS-K:2011 public-use database was used. Children were excluded from the sample if scale scores of any sub-constructs were missing at all measurement occasions. One of the twins were also excluded to remove the dependency in the family. Of 17,322 children (8,845 males, 8,443 females, and 35 missing) were included in the current study. The age of entering kindergarten ranged from 44.81 months to 93.90 months (mean = 67.47 months). The racial/ethnic distribution of the sample is: Whites (47.3%), African-Americans (13.2%), Asians (8.0%), Hispanics (25.2%), and others (6.12%). Descriptive statistics of other key demographic variables are shown in Table 1 ."}, {"section_title": "Measures", "text": ""}, {"section_title": "Self-control", "text": "The ECLS used a modified version of the Social Skills Rating System (SRSS; Gresham & Elliot, 1990) . The SRSS is a standardized multi-rater, multi-scale measure where parents and teachers rate children's behaviors on a 4-point scale (1 = never; 4 = very often). Using different cohorts of the ECLS dataset, Coyne and Wright (2014) conducted a factor analysis on the modified SSRS and found four scales on it reflect one underlying construct of self-control. The four scales are: selfcontrol (ability to regulate one's behaviors in social situations, 4 items), interpersonal skill (ability to interact appropriately with others, 5 items), externalizing problem behavior (acting out or rulebreaking behaviors, 5 items), and approaches to learning (positive learning behaviors such as being organized and following classroom rules, 7 items). The externalizing problem behavior scale was reverse scored. Scores on these four scales were found to be highly reliable across waves (see Appendix 2). Therefore, in the current study, these four scales are included as sub-constructs to model the overall self-control of children. To differentiate between the self-control sub-construct and the overall self-control, the former is hereby referred to as SC. Also, since only teacher reports are available on all four scales, only teacher ratings are used in the current study."}, {"section_title": "Child, family, and school variables", "text": "Several child, family, and variables were selected as possible predictors of the development of selfcontrol. These variables are: child race/ethnicity, age at the kindergarten entry, gender, family structure, parent education, parent expectation, and student-teacher relationship. StudentTeacher relationship was measured using The Student-Teacher Relationship Scale (Pianta & Steinberg, 1992) , which measured closeness and conflict between the teacher and student using 15 items. Only two scale scores were available in the public database. Higher scale score on the closeness scale means the closer relationship between the teacher and student; vice versa. Higher scale score on the conflict scale means more conflicts between the teacher and student; vice versa. Further details about measures used in the current study could be found in Appendix 1. Teacher-student conflict 1.64 .80"}, {"section_title": "Growth mixture models", "text": "As discussed before, multiple growth trajectories are not uncommon in the development of selfcontrol in the early childhood (Coyne & Wright, 2014; Diamond et al., 2015) . Therefore, to account for the possible heterogeneity of the growth trajectory of self-control, growth mixture models (GMMs; e.g., B. Muthén & Shedden, 1999) could be utilized, which incorporates one categorical latent variable, often called the latent class, which classifies individuals into different groups with distinct growth trajectories."}, {"section_title": "Analytic plan", "text": "Analysis proceeded in three steps. First, a curve-of-factors Latent Growth Curve Model (COF-LGCM) was specified to model the overall developmental trajectory of self-control. In the current study, we tested the COF-LGCM with both a linear and a quadratic slope. The robust maximum likelihood (MLR) method was used as the model estimator. Model testing procedures were carried out using package lavaan (Rosseel, 2012) in the programming environment R (R Development Core Team, 2017). Full information maximum likelihood estimator (FIML) was used to handle missing data. Guidelines of good model fit include a Comparative Fit Index (CFI) value greater than .90 and a Root Mean Square Error of Approximation (RMSEA) value less than .09 (Hu & Bentler, 1999) . Likelihood Ratio Test (LRT) was used to compare nested LGCM.\nSecond, Latent Class Growth Analysis (LCGA) (a type of GMMs) was utilized to explore multiple developmental trajectories of self-control. The same form of growth was specified for all latent classes. Variances of latent factors were constrained to zero, indicating within-class homogeneity -that is, all individuals within the same class have the same growth trajectory (Feldman, Masyn, & Conger, 2009 ). Expectation-maximization (EM) algorithm was used for parameter estimation. Bayesian information criteria (BIC) value and Lo, Mendell, and Rubin likelihood ratio test (LMR-LRT) were used to compare models and to determine the number of latent classes. The analysis was completed in Mplus version 7.4 (Muthén & Muthén, 1998 .\nThird, the impact of child, family, and school variables on the growth trajectories of self-control was investigated. To account for this uncertainty of classification, the weighted multinomial logistic regression was adopted to explore the relationship between the latent growth trajectory membership and the predicting variables, where the probability of belonging to each possible trajectory was used as the weights in the regression analysis. Maximum likelihood (ML) was used as the model estimators. The models were estimated using package nnet (Venables & Ripley, 2002) in R (R Development Core Team, 2017)."}, {"section_title": "Results", "text": ""}, {"section_title": "Forms of self-control developmental trajectory", "text": "When looking at the overall sample, both the linear and the quadratic COF-LGCM achieved acceptable model fit according to the criteria above (Table 3) . However, a likelihood ratio test revealed the quadratic COF-LGCM fit significantly better (Δx 2 ¼ 861; Δdf ¼ 4; plt; :001), indicating a non-linear developmental trajectory of self-control for the overall sample. Therefore, the quadratic COF-LGCM was adopted when further exploring possible multiple growth trajectories in the following analysis. The means and standard deviations of the four scale scores used to model the overall self-control is reported in Table 2 . Table 3 displays model comparison statistics from three growth mixture models. As can be seen, the 3-class model fit significantly better than the 2-class model, whereas the 4-class model did not improve model fit. Furthermore, the 3-class model had higher certainty in classification than the 4-class model (Entropy 3Àclass ¼ :738; Entropy 4Àclass ¼ :707). Therefore, in the current sample, three distinct growth trajectories of self-control were found from kindergarten to second grade."}, {"section_title": "Heterogeneity of self-control development", "text": "These three growth trajectories can be classified as high, medium, and low levels of self-control ( Figure 1 ). As shown in Table 4 , the medium self-control class makes up 33.07% of the whole sample. It was used as a reference group with the initial level of self-control fixed at 0 when entering kindergarten. From kindergarten to second grade, children's self-control increased linearly by .26 per semester in this group. As shown in Table 4 and Described in Figure 1 , the high-level group (52.89%) entered kindergarten with the initial self-control level at 7.89 (p< :05), from which point on children's self-control developed non-linearly, increasing till spring of first grade and then gradually declining through second grade. The low level group (14.04%) entered kindergarten with the initial self-control level at −9.31 (p< :05). Both the linear (linear slope low ¼ 0:238; p ¼ 0:15) and quadratic slopes (quadratic slope low ¼ À0:005; p ¼ 0:86Þ were nonsignificant for this group, indicating children in this group maintained a stable level of self-control from kindergarten to second grade.\nOverall, the results indicate that children enter kindergarten with significantly different levels of self-control, and the differences between latent classes maintained through second grade. In other words, the current study found that self-control exhibited relative stability during early childhood."}, {"section_title": "Impact of child, family, and school variables", "text": "To investigate the impact of different child, family, and school variables on the development of self-control, two weighted multinomial logistic regressions were conducted, one with the mediumlevel class as the reference group, and one with the low-level class as the reference group. This way comparison among all three groups could be made. As shown in Table 5 , among the child variables, being black was significantly associated with higher probability of being in the relatively lower level self-control classes (i.e., more likely to be in the medium level than high-level class, and Note: SC, Ex, Interp, and App represent four sub-constructs of the overall self-control, namely, self-control, externalizing problem behavior, interpersonal skills, and approach to learning. 1-6 represents a total of six measurement occasions. in the low level than the medium-level class). Other ethnicities were not significant predictors. Moreover, being a boy and having a disability were also associated with higher probability of being in the relatively lower level classes. Interestingly, older children were found to be more likely in the high instead of medium-level self-control class. However, age was not a significnat predictor when comparing high vs low or medium vs low-level classes. This indicates that age partly explains the differences in self-control levels between the high and medium-level classes, but may not be significant enough to explain the differences between the high and low or medium and low-level classes. Poverty level was also not a significant predictor of class membership.\nOnly one family variable, single parent household, was a signifiant predictor of membership class, where children with single parents were more likely to be in the lower level self-control classes.\nAmong the school variables, higher teacher expectation and less teacher-student conflict were both associated with higher probability of being in the higher level self-control classes. Higher levels of teacher-student closeness was also associated with higher probability of being in the high instead of medium or low-level classes. However, when comparing medium and low-level classes, it did not significantly predict class membership. For the model identification purpose, the standard error of the growth factor parameters in the medium class were fixed. More details in model identification can be found in B. Muthén and Shedden (1999) ; *** p < .001 Age: age of entering kindergarten centered at the average (67.4 months)."}, {"section_title": "Discussion", "text": ""}, {"section_title": "Development of self-control", "text": "The current study found three distinct growth trajectories of self-control from kindergarten to second grade among US children, namely, the high, medium, and low-level classes. This finding is consistent with previous studies suggesting heterogeneous growth trajectories of self-control during childhood (e.g., Coyne et al., 2015; Coyne & Wright, 2014; Diamond et al., 2015) . Specifically, Coyne et al. (2015) also identified three growth trajectories of self-control using the ECLS-K:1998 sample and looking at children from kindergarten to fifth grade. The three groups also exhibited similar growth patterns, with the high-and medium-level groups demonstrating substantively minor changes and the low-level group remaining stable. Moreover, the three trajectories were relatively stable across time, indicating children entered kindergarten with different rank orders of self-control and that these rank orders maintained during early childhood. This finding is consistent with the relative stability hypothesis that has also been supported by other studies of selfcontrol during this age range (e.g., Beaver & Wright, 2007; Coyne & Wright, 2014; Gottfredson & Hirschi, 1990; Turner & Piquero, 2002 ).\nSome researchers have found different numbers of growth trajectories when studying self-control. For example, when dividing the ECLS-K:1998 sample into twins and singletons, Coyne and Wright (2014) found a two-group solution fit the data best: the high-stable and low-stable groups. Vaughn et al. (2009) looked at children from kindergarten to fourth grade in the ECLS-K:1998 sample and found five distinct trajectories. The difference in the number of identified trajectories is not surprising, first, given the different measures of self-control used across studies. The current study used an expanded measure of self-control that included four subscales on the SSRS, whereas other researchers have used the SSRS self-control subscale alone (Vaughn et al. (2009); Vazsonyi & Huang, 2010) or some other measures (Diamond et al., 2015; Turner & Piquero, 2002) . Since different measures might tap into slightly different dimensions of self-control, researchers are encouraged to consider how selfcontrol is defined in their own context when applying the results from different studies. Furthermore, the current study followed children from kindergarten to second grade while other studies had different age ranges. Given that childhood through adolescence may be the time when self-control develops most dynamically (Gottfredson and Hirschi (1990) , it is reasonable to expect that its developmental trajectories will take on different forms when researchers look at different age ranges. Last but not least, mixture growth model is an exploratory method where the criteria to determine the number of latent classes are subjective and often varied by studies. The current study used the LMR-LRT and BIC values as did some before (Coyne et al. (2015) . Other researchers have used the BIC alone (Hay & Forrest, 2006) or other criteria such as the AIC (Vaughn et al. (2009) and posterior probabilities (Burt, Sweeten, & Simons, 2014; Diamond, 2016) . Abenavoli et al. (2017) have argued that results of mixture growth models depend heavily on the sample and criteria used by the authors, and therefore, researchers should use caution when generalizing results from different models. In sum, different numbers of developmental trajectories of self-control have been identified across studies using different measures, samples, and analytic methods. However, the consistent finding is that selfcontrol does not develop uniformly. Resutls from the current study also suggest that the different groups are distinguishable early on in childhood. Therefore, it will not be appropriate to use a common growth trajectory to describe the development of self-control for all children."}, {"section_title": "Implications for practice", "text": "The current study found some child, family, and school variables were significantly associated with different growth trajectories of self-control. More specifically, black children, male children, children with disabilities, and children from single-parent household were less likely to be in the relatively higher level self-control groups. This is consistent with previous findings (e.g., Bennett et al., 2005; Chapple et al., 2005; Gibbs et al., 1998; Lynskey et al., 2000) that children with these characteristics tend to be at a higher risk of having low self-control. Moreover, the current study found age was a significant predictor of class membership when comparing the high-and medium-level groups, but not these groups and the low-level group. This indicates that being younger may increase one's probability of being in the medium versus the high-level group, but it does not contribute to one's probability of being in the low-level group versus the other two. In other words, the difference between the low-level group and the other two might be due to a real deficit in self-control beyond age difference. Future researchers are encouraged to test this hypothesis.\nAbove and beyond these child and family background variables, the current study showed teacher-student relationship was also significantly associated with children's self-control. Like Turner et al. (2005) who suggested higher teacher closeness and more teacher support were related to higher self-control in students, this study revealed that children who had higher teacher expectation, closer relationship with teachers, and less teacher-student conflict were more likely to have relatively higher levels of self-control. While it is unclear whether lower teacher expectation and poorer teacher-student relationship hindered the development of self-control in children or vice versa, the pattern is that children with lower self-control tend to experience these negative school factors more often than their higher self-control counterparts. Since researchers (Barbarin & Aikens, 2015) have emphasized the importance of teacher expectation and support in students' academic and social-emotional development, educators are advised to pay special attention to students with lower self-control and to conveying a high expectation to and cultivating good relationship with these students in order to offset the challenges they already face."}, {"section_title": "Limitations and future study", "text": "The current study is not without limitations. First, although the ECLS:K-2011 database has a large sample that is nationally representative, we could only access the public database that provided only the scale scores of the self-control measures rather than the original item responses. Even though all these measures had high reliability, we cannot exclude measurement error when applying mixture growth modeling. Future studies should analyze the item responses directly to get measurement error-free estimates.\nAlso restricted by the database is the number of background variables available. Although the current analysis included a number of important predictors of self-control, other factors such as parents' levels of self-control, exposure to trauma, earlier education experiences, and early interventions, may also have an impact on children's self-control development after they enter kindergarten. Including these factors may provide a better understanding of how children's self-control develop in their social and educational environment. Moreover, the current study used teacher ratings of self-control. Even though teacher-report is considered more reliable than parent-report and self-report in young children, it is a single source of information and may not capture children's self-control in other settings. Furthermore, several school variables used to predict group membership reflect teachers' attitude towards the students (e.g., teacher-student relationship, etc.), and therefore, may be correlated with the teacherreported self-control. Future researchers are encouraged to replicate the findings with multiple sources of information such as parents or other care providers."}, {"section_title": "Funding", "text": "The author received no direct funding for this research. "}, {"section_title": "Author details", "text": ""}, {"section_title": "Impact and Implication Statement", "text": "The current findings add to the understanding of self-control development during early childhood. The multiple and relatively stable growth trajectories of self-control supported the heterogeneity of self-control development as well as the relative stability theory during eraly childhood. The child, family, and school factors that predicted membership of each trajectory allows for the early identification of children who are at-risk for low self-control. Environmental factors that could be possible areas of intervention are also identified. Note: SC, Ex, Interp, and App represent four sub-constructs of the overall self-control, including self-control, externalizing problem behavior, interpersonal skills, and approach to learning, respectively. 1-6 represents a total of six measurement occasions."}, {"section_title": "Citation information", "text": ""}]