[{"section_title": "Abstract", "text": "JSTOR is a not-for-profit service that helps scholars, researchers, and students discover, use, and build upon a wide range of content in a trusted digital archive. We use information technology and tools to increase productivity and facilitate new forms of scholarship. For more information about JSTOR, please contact support@jstor.org.\n. American Sociological Association is collaborating with JSTOR to digitize, preserve and extend access to American Sociological Review. \nIn the same address, Blake further concluded that family size is a more important factor than socioeconomic status, because by the time a family is formed, family socioeconomic status has been largely determined whereas final family size is still a decision variable. A couple can more easily influence the quality of their children through familysize decisions than by trying to change their socioeconomic status. All this advice rests on the premise that the effect of family size on child quality is causal. If the effect is not causal, couples only reducing the desired number of children will not see improved quality in their children.\nTo date, almost all the evidence for the relationship between sibship size and child quality comes from conventional regression analysis using cross-sectional data, and the causal interpretation of the statistical relationship has been frequently questioned. The alternative interpretation is that the statistically found negative relationship between sibship size and child quality is spurious, induced by another factor or combination of other factors highly correlated with sibship size, such as family socioeconomic status In this study, we test the alternative interpretation of the effect of sibship size on child's intellectual development through sibling analysis and analysis of repeated measures of the same individuals. Both analyses are variations of change models or fixed-effects models. Change models enable us to control permanent family effects including family socioeconomic status (SES), family genetic makeup, and intellectual atmosphere in the home by \"differencing them out.\" Thus, we can determine if, and how much, the sibship-size effect is confounded by other family influences that are difficult or impossible to control in conventional regression analysis.\nThe data are from the National Longitudinal Survey of Youth (NLSY). Our first step is to replicate the usual finding using the conventional regression approach; then we apply the change models. The change mod- \nCONTENDING EXPLANATIONS"}, {"section_title": "", "text": "In the same address, Blake further concluded that family size is a more important factor than socioeconomic status, because by the time a family is formed, family socioeconomic status has been largely determined whereas final family size is still a decision variable. A couple can more easily influence the quality of their children through familysize decisions than by trying to change their socioeconomic status. All this advice rests on the premise that the effect of family size on child quality is causal. If the effect is not causal, couples only reducing the desired number of children will not see improved quality in their children.\nTo date, almost all the evidence for the relationship between sibship size and child quality comes from conventional regression analysis using cross-sectional data, and the causal interpretation of the statistical relationship has been frequently questioned. The alternative interpretation is that the statistically found negative relationship between sibship size and child quality is spurious, induced by another factor or combination of other factors highly correlated with sibship size, such as family socioeconomic status (Anastasi 1956 In this study, we test the alternative interpretation of the effect of sibship size on child's intellectual development through sibling analysis and analysis of repeated measures of the same individuals. Both analyses are variations of change models or fixed-effects models. Change models enable us to control permanent family effects including family socioeconomic status (SES), family genetic makeup, and intellectual atmosphere in the home by \"differencing them out.\" Thus, we can determine if, and how much, the sibship-size effect is confounded by other family influences that are difficult or impossible to control in conventional regression analysis.\nThe data are from the National Longitudinal Survey of Youth (NLSY). Our first step is to replicate the usual finding using the conventional regression approach; then we apply the change models. The change models take advantage of two features of the NLSY: (1) Cognitive development of the same individual is measured at least twicein 1986 and 1992; and (2) the sibship size relevant to each individual changes between 1986 and 1992.\nIn this analysis, we measure child quality by intellectual development, which is in turn measured by three standardized cognitive tests administered in the NLSY. Cognitive test scores are the most commonly used dependent variables in sibship studies (Cicirelli 1978; Downey 1995; Steelman 1985) . More recently, sociologists considered other measures of child quality. Blake (1981 Blake ( , 1989 frequently measured child quality by total years of education in her own empirical work, but she based her conclusions on both her own work and previous research on the relation of sibsize to cognitive ability. Powell (1989, 1991 ) studied the effect of sibship size on parental financial support of college education. Because we measure child quality by intellectual development, our work only speaks directly to previous research using measures of cognitive development."}, {"section_title": "CONTENDING EXPLANATIONS", "text": "Most researchers on the topic agree that there exists a negative statistical relationship between sibship size and intellectual development (Blake 1989; Downey 1995; Steelman 1985) . This finding holds in studies using data from the United States ( "}, {"section_title": "The Confluence Model", "text": "The confluence model was developed to explain not only the relationship between sib-ship size and intellectual development but also that between birth spacing/birth order and intellectual development (Zajonc and Markus 1975 ). Zajonc and Markus theorized that a child's intellectual development is a function of two factors: family intellectual environment and a child-to-child teaching benefit. Family intellectual environment, measured by the average intellectual level of all members of the family, deteriorates with the birth of each child as a result of the low intellectual level of young children. This part of the theory explains the negative link among sibship size/birth spacing and intellectual development. The theory also argues that teaching a younger sibling is beneficial to intellectual development. Last-born children are at a disadvantage because they have no younger siblings to teach. In spite of its elegance and appeal, most studies failed to find empirical support for the confluence model ( "}, {"section_title": "The Resource Dilution Model", "text": "The resource dilution model focuses on the effect of sibship size alone (Blake 1981 (Blake , 1989 . A child's intellectual development depends on family resources. The more children in a family, the more the resources are divided, the fewer resources each child would enjoy, and therefore the lower the quality of the children. Blake (1981) described three categories of family resources. First, parents provide \"types of home, necessities of life, cultural objects (like books, pictures, music, and so on)\" (p. 422). Second, parents provide \"specific chances to engage the outside world\" or specific chances \"to get to do things\" (p. 422). Finally, parents provide \"personal attention, intervention, and teaching\" (p. 422). Using data from the National Education Longitudinal Study of 1988, Downey (1995) analyzed data on family size, parental resources, and educational performance and found that the effect of family size is mediated through parental resources.\nThe resource dilution theory appears to offer a particularly appealing explanation for the effect of sibsize on parental financing of higher education Powell 1989, 1991) The standard strategy for rejecting these noncausal competing explanations is to take them into account as far as possible in conventional regression analysis. However, some potential confounding factors such as family income and family genetic influences are difficult to measure. Others, such as home intellectual climate, value systems concerning academic success, and normative expectations, may never be adequately measured. As a result, we must look beyond conventional regression analysis for persuasive evidence for the causal explanation."}, {"section_title": "THE METHODS", "text": ""}, {"section_title": "Conventional Regression Analysis", "text": "Regression analysis of cross-sectional data is the most frequently used nonexperimental approach. It may be presented as idi = go + P/fsj + P2CHi + 33FAMi "}, {"section_title": "Change Models", "text": "Change models (or fixed effects models) constitute one promising solution to the problem of omitted variables (Liker, Augustyniak, and Duncan 1985) . Change models allow control for unobserved variables whose effects are shared by clusters of observations. In the present analysis, change models can control for such unobserved familial variables as family intellectual climate as long as the effects of these variables do not change over time and are shared by all family members. The exact \"amount\" of unobserved familial effect controlled is determined by the extent to which the effect is shared. We apply two variations of change models: sibling analysis and analysis of repeated measures of the same individuals.\nSibling analysis and twin analysis were used to study the effect of education on income (Ashenfelter and Krueger 1994; Gorseline 1932; Griliches 1979). The central concern of such studies is that the better educated tend to be more able and that the more able tend to earn higher incomes. The effect of education would be exaggerated if innate ability were not adequately controlled. Innate ability is exceedingly difficult to measure in conventional regression analysis; sibling analysis and twin analysis can control whatever ability is shared among siblings or between twins without measuring it explicitly.\nUsing change models and longitudinal data for 62 less-developed countries, Firebaugh and Beck (1994) were able to control unmeasured enduring national characteristics. They found large and robust positive effects of economic growth on national welfare and found no negative effects of Third World's dependence on foreign investment and trade. These results contrast sharply with those from more conventional dependency studies, which typically regress the difference between the two outcome variables for the two time periods on the original set of independent variables. Such dependency studies often found that economic growth harms rather than benefits the living standards of the masses.\nSister-pair analysis caused a major reconsideration of the socioeconomic costs of teenage childbearing (Geronimus and Korenman 1992, 1994 ; Hoffman, Foster, and Furstenberg 1993a, 1993b). Conventional analysis generally found substantial socioeconomic costs for young mothers. The difficulty with this conclusion is that teenage births are much more common in socioeconomically disadvantaged families. Geronimus and Korenman (1992) argued that measures of family background used in conventional analysis might have been insufficient. Using sister-pair analysis, they concluded that previous estimates based on conventional analysis had exaggerated the negative consequences of teenage childbearing.\nSibling models have been used to study the effect of birth order on intellectual development as tests of the confluence model (Olneck and Bills 1979; Retherford and Sewell 1991). Once the unmeasured effects shared by sibling pairs were adjusted for, no significant effects of birth order were found, providing evidence against the empirical validity of the confluence model.\nTo our knowledge, sibling analysis has not been applied to the study of the sibship-size effect. Sibship size is traditionally regarded as a family trait, meaning that the value of this variable is the same for all children of a family. A typical change model such as a sibling model would difference out all family variables including sibship size. The consequence is that the effect of sibship size would not be estimated. In our study, using longitudinal data, we treat sibship size as an individual trait that changes as a child ages. Later, we will show that sibship size can change significantly between two measures of intellectual development on the same individual or between two measures of intellectual development for a pair of siblings.\nSibling analysis. Sibling models require data consisting of sibling pairs or sibling clusters. The promise of sibling data lies in the fact that siblings share a variety of hardto-observe influences. Siblings share substantial amounts of environmental influences: They have similar access to family economic resources, are exposed to a similar family intellectual climate, and grow up under the influences of the same parents, similar friends, similar neighborhoods, and similar schools. Sibling data have been used in previous studies because siblings on average share one half of their genes (Plomin, DeFries, and McClearn 1980). When sibling data are used to study the effect of education on income, the genetic relatedness among full siblings enables researchers to control for about one half of the variance in innate ability.\nThere is a subtle and important difference between our use of sibling data and how sibling data are traditionally used. Instead of controlling for the genetic effects shared among siblings as in a traditional approach, we control for parental genetic effects. It is parental genetic effects rather than genetic effects shared among siblings that may be correlated with family size. Since full siblings have the same parents, and thus the same genetic influences at the parental level, the percentage of genetic influences controlled for at the parental level should be 100 instead of 50. By the same argument, half siblings share about 50 percent of the genetic influences at the parental level because half siblings share only one biological parent. In Table 1 , we summarize the magnitude of various unobserved effects controlled in conventional regression analysis, full-sibling analysis, and analysis of the repeated measures of the same individuals. As more potentially confounding effects are controlled, we expect the negative effect of sibship size to weaken if not to disappear altogether.\nSibling analysis controls for all effects shared between the two members of a sibling pair by cancelling them out. \nwhere the family and neighborhood influences cancel out. Note that equations 2 and 3 must be established for different times to allow sibship size to change and that the three PIs in equations 2, 3, and 4 are equivalent. Now we can obtain an estimate of the effect of sibship size (/l) from the regression of changes in intellectual development on changes in sibship size and other child characteristics without having to measure all the shared effects, familial or otherwise. This estimate is free of biases caused by family or neighborhood influences shared by the two members of a sibling pair. Repeated measures analysis. Analysis of repeated measures of the same individuals represents an extreme form of change models. The repeated measures of the same child resemble the measures from a sibling cluster. The difference is that the repeated measures are subject to much more similar environmental influences than are the measures from a sibling cluster. Most of the familial and other environmental influences on a child at different time points would remain largely unchanged (Table 1 ). The potential genetic influence at the parental level shared by the repeated measures of the same individual is the same as that shared by full siblings (100 percent).\nUnlike sibling analysis, analysis of the repeated measures control all child characteristics that remain stable over time such as individual ability and perseverance. Also controlled are the interactions between familial and child characteristics because these interaction effects tend to be shared by all the measures of the same individual. In conventional regression analysis, some of these interactions may contribute to a spurious relationship between sibship size and child intellectual development. For instance, the possible interaction between family SES and child ability would be partially responsible for the spurious relationship if high-SES parents tend to have fewer children, if high-SES parents with more resources are more likely to make a greater investment in brighter children, and if SES is not taken into consideration adequately.\nTo Although the NLSY sample includes many related children, the exact nature of the kinship link is sometimes ambiguous. For instance, an apparent sibling pair can be a fullor half-sibling pair. The shared genetic and environmental effects vary widely across these two types of pairs. For instance, unlike full siblings, half siblings only spend part of their lives in the same family. Half siblings' intellectual development is subject to only some of the same familial influences. While they share some environmental influences from shared family culture, friends, schools, and neighborhoods, the shared influences must be less than those full siblings are subject to. How much less is unclear and depends on how long the half siblings lived together. intellectual development rather than the conventional static regression of intellectual development on eventual family size. Table 3 ). We performed the two analyses on the same basic sample so that the comparison of the results from the two analyses would not be complicated by the differences between the two samples. Differences in sample size between the two analyses are due to missing values on the independent variables. For instance, the PPVT individual sample consists of 1,702 cases, all of which are used in the repeated measures analysis; 75 cases are excluded in the conventional analysis because more independent variables are included.3"}, {"section_title": "The Effect of Sibship Size on Intellectual Development", "text": "The conventional regression analysis attempts to replicate the negative effect of sibship size on intellectual development using cross-sectional data and the method of ordinary least squares. Sibship size is measured as the average number of children living in the household over 1989-1992.\nThe analysis controls for various individual, family, and other environmental characteristics as specified in equation 1. At the individual level, we control for child's gender, birth order, and child's age in months at the 1992 assessment date. At the family level, we control for family income, mother 's education, family structure, maternal age, and mother's AFQT score. Family income is measured by the average of the total family income over 1989-1992, which should more effectively capture the permanent income of a family than a single-year measure.4 3 Other ways of drawing samples for the conventional regression analysis are possible. We could have drawn a sample that maximizes the sample size for a conventional analysis, but this sample would be much larger than and not comparable to any available sample for a changemodel analysis. 4 Supplemental analyses were conducted substituting a 10-year average of income for the 4-Mother's education is the highest grade completed by the mother at the 1992 interview. For each year, family structure is measured by a three-category dummy variable: nevermarried, divorced, and married or widowed, with married or widowed as the reference category. An alternative measure of family structure is a dummy variable indicating whether father is in the household. Our measure of family structure averages this yearly dummy variable over the 1989-1992 period.\nOther environmental variables controlled are urban/rural residence and residence in the South. Both variables were constructed by averaging dummy variables coded 1 for urban residence and 1 for residence in the South over the 1989-1992 period. Analyses that distinguish central city residence from other urban residence and suburban residence did not lead to substantive changes in the magnitude or direction of the sibship-size effect. Table 3 shows the effects of sibship size on cognitive development in the individual samples estimated by the conventional regression model and the analysis of repeated measures. The analysis was performed separately for each racial group and each cognitive measure. The first three columns in Table  3 present the effects of sibship size from the 12 conventional OLS regression models. The estimated coefficients for the control variables are generally consistent with previous literature and follow the pattern shown in Table 2 (column 2) for the PPVT scores. The resultes in Table 3 indicate that the estimated effect of sibship size varies considerably by cognitive outcome. For PPVT, the effect of sibship size is negative, comparable in size to those estimated in previous work, and statistically significant by the usual standards. This result holds in a sample that combines all racial groups as well as in samples that contain only whites, blacks, or Hispanics. The combined sample yields a coefficient of -1.92, suggesting that each additional sibling in the household would lead to a decrease of about 2 points on the PPVT test.\nFor PIAT-R, a significant negative effect of sibship size is estimated in all regressions except the one for the black sample. The sibyear average and substituting a measure of poverty for income. The results regarding the effect of sibship size remained substantively unchanged. b Apart from estimating the effect of family size, the conventional regression models control for gender, birth order, child's age at the time of the cognitive assessment, family income, mother's education, family structure, maternal age, mother's cognitive ability, urban/rural residence, and region of the country. *p <.05 **p <.01 ***p < .001 (two-tailed tests)\nship-size effect in the black sample is negative, but not significant at the p < .05 level. For PIAT-M, the combined sample and the white sample produce a negative effect of considerable size, but none of the regressions yields a significant effect. The absence of a sibship-size effect for PIAT-M is in agreement with previous work, which has often found that the sibship-size effect was more pronounced on verbal than nonverbal tests (Blake 1989 Table 3 ). None of the 12 analyses of repeated measures yields a significant negative sibship-size effect. Compared with the conventional analysis, the coefficients are much closer to zero or much more positive. Two significant coefficients occur, but these are positive effects, meaning that each additional sibling would increase the index child's math score. This finding is the opposite from the usual negative effect of sibship size.5\nResults from the sibling samples. The conventional regression, full-sibling analy-S Appendix A presents the estimates from the difference models of PPVT, PIAT-M, and PIAT-R that include other time-varying covariates. sis, and the analysis of repeated measures were performed on sibling samples for each racial group and each cognitive measure (Table 4) . To construct the sibling sample, we first grouped the data into family or sibling clusters. We then selected all families in which the oldest sibling has a valid score on a given cognitive measure in 1986 and the youngest sibling has a valid score on the same cognitive measure in 1992, thus composing a sample of sibling pairs, each of which included the oldest and youngest children from a family. This sample of sibling pairs was then divided into full siblings and half siblings based on the kinship linking algorithms developed by Rodgers et al. (1994) and Charng and Baydar (1996) . Full-sibling pairs and probable full-sibling pairs formed the sibling samples. The sibling pairs in a sibling sample were separated into individual children to create a sample for conventional and repeated measures analysis that will be compared with the sibling analysis. Some of the individual children are then excluded from the conventional or repeated measures analysis due to missing values on either explanatory variables or outcome measures at one of the time points. In the first three columns of Table 4 , we present the effects of sibship size from the conventional analysis based on the sibling samples. The similarity between these effects and those based on the individual samples is apparent although the sibling-sample effects tend to be weaker. One possible reason for the weaker effects is that the individual samples are much larger than the corresponding sibling samples (1,627 vs. 995 for allrace/PPVT). Regressions for the verbal tests are more likely to yield a statistically significant negative effect of sibship size. Larger samples combining all racial groups also are more likely to yield a significant effect. All coefficients are negative, but those for the math test tend to be smaller than those for the verbal tests. We should avoid reading too much into the negativity of a single nonsignificant coefficient or a single significant coefficient, but as a whole, the negativity of all or nearly all coefficients may well represent a pattern.\nThe second three columns of Table 4 show the results of the sibling analysis, using samples of sibling pairs for each outcome. For all racial groups and all outcomes, the estimated effects of sibship size on intellectual development are no longer significant at the p < .05 level. The majority of the estimates are less negative than those from the conventional analysis. There are a few exceptions, but the general pattern that emerges when one moves from the conventional to the sibling analysis confirms our expectations as specified in Table 1 .\nThe last three columns of Table 4 present the results of the analysis of repeated measures of individuals using the sibling pair samples. These results continue to follow our expected pattern. As in Table 3 , none of the estimates are statistically significant. The majority are more positive than the estimates from the sibling analysis of a comparable sample. Some of the estimates, especially those for PIAT-M, suggest a possibility of a positive effect of sibship size. Moving from left to right across the three types of models in Table 4 , we generally find the expected weakening of the effect of sibship size on cognitive development. The overall pattern displayed in Table 4 is consistent with the pattern expected in Table 1 ."}, {"section_title": "DISCUSSION AND CONCLUSION", "text": "Our objective has been to examine the causal interpretation of the negative effect of family size on children's intellectual development. Our analysis has provided evidence against this widely held interpretation.\nWe reviewed previous work that questions the causal interpretation of the frequently found negative effect of family size. We argue that an appropriate test of the resource dilution model should make use of longitudinal data and a dynamic modeling approach. We have reexamined the interpretation using sibling analysis and analysis of repeated measures of the same individuals.\nWhile the conventional analysis has generally replicated the longstanding result of a negative sibship-size effect, the sibling analyses and the analyses of repeated measures have failed to yield such an effect. In other words, after implicitly controlling for the additional family and other environmental effects, genetic effects at the family level, child-specific effects, and the interactions between child and family effects, sibship size no longer has a negative effect on children's intellectual development, suggesting that the effect found from the conventional analysis may be due to one or more of these additional effects rather than to family size. As we compare the conventional analysis with the sibling analysis and then with the analysis of repeated measures, the negative sibship-size effect weakens as more potential confounding effects are controlled. This pattern agrees with the theoretical expectations specified in Table 1 . The negative sibshipsize effect essentially disappears in the sibling analysis, suggesting that the additional controls for environmental and genetic effects in the sibling analysis are enough to account for the sibship-size effect estimated in the conventional analysis. Last, we should point to the evidence for the possibility of a positive sibship-size effect on children's mathematics skills. In evaluating our results, we have tried to rely on the patterns indicated by the results from all analyses based on all samples rather on the result from a single regression analysis.\nBecause the sibship-size effect disappears in the sibling analysis, there must be a timeinvariant family influence or a collection of time-invariant family influences that are correlated with sibship size, omitted in the conventional analysis, and controlled in the sibling analysis. We have reasoned in our discussion of Table 1 Our results were obtained under the assumption that all effects specified in Table 1 are time-fixed or do not change over time. Another characteristic of our analysis is that only shared effects are controlled in the change models. However, some family and other environmental effects do change over time, and all environmental effects are not shared. These qualifications suggest that our findings hold with less than perfect control for potentially confounding variables. To test the importance of these time-varying influences, we estimated change models that explicitly measure and control for time-varying variables such as family income, mother's education, and family structure (some results are shown in Appendix A). The main results remain unchanged.\nBecause of the overrepresentation of young mothers in the NLSY, the proper control for maternal age is an important issue in every study using the NLSY children. Our change models address this issue by differencing out the effect of maternal age. This control for maternal age is as effective as the extent to which the effect of maternal age is constant across siblings or across repeated measures. Ultimately, however, our findings should be replicated in samples more representative of the U.S. population and in populations in other parts of the world.\nThe generalizability of our results is restricted by the amount of sibsize changes captured in the NLSY during the six years between 1986 and 1992. Few families could increase the number of children by more than a few over the six years. Consequently, the generalization of our results to situations in which families experience large increases in sibship size will have to wait for replications using data that capture substantially more sibsize changes. Promising data for such replications may come from longitudinal studies of intellectual growth in high-fertility developing countries or from longitudinal studies of intellectual growth that span considerably more than six years in low-fertility developed countries.\nAlthough a study spanning more than six years would help, spans much longer than six years may not be necessary. The development of cognitive ability may be vulnerable to environmental influences only under a certain age, beyond which cognitive ability may not be affected by sibship size. For instance, when a child's cognitive development is first assessed at age six, the maximum number of years we follow her or him may not need to exceed 10. In other words, cognitive ability may not be affected by sibship size after age 16. This example illustrates our argument that long-term studies of 15 to 20 years that record all the births in large families may not be necessary for testing the resource dilution theory. For this reason, the moderate span of six years in our study may have captured some of the most important elements in the relationship between family size and intellectual growth.\nWhile we agree that our conclusions are restricted by the limited amount of sibshipsize changes captured in our study, the absence of sibship-size effects seems primarily due to our theoretical and empirical approach rather than to an inadequate amount of variation in fertility. Using the same NLSY data and the same outcome variables (PPVT and PIAT-R), Parcel and Menaghan (1994a) found that the 1986 PPVT is significantly predicted by whether additional children had been born during the child's first three years of life, and that the 1988 PIAT-R is significantly predicted by the additional number of children born between 1986 and 1988 (1994b). The sibship-size changes in these two studies amount to only about one-half to one-third of the fertility changes in our study. The crucial difference seems to be that while Parcel and Menaghan used a semidifference model, we used a difference model. A semidifference model in this case is similar to the conventional analysis because the additional number of children born between 1986 and 1988 is likely to be correlated with family size.\nOur work casts doubt on the standard causal interpretation of the effect of family size on cognitive development and on the validity of the suggestion that everything else being equal, limiting the number of children in a family leads to more intelligent children. Yet, the findings from conventional analysis are still valuable in their own right. Family size can still be used to predict children's cognitive development. Sometimes it is unnecessary to establish causality to predict. Even if the real causes are not observed, as long as we observe family size and as long as family size is correlated with the causes, we will be able to make good predictions. Downey's (1995) work illustrates another important use of traditional analysis. Downey assumes that the family-size effect is causal, and he proceeds to study the factors that mediate the effect of family size. Even if the effect of family size is not causal, the mediating factors can be causal. These mediating factors are caused by something other than family size, and these mediating factors may in turn cause shifts in children's intellectual development. So even if we don't know exactly what family size represents, we do know it is something detrimental, and we know that the detrimental factor is mediated by other factors. Policy intervention can choose to focus on the mediating factors without knowing what family size really represents.\nHowever, the situation is dramatically different for individual couples planning to limit family size to achieve more intelligent children. If family size does not causally affect children's intellectual development, couples who manipulate family size are not manipulating the real causes of intellectual development. In such a case, limiting family size will not lead to higher quality children. Our systematic examination of sibling pairs and repeated measures of the same individuals via the change models has shown that limiting family size does not lead to children with a higher level of intellectual development.\nGuang Guo is Assistant Professor of Sociology at the University of North Carolina at Chapel Hill. His recent work includes the timing of the poverty effect on children's intellectual development, the mechanisms mediating the effects of poverty on children's intellectual development, the environmental effects on the realization of genetic potential for intellectual development, genetic basisforfriendship selection, and the mixed models for behavior genetic analysis. "}]