[{"section_title": "Abstract", "text": "Die Dokumente auf EconStor dürfen zu eigenen wissenschaftlichen Zwecken und zum Privatgebrauch gespeichert und kopiert werden.\nSie dürfen die Dokumente nicht für öffentliche oder kommerzielle Zwecke vervielfältigen, öffentlich ausstellen, öffentlich zugänglich machen, vertreiben oder anderweitig nutzen.\nSofern die Verfasser die Dokumente unter Open-Content-Lizenzen (insbesondere CC-Lizenzen) zur Verfügung gestellt haben sollten, gelten abweichend von diesen Nutzungsbedingungen die in der dort genannten Lizenz gewährten Nutzungsrechte. www.econstor.eu\nTerms of use:\nDocuments in\nD I S C U S S I O N P A P E R S E R I E S\nInstitute for the Study The Institute for the Study of Labor (IZA) in Bonn is a local and virtual international research center and a place of communication between science, politics and business. IZA is an independent nonprofit organization supported by Deutsche Post Foundation. The center is associated with the University of Bonn and offers a stimulating research environment through its international network, workshops and conferences, data service, project support, research visits and doctoral program. IZA engages in (i) original and internationally competitive research in all fields of labor economics, (ii) development of policy concepts, and (iii) dissemination of research results and concepts to the interested public.\nIZA Discussion Papers often represent preliminary work and are circulated to encourage discussion. Citation of such a paper should account for its provisional character. A revised version may be available directly from the author. We use unique survey data linked to nearly a decade of administrative welfare data to examine the relationship between early marijuana use (at age 14 or younger) and young people's educational outcomes. We find evidence that early marijuana use is related to educational penalties that are compounded by high-intensity use and are larger for young people living in families with a history of welfare receipt. The relationships between marijuana use and both high school completion and achieving a university entrance score appear to stem from selectivity into the use of marijuana. In contrast, early marijuana use is associated with significantly lower university entrance score for those who obtain one and we provide evidence that this effect is unlikely to be driven by selection. Collectively, these findings point to a more nuanced view of the relationship between adolescent marijuana use and educational outcomes than is suggested by the existing literature.\nI20, I24, I10, I18"}, {"section_title": "Introduction", "text": "Marijuana is one of the world's most frequently used illicit drugs. 1 Worldwide, it has been estimated that 147 million individuals (2.5 percent of world population) use marijuana (WHO, 2012) . Marijuana is also often associated with popular 'youth culture' in that the starting age for marijuana is usually much lower than for other drugs (WHO, 2012) . In the United States, for example, 16 percent of 8th graders and nearly 50 percent of 12th graders have used marijuana (Johnston et al., 2011) . A number of U.S. states (e.g. Washington and Colorado) have recently approved the full legalization of marijuana use for adults aged 21 years or over, despite concerns including the potential for 'leakage' to younger age groups."}, {"section_title": "2", "text": "There is a vast sociological, psychological and, to a lesser degree, economics literature linking youths' marijuana use to a range of negative outcomes including (i) adverse medical events (i.e. emergency room visits or death); (ii) poor labor market outcomes; (iii) lower educational attainment; (iv) criminal activity; and (v) subsequent drug use (see Pudney, 2003; Roebuck et al., 2004) . 3 At the same time, psychologists argue that adolescents' ability to regulate intense emotions, distinguish feelings from facts, reason, make decisions, and solve problems improves steadily as they transition to adulthood (Byrnes, 2003; Smetana and Turiel, 2003) , implying that occasional experimentation does not necessarily lead to enduring problem behavior (Steinberg and Morris, 2001) . What, then, separates those young people who do not experience substantial penalties from marijuana use from their peers who do?\nOur goal is to contribute to answering this question by focusing specifically on youths' socio-economic background and the age at which marijuana use first begins. Early 3 use of illicit drugs, i.e. before age 15, is an especially strong predictor of later drug use (U.S. Department of Justice, 2001) suggesting that initiation into marijuana use in early adolescence may have more severe consequences than initiation into marijuana use that occurs later. We investigate this possibility by analyzing the differential relationship of 'early' versus 'late' marijuana use with both educational attainment and educational achievement. Moreover, we account for socio-economic background using unique data from the Youth in Focus (YIF) Project which interviews a nationally representative sample of 20-year old Australians about their illicit drug use, school experiences, and family background.\nThese survey data are then linked to nearly a decade of administrative data on the family's welfare receipt while the young person was growing up. This allows us to assess whether the educational penalty associated with marijuana use is related to experiences of socio-economic disadvantage.\nWe make several contributions to the literature. First, unlike many other researchers, we can retrospectively identify the age at which marijuana use began. This allows us to extend the handful of economic studies that investigate any marijuana use in high school to explicitly consider whether disparity in the age of initiation is linked to heterogeneity in outcomes. Second, our administrative welfare data allow us to construct measures of the timing and intensity of socio-economic disadvantage (i.e. welfare receipt), not at a point in time, but over the course of a young person's childhood. This is important as outcomes for young people are linked to both the timing and duration of disadvantage (Duncan and Brooks-Gunn, 1997; Berzin et al., 2006) . For the first time, we are able to investigate whether socio-economic disadvantage compounds the educational penalty associated with marijuana use. Third, we consider a broad range of educational outcomes including educational attainment (i.e. high school completion) as well as relative academic achievement (i.e. achieving a university entrance score and the university entrance score obtained). This 4 breadth of outcome measures allows us to paint a fuller picture of the link between marijuana use and educational outcomes.\nWe find a strong relationship between marijuana use that occurs at age 14 or younger and diminished educational attainment and achievement. Moreover, the educational penalties associated with early marijuana use are compounded by high-intensity use. The strong link between marijuana use and both high school completion and achieving a university entrance score appear to stem from selectivity into the use of marijuana. In contrast, early marijuana use is associated with university entrance score that are at least 5 percentiles lower and we provide evidence that this effect is unlikely to be driven by selection. Finally, the magnitude of the negative association between early marijuana use and high school completion (achieving a university entrance score) is over twice (seven times) as large for young people living in families with a history of socio-economic disadvantage than for young people from more advantaged families. Collectively, these results point to a more nuanced view of the relationship between adolescent marijuana use and educational outcomes than is suggested by the existing literature.\nThe paper proceeds as follows. Section 2 briefly reviews the relevant literature placing and motivates our contributions in more detail. Section 3 provides details about the data, our selection criteria, and estimation sample. The estimation strategy is presented in Section 4, while our main findings and the results of our sensitivity analyses are presented and discussed in Sections 5 and 6. Section 7 concludes and draws out some potential policy implications."}, {"section_title": "Existing Literature on Adolescent Marijuana Use and Educational Outcomes", "text": "During adolescence, young people make critical (and increasingly independent) decisions regarding their own health, education, employment, and family arrangements (e.g. Gruber, 2000) . So it is not surprising that research in disciplines such as psychology, economics, 5 sociology and public health consistently outlines the critical importance of adolescence in shaping the life chances of individuals. The decisions made during the period between early childhood and adolescence known as 'early adolescence' (roughly ages 10-14) are potentially even more important, although this key stage in the life course is often overlooked. During early adolescence, students typically move from small, self-contained primary school classrooms to larger, more integrated learning environments in secondary schools. Young people also face the biological transformations of puberty and the psychological shifts that accompany the emergence of sexuality. This time can be problematic for many young people as they undergo so many changes simultaneously (Eccles, 1999) . Hence, it seems reasonable to expect that young people who make poor choices at this time, e.g. using marijuana, may face severe and long-lasting penalties on their educational attainment and achievement, labor market outcomes, health, and well-being.\nThere are a number of mechanisms via which marijuana use in adolescence might affect educational outcomes, including through diminished cognitive efficacy and psychological health (e.g. Scheier and Botvin, 1995; Patton et al., 2002) , delinquent peer affiliations (e.g. Fergusson and Horwood, 1997) , and substitution of time spent under the influence of drugs for time spent studying (Van Ours and Williams, 2009 ). These mechanisms are usually discussed in the literature in the context of educational attainment, although effects on educational achievement seem at least as likely as effects on educational attainment, at least through the cognitive efficacy and time use mechanisms. This in part motivates our examination of educational achievement as well as attainment.\nAdolescent marijuana use and subsequent outcomes might also be correlated for other, non-causal, reasons. For example, individuals with less academic inclination, low motivation, poor mental health or less supervision at home may be more likely to try marijuana and will tend to have poorer educational outcomes whether or not they are 6 involved in drug use. The extent to which negative associations between adolescent marijuana use and educational outcomes reflect causal impacts of marijuana use is therefore an empirical question, and one which is, arguably, yet to be conclusively answered in the existing empirical literature.\nSeveral studies quantify the negative association between marijuana use and subsequent years of schooling or related outcomes such as labor market earnings, while stopping short of establishing the extent to which these associations can be interpretable as capturing causal effects of marijuana use. Examples include Brook et al. (1999) who use longitudinal U.S. data for approximately 1,200 African American and Puerto Rican youths to estimate the association between early-adolescent marijuana use and high school graduation.\nThey find marijuana users to be twice as likely as non-users to drop out of high school. Bray et al. (2000) find similar results using data from four longitudinal surveys of students in a south-eastern U.S. public school system. Burgess and Propper (1998) examine the association between (late) adolescent marijuana use and earnings measured at age 28, using data drawn from the National Longitudinal Survey of Youth. They find no association between 'light' marijuana use and earnings, but strong, negative associations between 'heavy' marijuana use and earnings, particularly for black men. 4 Another group of studies, again largely using U.S. longitudinal data, has attempted more explicitly to identify causal relationships between adolescent marijuana use and later educational outcomes, although typically without identifying the particular mechanism underpinning the relationship. Register et al. (2001) , for example, use data from the National Education Longitudinal Study (NELS) to show that adolescent drug use reduces subsequent years of schooling by around one year, on average. Their identification strategy exploits 7 information on the religious affiliation of the young people to instrument for marijuana use. Second, we are the first to use welfare records to directly investigate the extent to which the 5 The credibility of this approach is however hard to evaluate as none of the usual specification tests associated with IV estimation is shown (van Ours and Williams, 2009 (Duncan and Brooks-Gunn, 1997; Berzin et al., 2006) . Third, we investigate the effect of early marijuana use on educational achievement --using nationally standardized achievement rankings --as well as educational attainment. This breadth of outcome measures allows us to paint a fuller picture of the link between marijuana use and educational performance. Finally, we control for a wide range of personal and family background characteristics, including parental education and employment status, family welfare history, etc. which minimizes the potential for selectivity bias associated with marijuana use to confound our results. We then adopt the approach suggested by Altonji et al. (2005) to assess the potential for any remaining selectivity bias to be driving our estimates."}, {"section_title": "The Youth in Focus Survey", "text": ""}, {"section_title": "Estimation Sample", "text": "We use unique data from the Youth in (Breunig et al., 2007 The Family Tax Benefit is essentially an income tax credit to families with children. At the time of writing, families with two children (aged 0 to 12) receive a Family Tax Benefit for incomes up to $112,400 AUD (Centrelink, 2013) . 9 The Wave 1 response rate was 36.1 percent with 73.1 percent of respondents also completing the selfcompletion questionnaire and more than 96 percent of respondents consenting to having their survey data linked to their administrative records. 10 Preliminary analysis suggests that young people who returned the self-completion questionnaire have somewhat better educational outcomes. Specifically, they are 6 percentage points more likely to complete"}, {"section_title": "Educational Attainment and Achievement", "text": "Upon high school completion in Australia, those students who meet certain minimum coursework requirements (e.g. with respect to minimum credit hours, English requirements, etc.) are assigned a percentile ranking (ranging from 1 to 100) based on their academic performance in grades 11 and 12."}, {"section_title": "11", "text": "The calculation of this ranking however varies by state with some states relying on standardized, state-wide exams and others deriving rankings from students' results in specific subjects. A national conversion formula allows comparisons to be made across students educated in different jurisdictions."}, {"section_title": "12", "text": "Students who wish to attend university register their preferences (in rank order) for the specific degree programs offered at various universities. This ranking serves as a university entrance score, as university placement offers are made centrally on the basis of students' rankings once they are known (see Marks et al., 2001) . Programs in fields such as law or medicine are highly competitive and often require rankings in the 99th percentile, while most degree programs at Australia's top-tier universities accept only those students in the top quartile of the distribution. Students with rankings towards the bottom of the scale are often not offered any university place at all.\nThe YIF data provide us with information on three educational outcomes: (i) an indicator of high school (secondary school) completion; (ii) an indicator of obtaining a university entrance rank; and (iii) the continuous university entrance ranking itself. These are our outcomes of interest.\nhigh school, 4 percentage points more likely to obtain a university entrance score, and have a university entrance score that is 1.5 percentiles higher. These differences are statistically significant at the 5 percent level and suggest that our results may understate the educational penalties associated with marijuana use. Results are available upon request."}, {"section_title": "Marijuana Use, Socio-Economic Disadvantage, and Other Control Variables", "text": "Two unique features of the YIF data make it particularly ideal for our purposes. The first is that YIF data contain extensive information on the timing, intensity and duration of marijuana use. This allows us to specifically consider the potential interactions between age of initiation, duration, and intensity of use, all of which may be related. We create two indicators of age at initiation: (i) ever versus never used by wave 2 (i.e. typically age 20); and\n(ii) used versus not used by age 14. We then create a series of indicators designed to capture the intensity of marijuana use interacted with age at initiation: (i) low intensity (≤8 times/year) usage and initiation at age 14 or younger; (ii) medium/high intensity (9+ times/year) usage and initiation at age 14 or younger; (iii) low (≤8 times/year) intensity usage and after age 14; and (iv) medium/high intensity (9+ times/year) usage and initiation after age 14; (compared to never used marijuana)."}, {"section_title": "13", "text": "These later indicators allow comparisons to be made with those who at age 20 had never used marijuana.\nSecond, young people's survey responses can be linked to their families' social assistance records allowing us to account for the family's complete welfare history. This is important in reducing unobserved heterogeneity, and provides a unique opportunity to investigate the differential consequences of marijuana use by socio-economic disadvantage (as proxied by welfare history). The Australian government does not consider either the Family Tax Benefit or the Child Care Benefit to be welfare payments and we adopt this 12 convention here.\n14 We also follow Cobb-Clark et al. (2012) in creating four indicators of socio-economic disadvantage based on the intensity and timing of welfare receipt: (i) no history of welfare; (ii) less than six years of welfare after 1998 when the respondent was aged 10 or more (late moderate welfare receipt); (iii) less than six years of welfare, some of which occurred before 1998 when the respondent was younger than 10 (early moderate welfare receipt); and (iv) more than six years of welfare receipt (intense welfare receipt).\nIn addition to accounting for each respondent's family welfare history, we also control for demographic characteristics (gender, indigenous status, country of birth) and family background when the respondent was 14 years of age (whether the youth lived with both parents, employment status of mother and father, educational attainment of mother and father and country of birth of the parents). We also check the sensitivity of our results to the inclusion of other childhood experiences (number of schools attended and whether the respondent was ever suspended from school). This detailed information helps us to draw a number of tentative conclusions regarding possible causal mechanisms and the likely extent to which the estimated associations could be driven by selection into marijuana use. Table 1 provides descriptive statistics for the variables used in the analysis for the estimation sample as a whole (column 1) and separately for those who did and did not use marijuana by age 14 (columns 2 and 3)."}, {"section_title": "Descriptive Statistics", "text": "The results indicate that 41 percent of all young people have used marijuana by the age of 20, with 7 percent having used marijuana for the first time by the age of 14. Only 62 14 To place these payments in context, similar benefits in the United States are provided to families through the U.S. tax system in the form of standard deductions for dependent children and child care rebates. Fully 40.9 percent of families with children never receive welfare benefits and appear in the administrative data only through their family tax and child care benefit records.\n13 percent of early marijuana users completed high school in comparison to 88 percent of those who either (i) began to use marijuana after the age of 14 or (ii) by age 20 had never used marijuana at all. Of those who completed high school, 78 percent of early marijuana users also met the requirements to obtain an entrance score for university. In contrast, 86 percent of late-and non-users achieved a score for university entrance. Finally, the entrance score, for those that achieve one, is on average 6 percentiles lower for early marijuana users than for their peers.\nEarly marijuana users also differ from late-and non-starters in their observable characteristics. Most importantly, early marijuana users are more likely (39 percent) to live in families with a long history of welfare receipt relative to late-and non-users (23 percent).\nNearly half (46 percent) of young people who had not used marijuana by age 14 live in families with no history of welfare receipt. The same is true of only a third (32 percent) of early marijuana users. Early marijuana users also appear to be more disadvantaged than their late-or non-using peers according to most other observed characteristics."}, {"section_title": "<Table 1>", "text": "Detailed information about the distribution of age of marijuana initiation, intensity of "}, {"section_title": "<Figure 1>", "text": "Initiation ages and duration of use are highly (significantly) correlated with a correlation coefficient of -0.77. The mean duration of marijuana use by age 20 for those young people who started at age 14 or younger is 6.1 years, whereas for those who started 14 after age 14 it is only 2.4 years. In fact, 82 (68) percent of early marijuana users are still using marijuana when they are aged 18 (20).\nFigure 2 shows kernel density estimates of the intensity of use, i.e. average number of times per year, for those who began using marijuana at age 14 or younger and those who started after the age of 14 but before age 20. Early marijuana use is correlated with more intensive use. Specifically, those young people who begin using marijuana after the age of 14 use it less intensively (10.2 times a year) than those who begin earlier (12.7 times per year).\nAmong late users, the majority (56 percent) use marijuana less than four times per year compared to only 30 percent of early users."}, {"section_title": "<Figure 2>", "text": "Given this relationship between age at initiation on the one hand and duration and intensity of use on the other, it is important to control for the overall pattern of marijuana use so that the effect of initiation age is not confounded by either the intensity or duration of use."}, {"section_title": "Estimation Strategy", "text": "We begin by estimating the effect of (early) marijuana use on our three educational outcomes (Y) using the following reduced-form model:\nwhere is a binary indicator of marijuana use (or alternatively, marijuana use interacted with intensity of use) and is a vector of controls for own, family background and parental characteristics. A probit model is estimated (and the average marginal effects derived) when 15 the outcome of interest is either high school completion or obtaining a university entrance score. OLS estimation is used to analyze the determinants of the continuous score itself."}, {"section_title": "15", "text": "It is important to note that the estimated determinants of the probability of obtaining a university entrance score and the entrance score itself are only representative of the sample of high school completers and high school completers who obtain an entrance score, respectively, and cannot be generalized to the whole population of 20-year olds as these subsamples are unlikely to be randomly drawn from the larger population. As a result, it is likely that our models underestimate the negative association between marijuana use and educational achievement since it is reasonable to expect that those who fail to complete high school (or fail to achieve an entrance score upon completion) have unobserved characteristics that are positively correlated with both dropping out and marijuana use."}, {"section_title": "16", "text": "Reduced-form estimates such as those from equation (1) can be interpreted as causal only if marijuana use is exogenous with respect to educational attainment and achievement.\nThere are many reasons, however, to suspect that young people who choose to use marijuana early differ in unobserved ways to those who do not. Some previous researchers have addressed this endogeneity problem using an IV approach (see French and Popovici 2011 for a review). Arguably, the most credible IV approach has been to use exogenous variation in state decriminalization laws (e.g. Yamada et al., 1996 and Chaterij, 2006) or in drug prices (e.g. Chaterij, 2006 ), yet such variation can often be challenging to find. Many researchers must rely instead on maintained, i.e. untestable, assumptions about the excludability of the particular individual or family characteristics used as instruments to achieve identification. 15 As a sensitivity check, we also estimated a tobit model in order to account for the fact that university entrance scores are censored at 30 and 100. The results are virtually identical to the OLS estimates as data censoring affects only seven respondents. 16 We do not apply a Heckman selection model as it is not feasible to find a valid exclusion restriction that influences one educational outcome (such as high school completion) but not another closely related educational outcome (obtaining a university entrance score given high school completion).\nMoreover, IV models typically provide estimates of local --rather than total --average treatment effects which can be viewed as causal only if the maintained assumptions hold.\nUnfortunately, our data do not provide us with plausible instruments. Neither is the bivariate duration model approach of Van Ours and Williams (2009) appropriate for modelling educational outcomes that are not expressible as transitions as is the case for both our educational achievement measures and arguably also for our measure of educational attainment. We therefore adopt two alternative strategies for dealing with the potential endogeneity problem generated by selective marijuana use. First, we estimate a series of models increasing in controls in order to assess how stable our results are to the inclusion of individual, parental, and family background characteristics. This sheds light on whether the conditional independence assumption is likely to hold. Second, in Section 6 we assess whether our results can be explained by the duration of marijuana use, educational experiences potentially linked to marijuana use, or selection on unobservable characteristics.\nThe advantage of our approach is that no exclusion restrictions are needed. The disadvantage is that, at best, we learn only whether or not it is reasonable to expect any component of the estimated effect to be causal."}, {"section_title": "Estimation Results", "text": ""}, {"section_title": "Educational Attainment: High School Completion", "text": "The estimated marginal effect (and standard error) of marijuana use on the probability of high school completion is shown in Table 2 . Estimates in the first column control only for the effects of respondents' own characteristics. Estimates in columns 2 and 3 additionally control for the effects of family welfare history and family characteristics at age 14, respectively. Our preferred specification is in column 3.\nThe first panel shows the marginal effect of ever (versus not) using marijuana by age 20 on high school completion. The estimated marginal effects are small, but statistically significant, and interestingly, very stable to the inclusion of further controls."}, {"section_title": "<Table 2>", "text": "The relationship between marijuana use and high school completion is clearly linked to the age of initiation. Specifically, the results in panel 2 highlight the enormous disparity in the marginal effect of marijuana use for those who begin early (age 14 or younger) versus late (older than 14) relative to those who by age 20 have never tried marijuana. The large differential in the probability of high school completion associated with early marijuana use is readily apparent and appears to have been mostly driving the small average effect of marijuana use in general. The effect is again very stable to the inclusion of parental and family background controls. Our preferred estimates (column 3) indicate that having used marijuana by the age of 14 is associated with a probability of high school completion that is 20.6 percentage points lower. This effect is stronger than the effect of any other control variable in the regression. The effect of marijuana use after the age of 14 (-4.5 percentage points) is small in comparison. This is reflected in the similarity of the marginal effects on early use in panel 3 (in which late use and no use are combined) compared to panel 2.\nFinally, young people who use marijuana early also tend to use it more intensively on average (see Figure 2) . In contrast to Van Ours and Williams (2009), however, we can exploit information on the intensity of marijuana use to disentangle the pure age-at-initiation effect from intensity-of-use effects. The results in panel 4 of Table 2 show the key marginal effects from an extended model interacting an indicator of low (1-8 times/year) and medium/high intensity usage (9+ times/year) with our indicator for early versus late initiation."}, {"section_title": "17", "text": "The results indicate that the educational penalties associated with early initiation into marijuana use are compounded by high-intensity use. Specifically, young people who begin using marijuana at age 14 or younger, but use it with low intensity, have a probability of high school completion that is 11.5 percentage points lower than those who have not tried marijuana by the time they turn 20. This is virtually identical to the difference in high school completion rates for those who begin later (i.e. after age 14), but then move on to use marijuana intensively. While late, low-intensity marijuana use has no discernible effects on high school completion, young people who both begin marijuana use at a young age and use it intensively have a probability of dropping out of high school that is 28.2 percentage points higher. The bottom line is that both intensity of use and age of initiation matter for educational attainment."}, {"section_title": "Educational Achievement: University Entrance Scores", "text": "We turn now to consider whether (i) marijuana use is associated with the probability that high school graduates in Australia have met the curriculum requirements necessary to be awarded a university entrance score; and (ii) whether entrance scores are lower for marijuana users. In particular, the marginal effect (and standard error) of marijuana use on the probability of obtaining an entrance score --conditional on completing high school --are presented in Table   3 . The estimated effect of marijuana use on continuous entrance scores are presented in Table   4 for those who obtain them. Tables 3 and 4 have the same structure as Table 2 .\nOur results indicate that it is only the combination of early initiation into and intensive use of marijuana that is related to high school graduates failing to obtain an entrance score that would permit them to apply for university (Table 3 , panel 4). In our preferred specification (column 3) young people who begin using marijuana in early adolescence (age 14 or younger) and then use it with medium/high intensity have an 18.8 percentage point lower probability of obtaining a university entrance score, despite completing high school. In all other cases, high school graduates are equally likely to obtain an entrance score irrespective of their history of marijuana use. These results are robust across specifications."}, {"section_title": "<Table 3>", "text": "Corresponding OLS results for entrance scores themselves are presented in Table 4 .\nAlthough there is no significant effect of marijuana use in general on young people's university entrance scores (see panel 1), early users of marijuana have entrance scores that are between 4 and 5 percentiles lower than their peers who either began to use marijuana after the age of 14 or who had never used it by age 20 (panel 2). This latter effect is completely driven by those early users who also use marijuana intensively. Although many young people who begin marijuana use early and use it intensively successfully complete high school and obtain a university entrance score, their scores are on average 5 percentiles lower than their peers. This represents a substantially lower level of educational achievement, despite having the same level of educational attainment. Again note the robustness of the estimates across specifications."}, {"section_title": "<Table 4>", "text": ""}, {"section_title": "Educational Penalties and Socio-economic Disadvantage", "text": "One of our objectives is to assess whether the relationship between marijuana use and young people's educational outcomes varies by the socio-economic circumstances of their families.\nOur conjecture is that the educational penalty associated with marijuana use may be larger for young people living in disadvantaged households. Children living in households with a low 20 socio-economic status, who are disproportionately from non-conventional families, tend to have less parental supervision than children in households with a high socio-economic status (e.g. Zick and Allen, 1996) , and parental supervision has been shown to have important positive impacts on adolescent development through a number of mechanisms (e.g. Aizer, 2004) . Marijuana use among disadvantaged young people may therefore be more likely to lead to reduced study time and engagement with delinquent peers, for example, than is the case for young people from more advantaged families. Identifying any disparities associated with socio-economic disadvantage is important in identifying the group of young people that might benefit the most from policy interventions, including interventions aimed at reducing adolescent marijuana use or supporting educational attainment and achievement.\nThe results presented in Table 5 come from a model in which we interact the effect of early marijuana use with an indicator of whether the young person's family has a history of intensive (as opposed to moderate or no) welfare receipt. We interpret the latter as a proxy for socio-economic disadvantage generally."}, {"section_title": "18", "text": "Marginal effects are calculated so that the sum of the cross-partial interaction effect with the marginal effect of the (standalone) early marijuana use indicator is interpretable as the impact of early marijuana use for young people from disadvantaged families, as would be the case for OLS."}, {"section_title": "<Table 5>", "text": "Unfortunately, these results exhibit a general lack of estimation precision due to the small number of individuals in some cells. Despite this, we find that there is an economically 18 We also conducted a similar sensitivity analysis using any welfare receipt (versus no welfare receipt) and also the occupational ranking (the ANU4 scale) of the mother as an alternative proxy for socio-economic status. The ANU4 scale is a continuous measure of socio-economic status developed at the Australian National University (more information is provided in Jones and McMillan, 2001) . Here the ANU4 scale is based on the current or, if not available, the most recent occupation. The results did not change qualitatively when using different proxies for socio-economic status. Results are available upon request. 19 We calculate the cross-partial interaction effect as described in Ai and Norton (2003) and Karaca-Mandic et al. (2012) and adjust the average marginal effects of the standalone interacted variables such that the other variable is held fixed at 0. "}, {"section_title": "Discussion: Understanding the Potential Mechanisms", "text": "In order to understand the potential mechanisms linking marijuana use and educational attainment and achievement, we investigated the potential for our results to be confounded by three issues: (i) the duration of marijuana use; (ii) educational experiences, i.e.\nsuspension, expulsion, and school change, potentially linked to marijuana use; and (iii) selection on unobservable characteristics.\nOne possibility is that our indicator of early marijuana use simply identifies those young people who, by age 20, have used marijuana for a long time. In other words, the estimated effect of early use is not the effect of a young age of initiation, but rather the effect of a long duration of use for those who started early. We test this proposition by estimating a model including interaction terms for ever used marijuana with starting age and duration of use."}, {"section_title": "21", "text": "The results are presented in Table 6 ."}, {"section_title": "<Table 6>", "text": "We find that --for those who used marijuana by age 20 --delaying the age of initiation into marijuana by one year is associated with a 2.8 percentage point increase in the probability of completing high school, a 2.8 percentage point increase in the probability of obtaining a university entrance score; and an entrance score that is 1 percentile higher. In contrast, there is very little difference in the marginal effect of marijuana use attributable to duration of use. Thus, it appears that the age-of-initiation effect dominates the duration-of-use effect."}, {"section_title": "22", "text": "A second possibility is that the educational penalties associated with early marijuana use stem from disruptions in education linked to suspension, expulsion, and school changes associated with schools enforcing anti-drugs policies. Specifically, young people who use marijuana before the age of 14: (i) are four times as likely to ever be suspended from school;\n(ii) are nearly three times as likely to ever have to repeat a year; and (iii) attend more schools on average than their peers who do not use marijuana early (see Table 1 ). All of these differences are statistically significant. Given the potential endogeneity of these outcomes, our preferred specification does not include them as controls. Nonetheless, it is interesting to compare results that do and do not control for these other schooling experiences in order to explore the potential mechanisms underlying the link between marijuana use and educational outcomes at age 20.\nWe find that the educational attainment penalty associated with marijuana use (4.5 percentage points) is only somewhat smaller when we account for previous suspensions, expulsions, and school changes which themselves might be the outcome of marijuana use (see Table 7 ). Similarly, we find that accounting for these educational disruptions reduces, but does not eliminate, the association between early marijuana use and either obtaining a university entrance score or the university entrance score itself. Taken together, these results suggest that while early marijuana use may influence educational outcomes in part through increased school disruptions, this does not provide a complete explanation."}, {"section_title": "<Table 7>", "text": "Third, we turn to the sensitivity analysis developed by Altonji et al. (2005) to assess the extent to which the estimated relationships between early marijuana use and later educational outcomes is likely to stem from selection bias as a result of unobserved differences between those who do and do not use marijuana by the age of 14 which are also correlated with educational outcomes. Specifically, we exploit the fact that we control for a rich set of observed characteristics and follow Altonji et al. (2005) by assuming that the degree of selection on unobservable characteristics is no greater than the degree of selection on observable characteristics. Assuming that selection on observables is equal to selection on unobservables, the degree of selectivity bias in our estimate of the impact of early marijuana use on educational attainment and achievement in equation (1) is then given by: * *\nwhere is the error term in an OLS model of the determinants of selection into marijuana use . This implies that the 'true' impact of marijuana use on young people's educational outcomes is given by:\nwhere results from estimating equation (1).\nFor convenience, we calculate the ratio of the estimated impact of marijuana use to the approximated selection bias as follows:\nIn effect, shows how strong selection on unobservable characteristics would have to be (relative to selection on observable characteristics) such that the complete effect of could potentially be attributed completely to the effects of selection bias. That is, selection on unobservable characteristics would produce the estimated coefficient in equation (1) even if the true effect of early marijuana use were zero. Altonji et al. (2005) argue that a ratio of estimate to bias of less than 1 is indicative of an association that is likely to be explained by selection bias. Table 8 shows the implied bias as given in equation (2) and the ratio of estimate to bias as given in equation (5). We find that our estimated effect of early marijuana use on high school completion (see Table 2 , column 3) could be the result of selection bias if selection on unobservable characteristics were only 69 percent as strong as selection on observables. We draw a similar conclusion with respect to the probability of obtaining a university entrance score conditional on graduating from high school (see column 2). This implies that it is very unlikely that marijuana use has a causal effect on high school completion or on the probability that high school graduates meet the requirements to obtain an entrance score for 25 university. Rather, the relationship stems from unobserved differences in the characteristics of early marijuana users."}, {"section_title": "<Table 8>", "text": "In contrast, the ratio of estimate to bias is negative when we consider the effect of marijuana use on university entrance scores themselves. This occurs because the implied bias given by equation (2) is positive rather than negative. This is true only if:\nwhich indicates that early marijuana users who graduate from high school and obtain a university entrance score have 'better' observable characteristics than their non-or late-using peers who also graduate from high school and obtain university entrance scores. We investigated this in detail and found that this is indeed the case in our data. In particular,\nearly users who obtain a university entrance score are less likely to have experienced socioeconomic disadvantage and are more likely to have highly educated mothers."}, {"section_title": "23", "text": "To the extent that selection on unobservable characteristics is of a similar sign and magnitude, it appears that those unobservable characteristics that are responsible for increasing early marijuana use are positively correlated with university entrance scores themselves. It therefore seems reasonable to conclude that our estimates of the percentile reduction in university entrance scores associated with early marijuana use (Table 4 ) are unlikely to be driven entirely by selection on unobservables. Nor are they easily explained by reverse causality. While it is possible that there are other threats to causality, we believe that these results provide strong 23 Marijuana users are more likely to live in families with a history of welfare receipt (46.9 percent) than are non-users (31.9 percent). However for the group who obtain a university entrance score, welfare receipt is less common among early users (18.8 percent) than among non-and later-users (24.5 percent). Similarly, early marijuana users who obtain a university entrance score are more likely to have mothers who also completed high school (59.4 percent) than are other young people who also obtain university entrance scores (56.6 percent)."}, {"section_title": "26", "text": "evidence that there is a negative causal relationship between early marijuana use and educational achievement as measured by entrance scores themselves.\nFinally, in addition to the Altonji et al. (2005) approach, we also follow McCaffrey et al. (2010) in including an indicator for tobacco smoking (equal to one for those that report having ever smoked and zero otherwise) and its interaction with marijuana use in our main specifications. The intuition for this is that tobacco smoking may capture some of the selection process underpinning the decision to smoke marijuana. The smoking indicator is significantly negative in all cases indicating that smoking tobacco is also associated with an educational penalty even among those young people who do not smoke marijuana. This educational penalty is significantly larger, however, for those who smoke both marijuana and tobacco. Our substantive conclusions regarding the educational penalties associated with marijuana use are unchanged, however, as the average marginal effect of marijuana use is similar in size and statistical significance irrespective of whether or not we control for smoking."}, {"section_title": "24", "text": ""}, {"section_title": "Conclusions", "text": "Adolescent marijuana use is widespread in the United States and across much of the developed world. Previous research has documented that marijuana users tend to have poorer educational attainment than non-users. This negative relationship is particularly pertinent right now as additional U.S. states consider moves towards full legalization of marijuana. In this paper, we examine the relationship between marijuana use and measures of educational achievement as well as educational attainment. We also examine the extent to which the strength of these associations varies with age of initiation, intensity of use, duration of use, 24 Results available upon request."}, {"section_title": "27", "text": "and socio-economic status. We show that the negative relationship between marijuana use and educational outcomes is particularly strong for some young people.\nIn particular, we find that early marijuana use is strongly related to diminished educational attainment and achievement and that the educational penalties associated with early marijuana use are compounded by high-intensity use. We also find that the strong link between marijuana use, on the one hand, and high school completion and achieving a university entrance score, on the other, are likely to be driven by the selectivity associated with the use of marijuana. In contrast, our analysis suggests that early marijuana users who complete the necessary requirements obtain university entrance scores that are 5 percentiles lower, a relationship that is unlikely to be entirely explained by unobserved heterogeneity associated with marijuana use. Finally, we show that the magnitude of the negative relationship between early marijuana use and high school completion (achieving a university entrance score) is over twice (seven times) as large for young people living in families with a history of socio-economic disadvantage than for young people from more advantaged families.\nGovernments across the developed world are under intense pressure to improve educational attainment and achievement, often in the face of tight funding constraints and powerful vested interests. This paper has potentially important implications for policy in this space. First, the strong links between early marijuana use and educational outcomes at age 20 suggest that those who have begun to use marijuana by age 14 -particularly those from disadvantaged family backgrounds -may be an important group to target for intervention. If these relationships are not driven entirely by selection, then interventions to reduce or delay marijuana use, or to ameliorate its detrimental effects, may impact positively on educational outcomes. Moreover, our evidence that the negative educational penalty associated with early marijuana use is larger and more broadly-based for young people from socio-economically 28 disadvantaged backgrounds --coupled with the fact that early use is more common among those from disadvantaged backgrounds --suggests that disadvantaged young people should be the focus of such interventions. Making progress in this area could disproportionately improve the educational outcomes of disadvantaged young people and might contribute to efforts aimed at closing the socio-economic gap in educational performance. "}, {"section_title": "Figures", "text": ""}]