[{"section_title": "Acronyms", "text": ""}, {"section_title": "DEM", "text": "Findings from this study will be provided to local authorities and Sea Grant Extension faculty to ensure that planning for hazards related to SLR achieves a high level of accuracy, appropriateness, and shared knowledge of the potential outcomes."}, {"section_title": "Purpose", "text": "The purpose of this study is to improve current understanding of the influence of projected 21 st century sea level rise (SLR) on the position of the water table across the Waikiki, Kaka'ako and Mo'ili'ili areas of O'ahu, Hawai'i. The position of the water table is expected to be elevated in response to ongoing sea level rise, producing widespread narrowing of the vadose zone and localized breaching of the land surface in the form of groundwater inundation (GWI). The objectives of this study include identifying and quantifying the spatial extent of groundwater inundation and severely narrowed (<1 m) vadose zone thickness projected for the years 2050, 2075, and 2100 for the populous and low-lying study region. At present, the Honolulu coastal zone has generally narrow vadose zones such that many construction projects working below grade require dewatering of worksites (Finstick, 1998). The conjunction of tidally influenced groundwater and narrow vadose zones produces localized temporary flooding during extreme tide events (Firing and Merrifield, 2004). Honolulu requires only a 20 cm tide above the mean higher high water (MHHW) datum to produce such flooding (Sweet, 2014). It follows that as SLR continues, vadose zones will become progressively narrowed or eliminated altogether, thus resulting in GWI. As the water table breaches the elevation of built infrastructure, flood damage will ensue. Underground infrastructure, including an array of essential attributes such as sewer mains, vented utility corridors, and on-site sewage disposal systems (OSDS) will be the first utility to be compromised by inundation. The potential for inundation of corroded sewer mains is of particular concern owing to the likelihood of groundwater contamination. Sewer mains in Honolulu are known to be leaky systems that experience occasional structural failure due to corrosion; much of this infrastructure was installed over 50 years ago, with some approaching 100 years old (O'ahu Metropolitan Planning Organization, 2011). The threat of GWI has not been considered in most adaptation planning. However, the state has relayed its concern regarding the threat that GWI poses to miles of underground infrastructure (O'ahu Metropolitan Planning Organization, 2011). Various offices in local and state government now anticipate that climate change will require the development of adaptive design standards. While adopting such standards is judicious, the lack of hazard projections and site-specific mapping is a limiting factor. This study was undertaken to address the need for hazard projections that illustrate groundwater induced flooding under projected SLR. Outcomes include high-resolution visualizations of vadose zone thinning and GWI that will ensue across the region that encompasses Waikiki, Kaka'ako, and Mo'ili'ili on O'ahu, Hawai'i."}, {"section_title": "Related studies", "text": "The existing literature on O'ahu's aquifers has largely focused on basalt aquifers, as they provide valuable sources of potable water (Stearns and Vaksvik, 1935;Wentworth, 1951;Nichols et al., 1997;Whittier et al., 2004). In contrast, studies regarding the caprock aquifer have mainly been limited to research regarding paleo sea level indicators and sediment characteristics as a foundation for construction. Stearns reviewed evidence of Pleistocene sea level transgressions and regressions revealed in drill cores and paleo shorelines, which characterize much of southern O'ahu's coastal plain (Stearns, 1935;Stearns and Chamberlain, 1967;Lum and Stearns, 1970;Stearns 1974Stearns , 1975Stearns , 1978. Two studies have been accomplished from an engineering standpoint that reported on the subsurface geology and hydrology of the caprock in Waikiki, Mo'ili'ili and Kaka'ako (Ferrall, 1976) and downtown Honolulu (Finstick, 1998). Numerous studies have been accomplished regarding the influence of ongoing SLR on the vertical extent of the water table. Rotzoll and Fletcher (2013) developed estimates of the mean water table elevation and tidal influence to evaluate vulnerability to GWI by projecting a one-dimensional model of water level vs. distance from the shoreline throughout the Honolulu and east Pearl Harbor caprock aquifer. Parkinson and McCue (2011) conducted an assessment of flood risk in the Satellite Beach, Florida area based on flooding of the static terrain. Bjerklie et al. (2012) produced a steady-state model of groundwater flow for part of New Haven, Connecticut to test hypotheses on the effects of SLR and increased recharge on groundwater levels. Masterson et al. (2014) produced a numerical model representing a barrier island groundwater system to investigate thinning of the vadose zone and saltwater intrusion resulting from SLR of up to 60 cm. Hoover et al. (2016) developed inundation scenarios representing SLR induced GWI for three sites along coastal California by comparing DEMs to groundwater surfaces constructed from groundwater observations."}, {"section_title": "Objectives", "text": "The main objective of this study was to simulate the future extent of SLR induced GWI and vadose zone narrowing across the Waikiki, Kaka'ako and Mo'ili'ili areas for current conditions of sea level and for incremental increases in sea level of 0.33 m, 0.66 m, and 1 m. Specifically, the objectives of this study were to 1) gain an understanding of the hydrologic effects of SLR on coastal water table elevations in the Waikiki, Kaka'ako, and Mo'ili'ili areas of O'ahu, Hawai'i, 2) estimate the areal extent of flooding and expected narrowing of the vadose zone resulting from SLR induced groundwater lift, and 3) produce inundation maps that illustrate localized regions more prone to GWI inundation resulting from SLR projected for the years 2050, 2075, and 2100.\nThe objectives of the hydrologic flow model included:  Construction of a steady-state groundwater flow model using the program MODFLOW-2005;  Population of the groundwater model with recent recharge and pumping distribution data. Recharge data reflect average climate conditions (1978 to 2007 rainfall and 2010 land cover); pumping distribution data reflect average pumping rates from 1996 to 2005;  Calibration of the model with both discrete and continuous water level data observed within the study area. Continuous water levels were measured as part of this study from 2012 to 2015, while discrete water level observations were acquired from Department of Health (DOH) Leaky Underground Storage Tank (LUST) records and reflect a time period of 1992 to 2008;  Comparison of estimated model hydraulic conductivity with ranges documented for the study area through model calibration;  Simulation of incremental SLR by construction and adjustment of a general head boundary (GHB) representing the elevation and spatial extent of the coastline for each modeled increase in sea level."}, {"section_title": "Description of the study area", "text": ""}, {"section_title": "Topography", "text": "The study area encompassing Waikiki, Kaka'ako and Mo'ili'ili, is located on the southeastern side of the island of O'ahu, Hawai'i ( Fig. 1). The region lies on the coastal plain, bounded to the northeast by the Ko'olau Range, to the east by Diamond Head Crater, to the west by Honolulu Harbor, and to the south by the coast. For this study, the region of interest lies east of Nu'uanu Avenue, west of Coconut Avenue, seaward of the 10 m elevation contour relative to LMSL, and landward of the coastline. The study area is located atop a low-lying coastal platform composed of fossil carbonate reef and dredged fill. 2014 NOAA LiDAR data show that the topography is relatively flat and that the elevation across the majority of the area is less than 2 m, with inner troughs located across western Waikiki, Kaka'ako, and landward of the canal. "}, {"section_title": "Land use", "text": "The area was chosen for study partially based on its high economic value. Waikiki is the gateway of Hawai'ian tourism, accounting for nearly half of tourism statewide, supplying more than 72,000 jobs, and providing 8% of the gross state product (Department of Business, 2003). Kaka'ako is a commercial and retail district located to the west of Waikiki. The Hawai'i Community Development Authority (HCDA) is working to redevelop Kaka'ako into a residential area that would host low-rise residences and high-rise towers (EDTHCDA, 2016). Mo'ili'ili is a residential and commercial district located landward of the Waikiki district."}, {"section_title": "Geology", "text": "This section has been summarized from Macdonald et al. (1983) unless otherwise noted. O'ahu is made up of two shield volcanoes; the older Wai'anae Volcano on the western side of the island, and younger Ko'olau Volcano on the eastern side of the island. The Ko'olau Volcano formed approximately 2.5 to 2.2 million years ago followed by a hiatus in volcanic activity that lasted approximately 1 million years. Following the hiatus, eruption resumed forming lava flows, cinder cones and tuff cones."}, {"section_title": "Caprock", "text": "Extensive emerged reef units are present along the O'ahu coastal zone and formed during sea level changes and isostatic subsidence of O'ahu during the Pleistocene. The reef units were built upon the eroded flanks of the Wai'anae and Ko'olau volcanoes along the majority of southeastern O'ahu and have been partially overlain by alluvium that was eroded and transported from the two volcanoes. Below the caprock unit is a layer of brown clay that acts as an aquitard to the caprock. Overall, the southeastern coastal plain, upon which the study area is located, is composed of a mixture of post-erosional volcanics, eroded alluvial debris from the Ko'olau Volcano and sedimentary deposits produced by Pleistocene sea level variations including lagoonal deposits, coral debris, and coral ledges. These materials make up the geologic unit referred to as caprock (Stearns and Vaksvik, 1935;Finstick, 1998;Oki et al., 1998). Nearly the entire study area has been further overlain by heterogeneous human-placed fill consisting mainly of coralline sand and gravel (Finstick, 1998).\nThe hydraulic conductivity of caprock ranges several orders of magnitude owing to the various materials that make up the hydrologic unit. For example, the hydraulic conductivity of alluvium ranges from 0.01 to 1 ft/d (Wentworth, 1938), the hydraulic conductivity of sand ranges from 1 to 1,000 ft/d (Nichols, et al. 1997), and coral gravels and reef limestone can have hydraulic conductivities of several thousands of ft/day. While the range of hydraulic conductivities is diverse, the overall caprock is considered to have lower hydraulic conductivity relative to the underlying basalt aquifer (Visher and Mink, 1964).\nThe top of the caprock unit was defined by the topography and bathymetry. The contact between the caprock and underlying basalt aquifer was determined using basalt contours from Rotzoll and El-Kadi (2007)."}, {"section_title": "Caprock geology particular to the study area", "text": "This section has been summarized from Ferrall (1976). The study area includes three separate coral ledges that formed during Pleistocene transgressions and regressions of the sea. The three ledges were defined nominally by the highest extent at which each bench was encountered, at +5, -15, and -30 ft relative to LMSL. The +5 ft ledge is present along the most landward extent of the study area, while the -15 ft and -30 ft ledges are located progressively seaward. The +5 ft bench was found to be approximately 20 ft thick; it overlies coralline gravel and alluvium and is topped by alluvium, and human placed fill. Volcanic deposits are present in localized areas directly beneath the +5 ft bench, produced by eruptions of Diamond Head and Kaimuki Shield. Diamond Head is located to the east of the study area, while Kaimuki Shield is located in the northeast corner of the study area; their eruptions produced localized tuff and basalt flows, respectively. The seaward extent of the +5 ft bench abruptly ends where the -15 ft ledge begins. The -15 ft bench ranges from 10 to 20 ft and is less developed than the +5 ft bench. The -15 ft bench is underlain by coralline debris and sporadic cemented layers, and overlain by a mixture of lagoonal deposits, coralline debris, alluvium, and human placed fill. The landward extent of the -30 ft bench begins where the -15 ft ledge ends and grades from -30 ft at its landward boundary to -50 ft near the current shoreline; it ranges in thickness from less than 5 ft to more than 30 ft. The bench is underlain by a mixture of coralline debris, sand and marl, and overlain by beach rock, coralline debris, lagoonal deposits, and modern beach sand."}, {"section_title": "Hydrology", "text": "Groundwater within O'ahu's southeastern coastal plain occurs primarily in the basal lens located in the basalt aquifer, and secondarily in caprock sediments (Gingerich and Oki, 2000). The lens floats atop saltwater due to density differences between salt and fresh water (Macdonald et al., 1983) and with a centerline that is roughly described by the Ghyben-Herzberg principle, which states that for every 1 unit of freshwater above sea level, the freshwater lens extends 40 units below sea level. Groundwater from the lens system migrates predominantly horizontally from inland recharge areas to coastal discharge areas (Souza and Voss, 1987). Lower permeability caprock acts as a confining layer to the basal lens along the coastline by partially obstructing flow (Stearns, 1935). Within the caprock aquifer, the uppermost limestone unit is unconfined and contains mainly brackish non-potable water that is highly vulnerable to contamination from the overlying urban setting (Oki et al., 1998). Groundwater in the caprock aquifer is influenced by marine oscillations generated by solar and lunar tides, seasonal sea level anomalies, rainfall, and atmospheric processes such as wind, barometric pressure, seiches, and storm surge (Ponte Rui, 1994;Wu et al., 1996;Yin et al., 2001;Gonneea et al., 2013). Tidal forcing produces fluctuations of the water table boundary and are a function of porosity, hydraulic conductivity, as well as the frequency and amplitude of the tides (Li and Barry, 2000). Fluctuations become damped, decreasing in amplitude and increasing in lag as oscillations propagate further inland (Li and Barry, 2000)."}, {"section_title": "Sources of surficial recharge particular to the study area", "text": "Recharge from groundwater flow occurs in the Palolo and Nu'uanu aquifers as water moves downgradient from the Ko'olau Volcano. The two aquifers encompass the east (Waikiki) and west (Kaka'ako) portions of the study area respectively, and are bounded to the northeast by the ridge of Ko'olau Volcano and to the south by the coast. Surficial recharge is generated by infiltration of rainfall, septic leachate, water main leakage, seepage from reservoirs and cesspools, and irrigation. The sum of surficial recharge reported for the study area is approximately 4 m/d (Engott et al., 2015) "}, {"section_title": "Withdrawal from wells", "text": "Well withdrawal from the caprock aquifer is employed mainly for small-scale irrigation and for use in cooling towers (Whittier et al. 2004). Pumping records are available for recent decades."}, {"section_title": "Aquifer parameters", "text": "Hydrologic parameters, such as hydraulic conductivity and porosity, alter groundwater flow. Summaries of aquifer parameter estimations for O'ahu's hydrologic units can be found in the reports of Nichols et al. (1997), Hunt (1996), and Oki (1998). The following has been summarized from Oki (2005) unless otherwise noted. Hydraulic conductivity is a quantitative measure of the capacity of a medium to transmit water. The parameter is the constant of proportionality in Darcy's law, which relates discharge per unit area to the hydraulic gradient: where v= specific discharge (L/T), K = hydraulic conductivity (L/T), and dh/dl= hydraulic gradient (L/L). Hydraulic conductivity is characterized for two main stratigraphic units within the study area including basalt lava and caprock."}, {"section_title": "Basalt lava", "text": "The hydraulic conductivity of basalt lava is controlled by flow thickness, flow type, and the existence of fractures and lava tubes. Hydraulic conductivity ranges from several hundred to several thousands of feet per day (Soroos, 1973;Williams and Soroos, 1973;Mink and Lau, 1980;Hunt, 1996). Analysis of aquifer tests from 103 wells in Central Maui, Hawai'i, showed that hydraulic conductivity ranged several orders of magnitude from 1 to 8,000 ft/d (Rotzoll, 2007)."}, {"section_title": "Numerical flow model", "text": "The groundwater flow model was developed to simulate steady-state water levels in the unconfined caprock aquifer across the study area representing current and expected conditions of increased sea level in increments of 0.33 m up to 1 m. Hydrologic characteristics used to construct the model were based on the methodologies of Oki (2005) and Rotzoll and El-Kadi (2007), ranges in hydraulic conductivity observed within and near the study area reported by Finstick (1998), and subsurface geology in the study area reported by Ferrall (1976). Model construction was facilitated using MODFLOW-2005(Harbaugh, 2005, a quasi-three dimensional cell-centered saturated-flow model. The model solves groundwater flow equations using the finite difference method and is used here to solve for steady-state water level. The software package Groundwater Modeling System (GMS), version 10.1.3. was employed as the graphical user interface for MODFLOW-2005. This software was produced by the Environmental Modeling Research Laboratory of Brigham Young University in partnership with the U.S. Army Engineer Coastal and Hydraulics Laboratory (Owen et al., 1996). The user interface is capable of importing scatter points, raster data, and GIS shapefiles."}, {"section_title": "Model construction", "text": "The numerical model of steady-state water level was designed to represent the caprock aquifers within the Nu'uanu and Palolo portions of the Honolulu aquifer. Flow within the basalt aquifer was not explicitly simulated because it was not the focus of the study. Rather, only the flow between the two layers was of interest."}, {"section_title": "Model grid", "text": "The finite-difference grid of the MODFLOW model was rotated clockwise 35⁰ to be aligned with the primary hydraulic gradient of the study area. The grid cell size was set to 10x10 m across the entire model grid. The model consisted of two units and included 443,602 active cells; the upper unit extended from the ground surface to the base of the caprock, and the lower unit extended an additional 1 m and was included exclusively to simulate flow into the caprock aquifer through a GHB. The landward boundary was adapted to the 5 m and 10 m elevation contour depending on proximal locations of observation wells. The seaward boundary was adapted to the -40 m bathymetric contour relative to LMSL. The top of the caprock unit was constructed by down-sampling a mosaic composed of 2013 NOAA elevation data and USACE bathymetric data. Both LiDAR data sets have 1 m point spacing which were down-sampled and interpolated to the top of the 10x10 m model grid."}, {"section_title": "Boundary conditions", "text": "The landward, seaward, and bottom boundaries were defined as no-flow boundaries and the upper boundary was defined as a recharge boundary. Flow from the bottom unit to the upper unit was simulated by defining a zonally characterized GHB for the bottom unit. Values of water level defined for each GHB zone were based on simulations of confined head in southern O'ahu produced by Rotzoll and El-Kadi (2007); conductance was defined as 0.001 m 2 /d. An additional GHB was applied to the upper unit to represent the current location of the coastline. The zone characterizing the coastal GHB was defined as the region extending seaward of the 0 m elevation contour. The general head was specified as 0 m relative to LMSL for the simulation representing current conditions, and as 0.33 m, 0.66 m, and 1 m for respective simulations of increased sea level; conductance was defined as 10 m 2 /d. The location of the coastal boundary was migrated to respective 0.33 m, 0.66 m, and 1 m contour lines to reflect incremental increases in sea level. Starting head was defined as 0 m for the upper unit."}, {"section_title": "Hydrogeology", "text": "Two hydrogeologic units were represented to simplify the numerical flow model for the current purpose; the two units represent the caprock and basalt aquifers. The configurations of the two units were determined as described below."}, {"section_title": "Basalt", "text": "The basalt aquifer was characterized by a unit that extended 1 m below the base of unit 1. As mentioned previously, a GHB was specified across the entirety of this unit to represent confined hydraulic head. Hydraulic conductivity was defined as 600 m/d."}, {"section_title": "Withdrawals from wells", "text": "Well withdrawal locations, rates, and geometries (Tab. 1) were adopted from an existing groundwater flow model representative of the Honolulu aquifer (Rotzoll and El-Kadi, 2007) that was modified from an existing regional model developed by the UH-WRRC and the Department of Health (Whittier, et al., 2004). Well withdrawal was defined as the arithmetic mean of respective pumping rates from 1996 to 2005. Since pumping rates did not fluctuate significantly between 1996 and 2005, the average was considered an acceptable representation of the simulated period. 1649-13 -44.1 -0.9 -7 Table 1: Pumping rates and geometries of pumping wells located within the study area."}, {"section_title": "Well", "text": ""}, {"section_title": "Recharge", "text": "Recharge data were acquired from mean annual water-budget components for the Island of O'ahu, Hawai'i, which are representative of average climate conditions, 1978 to 2007 rainfall and 2010 land cover (Engott et al., 2015). Results of the water-budget model, designed to simulate hydrologic processes and physical conditions present on O'ahu, were used in model simulations as surface recharge. Simulated hydrological processes include rainfall, fog interception, irrigation, direct runoff, septic-system leachate, and evapotranspiration."}, {"section_title": "Observed water levels", "text": "Observed water levels used as part of the calibration process were obtained by continuous measurement of water levels in wells and by compilation of discrete water level measurements from LUST records."}, {"section_title": "Continuous observations", "text": "The monitoring network used for this study consisted of four shallow (<10 m) un-pumped wells that were monitored at intervals ranging from 5 to 15 minutes (Fig. 2). Solinst Levelogger Model 3001 and Barologger Model 3001 pressure transducers were installed in three of the four wells, while a Mini Troll Pro vented water level datalogger was installed in the fourth well. Data acquired during monitoring included groundwater pressure changes and temperature. Pressure readings were converted from pressure measurements in pounds per square inch (psi) to water levels (m). Data from unvented datalogger units were corrected for barometric pressure changes using Solinst software. Data loggers were set to Hawai'i Standard Time to correspond with NOAA tide measurements. Groundwater elevation was measured at the time of logger installation and removal using a Durham Geo Slope water level indicator; this measurement was used to define a datum for subsequent increases and decreases in water level and to evaluate measurement drift; drift ranged from 0 to 2 cm. The elevation of the ground surface at each well location was obtained using the nearest data point represented in 2013 NOAA LiDAR data. Elevations were not obtained through leveling due to the poor condition and control of benchmarks near well locations; thus, leveling would have provided reduced accuracy relative to the 2013 NOAA LiDAR dataset which has 1 m horizontal resolution and 15 cm or better vertical resolution. Water levels were referenced to the ground elevation to calculate the potentiometric surface relative to LMSL. Tidal data were acquired from the NOAA Honolulu, Hawai'i tide station located at Pier 4 along Honolulu Harbor (Station 1612340). This tide station is located at the far western end of the study area. NOAA tide measurements are recorded at six minute intervals and referenced to LMSL."}, {"section_title": "Figure 2:", "text": "Locations of water level observations obtained for use in this study. Continuously monitored wells are shown as green squares that are numbered corresponding to well ID. Wells from which discrete water levels were obtained are shown as blue circles. Groundwater levels were compared to ocean levels to evaluate the influence of long period (seasonal anomalies) and short period (tidal) ocean oscillations on groundwater levels. Influence was quantified by calculating lag, tidal efficiency, and long period efficiency (Tab. 2). Lag was evaluated by cross correlating tidal signals measured at the Honolulu tide station with tidal signals observed in groundwater data. Tidal efficiency is defined as the amplitude of the tidal oscillation in the well over the tidal oscillation in the ocean. It was found using least-squares regression of lag corrected groundwater data to tidal data. The slope of the regressed line quantifies efficiency while the y-intercept quantifies offset from LMSL. The respective offsets calculated for each well location were applied as a mean observed water level, free from tidal and seasonal sea level changes, for steady-state model calibration. Long period values of efficiency were found similarly after applying a weekly moving average to groundwater and ocean level datasets. Efficiency and lag data were supplemented by incorporating two data sets collected within the study area by the USGS and the Board of Water Supply (Rotzoll et al., 2014). The best fit tidal parameters were used to produce tidal correction functions that were applied to discrete observations and flood maps.  "}, {"section_title": "Discrete observations", "text": "More than 150 discrete water level measurements were acquired from LUST records; however, records used to calibrate the model were limited to 95 records that included information regarding the time of water level measurement and the surveyed elevation. Records used for calibration dated from 1992 to 2008. Water level data were corrected with respect to the tidal efficiency and lag as a function of distance from the coastline, and position of the tide at the lag corrected time of measurement. As previously stated, lag was quantified by cross correlating continuous groundwater elevation measurements with verified NOAA tide gauge data. A regression was calculated for lag vs. distance from coastline as well as for efficiency vs. distance from coastline. The lag regression was used to find the influencing tide stage for respective well readings by subtracting the duration of tidal lag from the time of groundwater measurement. Following identification of the influencing tide stage, the efficiency regression was used to adjust the associated tide stage based on well distance from the coastline. The corrected tide stage was then applied to the respective groundwater measurement; the final equation used for tidal correction is included below. Tcorr = gt (e -0.003 (x) ) where g is the original measurement of potentiometric surface (m), t is the stage of the tide (m), and x is the distance from the shoreline (m)."}, {"section_title": "Steady-state calibration", "text": "Model calibration is used to improve the model's ability to simulate observed aquifer behavior. Goodness of calibration was evaluated by comparing simulated against observed water levels (Tab.5, Appendix). The calibration process employed manual iterative adjustment and the non-linear inverse modeling utility (PEST) that systematically estimated parameters; the PEST utility alters chosen model parameters until the error between simulated and observed water levels is minimized to an acceptable level of accuracy (Doherty, 2008). Manual iterative adjustment was employed in the estimation of the conductance parameter of the GHB defined for unit 2; manual alteration was undertaken because GMS software does not facilitate alteration of the conductance parameter when employing the PEST utility. Values of horizontal hydraulic conductivity applied to the caprock unit were estimated using the PEST utility. Both the zonal and pilot point PEST calibration methods were carried out separately to test the suitability of each solution with respect to the geology and groundwater conditions present in the study area. Justification of zone delineation is described in following sections. Ultimately, the solution calculated by using the zonal method ( Fig. 3) was chosen to represent the current hydrology of the study area. The solution exhibited more comparable ranges of hydraulic conductivities to observed ranges, presented a lower value of uncertainty (quantified by a lower root mean squares residual), and displayed a more reasonable hydraulic gradient. Additionally, the zonal approach is more appropriate in representing the contrasting geology of the study area in that it does not produce a smooth transition of site conductivities as does the pilot point approach. Observed and simulated water levels are compared (Fig. 4). The error and statistics are listed in the Appendix. The root mean squared residual was 11 cm, indicating acceptable calibration. The zonal PEST calibration method estimates hydraulic parameters for user-defined zones by iteratively adjusting the parameter values until the error of the objective function reaches a minimum. Six zones were defined in reference to the geology of the study region. One zone characterized the offshore extent of the study area, which hosts offshore sediment including limestones cemented by aragonite and high magnesium calcite (Sherman et al., 1999); the other five zones were defined based on distinct geologic units encountered within the landward extent of the study area subsurface (Ferrall, 1976). The five units were characterized by the extent in which the +5, -15, and -30 ft coral ledges were encountered. The +5 ft ledge was further broken into three units to include a region made up mainly of carbonate, a region in which Kaimuki basalt flows were encountered, and a region where Diamond Head tuff deposits were encountered and likely extend. The spatial extent of each zone and corresponding hydraulic conductivity values calculated by the PEST utility are included in Figure 5. All calculated values applied to the model were within the range observed inside or just to the west the study area as reported by Finstick (1998). Hydraulic conductivity values calculated for four of the zones fell within ranges observed for fill, lagoonal deposits, coral ledges, and coralline debris; these were zones representing the main +5 ft carbonate coral ledge, the +5 ft coral ledge with Diamond Head volcanics, the -30 coral ledge, and the offshore region. Values calculated for zones representing the +5 ft coral ledge with Kaimuki volcanics, and the -15 ft coral bench fell within ranges of fill, coarse lagoonal deposits, and cinder deposits. "}, {"section_title": "Sensitivity analysis", "text": "Numerical solutions are generally non-unique, as comparable calibration can be achieved when applying different parameter combinations. Sensitivity of the model to aquifer parameter variations was manually evaluated for the basalt conductance parameter and evaluated using the PEST utility for the hydraulic conductivity parameters. The sensitivity of the conductance parameter was evaluated for two cases: the GHB conductance of unit 2 (basalt aquifer) was increased by one order of magnitude and lowered by one order of magnitude, respectively. Thus, the conductance was adjusted to 0.01 m/d in case 1 and 0.0001 m/d in case 2. The higher conductance estimate approximately tripled simulated water levels across the study area, resulting in a mean residual water level of cm and root mean squared residual of 132 cm. The lower conductance estimate caused simulated water levels to fall significantly, resulting in a mean residual water level of 18 cm and a root mean squared residual of 23 cm. The results of the sensitivity analysis indicate that the model is highly sensitive to adjustments in conductance. A sensitivity analysis of the hydraulic conductivity parameter was calculated as part of the PEST utility (Tab. 3). MODFLOW calculates sensitivities as the derivatives of simulated equivalents to observed head with respect to model parameters. It can be concluded that all zones are sensitive to adjustments in hydraulic conductivity. The HK_15 zone shows the highest value of sensitivity owing to the majority of observation points being located in this zone. "}, {"section_title": "Model assumptions and limitations", "text": "The numerical model has limitations owing to assumptions inherent in the governing equations and the conceptual design of the model. Simulated steady-state conditions were modeled under the assumption that recharge, pumping, and groundwater flow remain constant. Current simulations do not consider small scale pumping that is likely currently employed by numerous property owners to minimize basement flooding across the study area. The simulation is not capable of assessing numerous time-dependent factors including short-term variations in recharge, pumping rates, and boundary flows. The model simulations represent conditions of average annual recharge and a MHHW stage of the tide and do not include any consideration of anomalous conditions of extreme wet or dry periods or seasonal tide anomalies. The MODFLOW-2005 model assumes a uniform density of water which limits the model's capability to simulate the saltwater/freshwater interface, and hence, does not incorporate the influence of density driven fluid flow. Because the caprock aquifer is mainly brackish, the uniform density model was deemed reasonable for use in this study; however, the caprock aquifer does have a freshwater component, thus it would be worthwhile to collect salinity observations across the study area and employ SEAWAT (Langevin et al., 2003) or a similar groundwater variable density flow model to improve future simulations. Heterogeneity in groundwater environments is prevalent, especially in the caprock aquifer; however, heterogeneities across the study area are poorly understood and thus difficult to include in the design of the conceptual model. Hydrogeologic zones and units were simulated as homogeneous to avoid overcomplicating the model, and because detailed hydrologic and geologic information is not available. Thus, heterogeneities in the caprock aquifer were not adequately accounted for. For example, karst caves are known to exist in the Mo'ili'ili area; however, since the cave system has not been adequately mapped, the presence of the cave system was ignored during model construction, considering also that the model is not suitable for non-Darcy conditions associated with such caves Simulations of future conditions only take into account changes in sea level, and do not reflect projections of future pumping rates, recharge, or changes in the terrain. The model assumes that flooding occurs when the water "}, {"section_title": "Digital Elevation Model Construction", "text": "A digital elevation model (DEM) was produced by merging and hydro-flattening 2013 NOAA DEM tiles. Raw ground return data points describing elevations relative to LMSL were used by NOAA to generate rasterized 1x1 m DEM tiles. Hydro-flattening was accomplished by applying a constant elevation of -1.5 m to all major waterways, water features, and offshore areas. The 2013 NOAA LiDAR data has a linear error of 0.15 m. The DEM has a similar linear error across regions defined by high point density, and slightly higher error across regions defined by low point density. The objectives of DEM construction included:  Development of a highly accurate (+/-15 cm) and hydro-flattened DEM from which to compare simulations of the water table under incremental increases in sea level.  Production of raster visualizations illustrating GWI and narrowed vadose zones using gridded comparisons of DEM elevations vs. water table elevations. Steady-state simulations representing incremental SLR were uploaded into ArcGIS and converted into raster grids using the natural neighbor method of interpolation. Values of each raster grid were subtracted from the DEM grid to arrive at the distance of the water level below (or above) the modeled terrain. Cells with positive values were identified as having a vadose zone, while cells with negative values were identified as having GWI. Total cell counts for each model run were used to quantify the percent of the study area with a narrowed vadose zone and GWI respectively."}, {"section_title": "Uncertainty", "text": "Two main sources of error were identified in the uncertainty analysis for vertical disparity between the ground surface and potentiometric surface; these are LiDAR error and MODFLOW error. Vertical error present in the LiDAR data was reported as less than 15 cm (Photo Science Inc., 2013). Error in the MODFLOW simulation was found to be 11 cm based on the root mean squared difference between simulated and observed water levels. Natural water level variations are assumed to be encompassed by the MODFLOW simulation error. The quadrature sum of the two vertical sources of error was found to be 19 cm and is defined here as \"relative error\" because it only describes the vertical error in the combined groundwater and elevation models. Additional uncertainties are present in the GEOID 12a model, which is used to transform heights between ellipsoidal coordinates and physical height systems. Within the study area, the vertical error in GEOID 12a ranges from 59 to 73.5 cm (Ed Carlson, personal communication, May 5, 2016). Conditions that alter the vertical extent of the water table, such as drought, prolonged precipitation and seasonal sea level anomalies, were not included as part of the vertical uncertainty estimate as simulations are representative of average conditions of annual recharge at the MHHW tide stage. However, fluctuation of the water table resulting from such anomalies are a valid concern and warrant further study due to the potential of enhanced flooding."}, {"section_title": "Results", "text": "The results of the model simulation are included in Table 4. Values are reported as percent of the study area with a narrow vadose zone (0.5 to 1 m), severely narrow vadose zone (0 to 0.5 m), shallow flooding (0 to 0.5 m), and deep flooding ( > 0.5 m) at tidal elevations representative of the MHHW datum. GWI and narrowed vadose are simulated for increases in sea level of 0.33 m, 0.66 m, and 1 m of SLR. Based on projections of SLR specific to Honolulu, we define these increases as approximate simulations for the years 2050, 2075, and 2100. Raster visualizations of GWI and vadose zone narrowing are shown in Figure 6.   "}, {"section_title": "Deep", "text": ""}, {"section_title": "Implications", "text": "As infiltration and drainage are diminished, pools of brackish water containing pollutants from urban runoff will likely become widespread. Buried infrastructure (e.g., basements, cesspools, utility corridors) not designed to withstand continued submersion will experience inundation and saltwater intrusion (Bjerklie et. al., 2012). These impacts present serious engineering challenges and in anticipation of imminent flooding, preparation of city infrastructure is necessary. Practical upgrades include the installation of storm-water pumping units, the modification of drainage to reduce inflow of sea water during high tide, and the reinforcement of submerged infrastructure to withstand constant submersion in saline waters. Additional safeguards such as the construction of lock structures and raised infrastructure may need consideration as flooding events become increasingly prevalent."}, {"section_title": "Conclusions", "text": "A groundwater flow model was constructed as part of this study to simulate SLR induced GWI and vadose zone narrowing in the Waikiki, Kaka'ako, and Mo'ili'ili regions of O'ahu, Hawai'i. Findings are summarized below.  A groundwater flow model (MODFLOW-2005) was successfully constructed that simulates the water table across the study area for current conditions of sea level and increases in sea level of 0.33 m, 0.66 m, and 1 m.  Continuous water level monitoring was accomplished at four shallow (<10 m) monitoring wells from 2012 to 2015 to better understand the influence of the tidal oscillations on coastal groundwater.  The hydrologic model was well calibrated and the root mean squared residual between observed and simulated groundwater levels was found to be 11 cm.  A highly accurate (+/-15 cm) DEM was developed, to which simulated water levels were compared.  Simulations show that approximately 19% of the 13 km 2 study area presently has narrow vadose zone of less than 1 m; SLR of 1 m raises this extent to 50% and produces flooding over nearly 13% of the study area. It follows that under 1 m of SLR, the majority (~63%) of the region will likely experience either episodic or continuous flooding. Table 5: Calibration summary for the steady state groundwater flow model. Wells with names beginning in \"disc\" represent discrete observations while names beginning with \"cont\" represent continuous monitoring wells. "}, {"section_title": "Appendix", "text": ""}, {"section_title": "Name", "text": ""}]