[{"section_title": "", "text": "Notes. Robust standard errors in parentheses. *Significant at 10%. **Significant at 5%. ***Significant at 1%. All regressors lagged 1 year. All regressions have field-university pair and year fixed effects, and university and field-specific trends. \n(8) Notes. Standard errors in parentheses. *Significant at 10%. **Significant at 5%. ***Significant at 1%. All instruments lagged one period behind enrolments and are triple interactions. Notes. *Significant at 10%. **Significant at 5%. ***Significant at 1%. Standard errors in parentheses. Recession indicator coded 1 for recessions in 1974, 1980, 1981, 1990, 1991 and 2001. 1974-2003 are all years for which R&D data are available, while 1974-98 matches our main estimation sample. We chose 100 universities based on (highest) total doctoral degrees granted to foreign students. Ninety of these universities also were the top total Ph.D.-granting institutions. We collected data on all publications by those universities in S&E fields from 1973 to 2001. The data were downloaded from Thomson ISIÕs Web of Science, using a Perl script. Each publication record included the university ID, year, number of times cited, subject category or categories and department affiliation(s). Using an algorithm (described below), we sorted the publication records into 23 fields of science and engineering. We then constructed the number of publications per university ⁄ field ⁄ year and the sum(1 + times cited) per university ⁄ field ⁄ year.\nSince Web of Science does not standardise department abbreviations, we started with typical abbreviations, which were closely aligned to the 23 fields (e.g. the typical abbreviation for a mathematics department is Ôdept mathÕ).\nSearching with typical abbreviations, we identified the 5,000 most highly cited publications within each field. Using Web of ScienceÕs assignment of publications to subject categories, we identified all subject categories referenced by at least one per cent (50) of those publications, for each field. In order to ensure that all publications related to the core literature of each field were assigned to the correct field, we designated categories identical or very close to the field name as unique, and removed them from the other fieldsÕ listings. Categories that were truly unique were also designated.\nThe sorting algorithm is as follows:\n1 If there is only one subject category listed by the publication and:\n(a) it is a unique category, it is assigned directly to the associated field; (b) it is a non-unique category, but the associated typical department is listed and matches a field, then it is assigned to the associated field; (c) it is a non-unique category, and the department does not match a field, it is assigned to the highest ranking field (see below) that is associated with the subject category. 2 If there are multiple subject categories listed and:\n(a) the department listing matches a field, it is assigned to that field; (b) the department does not match a field, and there is only one unique subject category, it is assigned to the field associated with that subject category; (c) the department does not match a field, and there are multiple unique subject categories, it is assigned to the field associated with the highest ranked unique subject category; (d) the department does not match a field, and there are no unique subject categories, then it is assigned to the field associated with the most subject categories listed; (e) the department does not match a field, there are no unique subject categories, and several fields are tied for the most subject categories, then of the tied fields, assign the publication to the highest ranked field. 3 If there are no subject categories listed and:\n(a) the department listing matches a field, it is assigned to that field; (b) the department listing does not match a field (or there is no department listing), the publication cannot be assigned.\nIn all, some 3.2 million records were collected, of which 290,000 could not be assigned with this algorithm. The distribution of records among fields is not uniform but not heavily skewed either. Computer science has the least records, around 40,000, while ecology, evolution and behavioural biology has the most, around 520,000 records. Priority in ranking fields was given to fields with specific topics of inquiry, such as neuroscience and aerospace engineering, over fields with methods of inquiry, such as biochemistry and mechanical engineering. Of the 3.2 million records, many are duplicates, having been assigned to multiple universities on account of coauthorship by researchers at several institutions."}, {"section_title": "B.3. Independent Variables", "text": "B.3.1. Graduate student enrolment counts Data on graduate student enrolments were compiled from the NSFÕs Survey of Earned Doctorates, a survey requested of every doctorate recipient upon completion of that degree. The survey has been consistent in its core questions from 1959 to the present. For key identifying variables the NSF inferred responses from the location and time of the survey, so that doctoral institution and year of graduation are identified with a response rate of 100%. Other key variables, such as country of citizenship, year of graduate entry and dissertation field had response rates on the order of 90-95%.\nStudents were assigned to fields based on their indicated three-digit dissertation specialty. The SED uses 340 of these titles to categorise specific areas of study, of which 189 are related to science and engineering. We matched these 340 specialties to the 23 fields of science and engineering used in the National Research CouncilÕs 1993 Survey of Graduate Faculty and to a twenty-fourth field, which we call non-science. This matching, although ad hoc, was for the most part obvious. When not obvious, assignment was made using information from the list of subject categories (discussed above to match publications to fields). In cases where a dissertation specialty seemed to match more than one product category, students indicating that specialty were randomly distributed to the product categories.\nUsing information in the SED on year of graduation and year of entry, 1 we assumed that the respondent was enrolled at his doctoral institution for the intervening years before completion. We thus created an inferred enrolment count, whereby each Ph.D. recipient was counted in a university ⁄ field ⁄ year observation for each year of enrolment. This assumption may slightly overstate enrolments due to breaks in attendance. However, since the SED does not record people who leave before completing their doctorate, the enrolment counts may as likely be an underestimate. One difficulty with inferred enrolments is that since the SED only goes to 2004, such counts for the most recent years underestimate total enrolment. Since the observed average time to degree is 6 years, a student entering in 1999 would graduate in 2004. To be conservative, we use inferred enrolment counts only to 1997, although counts for 1995-1997 will have some slight truncation because students finishing in 2005 and 2006 would not be included."}, {"section_title": "B.3.2. Control variables: R&D and equipment expenditures", "text": "Two variables were created with data from the NSFÕs Survey of R&D Expenditures at Universities and Colleges, available online through WebCaspar (webcaspar.nsf.gov). The survey contains total R&D by university, field and year, and has sub-totals by federal ⁄ non-federal funding and equipment (capital) expenditures. The fields in this survey were slightly different than those contained in the Survey of Graduate Faculty, and our correspondence between them is available upon request. The first measure we create from this data is real non-equipment R&D expenditures, which includes both federal and local funding, but is net of equipment and capital (physical plant) expenditures. This sum includes mainly administrative costs and payments to professors, postdocs and graduate students. The second variable is real equipment & physical plant expenditures, which again includes both federal and local funding. Tables, while figures for the USSR. prior to its breakup were from estimates compiled by Angus Maddison. For instruments at the regional level of aggregation, the median per capita GDP of each region was used.\n1 To be precise, the SED includes multiple variables indicating year of entry. We used the one with the highest rate of response and if omitted used the next most common and so on. B.4.2. Total international students to non-US hosts Data on international student enrolment at the tertiary (undergraduate and graduate) level came from UNESCOÕs Statistical Yearbooks 1963-1998, and UNESCOÕs online database for post-1998. The data are reported as a count, with observations by origin ⁄ host ⁄ year. Our instrument is constructed as total students per origin per year, which we made by first linearly interpolating missing values in the origin-host series, then summing across non-US hosts to create the aggregate variable."}, {"section_title": "B.4.3. Policy changes", "text": "This variable tracking the removal of study abroad restrictions in countries that have had restrictions on students, when aggregating across the globe and weighting by the countryÕs population share, amounts to a measure of the proportion of the worldÕs population with freedom to study abroad as P n i¼1 P T t¼1 D it Pop it = P n i¼1 P T t¼1 Pop it , where D it = 1 if country i permitted study in the US in year t, and 0 otherwise. The value of D it is zero in the following cases: China, pre-1978 , Russia, pre-1986 , Poland, pre-1972 , Germany, Romania, Bulgaria, Czechoslovakia and Hungary, all pre-1990 , and Cuba and Vietnam, whole sample. Detailed documentation of such policies is available upon request. In brief, the seven Soviet and Eastern Bloc countries dictated student enrolment and prohibited travel. While Poland reformed its policies and relaxed restrictions in the early 1970s, the others remained autocratic. With the introduction of glasnost in the USSR in 1986, small exchanges of students with the US began, but the other Eastern Bloc countries resisted this change. Only with the revolutions of late 1989 was state control relaxed in those countries. Germany is considered a state-control country because, post-reunification, East Germans are counted among all German students and so the East German policy effectively restricted the numbers of German students in our panel. China granted limited allowances for study abroad starting in 1978, 2 years after the death of Mao Zedong and did not grant total freedom until 1985."}, {"section_title": "B.4.3. US instruments", "text": "State and national unemployment rate data was obtained from the Bureau of Labour Statistics, US Department of Labour. State Gross Domestic Product (GSP) data was obtained from the Bureau of Economic Analysis, US Department of Commerce, to create variables of average GSP within census regions."}]