[{"section_title": "Abstract", "text": "This study investigated the predictive power of selected variables on academic achievement integrated science among College of Education students in Ikere Ekiti, Ekiti State, Nigeria. The study employed ex-post-facto research design. A sample of 280 students in 2006/2007 and 2007/2008 academic sessions was drawn from all the subject combinations in the Department of Sciences using stratified random sampling technique. The data used were collected from the college examinations and records division of the college through a format developed by the researchers. A questionnaire consisting of items seeking information on home background gender, school type, socio-economic status, birth order of the students was also used. Multiple Regression and Pearson Product Moment Correlation Analysis were used to analyse the data. The findings showed that there were moderate and positive relationships among the selected variables and achievement of students in Integrated Science at National Certificate in Education level. The findings also revealed that only 42.5 percent of the total variance in the students achievement in integrated science is accounted for by the linear combination of the eight variables examined in the study. Result further showed that school type was the most potent predictor of students' achievement in integrated science while chemistry showed the least contribution to the academic achievement of students in integrated science during the years of this study. It was therefore recommended among others that school proprietors and administrators should improve on their schools administrative strategies so as to make teaching and learning of science more effective."}, {"section_title": "INTRODUCTION", "text": "Integrated science teaching in Nigerian schools is meant to express the fundamental unity of scientific thoughts and to avoid premature or undue stress on the distinctions between the various scientific fields. Therefore, integrating principles according to Bajah (1983) are intended to produce a course which:\ni. is relevant to the child's needs and experiences; ii.\nstresses the fundamental unity of science; iii.\nlay adequate foundation for subsequent further study of science; and iv.\nadd a cultural dimension to science education.\nDespite that fact that integrated science is an activity-based subject that needs little of basic computation, but mostly of practical, it seems that the basic knowledge of Biology, Chemistry, Physics and Mathematics are the major criteria for full understanding of the subject. It is the measure of this parameter that determines the level of achievement of students in the subject. However, some variables have been identified in predicting students' grades in school. These include, gender (Kolawole, 2002) ; School type (NAIS, 2005) ; SES (Rothman, 2002) ; birth order (Sulloway, 2001) ; and lower school certificate grades (Adeyemi, 2005; Afolabi, Mabayoje, Togun, Oyedeji & Raji, 2007) . Studies on prediction for different purposes are vast in literature. In some studies, emphasis was made on the extent to which a criterion behaviour pattern could be predicted (Kowarsky, Clatfelter & widaman, 1998; McCamley-Jensen & Ervin, 2000) . In other studies, emphasis was on test development in which the test developers sought to test the predictive validity of their newly developed test items (Thorndike & Hagen, 1977; Deen, 1979) . Other research on prediction also showed that about 25% of students' success could be explained by factors that are observable at the time of research, but the general finding according to Hakkinen (2004) was that grade point average (GPA) from previous school and aptitude test scores provide the best forecast of success, whether the success is measured as grades or completion of higher education. Hakkinen further observed that initial entry point based on past performance in senior secondary school was a good predictor of study credits at University level in all fields . In the study of predicting students' first semester achievement in a dental School in Korea, it was found that undergraduate GPAs and science scores from standardized aptitude test were highly correlated with academic performance in preclinical years of students (Kim, 2007) .\nFinding of Yoloye (1982) and Ayodele (2005) confirmed that there was a positive significant relationship between the cognitive variables and student's academic achievement. Abdullahi (1983) as well showed that there was a significant and positive relationship between University Matriculation Examination (UME) scores and first year University Examination scores in Physics. However, the report of Afolabi, Mabayoje, Togun, Oyedeyi & Raji (2007) showed that Ordinary level (O' level) scores in Physics, Chemistry, Biology and Mathematics with the UME scores showed a better correlation with the CGPA and physiology scores of medical students. Findings of Adeyemi (2005) also showed that the achievement of students at Junior Secondary School Certificate Examination is a moderate predictor of academic achievement of students at the Senior Secondary School Certificate Examination (SSCE) in Ondo state, Nigeria. This is similar to Ojerinde's (1975) observation that there was a positive and significant relationship between candidates' academic achievements in SSCE and the UME performance of the same set of students and that the SSCE has a fair predictive power on university academic achievement.\nGaps in academic achievement among the gender have been a topic of concern in the field of research for decades, but there is no conclusive explanation for these gaps. Many research studies have shown that females outperformed males in reading and writing, with larger differences in writing (Battistich, Solomon, Kim, Watson & Schaps, 1995 , Adedayo, 1997 . The analysis of National Assessment of Educational Progress (1997) showed that 4 th -grade male average scores were higher than scores of their female counterpart in Mathematics. However, average scores for 8 th -and 12 th -grade males and females did not show any significant differences. In a similar study, Esquivel & Brenes, (1988) showed that boys had significantly better achievement in Science and Mathematics than did the girls for 6 th , 7 th , 10 th and 11 th grade levels. Kolawole (2002) in a study on sex differences and academic achievement in Science subjects in a tertiary institution in Nigeria also found that female students performed significantly better in Integrated Science while the finding of Falaye (2006) does not reveal any significant difference in the performance of males and females students in Pre-degree achievement test..\nMany researchers have shown the relative effect of private schools compared with public schools on students' academic achievement. For example, the study of the National Association of Independent School (2005) using National Education Longitudinal study of 1998-2000 showed that the average private school students outperformed public school students. The high achievements of private school students have been attributed to their social class (Lee & Burkhan, 2002) . Possible explanations for this are that low-income students have fewer educational resources at their possession than students from high-income families, with high level of education to support their children in schools.\nResearch findings concerning the relationship between socio-economic status (SES) and learning outcomes of students shown that it has significant influences on students' academic achievement (Rothman, 2003; Lara -Cinisomo, Pebley, Vaina, Maggio, Berends & Lucas, 2004) . Ainley (2003) reported that SES background, as measured by parental education, wealth and occupational status, has an important influence on tertiary institution entrance performance. Students whose parents are professionals achieve higher tertiary institution entrance scores. Some researchers attribute low academic achievement of certain students to their low SES. For example, Teese (2003) in the analysis of the performance of students in Victoria, found that the children from low socio-economic status families have lower scores (Year 12 results and Year 5 benchmarking test result). The analysis of Ainley (2003) also showed that there was a positive relationship between the extent of home education resources and reading achievement of students.\nInfluence of birth order on students' academic achievement has continued to be a topic of curiosity. Achievement in order of birth could manifest in different ways depending on the family. Schacter (1963) argued that parental resources have an important effect on children's educational success. He affirmed that the relative richness of the environment affect the cognitive development of children in school. Sulloway (2001) showed that the eldest children in families tend to develop slightly higher Intelligent Quotient (IQs) than their younger siblings. This could be a consequence of parents spending more quality time with firstborn children than with subsequent children. However, Rodger, Cleveland, Vander Oord & Rowe (2000) and Price (2000) have a divergent view on birth order and achievement of students. Using National Longitudinal Survey on Youths in USA, they found that there was no relationship between birth order and academic achievement of students. The findings of Vonderheide (1978) and Warnick (2008) also showed that there was no correlation between birth order and grade point average (GPA) of college students."}, {"section_title": "Statement of the problem", "text": "The poor performance of students in integrated science, despite its importance in nation's scientific and technological advancement, has been a concern to researchers in the field of science education, especially a developing country like Nigeria. A lot of factors had been identified in literature to be responsible for the low academic achievement of students' in integrated science. This paper therefore attempted to identify the predictive power of some factors on academic achievement of students in integrated science in Nigeria. To address this problem, the following research questions were raised:\n1. Is there any relationship among the selected student variables of gender, school type, socio-economic status, Birth order, (Biology, Physics, Chemistry, and Mathematics) and academic performance of first year NCE students in Integrated science? 2. What are the relative contributions of the selected variables to the prediction of the first year NCE students' achievement in Integrated Science?"}, {"section_title": "METHOD", "text": "The study adopted an ex-post-facto research design. Mouly (1970) described ex-post design as a relatively questionable type of quasi-experimental design in which a particular attribute of a given group is investigated with a view to identifying its antecedents. The targeted population for the study consisted of all the Integrated Science year one students in College of Education, Ikere Ekiti, Ekiti State, Nigeria. Stratified random sampling technique was used in selecting 280 students from all the courses with Integrated Science combinations. These comprisede Physics\\Integrated science, 45students, Chemistry\\Integrated science, 45students, Computer science\\ Integrated science, 45students, Geography\\Integrated science, 45students, Mathematics\\Integrated science, 45students and Biology\\Integrated science, 55students. Two instruments were used for the study. The first instrument was an inventory format developed by the researchers to collect data relating to the students' academic records in the Examinations and Records Division of the college. The format consisted of data on the Senior Secondary School Certificate Examination (SSSCE) and National Examination Council (NECO) results of students in Mathematics, Biology, Chemistry and Physics and First Year CGPA in Integrated science. The performance of students in SSSCE and NECO grades in Mathematics, Biology, Chemistry, and physics were transformed from discrete data into continuous data through secondary analysis. The second instrument was a Questionnaire which consisted of the items relating to the students' biodata such as the type of secondary school attended by the students, (whether private or public), their status in their families, (whether Firstborn, Middle born or lastborn), accessibility to internet in their homes, and availability of family library, computer, television and personal integrated science textbooks. These factors were considered as measures of students' socio-economic status (SES). The instruments were ascertained for face, content and construct validities by two experts in the field of Test and Measurement and a curriculum studies specialist, all from Ekiti State university, Ado-Ekit, Nigeria while the internal consistency of the instruments was ensured using alpha Cronbach (KR 20) method and the result yielded 0.77 which was considered high enough for this study."}, {"section_title": "RESULTS AND DISCUSSION", "text": "Research Question 1: Is there any relationship among the selected student variables of gender, school type, socio-economic status, Birth order, biology, physics, Chemistry, and Mathematics and academic performance of first year NCE students in integrated science? .484 1 Key: CGPA = Cumulative Grade Point Average; SCHLTYP = School type; SES = socio-economic status; BRTHORD = Birth order; PHY = Physics; BIO = Biology; CHM = Chemistry; MAT = Mathematics. Table 1 shows the strength of the relationship between students' CGPA and gender, CGPA and school type, CGPA and SES, CGPA and birth order, CGPA and physics, CGPA and biology, CGPA and chemistry and CGPA and mathematics; school type and gender, SES and gender, birth order and gender, physics and gender, biology and gender, chemistry and gender, and mathematics and gender; SES and school type, birth order and school type, physics and school type, biology and school type, chemistry and school type, and mathematics and school type. The analysis revealed that, at p< 0.05, there were positive and moderate relationships between students' CGPA and gender, school type, SES, birth order, physics, biology and mathematics as well as between gender and school type, birth order, biology and mathematics. This is also the same with school type and SES , physics and biology and between physics and biology and chemistry and mathematics. However, positive and low relationship existed between CGPA and chemistry, gender and SES; between gender and physics, chemistry; between school type and birth order, chemistry mathematics, as well as between SES and birth order, physics, biology, chemistry and mathematics. Table 2 shows the summary of the regression analysis of the selected variables. The table revealed that the entire eight variables considered in this study yielded a multiple correlations coefficient of 0.583 and a standard error of 0.706. This implies that, on the average, the predicted achievement of first year college students in integrated science at NCE level will deviate from the true value by 0.706 limit of that measure. This table further indicates that there was a positive and moderate linear correlation (0.382) between the sets of the independent variables and dependent variable. The Table also shows that all the eight independent variables jointly and independently contributed 42.5% of the total variance in students' academic achievement in integrated science. Table 3 shows the analysis of variance of the multiple regressions. The table reveals that the F-ratio of 2.927 and a significant value of .000* which indicate that all the eight independent variables, that is, gender, school type, socio-economic status, birth order, physics, biology, chemistry and mathematics have positive and significant relationship with the academic achievement of college students in integrated science."}, {"section_title": "Research Question 2:", "text": "What are the relative contributions of the selected variables to the prediction of the first year NCE students' achievement in integrated Science? Kim (2007) whose studies showed that Ordinary Level scores in Physics, Chemistry, Biology, Mathematics and UME scores correlate significantly with candidates' CGPA. Furthermore, 42.5 % of the total variance of students' academic achievement in Integrated Science is accounted for by the linear combination of the eight independent variables when taken together. Of all the eight variables, school type has the highest contribution to the student's academic achievement while chemistry showed the least contribution to the academic achievement of students in Integrated Science. The analysis further showed that school type was the best predicator among the eight independent variables while gender showed the least predictive power to the students' academic achievement in Integrated Science at the college level. The findings are in line with the studies of Lee & Burkhan (2002) and National Association of Independent Schools (NAIS) (2005) who observed that the type of school attended by students has significant and predictive influence on students' academic achievement.\nBased on the findings of this study, it is recommended that science teachers should intensify their efforts in teaching of science subjects at the secondary school level while regular seminars and orientations should be organised for science teachers by local, state and federal governments and other stakeholders in education in order to enhance better performance of students in integrated science at higher level of institution. It is also recommended that parents should consider the school type that would enhance better academic performance of their children or wards."}]