[{"section_title": "INTRODUCTION", "text": "Among older Americans, volunteering is common and strongly associated with good health outcomes including better function and lower mortality. [1][2][3][4][5][6][7][8][9] Volunteering may be particularly appealing to older adults, with 24% of Americans over 65 reporting some volunteer work in 2009. [10] Thus, volunteering may be a widely acceptable way to engage retirees to be more physically, mentally and socially active. [1,11] Because volunteering appears to benefit both older adults who volunteer and the charitable organizations that receive the volunteers' efforts, there has been increasing research [1,8,12] and government support for volunteering with 2 recently enacted federal laws. In 2006, the Older American's Act was reauthorized, charging the Department of Health and Human Services' Administration on Aging to support and enhance older Americans' volunteer opportunities. [13] In April 2009, the Serve America Act was signed into law, expanding volunteer opportunities for Americans age 55 or older. [14] A fuller understanding of the association between volunteering and mortality could guide the design of future volunteer opportunities and help insure access to those most likely to benefit. [15] Driving status may be an important factor to consider when examining the volunteeringmortality relationship for two reasons. First, driving remains the primary mode of transportation for older adults [16] and the cessation of driving leads to decreased out-ofhome activity, including decreased volunteering. [17] Since driving status is also strongly associated with mortality, [18] accounting for driving status may help explain the volunteering-mortality relationship. [19] Second, driving cessation leads to decreased social integration and social ties. [20] Since one proposed mechanism for the health benefits of volunteering is through increased social integration, [4,5,7,8] driving status may also alter the volunteering-mortality relationship through its effect on social integration. Despite these relationships, previous studies on the relationship between volunteering and mortality have not accounted for driving status. Thus, our objective was to examine the effect of driving status on the relationship between volunteering and mortality in a national, population-based sample of US retirees over 65. We accounted for a wide range of factors which may confound this relationship, including demographic variables, chronic conditions, health behaviors, function, geriatric syndromes, socioeconomic status and psychosocial factors. Finally, the importance of driving may vary between elders in rural and urban settings due to differences in the availability of alternate means of transportation. [21,22] Thus, we evaluated whether relationships between volunteering, driving, and mortality differed among elders in rural versus urban settings."}, {"section_title": "METHODS", "text": ""}, {"section_title": "Participants", "text": "We studied community-dwelling participants interviewed in the 2000 and 2002 waves of the Health and Retirement Study (HRS), a nationally representative sample of all persons in the contiguous US. Data were collected primarily through telephone interviews, with an overall response rate of 81%. [23] A total of 8017 participants over age 65 were interviewed in 2000 and 2002 for the HRS. We excluded participants who reported not being completely retired (1600), or if critical data needed for the analysis were missing such as 2002 volunteer activity (4) or 2006 vital status (5). Our final analytic sample consisted of 6408 retirees with 1423 individuals (22%) dying by 2006."}, {"section_title": "Analytic Strategy", "text": "Factors such as depression and physical function may both confound and modify the relationship between volunteering and mortality. For example, elders who are depressed may be less likely to volunteer and more likely to die, suggesting that depression confounds the volunteering-mortality relationship and thus should be adjusted for. However, volunteering may lead to lower mortality in part by improving depression; [24,25] if this is the case, adjusting for depression would lead to over-adjustment (inappropriately minimizing the role of volunteering by adjusting for factors on the causal pathway). To adjust for possible confounding factors while decreasing the chances of over-adjustment, we utilized the longitudinal design of the HRS and used 2002 primary predictor data (volunteering, driving status and urban/rural designation) but used 2000 data for possible confounding factors. By adjusting for factors that precede the primary predictors, we decreased the chances of adjusting for factors on the causal pathway since a 2000 factor cannot directly mediate a relationship between a 2002 predictor and 2006 outcome. Although some predictors were similar between 2000 and 2002, this analytic strategy has been used successfully in previous volunteering studies [5,26,27] and is more likely to yield unbiased results than using predictor and confounding factor data from a single year."}, {"section_title": "Measures: Outcome", "text": "The primary outcome was death by December 31, 2006. We assessed mortality using the HRS follow-up procedures, which entailed cross-referencing HRS information with the National Death Index. [23] Measures: Primary Predictors Volunteer activity and driving status were ascertained by self-report in 2002. To determine volunteer activity, subjects were asked, \"Have you spent any time in the past 12 months doing volunteer work for religious, educational, health-related or other charitable organizations?\" To determine driving status, subjects were asked, \"Are you able to drive?\" and \"Do you limit your driving to nearby places, or do you also drive on longer trips?\" Because non-drivers and drivers who limited their driving had very similar results, our primary analysis combines limited and non-drivers into a single group. We used retirees' county of residence in 2002 and the Beale rural-urban continuum codes to determine whether each retiree lived in an urban (county within metropolitan area with greater than 1 million population) or rural setting (all other counties). [28] "}, {"section_title": "Measures: Possible Confounding Factors", "text": "Factors that may confound the relationship between volunteering and mortality were ascertained by self-report in 2000. For demographics, participants were asked about their age, gender, race and ethnicity and marital status. For chronic conditions, participants were asked, \"Have you ever had, or has a doctor told you, that you have/had X?\" with follow-up questions to gauge the severity of disease. We examined a total of 7 conditions with up to 3 levels of severity: hypertension, diabetes mellitus, cancer, chronic lung disease, heart disease, congestive heart failure and stroke. For smoking, participants were asked, \"Have you ever smoked cigarettes?\" and \"Do you smoke cigarettes now?\" Participants were asked about their weight and height, which allowed us to calculate body mass index (BMI). For geriatric syndromes, participants or their proxy were asked about memory, falls, incontinence, pain, eyesight and hearing in 2000 with follow up questions to gauge the severity of the geriatric syndrome. For functional limitations, participants were asked \"Because of a health or memory problem, do you have any difficulty with X?\" in 2000. Difficulties in 5 activities of daily living (ADL: bathing, dressing, eating, transferring and toileting); 5 instrumental activities of daily living (IADL: shopping, preparing meals, using the telephone, managing medications and managing finances) and walking were determined. For socioeconomic status (SES) in 2000, participants were asked about the highest educational degree that they obtained, their annual income and net wealth. [29] Because of the positively skewed nature of these variables, we categorized wealth and income into quintiles for analysis. For psychosocial factors in 2000, we assessed depressive symptoms using a modified 8-item Center for Epidemiologic Studies-Depression (CES-D) Scale. [30,31] Participants were asked \"Did you feel depressed much of time during the past week?\" Similar questions explored other depressive symptoms including restless sleep, feelings of loneliness and sadness, decreased energy and enjoying life. We also asked participants, \"Would you say your health is Excellent, Very Good, Good, Fair or Poor?\" In our bivariate analysis of these potential confounding factors, we found that falls, incontinence, pain, visual impairment, ADLs and income were not associated with mortality at the p<0.2 level. These factors were not included in the final model. Missing data for confounders were rare, with all variables more than 98.7% complete."}, {"section_title": "Statistical Analysis", "text": "Using multivariate logistic regression, we determined the relationship between volunteering and 4-year mortality. We conducted analyses stratified by driving status to obtain point estimates of the relationship between volunteering and mortality in drivers versus volunteering and mortality in limited or non-drivers. To determine an unadjusted measure of association between volunteering and 4-year mortality, our initial multivariate models only accounted for demographic factors. Our fully adjusted models also accounted for chronic condition and health behaviors, geriatric syndromes, function, socioeconomic status (SES) and psychosocial factors that were associated with our mortality outcome at the p<0.2 level in our bivariate analysis. To test the statistical significance of differences between these estimates, we ran a single model using driving and the driving-volunteering interaction term as covariates. Because we hypothesized that the ability to drive may have a stronger effect in rural settings with fewer alternate transportation options, we also performed analyses stratified by urban/rural status. Because of our concerns about residual confounding, we augmented our primary analyses with a propensity score analysis. [32,33] We determined the propensity of each subject of being a volunteer through logistic regression using the covariates from our primary analysis. We divided subjects into quintiles of propensity [34,35] and found that in the lowest propensity quintile, there were very few volunteers (n=57) compared to non-volunteers (n=1225). We omitted the lowest propensity quintile from further analysis [32,33] and compared volunteers to non-volunteers (stratified by driving status) adjusting for propensity of volunteering along with our other covariates. As a sensitivity analysis, we performed our propensity score analysis including the lowest propensity quintile and found that our results were similar to our lowest quintile excluded propensity analysis. Thus, we present our propensity score analysis with the lowest quintile of propensity score subjects excluded. All statistics were performed using Stata MP software (version 10.0; Stata Corporation, College Station, TX). The Committee on Human Research of the University of California, San Francisco and the San Francisco Veterans Affairs Research and Development committee approved this study."}, {"section_title": "RESULTS", "text": ""}, {"section_title": "Characteristics of the Participants", "text": "Volunteers had a more favorable risk factor profile than non-volunteers across virtually every measure examined. (Table 1) For example, compared to non-volunteers, volunteers were less likely to smoke, to have diabetes mellitus and to have poor memory. Volunteers were more likely to have earned a college degree and have higher wealth. Volunteers also were more likely to report excellent or very good overall health and no depressive symptoms. Volunteers were less likely to report being a limited or non-driver at 44% compared to 71% of non-volunteers who reported being a limited or non-driver. Compared to limited or non-drivers, drivers were more likely to be male, married and white. Drivers were less likely to report pain or visual impairment and more likely to report no functional difficulties. Drivers were also more likely to have earned a college degree, more likely to report no depressive symptoms and live in a rural setting."}, {"section_title": "Demographic Factor Adjusted Volunteering-Mortality Relationship, Stratified by Driving Status", "text": "When we examined the volunteering-mortality relationship stratified by driving status, among limited or non-drivers, volunteers had a markedly lower mortality rate of 15% compared to 32% for non-volunteers (p<0.001). (Figure 1) However, among drivers who reported no limitations, volunteers had only a slightly lower mortality rate of 9% compared to 12% for non-volunteers (p=0.01)."}, {"section_title": "Multivariable Adjusted Volunteering-Mortality Relationship, Stratified by Driving Status", "text": "Next, we examined the effect of accounting for other factors on the volunteering-mortality relationship and how this association may differ between older adults who drive versus those who limit their driving or do not drive altogether. We first just adjusted for demographic factors (age, gender, race and ethnicity, marital status), we found that in all subjects, volunteering was strongly associated with lower mortality, with an OR of 0.45 (95% CI: 0.38 -0.53). (Table 2) However, when we stratified by driving status, we found that the volunteering-mortality relationship differed dramatically between drivers and limited or non-drivers. In limited or non-drivers, volunteering remained strongly protective, with an OR of 0.44 (95% CI: 0.36 -0.55) but in drivers, volunteering was not significantly protective, with an OR of 0.81 (95% CI: 0.61 -1.08). The p-value to assess the relationship between driving and volunteering was determined through an interaction term (driving x volunteering) and was highly significant at 0.002. When we accounted for other factors beyond demographic variables, the differences between drivers versus limited or non-drivers persisted. (Table 2) Thus, we found that among drivers, volunteering was not protective when accounting for all other factors with an OR for mortality of 0.90 (95% CI: 0.66 -1.22). In contrast, among limited or non-drivers, volunteering remained strongly protective even after accounting for all other factors with an OR for mortality of 0.62 (95% CI: 0.49 -0.78). For the fully adjusted model, the p-value for interaction approached significance at 0.05. Propensity adjustment did not alter our results substantially, with volunteering continuing to be more protective in limited or non-drivers (OR 0.68, 95% CI: 0.53 -0.86) than drivers (OR 0.89, 95% CI: 0.64 -1.23). We then examined whether the differences in the volunteering-mortality relationship between drivers versus limited or non-drivers were affected when stratified further by urban/ rural status. ( Table 3) We found that driving was more important to consider for rural subjects than urban subjects with greater differences between drivers and limited or non-drivers. In urban subjects, after full multivariable adjustment, there was no significant difference in the association between volunteering and mortality for drivers versus limited or non-drivers (p-value for interaction 0.81), suggesting that in urban subjects, the volunteering-mortality relationship was similar in drivers and limited or non-drivers. In contrast, in rural subjects, there were significant differences in the association between volunteering and mortality between drivers versus limited or non-drivers (p-value for interaction 0.02), suggesting that in rural subjects, volunteering was more protective in limited or non-drivers."}, {"section_title": "DISCUSSION", "text": "In a population-based sample of US retirees over age 65, we found that volunteering was strongly associated with lower mortality in limited or non-drivers, with an adjusted OR for mortality of 0.62 (95% CI: 0.49 -0.78). In contrast, volunteering was not associated with lower mortality in drivers, with an adjusted OR for mortality of 0.90 (95% CI: 0.66 -1.22). These findings suggest that the decreased mortality seen in volunteers are concentrated in US retirees who limit their driving or are unable to drive altogether. When we examined these relationships in urban and rural settings, we found that the differences in the volunteering-mortality relationship between drivers versus limited or non-drivers were more pronounced in rural retirees (p-value for interaction of 0.02) than in urban retirees (p-value for interaction of 0.81). Our results suggest that any future expansion of national and community service should include older adults who have limited access to volunteer opportunities due to their inability to drive. One possible explanation for our findings is that limited or non-drivers are more likely to be socially isolated, with volunteer activity in these retirees leading to relatively large improvements in social integration, ultimately resulting in decreased mortality. Conversely, for drivers, because they are able to drive to maintain social relationships with family and friends, their level of social integration even without volunteering may be sufficient, leading to minimal decreases in mortality from the additional social integration from volunteering. Previous studies on the effects of social integration on health outcomes have suggested a threshold effect, where additional integration below a threshold was beneficial but further social integration beyond that threshold did not lead to further improved outcomes. [4,7,8,36] Even without volunteering, retirees who are able to drive may be above this threshold of social integration, so that the additional social integration from volunteering does not lead to substantial decreases in mortality. Our urban/rural results provide further evidence for social integration as an important factor in the volunteering-mortality relationship. Driving is often required for an active social life, especially in rural areas where there are fewer alternative transportation options. [21,37] Thus, we hypothesized that driving would be more important to consider in rural areas compared to urban areas. Our results showing that the differences between limited or nondrivers versus drivers were greater in rural subjects compared to urban subjects confirmed our hypothesis and suggest that social integration is an important factor in the volunteeringmortality relationship. This is of particular policy importance give that rural areas generally have a higher proportion of older residents than urban areas. [38] Given the many differences in risk factors between volunteers and non-volunteers, it is likely that some of the observed association between volunteering and mortality is due to residual confounding. However, we accounted for a wide range of possible confounding factors, including subjective factors such as overall self-rated health which have been previously shown to be strongly associated with our primary predictors and outcomes, [39][40][41] making it less likely that our results are entirely due to residual confounding. Second, if volunteering and driving status are simply measures of the same underlying factor such as overall health, it is unlikely that the volunteering-mortality relationship would differ by driving status since both volunteering and driving status would identify the same subjects with marginal overall health. Our results have several practical implications. First, organizations with older volunteers should ensure that volunteer opportunities are available to all older Americans, regardless of their ability to drive. For example, volunteer organizations could partner with elder mobility services or provide ride sharing opportunities to make it easier for non-driving retirees to volunteer, ensuring that volunteering opportunities are available to those retirees most likely to benefit from volunteering. Supporting volunteer activity among non-driving retirees who may be at highest risk for social isolation will minimize the chances that an expansion of volunteering opportunities will exacerbate existing disparities. [42] Second, our results support continued investment in mass transportation, as well as the zoning and development of mixed use neighborhoods that would allow elders to remain socially integrated without driving. [43] Naturally Occurring Retirement Communities [44,45] and Beacon Hill Village [46] are specific models of senior living where the physical environment and services are tailored to allow non-driving elders to maintain an active social life that includes volunteering. Third, our results suggest that rural retirees may be especially vulnerable to isolation and adverse outcomes if they are unable to drive. Rural communities should consider increasing access to volunteering opportunities as they address the broader zoning and transportation challenges posed by an increasing number of older people with limited ability to drive themselves. Our study has several limitations. First, like almost all studies on volunteering, most of our information was obtained through self-report. For some factors such as pain, depressive symptoms and overall self-rated health, self-report is the gold standard. For other factors such as chronic conditions and function, previous studies have suggested that self-report is a valid and reliable way to measure these risk factors. [47,48] Second, we were unable to directly measure social integration; thus, we were unable to test whether social isolation is a critical mediating factor between driving status and mortality. However, previous studies have shown strong associations between driving, social integration and mortality. [4,[17][18][19][20] Furthermore, driving status may be easier to measure than social integration and mobility services provide a possible remedy to driving cessation, facilitating the translation of research findings such as ours into policy recommendations. Third, our decision to use 2000 and 2002 data required us to only include retirees who were alive and participating in the HRS study in both years, enriching our cohort with survivors. Because the use of 2000 and 2002 data allowed us to minimize the chances of over-adjustment, we believe the advantages of our approach outweigh the disadvantages. Fourth, since we were unable to account for access to healthcare and previous studies have suggested that healthcare access may be more problematic in rural areas, [49,50] our urban/rural results may be due in part to differences in healthcare access between urban and rural retirees. Future studies should explicitly account for healthcare access as a possible mechanism of the volunteeringmortality relationship. Finally, our observational study design precludes conclusions regarding causality. Thus, although our study provides supporting evidence for the beneficial effects of volunteering, questions regarding a causal relationship between volunteering and mortality must await an ongoing randomized trial. [1,11] We found that volunteering was associated with lower 4-year mortality in US retirees who are limited or non-drivers and that this association was most pronounced among rural retirees. Our results suggest that the expansion of volunteer opportunities could lead to improved health and quality of life for American retirees, especially if recruitment and retention efforts supported access for rural, non-driving elders. The next federal transportation funding bill and the anticipated reauthorization of the Older Americans' Act in 2011 provide an important opportunity to increase access to volunteer opportunities, along with other opportunities for social integration, for older Americans who are limited drivers or do not drive.   "}, {"section_title": "4-Year Mortality Rates by Volunteer and Driving Status", "text": ""}]