[{"section_title": "Abstract", "text": "The seasonal variations and the interactions of the water masses in the tropical Pacific off central Mexico (TPCM) and four surrounding areas were examined based on an extensive new hydrographic database. The regional water masses were redefined in terms of absolute salinity (S A ) and conservative temperature (Q) according to the Thermodynamic Equation of Seawater 2010 (TEOS-10). Hydrographic data and the evaporation minus (precipitation 1 runoff) balance were used to investigate the origin and seasonality of two salinity minima in the area. The shallow (50-100 m) salinity minimum originates with the California Current System and becomes saltier as it extends southeastward and mixes with tropical subsurface waters while the surface salinity minimum extends farther north in the TPCM in summer and fall because of the northward advection of tropical surface waters. The interactions between water masses allow a characterization of the seasonal pattern of circulation of the Mexican Coastal Current (MCC), the tropical branch of the California Current, and the flows through the entrance of the Gulf of California. The seasonality of the MCC inferred from the distribution of the water masses largely coincides with the geostrophic circulation forced by an annual Rossby wave."}, {"section_title": "Introduction", "text": "The main hydrographic characteristics of the northeastern tropical Pacific (NETP) were summarized by Fiedler and Talley (2006) . Nevertheless, the large spatial scale considered in their study missed important features of subbasin scale like the tropical Pacific off central Mexico (TPCM). Smaller-scale studies in this region used hydrographic data that covered only restricted areas (Roden 1972; Castro et al. 2000 Castro et al. , 2006 Godínez et al. 2010; León-Chávez et al. 2010 Durazo 2015) or are not focused on water masses (Cepeda-Morales et al. 2013) . The scarcity of data in the TPCM, in comparison with the available amount of historical data in surrounding areas like the California Current System or the Gulf of California, has hindered the characterization of the circulation and the water masses in this region.\nThe TPCM is a region with complex dynamics (Kessler 2006) . At seasonal scale, the circulation in this area is dominated by the confluence of the equatorwardflowing tropical extension of the California Current [hereinafter called the tropical branch of the California Current, as in Godínez et al. (2010) ] and the polewardflowing Mexican Coastal Current (MCC; Lavín et al. 2006; Gómez-Valdivia et al. 2015) . The latter has been found to be controlled by an annual long Rossby wave forced locally by the wind stress curl and remotely by radiation from the coast . The poleward flow of the MCC corresponds to the cyclonic phase of this annual Rossby wave, but there are no studies to date that have described its complete seasonal and interannual variation. In the mesoscale, the dynamics of the TPCM are dominated by intense eddy activity (Kurczyn et al. 2012 (Kurczyn et al. , 2013 Lavín et al. 2013 ). This current pattern, including the continuous exchanges through the entrance of the Gulf of California (Collins et al. 2015) , govern the spatial distribution and temporal variability of the water masses in the TPCM. In the upper layer of 1000-m depth these are Pacific Intermediate Water (PIW), Subtropical Subsurface Water [StSsW; also known as Subtropical Underwater (StUW; O'Connor et al. 2002; Fiedler and Talley 2006) ], California Current Water (CCW), Gulf of California Water (GCW), and Tropical Surface Water (TSW; Wyrtki 1966; Castro et al. 2006; Lavín et al. 2009; León-Chávez et al. 2010 Fiedler and Talley 2006) . We preferred the name StSsW over StUW to emphasize the Southern Hemisphere origin of this water mass that reaches the TPCM with specific biogeochemical features as the minimum content of oxygen. Instead, the StUW is a more general term that includes the StSsW but refers to the waters formed by subduction in the vicinity of the subtropical gyres in the Pacific and Atlantic Oceans.\nAccording to McDougall and Barker (2011) , absolute salinity (S A ) and conservative temperature (Q) corresponding to the Thermodynamic Equation of Seawater 2010 (TEOS-10), must be used in scientific publications instead of practical salinity (S p ) and potential temperature. The S A (which is measured in SI units, grams per kilogram) takes into account the spatially varying composition of seawater. It has an effect on the horizontal density gradient and, therefore, on all the calculations derived from this quantity (e.g., geostrophic velocity or heat transport using the thermal wind relation). In addition, conservative temperature Q represents more accurately the heat content per unit mass of seawater. Those are important improvements of the TEOS-10 definition compared with the former 1980 International Equation of State (EOS-80).\nBased on a complete seasonal cycle, we have defined new limits of the water masses and revised their interactions in the TPCM and four surrounding areas for the first time under the TEOS-10 standard. From the distribution of water masses, we have outlined the circulation in the TPCM at seasonal scale. These results provide an updated scenario for further studies involving distribution of properties and biogeochemical processes."}, {"section_title": "Data and methods", "text": "The study area (Fig. 1, top) was divided into five regions according to their typical hydrographic characteristics as follows: Tropical, TPCM, Transition, Gulf of California, and California Current System (CCS). We delimited the CCS, Gulf of California, and Tropical areas as being ultimate source areas of some of the water masses involved in this study, while the Transition area and the TPCM are areas of water with characteristics intermediate between the surrounding water masses (Fig. 1,  bottom panels) . The presence of the coast (in contrast with the Transition area) and the convergence of three different circulation regimes carrying different water masses on a seasonal basis, make the TPCM a distinct transitional region, worthy of a separate designation. In addition, keeping the designation of this region as in previous recent works Cepeda-Morales et al. 2013; León-Chávez et al. 2010 allows comparison of the results, which improves the background for future studies in the area.\nWe used profiles from CTDs, hydrographic bottle data, and profiling floats obtained from the World Ocean Database 2013 (WOD13; https://www.nodc.noaa.gov/OC5/ WOD13/data13geo.html), plus CTD data from 45 cruises of different sources carried out between 1992 and 2015. The latter represent 23% of the total casts but reach up to 70% of the casts in the TPCM. In addition, we have used surface temperature and salinity data collected with a thermosalinograph by the NOAA/Southwest Fisheries Science Center as described by Philbrick et al. (2001) . The timeline of the number of casts in each area (Fig. 2) shows that, although the number of samples has increased in the last two decades, the data are quite evenly distributed throughout the record in all five areas. To reduce biases induced by the spatial heterogeneity in the number of casts, we averaged all the data spatially in cells of 0.258 3 0.258 for all levels down to 1000-m depth, then we plotted the quarterlies of the climatology of the Q-S A diagrams within each subarea and mapped the Q, S A and depth of the 25 kg m 23 isopycnal. Potential temperature and practical salinity (S p ) were converted into Q and S A according to TEOS-10. The observed variables S p , temperature, and pressure (p), together with longitude (u) and latitude (l), are used to first calculate S A and then Q using the Gibbs-SeaWater (GSW) Oceanographic Toolbox (McDougall and Barker 2011; http://www.teos-10. org/software.htm). The S A is expressed in terms of S p (IOC/SCOR/ IAPSO 2010):\nThe reference salinity (S R ) corresponds to the mass fraction of solute in standard seawater with the same conductivity as the sample, and dS A is the S A anomaly as a function of longitude, latitude, and pressure. This dS A is not observed but is estimated using an algorithm that relates the density calculated from S p to the density measured in the laboratory through the relationships between dS A and silicate concentrations (McDougall et al. 2012) . Conservative temperature Q is defined as the potential enthalpy divided by the fixed ''heat capacity,'' c "}, {"section_title": "21", "text": ". It can be calculated from in situ temperature (McDougall et al. 2012 ).\nWe calculated the mixed layer depth following the method of Kara et al. (2000) . We determined the density variation (Ds t ) from a corresponding DQ criterion of 0.28C in the equation of state. We chose this criterion for being able to compare our results with the mixed layer depth obtained from satellite data (not shown). We found agreement between both datasets.\nThe evaporation minus precipitation data were provided by Saha et al. (2010) . These are 6-hourly gridded products of data reanalysis from 1979 to 2010 with a spatial resolution of 0.58 3 0.58 of latitude and longitude. Those are among the most reliable data with relatively high resolution that are widely used by the geophysical community. Since it is not possible to obtain evaporation from only observational data, we consider that these reanalysis data work well for our purposes.\nThe river discharge was obtained from GRDC (2015) . From these data we calculated the monthly climatology of the evaporation 2 (precipitation 1 runoff) [E 2 (P 1 R)] averaged in each subarea.\nWe used satellite altimetry data to obtain the geostrophic velocities from the climatological maps of sea level anomalies (MSLAs) in the whole study area. The altimeter products were produced by SSALTO/Duacs and distributed by AVISO, with support from CNES. We calculated the annual signal of the MSLA as follows:\nwhere X 5 (x, y) is the position of the measurement, A a is the annual amplitude, u a is the annual phase, v is the annual radian frequency, and t is the time in months. From this annual signal of the MSLA, we obtained the geostrophic velocity through the thermal wind relation.\n, which is found between 50-and 75-m depth (Fig. 6 ), associated with a potential density anomaly of 25 kg m 23 (Fig. 3 ).\nIn contrast with the mixed nature of the upper water column, the water between 100 and 200 m in the TPCM is mostly of tropical origin, as indicated by the similarity of the salinity profiles in the Tropical and the TPCM areas (Fig. 6) . In summer, this similarity extends to ;400-m depth (Fig. 6c) , but the rest of the year, below approximately 250 m, the TPCM matches the salinity profile of the Gulf of California."}, {"section_title": "Results and discussion", "text": ""}, {"section_title": "a. Water masses limits", "text": "The conversion of the water masses limits to TEOS-10 supposed an increase of around 0.2 g kg 21 in the S A regarding the former S p (in EOS-80), while Q was 0.18C greater than its corresponding potential temperature only in the case of the TSW (because of its relatively low salinity and high temperature). After the conversion to TEOS-10, we made no changes in the definition of the GCW. In contrast, it was necessary to diminish the S A limits of PIW by 0.1 g kg 21 to include its characteristic relative salinity minimum of ;34.7 g kg 21 (34.6 in EOS-80). To avoid the overlap between the water masses definition and to facilitate their differentiation, we also shifted the S A limits of the StSsW to match the PIW on their lowest extreme and the GCW on the highest. Given the extension of our database, we were able to redefine the limits of the TSW and the CCW (Table 1) for both of which differing definitions existed. The seasonal currents pattern in the NETP produces mixing between these two water masses and therefore transitional characteristics (Figs. 1a-d, bottom panels) that complicate their definition in this area. Previous studies in the TPCM Lavín et al. 2009; Cepeda-Morales et al. 2013 ) based their classification of these water masses on the work of Torres Orozco (1993) . In this thesis work, performed in the Gulf of California, the author unified different existing criteria (e.g., Wyrtki 1967; Warsh et al. 1973; Álvarez-Borrego and Schwartzlose 1979; Bray 1988; Robles and Marinone 1987) for the water masses limits, based on their characteristics in the Gulf rather than in their source areas. The improved resolution of our database allowed us to use the characteristics of the water masses observed in their ultimate source area and to consider the complete seasonal cycle to establish their limits. Quarterly plots of Q-S A and their spatial average at standard depths in the surroundings of the TPCM (Fig. 3) show a unimodal branch of cold and low-salinity water in the CCS corresponding to the CCW. Our data revealed that its old limits (Torres Orozco 1993; Castro et al. 2006; Lavín et al. 2009 ) were too narrow to include the complete range of the observations in the first 150 m of the water column in the CCS; therefore, we broadened the CCW temperature limits to 108-218C [the maximum temperature limit, in agreement with León-Chávez et al. (2010) ]. We also set the lower temperature limit of the TSW to 258C in agreement with Fiedler and Talley (2006) and the S A equal to the CCW (Table 1) . Consequently, despite their similar low salinities, these two water masses are now well differentiated by their temperature (Fig. 3) . The former definition of the TSW confused this distinction; some authors treated transitional waters as TSW, which has produced misleading conclusions about the arrival of southern tropical waters into the CCS and the Gulf of California Lavín et al. 2009 ).\nb. Water masses in the upper water column"}, {"section_title": "1) SURROUNDINGS OF THE TROPICAL PACIFIC OFF CENTRAL MEXICO", "text": "In the CCS, the Q-S A profile exhibits a seasonal behavior in the first 50 m. The mixed layer has its maximum depth in all five areas in winter, especially in the CCS where its mean reaches ;45 m ( Table 2) . The E 2 (P 1 R) monthly climatology (Fig. 4) shows a high net evaporation in the CCS during winter that makes the waters in the mixed layer (;0-50-m depth) relatively salty and cold.\nThe highest coastal upwelling rate in the CCS occurs in spring (Kurczyn et al. 2012 ). This upwelling, combined with an especially strong equatorward flowing California Current, can explain the observed lowest \ntemperature and salinity of the year (Fig. 3b ) and the CCW reaching the surface in the whole CCS (Fig. 1b) . In summer and fall, the surface CCW is confined to the northern section of the CCS while the southern part is occupied by waters transitional between the CCW and TSW with some mainly summer contribution of GCW (Figs. 1c,d ). The presence of some TSW in the CCS in summer is indicative of poleward advection (Figs. 1c, 3c ). The water in the Gulf of California presents two branches: one of them contains mainly GCW, the most saline water in the NETP (S A . 35.1 g kg 21 ); the other presents salinity values usually lower than 35.1 g kg 21 and represents the mixing among GCW, CCW, and TSW, reflecting the seasonally variable exchanges at the entrance of the Gulf (Castro et al. 2000 Lavín et al. 2009; Collins et al. 2015) . In winter (Fig. 3a) , a low salinity and the lowest surface temperature of the year (Lavín et al. 2009, their Fig. 2 ) suggest a mixture between CCW and GCW at the entrance of the Gulf of California (Fig. 1a) . This mixing persists through spring, when the increased poleward flow of the tropical branch of the California Current reaches the Gulf after passing the tip of the Baja California peninsula. This is suggested by the shape of the left branch of the water in the Gulf of California, which shows traces of the shallow salinity minimum typical of the CCW (Fig. 3b) . In the spring season GCW leaves the Gulf along its eastern coast while the inflow of CCW takes place along the western shore (Fig. 1b) . In summer, the highest temperature and minimum salinity of the year (Fig. 3c) indicate the presence of water transitional between TSW and GCW (Fig. 1c) entering the Gulf of California along its eastern side, while GCW leaves the Gulf on the west side. The net input of freshwater into the Gulf of California (Fig. 4) is due to coastal runoff (not shown) and acts to reduce the salinity during the summer season. However, the shallowness of the mixed layer in this area (Table 2) confines this effect to, at most, the first 20 m of the water column. Our results, in contrast with Castro et al. (2006) , do not show the presence of TSW in the Gulf of California during fall (Fig. 3d) . This disagreement is due to the differing definition of the TSW limits in the two studies.\nThe Tropical area, at the surface, is characterized by the presence of only TSW, the least saline water mass (S A ; 33 g kg 21 for the whole year) in the NETP. In summer and fall, when precipitation greatly exceeds evaporation (Fig. 4) , S A diminishes and a surface isothermal layer (;298C) becomes evident, mostly in summer, in the first 30 m of the water column (Fig. 3c) .\nFrom 30-to 50-m depth, below the mixed layer (Table  2) , the salinity increases and the temperature decreases drastically. Net evaporation makes the TSW relatively saltier in winter and spring (Figs. 3a,b ). In addition, in spring the presence of waters of transition between GCW and TSW ( Fig. 3b ) along the coast of the Tropical area (Fig. 1b) suggests an equatorward flow that brings saltier waters into the Tropical area (Fig. 3b) . The Transition area receives CCW from the northwest and tropical waters from the southeast during the whole year (Figs. 1a-d and Fig. 3) ; their mixing strongly characterizes this area. Although Durazo (2015) suggested the presence of the warm and salty Subtropical Surface Water near the Pacific coast of Baja California, we did not find any clear signature of this water either in the transition area or in the CCS, but it is possible that it occurs during strong interannual events like El Niño when poleward flow along the eastern boundary is enhanced (Strub and James 2002) . Instead, the net evaporation throughout the year in the Transition area would explain the saltier nature of its waters in the surface, compared with their source areas."}, {"section_title": "2) TROPICAL PACIFIC OFF CENTRAL MEXICO", "text": "The confluence of different currents (Lavín et al. 2006; Godínez et al. 2010 ) characterizes the TPCM as a region with a large proportion of waters transitional between TSW, CCW, and GCW in the surface layer that extends to the first 50-75 m of the water column. The relative importance of each water mass varies on a seasonal basis, as inferred from their surface distribution in Fig. 1 (bottom) . The quarterly plots of Q-S A in the TPCM (Fig. 5) suggest a mixture between similar proportions of TSW, CCW, and GCW (Fig. 5a) in winter. This season shows the minimum surface temperature, as in the Gulf of California, Transition, and Tropical areas, indicative of regional seasonal cooling. However, there is little presence of the warm TSW in due to E 2 (P 1 R) in each area.\nthe southeast side of the TPCM (Figs. 1a, 5a ). In spring, the maximum surface salinity occurs when the GCW enters the TPCM (Figs. 1b, 5b ) and evaporation exceeds precipitation (Fig. 4) . The presence of CCW is augmented in this season between ;30-and 150-m depth (Fig. 5b) . In summer, net precipitation (Fig. 4) and the great influx of TSW produce a pronounced surface salinity minimum accompanied by the highest temperature of the year in the first 20 m of the water column (Fig. 5c ). This is approximately the mixed layer depth in both the TPCM and the Tropical area (Table 2) , which makes it difficult to separate the relative importance of advection and freshwater input on the presence of the salinity minimum in the TPCM. This minimum continues, but weakens, through fall when the presence of TSW is still important (Figs. 1d, 5d ) but evaporation exceeds precipitation (Fig. 4) ."}, {"section_title": "c. Water masses in subsurface and intermediate layers", "text": "In the Transition, TPCM, and Gulf of California areas, the water between 400 and 1000 m is entirely PIW (Figs. 3, 5) . The salinity profiles at standard depths for the five subareas (Fig. 6) show a relatively fresher PIW in the CCS and saltier PIW in the Tropical area that suggest the influence of the North Pacific Intermediate Water and the Antarctic Intermediate Water, respectively, as defined by Fiedler and Talley (2006) .\nSubsurface water from 75 to 400 m corresponds to StSsW. This water mass is quite invariable throughout the year and is associated with a relative salinity maximum located between 150-and 250-m depth (Fig. 6 ). This salinity maximum is fresher and deeper to the west: it ranges from ;34. "}, {"section_title": "OCTOBER 2016 P O R T E L A E T A L .", "text": "and it is always higher than in the TPCM, so it must have a local origin, different than the StSsW. Some authors (Álvarez-Borrego and Schwartzlose 1979; Lavín and Marinone 2003) reported the formation of this subsurface, salty water by the subduction of salty and cold surface waters in the upper Gulf of California during winter. We found this feature to extend throughout the year, especially in summer, when the strong poleward flow into the Gulf at the surface can be associated with a corresponding increased outflow in the subsurface that would bring the salty subsurface water into the southern Gulf of California.\nIn the CCS we found the deepest StSsW (initial depth ; 150 m), while the CCW occupies most of the water column above 150 m. The CCW is marked by the shallow salinity minimum of ;33.5 g kg"}, {"section_title": "d. Shallow salinity minimum", "text": "The shallow salinity minimum associated with the fresh waters of the northern CCS was first mentioned in the early works of Wyrtki (1966 Wyrtki ( , 1967 . From 358N, 1248W this minimum became saltier and denser as it was transported southwestward by the California Current and encountered the saltier Subtropical Surface Water (Reid 1973) . Our data show that in the CCS, the salinity reaches a minimum of ;33.5 g kg 21 around the 25 kg m 23 isopycnal (Fig. 3 ), between 50-and 100-m depth, throughout the year (Fig. 6) . The seasonal distribution of Q, S A , and depth on the 25 kg m 23 isopycnal (Fig. 7) shows that near the tip of the Baja California peninsula (238N) the tropical branch of the California Current turns to the southeast and brings CCW into contact with the saltier and warmer tropical waters. This tropical-subtropical convergence (Roden 1972) produces throughout the year a sharp temperature and salinity front that extends in the alongshore direction from the CCS to the southeast (Fig. 7 , left and center panels). The shallow salinity from its source area to the southeast (Figs. 6 and 7, center panels). Warsh et al. (1973) argued that the shallow salinity minimum in the entrance of the Gulf of California was a mixture of subsurface CCW and TSW, but the latter is too shallow (see Table 1 ) and overlays waters too low both in density and in salinity to modify the minimum as observed (Fig. 3) . Below the TSW, between 50-and 100-m depth, on the isopycnal of 25 kg m 23 , we found tropical waters, saltier (Fig. 7, center panels) but warmer (Fig. 7 , left panels) than the CCW. These subsurface waters that modify the salinity minimum are composed of StSsW and transitional waters, warmer than the StSsW that overlay them in the water column (Fig. 3) . In the TPCM, the shallow salinity minimum is governed by the seasonality of the tropical branch of the California Current and the MCC. In winter, the minimum vanishes since the salinity decreases gradually from its maximum at 150-m depth to the surface (Fig. 6a) . From spring to fall it is present, but in summer the great influx of TSW turns the shallow salinity minimum into a barely detectable relative minimum (Fig. 6c) . Lavín et al. (2009) found the shallow salinity minimum extended as far as 258N into the Gulf of California. Our observations showed traces of it in the Gulf during summer and fall (Figs. 6c,d \narrival of CCW below the surface layer (Figs. 3, 7) . Nevertheless, the presence of this minimum associated with one of the branches of the Gulf waters was also evident in winter and mostly in spring (Figs. 3a,b) . This is indicative of the continual exchange between the CCS and the Gulf of California. In the Tropical area, the shallow salinity minimum is absent (Fig. 6 ) because the CCW never reaches that far south (Fig. 7, center panels) ."}, {"section_title": "e. Circulation in the TPCM and surrounding areas", "text": "Based on the distribution of the water masses arriving from the surrounding areas, we were able to describe the seasonality of the circulation pattern in the TPCM. The advection of TSW and transitional waters between CCW and GCW into the TPCM is indicative of the seasonal variations of the MCC and the tropical branch of the California Current.\nThe annual signal of the climatology of the surface geostrophic velocity in the study area is shown in Fig. 8 for the period April-September. The circulation from October to December can be deduced as the opposite of Fig. 8 ; this annual signal of the circulation in this area represents around 90% of the explained variance (not shown). Between January and June (winter and spring), the circulation pattern is equatorward from the northwest through the TPCM. It reverses between July and December (summer and fall) when a nearshore current flows poleward through the TPCM (Fig. 8) .\nThis pattern of circulation agrees with the arrival of transitional waters between CCW and GCW into the surface TPCM from the northwest during winter and spring (Figs. 1a,b) and of TSW from the Tropical area in summer and fall (Figs. 1c,d ). Previous works (Kessler 2006; Godínez et al. 2010, their Fig. 12) found that the physical mechanisms that force this pattern of circulation are the local wind stress curl and a long Rossby wave radiated from the coast. The poleward-flowing MCC is superimposed with the anticyclonic phase of this Rossby wave. In summer and fall the MCC flows poleward through the Tropical area and the TPCM as far as the entrance of Gulf of California (Figs. 1c, 5c) .\nThe flow through the entrance of the Gulf of California occurs continuously and dominates the mesoscale variability in this area ; however, at least at the surface, we observed also a seasonal pattern. The circulation inside the narrow Gulf of California is difficult to resolve with altimeter data because of the intrinsic difficulties that affect the corrections applied to these data near the coast (Saraceno et al. 2008) . For this reason we consider the altimetry-derived circulation not reliable enough inside the Gulf, and we blanked this area in Fig. 8 . However, there are some features about the circulation through the Gulf of California that can be inferred from the analysis of water masses. In spring, there is a strong equatorward outflow that transports water from the Gulf of California through the TPCM to the southeast. The alongshore nature of this equatorward flow is suggested in Fig. 1b . This outflow occurs on the eastern side of the Gulf, while an inflow of water from the CCS takes place on the western side (Fig. 1b) . In summer, in turn, the outflow of GCW to the CCS occurs on the western side of the Gulf, while the eastern side receives the inflow of TSW by the MCC (Fig. 1c) . In the subsurface, the coincidence in the salinity profiles of the Gulf of California and the TPCM throughout the year (Fig. 6) suggests a permanent outflow from the Gulf of California to the TPCM below 250-m depth (400-m depth in summer). However, our results are not conclusive on this matter, and further analysis would be necessary to determine unequivocally the subsurface and deep circulation pattern through the entrance of the Gulf of California at seasonal scale.\nAlong with the MCC and the exchanges through the entrance of the Gulf of California, the tropical branch of the California Current also reaches the TPCM; this southeastward flow is present in the mean circulation at annual scale (not shown). Water with low Q and S A , characteristics of the CCW, extends from the CCS, through the Transition area to the TPCM the whole year (Fig. 7) . Based on the presence of CCW in the TPCM (Fig. 5) , the tropical branch of the California Current is stronger in spring and fall. This is in agreement with the findings of Cepeda- Morales et al. (2013) .\nThe depth of the 25 kg m 23 isopycnal (Fig. 7 , right panels) reflects some typical features of the circulation pattern in the complete study area. In winter and spring, the deepening of the isopycnal in the Tropical area coincides with the intensified anticyclonic circulation around the Tehuantepec Bowl during these seasons. In addition, the northern edge of the strong cyclonical circulation around the Costa Rica Dome in summer and fall (Kessler 2006 ) produces a shoaling of the isopycnal in the southeast corner of the Tropical area (Figs. 7i,l) . The shoaling of the isopycnal along the coast of the TPCM in winter and spring (Figs. 7c,f) can be explained by the intensification of the upwelling events around Cabo Corrientes during the first half of the year. In contrast, the stronger anticyclonic eddy generation in summer (Kurczyn et al. 2012 ) produces a slight downwelling trend off Cabo Corrientes that is reflected by the local deepening of the isopycnal in this region (Fig. 7c) . The effect of this vertical advection reinforces the other processes affecting the water masses distribution in the TPCM [advection and E 2 (P 1 R)]. They all produce an increase of the temperature and a decrease of the salinity at the surface in summer and the opposite effect in winter and spring, as shown in Fig. 5 . The coast of the Baja California Peninsula is a region of permanent upwelling (Durazo 2015 ) that reaches its maximum in spring (Kurczyn et al. 2012) . It is reflected in the presence of a sharp gradient of the 25 kg m 23 isopycnal depth in the across-shore direction in the CCS."}, {"section_title": "Concluding remarks", "text": "This study of the seasonality of the water masses in the TPCM and four surrounding areas has shown that no water masses are formed in the TPCM, so its hydrographic characteristics depend on the interaction of the surrounding water masses and provide information of the current pattern in the regional circulation scheme. In the upper water column, the TPCM receives CCW the whole year, GCW in spring, and TSW mainly in summer and fall (Fig. 5) . Between 100-and 200-m depth the TPCM seems to receive mainly tropical waters, while below 250-m depth (400 m in summer) this area shows the same characteristics as the Gulf of California (Fig. 6) , indicating a possible permanent outflow in the subsurface. We found two important hydrographic features that demonstrate the importance of salinity as a tracer of the circulation. The first is the shallow salinity minimum detected in the CCS, which becomes saltier as the tropical branch of the California Current transports CCW southeastward and mixes with tropical subsurface waters. This shallow salinity minimum becomes weakly evident in the Gulf of California mainly in summer and fall, while it is always absent from the Tropical area. The second is the surface salinity minimum associated with OCTOBER 2016 P O R T E L A E T A L .\nthe TSW. The poleward-flowing MCC brings this minimum from the Tropical area through the TPCM as far north as the entrance of the Gulf of California in summer and fall. The disappearance of the surface salinity minimum in winter and spring is consistent with the weakening and subsequent reversal of the MCC and provides new evidence of its seasonal nature. Our water mass characterizations, based on a new extensive hydrographic database with improved spatial and temporal resolution, provide an improved background for future interdisciplinary studies in this area. The current regime inferred from the water mass variations largely coincides with the general circulation reported in previous studies (Kessler 2006; Godínez et al. 2010; Kurczyn et al. 2012 ) and provides new information on the seasonality of the flows reaching the TPCM from the surrounding areas. These results highlight the role of the TPCM as a key region in this tropical-subtropical convergence system and the usefulness of high-resolution hydrographic data as a tool to describe the regional circulation."}]