[{"section_title": "Abstract", "text": "We investigated whether minority children attending U.S. elementary and middle schools are disproportionately represented in special education. We did so using hazard modeling of multiyear longitudinal data and extensive covariate adjustment for potential child-, family-, and state-level confounds. Minority children were consistently less likely than otherwise similar White, English-speaking children to be identified as disabled and so to receive special education services. From kindergarten entry to the end of middle school, racial-and ethnic-minority children were less likely to be identified as having (a) learning disabilities, (b) speech or language impairments, (c) intellectual disabilities, (d) health impairments, or (e) emotional disturbances. Language-minority children were less likely to be identified as having (a) learning disabilities or (b) speech or language impairments."}, {"section_title": "", "text": "R acial-, ethnic-, and language-minority schoolchildren in the United States have repeatedly been reported to be overidentified as disabled and so disproportionately overrepresented in special education (e.g., Artiles, 2003; Dunn, 1968; Harry, Arnaiz, Klinger, & Sturges, 2008; Oswald, Coutinho, Best, & Singh, 1999; Sullivan & Bal, 2013) . These findings have led to characterizations of special education as \"discriminatory\" (Skiba, Poloni-Staudinger, Simmons, FegginsAzziz, & Chung, 2005, p. 142) , having \"systemic bias\" (Oswald, Coutinho, Best, & Nguyen, 2001, p. 361) , constituting \"a new legalized form of structural segregation and racism\" (Blanchett, 2006, p. 25) , and \"another manifestation of institutionalized racism\" (Codrington & Fairchild, 2012, p. 6) . Federal legislation and policies have been enacted to reduce minority disproportionate representation (MDR) in special education (e.g., Posney, 2007 ; U.S. Department of Education, Office of Civil Rights, 2009). For example, the U.S. Congress observed that \"more minority children continue to be served in special education than would be expected from the percentage of minority students in the general school population\" (p. 118 of Statute 2651, Public Law 108-446).\nLocal educational agencies (LEAs) are currently required to report to the U.S. Department of Education whether minority children are significantly overrepresented in special education. If overrepresentation is observed, the LEAs are required to allocate 15% of their Part B funds for early intervening services to children from minority groups being overidentified as disabled. The federal government is currently considering enacting further compliance monitoring policies (Government Accountability Office, 2013; U.S. Department of Education, 2014). Calls are also being made to strengthen existing monitoring policies (Skiba, Albrech, & Losen, 2013) , including requiring LEAs to report any disproportionality instead of reporting disproportionality resulting only from incorrectly applied procedures or policies (Albrecht, Skiba, Losen, Chung, & Middelberg, 2012) ."}, {"section_title": "Contradictory Explanations and Evidence of Minority Disproportionate Representation", "text": "Yet existing theoretical and empirical work is contradictory as to whether minority children in the United States are disproportionately represented in special education. Some mechanisms have been theorized to result in overidentification (e.g., Harry et al., 2008) ; others in underidentification (e.g., Coll, Crnic, Lamberty, & Waski, 1996; . Some empirical studies find that minority children are overidentified as disabled (e.g., Oswald, et al., 1999; Sullivan & Bal, 2013) . Others find that minority children are underidentified (e.g., Hibel et al., 2010; Morgan, Farkas, Hillemeier, & Maczuga, 2012; Morgan, Staff, Hillemeier, Farkas, & Maczuga, 2013; Shifrer, Muller, & Callahan, 2011; Sullivan, 2013) as well as less likely to be referred for services (Delgado & Scott, 2006) . Below, we briefly survey this contradictory theoretical and empirical work. We then identify methodological and substantive limitations in the existing empirical studies to justify the current study.\nMechanisms theorized to result in racial-, ethnic-, and language-minority children being overrepresented in special education include cultural, linguistic, and racial bias. For example, minority children are believed to experience systemic prejudice that results in their abilities and behaviors being unjustifiably characterized as problematic and atypical (Coutinho & Oswald, 2000; Harry et al., 2008; Hays, Prosek, & McLeod, 2010; Lorsen & Orfield, 2002; O'Connor & Fernandez, 2006) , resulting in segregation into special education (Blanchett, 2006; Reid & Knight, 2006) . 1 Prior to possibly becoming sensitive to minority overrepresentation, teachers may have been more likely to refer minority students for special education (e.g., Hosp & Reschly, 2003) , although early evidence of this tendency is also contradictory (Skiba et al., 2008; Tobias, Cole, Zibrin, & Bodlakova, 1982; Tobias, Zibrin, & Mennell, 1983) . Schools have been theorized to use academic and behavioral standards aligned more with White, English-speaking, middle-class, privileged populations (Blanchett, Klingner, & Harry, 2009 ). Racial-, ethnic-, and language-minority children may be less likely to meet these standards as a result of receiving lower-quality educations provided at underresourced schools (e.g., Peske & Haycock, 2006) and so more likely to be identified for special education. Minority children in the United States are also more likely to be exposed to biological and environmental factors in early childhood (e.g., fetal alcohol syndrome, low birth weight, lead exposure, poverty) that disproportionately increase their risk for impaired cognitive, academic, and behavioral functioning and disability (Annie E. Casey Foundation, 2014; Donovan & Cross, 2002; Mann, McCartney, & Park, 2007) .\nConsistent with mechanisms theorized to result in overrepresentation, Skiba et al.'s (2005) analyses of cross-sectional statelevel data and statistical control for school-and district-level confounds indicated that Black and Hispanic children were overrepresented in special education. This was the case for multiple disability conditions, including intellectual disabilities, emotional disturbances, speech or language impairments, and learning disabilities. Oswald et al.'s (1999) analyses of cross-sectional, nationally representative, and district-level data with statistical control for district-level educational, economic, and demographic confounds indicated that minorities were overrepresented in special education. Minority children were overidentified as having intellectual disabilities and emotional disturbances. Sullivan and Bal's (2013) cross-sectional analyses of an urban school district and statistical control for child-and school-level potential confounds indicated that Black children were more likely to be identified for special education services. Follow-up analyses indicated that Black children were overidentified for learning disabilities, although they were no more likely than White children to be identified as having cognitive impairments, speech or language impairments, other health impairments, or emotional disturbances and were underidentified as having intellectual disabilities. Samson and Lesaux's (2009) analyses of a nationally representative, longitudinal data set with statistical control for individual-and family-level potential confounds indicated that language-minority children were overrepresented in special education by third grade, although they were underrepresented during both kindergarten and first grade. Sullivan and Bal (2013) also reported that Hispanic children were underrepresented in special education.\nOther mechanisms have been theorized to result in racial-, ethnic-, and language-minority children being underrepresented in special education Morgan, Farkas, et al., 2012; Rosenberg, Zhang, & Robinson, 2008; Samson & Lesaux, 2009) , including socioeconomic, linguistic, and/or cultural obstacles that constrain access by minority families to special education services (Danesco, 1997; Coll et al., 1996; Harry, 1992; O'Hara, 2003; Pena & Fiestas, 2009 ). Some minority families may prefer to rely on the social support of extended families to assist their children and so may not agree to evaluation requests for special education (Coll et al., 1996) . Cultural factors may also result in some minority groups attributing their children's perceived lower academic behavioral functioning to systemic prejudice or other nonbiological explanations (Danesco, 1997; Yeh, Forness, Ho, McCabe, & Hough, 2004; Yeh, Hough, McCabe, Lau, & Garland, 2004) . The stigma associated with disability identification may further reduce a racial-, ethnic-, or language-minority family's willingness to have their child identified as disabled (Hervey-Jumper, Dougan, & Franco, 2008; O'Hara, 2003; Zuckerman et al., 2014) , particularly for conditions considered highly stigmatizing (e.g., intellectually disabled). Minority families may experience fewer interactions with pediatricians and other health professionals who often diagnose disorders (e.g., autism) during early childhood (Palfrey, Singer, Walker, & Butler, 1987) . This may occur as a result of less access to health care (Flores & Committee on Pediatric Research, 2010; Inkelas, Raghavan, Larson, Kuo, & Ortega, 2007) as well as language barriers (Flores & Tomany-Korman, 2008; Zuckerman et al., 2014) . Children attending disadvantaged schools may also be less likely to be identified as displaying atypical academic or behavioral functioning (Delpit, 1995) . For example, Hibel et al. (2010) theorized that minority children experience \"frog pond\" effects in regard to special education eligibility. Specifically, attending poorly resourced schools may result in referrals for special education only for those children displaying unusually low academic achievement or behavior relative to other, lowerperforming children attending these same schools.\nConsistent with mechanisms posited to result in underrepresentation, Hibel et al.'s (2010) analyses of a nationally representative sample followed from kindergarten entry to the end of fifth grade indicated that, following extensive statistical control, Black, Hispanic, and Asian children were less likely to receive special education services than otherwise similar White children. Follow-up analyses indicated that minority children were less likely to be identified as having learning disabilities, speech or language impairments, and intellectual disabilities. Morgan, Farkas, et al.'s (2012) analyses of a population-based, longitudinal sample of preschool-age children found that those who were Black or from homes where a language other than English was spoken were less likely than otherwise similar White children or those from English-speaking homes to be identified as having developmental delays or disabilities. Shifrer et al.'s (2011) analyses of a nationally representative sample of high school students with statistical control for individual-, family-, and school-level potential confounds indicated that Blacks were less likely than otherwise similar Whites to be identified as having learning disabilities. Yeh, Forness, et al.'s (2004) analyses of a large sample of children receiving mental health services with statistical control for child-and family-level factors indicated that Hispanic children were less likely to receive special education services as a result of being underidentified as having emotional disorders."}, {"section_title": "Extant Empirical Work's Methodological and Substantive Limitations", "text": "Methodological factors may help explain these contradictory directional estimates. Studies of minority disproportionate representation have often failed to account for potential confounding factors prior to estimating minority children's risk of being identified as disabled (Donovan & Cross, 2002; MacMillian & Reschly, 1998) . Examples of child-, family-, and school-level factors that might confound estimates of minority children's risk of disability identification include being born at very low birth weight (Grunau, Whitfield, & Davis, 2002) , being raised in poverty (Blackburn, Spencer, & Read, 2013; Costello et al., 1996; Emerson, Einfeld, & Stancliffe, 2011) , receiving lowerquality (e.g., fewer language-based interactions) parenting and being raised in lower-resourced home environments (Altarac & Saroha, 2007; Costello et al., 1996) , experiencing multiple risk factors (Myers & Pianta, 2008; Shaw, Owens, Giovannelli, & Winslow, 2001) , and the state of residence (Wiley & Siperstein, 2011) . Most of the extant studies either have not adjusted for these potentially confounding factors or have done so using school-or district-level averages (e.g., Oswald et al., 1999; Skiba et al., 2005; Sullivan, 2011; Talbott, Fleming, Karabotsos, & Dobria, 2011) , thereby introducing substantial measurement error into the resulting directional estimates (Harwell & LeBeau, 2010) .\nThe relatively fewer studies using extensive covariate adjustment consistently find that racial-, ethnic-, and language-minority children are instead underidentified as disabled (e.g., Hibel et al., 2010; Morgan et al., 2013; Morgan, Farkas, et al., 2012; Shifrer et al., 2011; Yeh, Forness, et al., 2004) . Covariate adjustment has sometimes resulted in the estimates reversing direction from over-to underrepresentation Shifrer et al., 2011) . Estimates reported by those education researchers using extensive covariate adjustment for child-, family-, and school-level control variables are also consistent with estimates reported by public health researchers, who often use covariate adjustment when investigating disparities in disability identification and treatment (for a review, see Flores & Committee on Pediatric Research, 2010) . For example, children who are Black have been found to be less likely to be diagnosed with autism, learning disabilities, and attention-deficit/hyperactivity disorder following covariate adjustment for IQ, prior academic achievement and behavior, maternal education, and additional factors (e.g., Bussing, Zima, Gary, & Garvan, 2003; Mandell, Listerud, Levy, & Pinto-Martin, 2002; Morgan et al., 2013; Pastor & Reuben, 2005) . Furthermore, those minorities who receive a diagnosis have been reported to be disproportionately less likely than otherwise similar White children to make use of empirically based treatments for their disorders .\nAdditional methodological and substantive limitations characterize the extant empirical work. Very few studies have investigated MDR longitudinally . Thus, the over-time dynamic of MDR and whether this dynamic is consistent with mechanisms theorized to result in over-or underrepresentation continues to be poorly understood (Hibel & Jasper, 2012 ). Yet the likelihood of disability identification is not a static, single-point-in-time event but instead occurs over time as children age. The lack of longitudinal studies also limits statistical control for time-varying control variables (Finkel, 1995) . Relatively few studies have estimated minority children's risk of disability identification across multiple conditions. Instead, the available studies typically report estimates of the children's risk of receiving special education services generally (e.g., Samson & Lesaux, 2009) or for only a single condition (e.g., Hibel & Jasper, 2012; Morgan et al., 2013; ). Yet the directionality of MDR may vary across specific disability conditions (Donovan & Cross, 2002; Sullivan & Bal, 2013) . It is also unclear whether and to what extent disproportionate representation across specific disability conditions differs between children who are racial or ethnic minorities and those who are language minorities. It may be that any observed disproportionate representation for language-minority children is specific to languagerelated disorders (e.g., learning disabilities, speech or language impairments) as a result of the children's lower proficiency in English and the lack of availability and use of proper diagnostic assessments for these specific types of disorders (Figueroa & Newsome, 2006; Hibel & Jasper, 2012; Linan-Thompson, 2010) . In contrast, sociocultural factors might result in children who are racial or ethnic minorities experiencing disproportionality more generally across a wider range of disorders (Coll et al., 1996; Danesco, 1997; Harry, 1992; O'Hara, 2003) . Primary school-age children who are language minorities have also been hypothesized to be initially underidentified as having disabilities but then overidentified as teachers begin attributing the children's lower achievement to factors other than limited English proficiency (Hibel & Jasper, 2012; Samson & Lesaux, 2009) . Whether this dynamic is evident following extensive statistical control and whether it continues to occur throughout middle school has yet to be investigated (Samson & Lesaux, 2009 ). Collectively, these methodological and substantive limitations have resulted in substantial ambiguity as to whether racial-, ethnic-, and language-minority children in the United States are over-or underidentified as disabled, including whether this disproportionality varies by disability condition. Establishing the directionality of minority disproportionate representation in special education would have far-reaching implications for U.S. educational policy, research, and practice. For example, finding that racial-, ethnic-, and language-minority children in the United States are less likely than otherwise similar White, English-speaking children to be identified as disabled and so are comparatively underrepresented in special education would suggest that federal legislation and policies currently designed to reduce minority overrepresentation in special education may be misdirected. These policies instead may be exacerbating educational inequities by limiting minority children's access to potentially beneficial services to which they may be legally entitled."}, {"section_title": "Study's Purpose", "text": "We systematically investigated whether and to what extent racial-, ethnic-, or language-minority children in the United States were over-or underidentified as disabled relative to otherwise similar White, English-speaking children as they attended elementary and middle schools. To address methodological and substantive limitations in the existing knowledge base, we (a) analyzed longitudinal data collected on a nationally representative sample followed from kindergarten entry to the end of middle school, (b) used hazard modeling to estimate over-time dynamics of disability identification across five specific conditions, and (c) extensively corrected for child-and family-level variables that might confound the directional estimates of disproportionality uniquely attributable to children's status as racial, ethnic, or language minorities. Collectively, these analyses should yield rigorously derived estimates of the likelihood that racial-, ethnic-, or language-minority children in the United States are disproportionately over-or underidentified as having disabilities throughout elementary and middle school and so whether they are more or less likely to be receiving special education services than otherwise similar White, English-speaking children."}, {"section_title": "Method", "text": ""}, {"section_title": "Sample Description", "text": "The study's sample included children participating in the Early Childhood Longitudinal Study-Kindergarten Cohort, 1998 -1999 Tourangeau, Lê, Nord, & Sorongon, 2009 ). The ECLS-K is a nationally representative cohort of U.S. schoolchildren who entered kindergarten in the fall of 1998 and were then surveyed during the spring of kindergarten, fall and spring of first grade (with data from only a random subsample collected during the fall of first grade), and the springs of third, fifth, and eighth grade. Data were collected from children, parents, and teachers. Our hazard modeling analyzed data from a sample of 20,100 kindergarten children with complete information on race/ethnicity, gender, and age at the fall-of-kindergarten survey wave. Table 1 displays the means of the study's criterion and predictor variables. Additional detail regarding the ECLS-K's study design is available from the National Center for Education Statistics (NCES; see http://nces.ed.gov/ecls/kindergarten.asp). Our analyses were weighted to produce results generalizable to the population of U.S. schoolchildren who entered kindergarten in 1998 and who continued through school until at least to the end of eighth grade."}, {"section_title": "2", "text": ""}, {"section_title": "Variables of Interest", "text": "Disability categories. We identified students receiving special education services as a result of having one of five Individuals with Disabilities Education Act (IDEA)-eligible disabilities. In kindergarten and in first, third, fifth, and eighth grades, a child's special education teacher was asked, \"For which of the following disabilities did this student receive special education or related services this school year?\" Response options included (a) learning disability, (b) speech or language impairment, (c) mental retardation, (d) health impairment (e.g., attention-deficit/hyperactivity disorder, Tourette's syndrome), and (e) serious emotional disturbance.\n3 These five disability categories were the most frequently identified reasons why children were receiving special education services in the ECLS-K. The percentage of all children participating in the ECLS-K with these IDEA-eligible identified disabilities ranged from a high of 6.4% (speech or language impairment) to a low of 0.7% (intellectual disability)\nTime-invariant measures. Parents reported on their child's gender and race/ethnicity. We analyzed four racial and ethnic categories. These were (a) Hispanic, (b) non-Hispanic Black, (c) nonHispanic White, and (d) other race/ethnicity (e.g., including Asian, American Indian, Alaskan Native). The mother's marital status was reported in fall kindergarten.\nThe mother's age at the time of birth was calculated from the child's and mother's ages recorded at the date of interview in spring of kindergarten. We considered mothers as being younger mothers if they gave birth when they were 17 years old or younger. We considered mothers as being older mothers if they gave birth when they were 39 years old or older. Parents reported whether the child was born at low birth weight (i.e., less than 5 lbs.) and whether the child had health insurance. We used whether a language other than English was the language spoken during the ECLS-K home interview as an indicator of languageminority status. 4 We also included the ECLS-K's multivariate measure of the family's socioeconomic status (SES). This included the mother's and father's education levels and occupations along with household income. To allow for nonlinear effects of SES, our analyses used dummy variables for SES quintiles. Dummy variables for the states of the children's schools were also included as controls. Sample members were drawn from almost all states. These time-invariant variables were measured during the spring of kindergarten.\nTime-varying measures. The frequencies of children's externalizing and self-regulatory behaviors were rated independently by their general education teachers in kindergarten and first, third, and fifth grades using the Social Rating Scale (SRS). The SRS is a modified version of the Social Skills Rating Scale (SSRS; Gresham & Elliott, 1990) , a psychometrically validated behavioral measure. The test-retest correlation of the original SSRS was .85 (Gresham & Elliott, 1990) . Correlational and factor analyses support the measure's construct validity (Feng & Cartledge, 1996; Furlong & Karno, 1995) . NCES subsequently modified the SSRS (e.g., adding some items, expanding the response format from a 3-point to a 4-point scale; Pollack, Atkins-Burnett, Najarian, & Rock, 2005) . Teachers used a frequency scale to rate how often children in their class displayed a particular social skill or behavior (i.e., 1 = never; 4 = very often). The Externalizing Problem Behaviors subscale measured the frequency of a child's acting-out behaviors, including how frequently the child argued with a teacher, fought, showed anger, acted impulsively, and disturbed the classroom. This subscale's reliabilities ranged from .86 to .89 across the survey waves. The Approaches to Learning subscale measured how frequently a child self-regulated and managed his or her behavior while completing classroom tasks. These self-regulatory behaviors included how well a child paid attention, kept belongings organized, worked independently, showed eagerness to learn new things, easily adapted to changes in routine, and persisted in completing tasks. This subscale's reliabilities ranged from .89 to .91 across the survey waves. We averaged the ratings if more than one teacher provided them in a given year. The SRS was not administered in eighth grade. To statistically control for the frequency of an eighth-grade child's self-regulatory and externalizing problem behaviors, we imputed the two SRS subscale ratings obtained from the prior (i.e., fifthgrade) survey wave. Prior work has established that elementary schoolchildren's behavioral functioning is stable over time (e.g., Lin et al., 2013; Shaw, Lacourse, & Nagin, 2005) .\nDuring each survey wave, children's academic achievement was estimated by averaging their scores from general measures of both their reading and mathematics achievement. Each of these two achievement tests was individually administered, untimed, and extensively psychometrically validated. Scores on the measures are relative to those of all other children participating in the ECLS-K. Item response theory and routing procedures were used for both measures to maximize academic content coverage and to obtain scale scores specifically designed by NCES to be comparable across the ECLS-K's survey waves. The Reading Test evaluated a range of reading skills across time (e.g., sight word reading, decoding, vocabulary, reading comprehension). After first grade, the emphasis on basic reading skills was decreased, and greater emphasis was given to reading comprehension skills.\nAll items were field-tested. Theta reliabilities for the kindergarten to eighth-grade assessments ranged from .87 to .96 (NCES, 2009) . As an indication of construct validity, the Reading Test scores of first-grade students correlated at .85 or above with their scores on the Kaufman Test of Educational Achievement Reading subtest (Rock & Pollack, 2002) . The Mathematics Test evaluated a wide range of skills over time (e.g., place value, ordinality, sequence, basis operations, measurement, fractions). Reliabilities of the Mathematics Test's theta scores are in the mid .90s for each of the assessment waves (NCES, 2009; Pollack et al., 2005) . As with the Reading Test, there was little differential item functioning, nor was there evidence of floor or ceiling effects. We standardized scores on the time-varying measures for ease of interpretation."}, {"section_title": "Analytical Method", "text": "We used discrete-time logit (hazard) regression models for event history analysis to identify factors predicting children's identification as disabled from kindergarten to eighth grade (Singer & Willet, 2003) . Importantly, we estimated separate regressions for each of the five disability diagnoses under study. (Each of these is a dichotomous variable for diagnosed with the particular disability or not.) These diagnoses are mutually exclusive at each time point. These models estimated the hazard of a child being identified with the specific disability being examined, conditional upon not having been previously identified with this specific disability. Once identified, the child was censored from the sample for this specific disability condition but not from the regressions for the other disability conditions. Thus, for example, if a child was diagnosed with speech or language impairment in first grade, then that child was censored from the subsequent speech-or-language-impairment condition regressions in third, fifth, and eighth grades. However, the child may subsequently have been identified for another disability condition (e.g., learning disability, emotional disturbance) in the regressions for the other four disability conditions. Thus, children's risk for disability identification was fully modeled across the five disability conditions and time periods examined. Hazard models are advantageous over models that predict disability identification at only a single time point. This is because hazard models more appropriately model disability identification as a dynamic, over-time process. These models measure the duration until diagnosis, thus allowing differential rates of diagnosis for different racial, ethnic, and language-use groups to be appropriately modeled. These models also allow for the use of time-varying covariates. Use of time-varying covariates better corrects for potentially confounding variables occurring at the same time that children were identified as disabled, thereby allowing for more closely matched White, English-speaking children when estimating the risk of being identified as disabled throughout elementary and middle school that is uniquely attributable to children's status as racial, ethnic, or language minorities.\nWe first prepared the data by using SAS 9.3 (SAS Institute, Cary, NC) and then converted the data file to Stata using Version SE 12.1 (StataCorp, College Station, TX). We then modeled the data using the Stata add-on procedure dthaz. We estimated two hazard models for each of the study's five specific disability conditions. For Model 1, we included only race or ethnicity and time as predictors for the specific disability condition. Using time as a predictor allowed us to model the probability of receiving special education services for each of the disability conditions from kindergarten entry to the end of eighth grade. Model 1 results show the relative frequency of disability diagnosis for children from the racial and ethnic groups before these relative frequencies are adjusted for covariates such as individual childlevel academic achievement or behavioral functioning or familylevel SES, which may be associated with disability diagnosis and on which the groups of children differ. In Model 2, we then included additional individual child-and family-level covariates measured in kindergarten, as well as time-varying measures of children's behavioral and academic functioning measured from kindergarten to eighth grade, for each specific disability condition. This relatively large number of control variables was necessary so that our directional estimates of the likelihood of disability identification uniquely attributable to children's status as racial, ethnic, and language minorities were adjusted so as to make the children as otherwise similar as possible. We reported these estimates as odds ratios (ORs). Odds are the ratio of the probability that an event occurs to the probability that it does not. For our estimates of disparities in children's disability identification, the OR is (a) the odds that one particular group (e.g., children who are Black) will experience versus not experience an event (e.g., being identified as having learning disabilities) versus (b) the odds of another group (e.g., children who are White) will experiences versus not experience the same event (see Szumilas, 2010 , for a brief primer). Odds coefficients of 1.0 indicate no effect of the predictor variable on the outcome. Odds above 1.0 indicate a positive effect; those below 1.0, a negative effect. Table 2 shows weighted estimates from the discrete-time logit regression modeling of disability identification for each of the five specific conditions. Model 1's results vary considerably and do not yield any evidence that racial-and ethnic-minority children are statistically significantly overidentified as having disabilities. Instead, and prior to extensive covariate adjustment, Model 1's results indicate that racial and ethnic minorities are underidentified as having speech or language impairments as well as health impairments."}, {"section_title": "Results", "text": "Model 2 extensively adjusts for potentially confounding factors, including family-level SES and individual child-level academic achievement and behavioral functioning. Doing so indicates that racial-and ethnic-minority children are less likely than otherwise similar White children to be identified as having disabilities, and these results are statistically significant. For example, Black children are 58% (covariate adjusted OR = .42), 63% (covariate adjusted OR = .37), 57% (covariate adjusted OR = .43), and 77% (covariate adjusted OR = .23) less likely than otherwise similar White children to be identified as having learning disabilities, speech or language impairments, intellectual disabilities, and health impairments, respectively. Black children are 64% (covariate adjusted OR = .36) less likely to be identified as having emotional disturbances than otherwise similar White children.\nHispanic children are 29% (covariate adjusted OR = .71) less likely than White children to be identified as having learning disabilities, 33% (covariate adjusted OR = .67) less likely to be identified as having speech or language impairments, and 73% (covariate adjusted OR = .27) less likely to be identified as having health impairments. These results indicate that Hispanic children are identified with disabilities more frequently than Black children but significantly less often than otherwise similar White children. Model 2's results also indicate that language minorities are 28% (1 − 0.72) and 40% (1 − 0.60) less likely than otherwise similar children from English-speaking households to be identified as having learning disabilities or speech or language impairments, respectively. However, these children are not significantly more or less likely than other children to be identified as having intellectual disabilities, health impairments, or emotional disturbances.\nModel 2's results also indicate that factors other than children's status as racial, ethnic, or language minorities are associated with their risk of disability identification. Children from families without health insurance are less likely to be identified as having speech or language impairments. Particularly notable as well is that higher academic achievement and greater behavioral self-regulation consistently lower children's likelihood of being identified as disabled. More frequent externalizing problem behaviors decrease children's likelihood of being identified as having learning disabilities or speech or language impairments. These behaviors increase children's likelihood of being identified as having health impairments or emotional disturbances. Collectively, the findings suggest that U.S. schools are likely to identify children as disabled on the basis of their academic achievement, behavioral self-regulation, and externalizing problem behaviors.\nFigures 1 and 2 display the covariate-adjusted hazard and survival functions, respectively, of each of the specific disability conditions. 5 The hazard functions plot the probabilities of being identified for the specific disability condition for the particular time period for those children who have not yet been identified with the specific condition. The survival curves measure, at each time period, the percentage of children who have not as yet been identified with the specific disability condition. Thus, for example, for two groups of 1,000 otherwise similar White and Black children who begin in kindergarten, the survival function indicates that approximately 99% will be estimated not to have been identified with a learning disability by the spring of first grade. In contrast, 97% of the Black children but 94.5% of the White children will have survived not being identified as having learning disabilities by the end of eighth grade.\nThese estimates are adjusted for each condition's Model 2 control variables. Figure 1 shows that young children's likelihood of being identified as having learning disabilities steadily increases and then peaks in fifth grade, after which point it begins to decline. In contrast, children's likelihood of being identified as having speech or language impairments declines steadily over time. Intellectual disabilities display no clear over-time pattern. Children's likelihood of being identified as having health impairments or emotional disturbances increases over time. Some of these rates are very low as a result of relatively low prevalence of the disabilities in the general population of U.S. schoolchildren. Yet the estimated rates also continue to indicate that, after extensive covariate adjustment, Hispanic and Black children are less likely than otherwise similar White children to be identified with disabilities while attending elementary and middle schools in the United States."}, {"section_title": "Discussion", "text": "Contrary to federal legislative and policy efforts to reduce MDR in special education, our study failed to find any evidence that racial-, ethnic-, or language-minority children in the United States are being disproportionately overrepresented in special education. This lack of overrepresentation was evident both prior to and following extensive covariate adjustment. Instead, results from our analyses of longitudinal and nationally representative data consistently indicate that racial-, ethnic-, and language-minority schoolchildren in the United States are less likely than otherwise similar White, English-speaking schoolchildren to be identified as disabled and so are comparatively underrepresented in special education. Minority children's underrepresentation was evident across the entire elementary and middle school time periods. Racial and ethnic minority children in the United States are less likely to receive special education services as a result of being identified as having learning disabilities, speech or language impairments, intellectual disabilities, health impairments, or emotional disturbances. Language-minority children are less likely to be identified as having learning disabilities or speech or language impairments. Our estimates of minority disproportionate underrepresentation were extensively corrected for potential confounding variables, including individual child-level academic achievement and behavioral functioning as well as family-level SES."}, {"section_title": "Limitations", "text": "Our study has several limitations. We are unable to report whether and to what extent minority underrepresentation in FIGURE 1. Plots of covariate-adjusted hazard functions of disability conditions by race/ethnicity special education continues to occur throughout high school. Data collection from the ECLS-K sample ended at the end of eighth grade. We analyzed a single cohort of U.S. schoolchildren. Consequently, we are unable to report on the extent to which federal policies (e.g., the Reading Excellent Act, No Child Left Behind Act) introduced across this same time period may have resulted in changes in disability identification rates. We were unable to report whether minority underrepresentation occurs across other types of IDEA-eligible conditions (e.g., autism, hearing or vision impairments) due to their very low prevalence and resulting extremely small sample sizes in the ECLS-K data set. Our use of a parent's decision to speak a language other than English during the kindergarten home interviews as a proxy for the child's language-minority status may not have included all children who were language minorities. Our study does not allow us to identify the specific mechanisms resulting in the observed disparities. In-depth qualitative studies that identify the mechanisms potentially responsible for minority underrepresentation are needed, including those that systematically interview minority families and school personnel as to the disability identification process (e.g., Skiba et al., 2008; Zuckerman et al., 2014) . Although we controlled for many potential confounding variables, it is possible that unmeasured factors (e.g., IQ, genetic disorders, parenting quality, the home environment) may have contributed to the lower risk we attributed to children's racial-, ethnic-, and language-minority status. However, our inclusion of time-varying measures of academic achievement and behavioral functioning should have helped control for unmeasured factors that may have also contributed to children's disability identification. This is because these unmeasured factors should also be strongly correlated with children's academic achievement and behavioral functioning. Consistent"}, {"section_title": "FIGURE 2. Plots of covariate-adjusted survival functions of disability conditions by race/ethnicity", "text": "with prior work (e.g., Flores, Olson, & Tomany-Korman, 2005; Hibel et al., 2010; Shifrer et al., 2011) , we interpret our findings as evidence of minority underrepresentation in special education. Our findings might instead be interpreted as indicating that White, English-speaking children are overidentified as having disabilities. However, the extant empirical work does not indicate that nonminority children are more likely to display disability-related symptomatology, which might indicate that they are more likely to have disabilities. Instead, prior work reports that minorities are more likely to display disabilityrelated symptomatology and yet, despite this, remain less likely to be identified as disabled, possibly as a result of racial, language, and cultural factors (e.g., Flores & Committee for Pediatric Research, 2010; Miller, Nigg, & Miller, 2009; Morgan, Farkas, et al., 2012) . Our study was designed to evaluate children's likelihood of disability identification and not whether children so identified benefited from the special education services subsequently provided. It is presently unclear whether naturally delivered special education services are effective (Hanushek, Kain, & Rivkin, 2002; Morgan, Frisco, Farkas, & Hibel, 2010) , although there is extensive evidence that researcherdesigned interventions implemented with fidelity result in large gains in academic and behavioral functioning by children with disabilities (e.g., Gage, Lewis, & Stichter, 2012; Gersten et al., 2009; Morgan, Sideridis, & Hua, 2012; Swanson & Hoskyn, 1998 )."}, {"section_title": "Study's Contributions and Implications", "text": "Long-standing and ongoing federal legislation and policymaking have attempted to reduce minority disproportionate overrepresentation in special education. This is because, to date, the extant education research has largely reported that minority children are more likely to be identified as having disabilities. This has led to characterizations of special education as \"discriminatory\" (Skiba et al., 2005, p. 142) , maintaining \"a new legalized form of structural segregation and racism\" (Blanchett, 2006, p. 25) , and constituting \"institutionalized racism\" (Codrington & Fairchild, 2102, p. 6 ). Yet, and despite these characterizations, our analyses of a longitudinal sample of U.S. schoolchildren followed from kindergarten entry to the end of middle school failed to yield any evidence of minority overrepresentation in special education. Instead, and consistent with those few studies by education researchers employing extensive covariate adjustment for individual student-, family-, and school-level variables (e.g., Hibel et al., 2010; Morgan, Farkas, et al., 2012; Shifrer et al., 2011) , as well as with studies by public health researchers who have also used extensive covariate adjustment (Bussing et al., 2003; Flores & Committee for Pediatric Research, 2010; Mandell et al., 2002) , our study's analyses indicated that minority children are underidentified as having disabilities and so are less likely to be receiving special education services than otherwise similar White, English-speaking children in the United States. This study's findings are not consistent with characterizations of special education as racist or discriminatory due to predispositions to label racial-, ethnic-, or language-minority children as disabled in order to segregate them in classrooms separate from their White, Englishspeaking classmates. Nor are they consistent with long-standing and ongoing federal legislation and policies designed to reduce minority overrepresentation in special education. Our findings contribute to the field's understanding of minority disproportionate representation and so should inform future actions by researchers, practitioners, and policymakers. For researchers, our findings are consistent with mechanisms theorized to result in minority underrepresentation in special education. These mechanisms include (a) socioeconomic, linguistic, and/or cultural obstacles resulting in minority families being less likely than White families to make use of special education services (Coll et al., 1996; Danesco, 1997; Harry, 1992; O'Hara, 2003; Pena & Fiestas, 2009); (b) an aversion by minority families to the stigma associated with disability identification (Hervey-Jumper et al., 2008; O'Hara, 2003; Zuckerman et al., 2014) ; (c) fewer interactions with professionals due to lower health care access (Flores & Committee on Pediatric Research, 2010; Inkelas et al., 2007) and language barriers (Flores & Tomany-Korman, 2008; Zuckerman et al., 2014) ; and (d) \"frog pond\" effects in which high-minority schools, which also tend to be underfunded and underresourced and so lower performing (Peske & Haycock, 2006) , are less likely than higher-performing schools to identify otherwise identically performing minority students as disabled in order to avoid the burden of being required to provide special education services to an overly large percentage of their students .\nOur findings also extend the field's knowledge base by establishing that, although lower health care access and non-English use are each predictive of a lower likelihood of disability identification, neither factor fully explains the underidentification attributable to children's status as racial, ethnic, or language minorities (Zuckerman et al., 2014) . Our results also suggest that future investigations of minority disproportionate representation are likely to report biased estimates of minority disproportionate representation if they fail to account for the strong potential confounding variables of individual child-level academic achievement and behavioral functioning. These factors, as well as other sociodemographic characteristics (e.g., age, gender) are both consistently and uniquely related to U.S. schoolchildren's likelihood of being identified as disabled. Prior research has reported that the directionality of disproportionate representation varies depending on the type of disability condition under investigation, although these studies have often not accounted for individual child-level academic achievement and behavioral functioning (Donovan & Cross, 2002; Skiba et al, 2005; Sullivan, 2011; Sullivan & Bal, 2013) . Those studies adjusting for individual-and family-level as well as school-level potential confounds consistently indicate the minority children are underrepresented in special education, with this underrepresentation evident both generally and for specific disability conditions and both prior to and following school entry Morgan, Farkas, et al., 2012; Shifrer et al., 2011) . Our results indicate that racial-and ethnic-minority children who are otherwise similar to White children are consistently less likely to be identified as disabled whether the specific condition being investigated is learning disabilities, speech or language impairments, intellectual disabilities, health impairments, or emotional disturbances. Our study extends this prior work by establishing that the underrepresentation is evident across multiple disability conditions and over time when examined in the same cohort followed from the beginning of elementary school to the end of middle school. Thus, and consistent with mechanisms suggesting that sociocultural factors may collectively result in barriers to access to services (Coll et al., 1996; Danesco, 1997; Harry, 1992; O'Hara, 2003) , our findings suggest that racial-and ethnicminority children experience underrepresentation across time and for a wide range of disability conditions.\nIn contrast, our findings indicate that language-minority children's underrepresentation is specific to the language-related disorders of learning disabilities and speech or language impairments, possibly as a result of these children's lower proficiency in English as well as a lack of availability and use of proper diagnostic assessments for these types of disorders with non-English speakers (Figueroa & Newsome, 2006; Hibel & Jasper, 2012; Linan-Thompson, 2010) . Elementary schoolchildren who are language minorities have also been hypothesized to follow a specific over-time dynamic of disproportionate representation, in which they are initially underidentified as having disabilities but then begin to be overidentified as teachers begin attributing the children's lower achievement to factors other than limited English proficiency (Hibel & Jasper, 2012; Samson & Lesaux, 2009 ). Yet, and possibly due to our use of a wider set of covariates, we find no evidence of this dynamic. Instead, we find that, following extensive statistical control, including for individuallevel academic achievement and behavioral functioning, languageminority children continue to be underidentified for learning disabilities and speech or language impairments throughout elementary and middle school.\nOur findings support policies and practices that result in increased use by practitioners of culturally and linguistically sensitive special education evaluation methods. Use of these methods may be necessary to ensure that special education eligibility procedures do not result in unwarranted overrepresentation of White, English-speaking children. This overrepresentation may result from teachers, school psychologists, and other professionals being differentially responsive to White, English-speaking parents. Pediatricians have already been reported to be more likely to solicit developmental concerns about children from White parents (Guerrero, Slusser, Barreto, Rosales, & Kuo, 2011) . Minority children have been reported to be less likely to be using empirically validated treatments than White children . From a social justice standpoint, if special education's eligibility procedures are being disproportionately responsive to children from White, English-speaking families, then children from racial-, ethnic-, or language-minority families may not be experiencing the same access to potentially beneficial special education services for which they are legally entitled. This in turn may maintain or exacerbate the nation's long-standing educational inequalities, including achievement gaps. Minority children's lack of treatment for undiagnosed disorders and disabilities has been hypothesized to at least partially account for these achievement gaps (Basch, 2011) . Educational professionals should be attentive to cultural and language barriers that may be keeping minority children from being appropriately evaluated and identified for disabilities. Use of interpreters as well as appropriately translated written materials may assist with this process (Brotanek, Rocha, & Flores, 2008) . Due-process pamphlets describing disability eligibility procedures are often written in less accessible language, particularly for parents of lower-SES backgrounds (Fitzgerald & Watkins, 2006) , who are more likely to be minorities (U.S. Census Bureau, 2012) . School-to-community outreach programs may be another possible method of addressing cultural and linguistic barriers to disability identification and treatment. Such outreach programs have helped reduce racial and ethnic disparities in children's health and health care access (Flores, 2009; Madsen, Thompson, Adkins, & Crawford, 2013) .\nFor policymakers, our results suggest that current federal educational legislation and policymaking designed to minimize overidentification of minorities in special education may be misdirected (Government Accountability Office, 2013; U.S. Department of Education, 2014), including the reallocation of Part B funding to early intervening services designed to reduce minority overrepresentation in special education. Our analyses of a nationally representative and multiyear data set failed to yield any evidence that minority overrepresentation is currently occurring. Instead, we consistently found that racial-, ethnic-, and language-minority schoolchildren are comparatively underidentified as having disabilities and so are underrepresented in special education as they attend elementary and middle schools in the United States. Consequently, federal legislation and policies may be inadvertently exacerbating educational inequities by reducing access to special education services for eligible schoolchildren who are racial, ethnic, or language minorities. Federal legislation and policies that lower cultural and language barriers resulting in these racial, ethnic, and language disparities may be necessary to ensure that all U.S. schoolchildren with disabilities are provided with the special education services for which they are legally entitled. This may be especially likely to occur for disability conditions (e.g., learning disabilities) relying on more subjective normative contrasts (Harry & Klingner, 2006) , although evidence of variability in children's identification for these disabilities is sometimes limited (Hallahan, Keller, & Ball, 1986; Hallahan, Keller, Martinez, Gelman, & Fan, 2007) 2 An anonymous reviewer asked us to validate the Early Childhood Longitudinal Study-Kindergarten Cohort (ECLS-K) identification rate of disabilities by examining those rates reported to the U.S. Department of Education by individual school districts. However, these rates are not directly comparable. This is because the ECLS-K identification rates are for a single cohort followed across multiple years as the children entered kindergarten until they completed eighth grade. In contrast, the rates published by the U.S. Department of Education are from kindergarten to 12th grade in a specific year. Our examination indicated that these rates were generally consistent with one another when accounting for these sampling differences.\n3 Although the ECLS-K special education teacher surveys used the term mental retardation, we use the term intellectual disability to be consistent with current terminology. Emotional disturbance is the term used in federal legislation to refer to emotional/beahvioral disorders (http:// idea.ed.gov/explore/view/p/,root,regs,300,A,300%252E8). 4 We used non-English use during the home interview in our analyses to better identify language minorities. Unlike the English language learner (ELL) status variable available in the ECLS-K, which measures children's own low level of English proficiency as indicated by low scores on the Oral Language Development Scale (OLDS), the variable non-English language use helps to indicate whether the parents may themselves experience low levels of English proficiency. Parents may have lower English-speaking proficiencies than their children. This is important, as a parent's own low level of English proficiency may itself constitute a barrier to a child's disability identification. We also used this variable because it sampled a group about 3 to 4 times the size of the ELL-status variable, resulting in greater statistical power when examining the relation between language-minority status and disability identification. Further analyses indicated that 100% of those children who were identified as ELL through administration of the OLDS in kindergarten and first grade were also from households where the parent used non-English during the home interview.\n5 Vertical scaling of these figures vary by disability condition. This is due to variability in the prevalence rates of the five disability conditions."}]