[{"section_title": "Abstract", "text": "The traditional data mining method is featured by no analysis over the data distribution and incomplete derived association rule. As a result, the data mining results have the deficiencies of large redundancy probability, large root-mean-square error of approximation (RMSEA) and long consumption time. To handle these issues, this paper proposes a medical data stream distribution pattern association rule mining algorithm based on density estimation. This paper collects medical data, selects the distance method to detect abnormal orphan data in the data stream, detects the duplicate data in the data stream by the similar field matching degree, and eliminates the abnormal data and the duplicate data. Then, the data stream density is estimated based on the histogram estimation samples. According to the data density estimation results, this paper analyzes the distribution of medical data stream from perspectives of concentration, dispersion and morphological characteristics of data distribution. Afterwards, the data distribution pattern association rule mining model is constructed based on compound neural network, data distribution parameters are entered into model's clustering layer, and in-depth training is conducted over the BP (Back Propagation) neural network at the model's mining layer. Meanwhile, all rules under the combination of hidden layer's neuron activity value and corresponding output value, and all rules under the combination of hidden layer's neuron activity value and corresponding input value are derived, so as to complete association rule mining of medical data stream distribution pattern. The experimental results show that the proposed algorithm has a contour curve closest to the true probability density curve; the dispersion degree of medical data is within a reasonable range, and the medical data has high stability; the data redundancy probability is smaller; the mining result's RMSEA is small; data mining takes less time."}, {"section_title": "I. INTRODUCTION", "text": "In recent years, the medical field has witnessed dramatic changes, and the medical data generated has increased exponentially. Due to the increase and enhancement of medical measuring instruments and technologies, large-scale medical information can be accurately recorded and counted, resulting in more sources of medical information data [1] , [2] . In particular, as medical information is continuously put into use and used by major medical institutions, the collected patient The associate editor coordinating the review of this manuscript and approving it for publication was Ying Li.\ninformation includes not only medical images and various physiological indicators, but also a large amount of resources, such as the patients' age and past medical history [3] , [4] . When the information and data collected by major medical institutions are gathered together, the summary results are huge and all are the real information and data of patients [5] , [6] . The association between them is identified from the above data stream set, and the association rules of its distribution pattern are summarized, which is very beneficial to the treatment of diseases and medical diagnosis [7] , [9] .\nGenerally, the mining of the distribution pattern association rule requires the following steps: First, collecting the VOLUME 7, 2019 This work is licensed under a Creative Commons Attribution 4.0 License. For more information, see http://creativecommons.org/licenses/by/4.0/ original data, which often takes a long time; second, identifying the basic distribution conditions by establishing a data distribution histogram; third, conducting the parameter estimation to reflect the medical data distribution characteristics; fourth, performing the fitness test on the collected data [10] , [11] . If the test results do not match the assumed distribution, return to the second step for reanalysis [12] , [13] . Evidently, the traditional data distribution pattern association rule mining method has the deficiencies of large computation and cumbersome steps [14] . The neural network modeling method is also a good data mining method. The traditional neural network is widely applied, because it has better adaptive learning ability and information processing capability, and provides good data ideas for computer data identification, control and modeling analysis [15] , [16] . This traditional neural network method simplifies the modeling process of time series and is of great help to the system research which is difficult to establish mathematical model. Since then, the research on the neural network has attracted the attention of many researchers, and researchers continue to analyze and optimize the traditional neural network. Foreign researchers have conducted correlation analysis on neural network and data flow distribution. Xing et al. [17] self-organizing incremental neural network based on local distributed learning analysis combines the advantages of incremental learning and matrix learning. This method can automatically find suitable nodes and fit learning data incrementally without prior knowledge. Dash and Rao [18] detected arrhythmia based on Wigner-Ville distribution neural network, using Wigner-Ville time-frequency energy distribution and neural network to classify and mine different electrocardiogram beats, the mining accuracy is high. Lal et al. [19] used uncertain medical data flowed to estimate the non-invasive blood flow characteristics of cerebral artery, enabled magnetic resonance angiography data to extract specific blood flow rates of patients, and then completed data mining to achieve feature estimation. Su et al. [20] automated and efficiently test data streams from different angles, and deeply analyze data shape and distribution problems, which provides a good foundation for data mining. Good results have been achieved through the above research methods, but there are many problems at the same time, and the obtained results have higher redundancy probability.\nFor medical data mining, a lot of researches have been carried out in China, and numerous research results have been obtained. Domestic scholars take the large-scale data mining in the medical industry as the research object, apply the Apriori algorithm to medical data collection and mining, and use the Apriori algorithm to perform correlation analysis based on the obstetric data in the current medical data. The correlation between cesarean section, physical signs and drugs was discussed, and the relationship between maternal admission time and the number and the distribution of newborns [21] . In order to solve the ECG data processing problem in medical data, based on the Spark cloud platform, an improved genetic K-means clustering algorithm is proposed to be applied to ECG data mining. In this paper, Mallat wavelet transform preprocessing technology is introduced to detect and extract R waves from large-scale ECG data, MIT-BIH data is collected and processed, so as to realize medical ECG data mining [22] . Under the rapid development of the Internet, medical data is characterized by many types and complex relationship. It is difficult for general data processing methods to analyze it effectively. According to the current research status, the origin and characteristics of medical big data are analyzed, and the definition and research status of medical data visualization are introduced. The current medical data visualization mode is converted into two categories, and the cluster describes the most common medical data visualization mining method. The current visualization mode of medical data is converted into two categories, and describes the most common visualization mining method of medical data in a clustering way. The complexity and dynamics have posed challenges to the development of medical data [23] . The two-layer modeling concept under the open EHR specification enhances the flexibility of the medical data system and adapts to the changes in current medical data requirements to some extent. However, due to the large amount of retrieved data, complex query conditions and increasing personalized demands, the retrieval performance of medical data system is relatively weak by using open HER(electronic Human Resource) modeling, which is mainly related to the storage model of underlying data. In order to solve the above problems, based on the two-layer modeling concept under the open EHR specification, this study presents a multidimensional data model mapping method for template and medical dynamic data warehouse, and then improves the implementation speed of ETL(Extract-Load-Transform) through the mapping path to realize medical data stream pattern mining [24] .\nMedical data stream distribution pattern association rule mining is one of the key ways to understand and identify medical data. The above related research results are not very comprehensive for the cleaning of abnormal data and duplicate data, which leads to higher redundancy probability in the medical data mining process, and large overall mining RMSEA. As a result, this paper proposes a medical data stream distribution pattern association rule mining algorithm based on density estimation. This paper uses the distance method to detect abnormal orphan data in the medical data stream. By estimating the density function of data stream, the data distribution of the data stream can be effectively grasped. Then, the data distribution is analyzed from perspectives of concentration, dispersion and association rules. The association rules are derived from the active values of neurons in the hidden layer, and the clustering group data patterns are mined according to all the rules exported, so as to complete the research task. At the same time, this study uses different experimental indicators to verify the feasibility of the proposed algorithm, providing a good data foundation for the development of medical technology.\nThe compound neural network is used in the research process. The compound neural network is a compound network structure formed by the combination of neural network learning vector quantization (LVQ) and support vector machine (SVM). The compound neural network framework is usually composed of a standard three-layer feed forward neural network: a data input layer, a hidden layer and a data output layer. The neurons between each layer are weighted and connected, and there is no connection between the neurons in the layer. The compound neural network not only has the advantages of simple structure and high classification efficiency, but also can effectively control the problems caused by the wrong classification at the root and the data deviation, hence the characteristics of strong stability and easy training Based on the existing research, this paper proposes a medical data stream distribution pattern association rule mining algorithm based on density estimation, and verifies the feasibility of the proposed algorithm. The main research contributions of this paper are:\n(1) Histogram density estimation of medical data is conducted, and research on data distribution is carried out, thereby effectively grasping the data distribution conditions and effectively improving the validity of data mining.\n(2) Export all the association rules of medical data, and combine the association rule with cluster group data to mine the data.\n(3) The validity of the research is verified from many perspectives, so the experimental results are feasible."}, {"section_title": "II. PRELIMINARY OPERATIONS FOR MEDICAL DATA MINING", "text": "The medical data stream often contains some abnormal values. These abnormal values are generally referred to as isolated points [25] . The isolated point is not a random deviation, but is produced in a completely different mechanism. At present, there are many kinds of isolated point detection methods, which can be roughly divided into several types based on statistics, distance and deviation, and each method gives the corresponding definitions of isolated points [26] - [28] . Here, the distance method is selected to implement the abnormal orphan data detection in the medical data stream [29] - [31] .\nWhen the abnormal orphan data detection process is performed, the data source containing the abnormal data is obtained for the first time, and the abnormal point in the data source is detected. The isolated point also includes incomplete data points. If there is an isolated point, the database connection cannot be closed, and the isolated point should be removed. If there is no isolated point, the output file is not closed, and the data should be further processed according to the corresponding rules to complete the abnormal point detection [32] - [34] .\nIn order to effectively reduce the redundancy probability of data mining, duplicate data in data stream is detected. The detailed process is as follows:\nAssuming that the medical data set X = {x 1 , . . . , x n }, the field vector, F = {F 1 , . . . , F p }, where F k represents the p field in the data x i = {x i1, . . . , x ip }, 1 ≤ i < n. X ip represents the p-dimensional value of the record, and the importance of the field in the target object is represented by the first value, which can also be called attribute weight value. The vector expression of the weight value is\nAccording to the above parameter settings, assume that T ik represents the level specified by F k and 1 is the highest level, the higher the value, the lower the level [35] - [37] . T k represents the ultimate unified level of the k field k ∈ {1, 2, . . . p}, then the expression of T k is\nAssuming that T k represents the final unified level of F k . T represent the lowest, i.e. the maximum level, and that the final unified level of any two fields is not the same, then T = p, using RC transformation to represent the field F k weight value.\nAssuming that there are two or more fields with the same final unification level, formula (3) can be converted to:\nwhere,\nFor any medical data record x i and x j , the k-dimensional fields of two are x ik and x jk .The similarity expression of the x ik and x jk fields are as follows:\nwhere, Score(a, x ik ) represents the score of the atomic strings a and x jk in x ik , and |x ik | represents the length value x ik , and q represents the number of x ik atomic strings. To sum up, the expression of duplicate detection for two records is as follows:\nAccording to formula (7) , duplicate data in data stream can be detected and eliminated."}, {"section_title": "III. HISTOGRAM DENSITY ESTIMATION", "text": "The medical data stream contains rich and valuable information. Density estimation is a widely used and effective way.\nIf the density function of the data stream is estimated at the time of data input, the data distribution of the data stream can be effectively grasped, and the sparse or dense area can be quickly found in the data stream. Due to data continuous volume of the medical data stream as well as limited storage space of the data stream and the cache, this paper, without assuming that the samples of the objects conform to any theoretical distribution and based on the data density estimation results, models the medical data by constructing the medical data stream distribution model and selecting the nonparametric estimation method, and then estimates the density of the data stream. At this time, the density distribution form of medical data mainly depends on the actual value of the sample. The model itself also changes when there is a large change in the sample value. In order to effectively mine the data stream density distribution model, this paper chooses the nonparametric evaluation method of histogram to represent the frequency of medical data and the result is intuitive and easy to understand, which can effectively reduce the complexity of mining calculation. Non-parametric modeling method for uncertain data streams. It is shown in Figure 1 .\nThe key step in histogram density estimation is to determine the class interval d. The nature of the density function corresponding to different class intervals and the overall distribution characteristics also vary. If the class interval d is unreasonable, the estimated density function will have a large deviation from the real situation. Therefore, assuming that the true density function of the uncertain object u is u (x), and histogram density estimation is u (x).Combined with the above theory, the method of histogram density estimation for uncertain objects is given. The steps are as follows:\n(1) Suppose the sample of the uncertain data object is u I i,j , the size is represented by I , and the sample is sorted; the minimum and maximum samples are x 1 = min u I i,j and x n = max u I i,j respectively; (2) Estimate the class interval d;\n(4) Make a histogram with d as the bandwidth and v 1 , v 2 , . . . , v k as the height;\n(5) u (x) can be obtained by estimating the density distribution of the population corresponding to the samples according to the histogram."}, {"section_title": "IV. MEDICAL DATA DISTRIBUTION PATTERN", "text": "According to the statistical principle, the data distribution is mainly composed of the following three characteristics: data concentration, dispersion and morphological characteristics of data distribution."}, {"section_title": "A. MEDICAL DATA CONCENTRATION", "text": "The data concentration refers to the degree to which the data is close to or concentrated toward the center value. The main indicators for determining central tendency can be divided into the following two categories: position representative value and numerical mean. Between them, the position representative value includes the mode, median and quartile, etc [38] - [40] . The numerical mean includes the arithmetic mean, the harmonic mean and geometric mean. There are three quartiles: the lower quartile, the median, and the upper quartile."}, {"section_title": "B. MEDICAL DATA DISPERSION", "text": "Medical data dispersion is a statistical description of data variation. Its main role is to measure representative nature and determine the uniformity and stability of data changes. Dispersion is measured by the following indicators: range, quartile range, mean difference, variance, standard deviation, and dispersion coefficient. The dispersion coefficient is also called the variation coefficient. It is the ratio of the dispersion indicator to the arithmetic mean, representing a dimensionless quantity. It is suitable for analysis of variations in data with different phenomena or levels. The dispersion coefficient is divided into range coefficient, coefficient of average deviation, and coefficient of standard deviation. Among them, the coefficient of standard deviation V is commonly used, which is the ratio of standard deviation σ to arithmetic mean g."}, {"section_title": "C. MORPHOLOGICAL CHARACTERISTICS OF DATA DISTRIBUTION", "text": "The morphological characteristics of data distribution mainly include moment, kurtosis and skewness. Among them, the moment means the arithmetic mean of all variables and the n-th power constant dispersion. This paper uses the third order moment and the fourth order moment to characterize the morphological features of data distribution. Among them, the calculation formula for the third-order center distance v 3 and the fourth-order center distance v 4 is:\nIn the above formula, x i is the data morphological characteristic value, andx is the mean value of x i .\nSkewness represents the direction and extent of data asymmetry, which can be divided into Pearson skewness, quartile skewness and moment method skewness. Among them, the moment method skewness is more accurate. Normally, the skewness index α represents the cube of the ratio of the third-order center distance to the standard deviation σ , expressed as:\nPeak is also called kurtosis, indicating the sharpness and peak degree of the medical data distribution pattern. The quantile kurtosis represents a measured value of the kurtosis. According to the specific concept of the moment, the kurtosis is accurately measured to obtain the moment kurtosis. The specific calculation method is as follows:\nThis paper combines the above three medical data distribution characteristics to determine the quartile, namely, the lower quartile, the median, the upper quartile, as well as the dispersion coefficient, skewness (α) and kurtosis (β). The medical data distribution pattern is determined by the above six parameters."}, {"section_title": "V. COMPOUND NEURAL NETWORK DATA DISTRIBUTION PATTERN ASSOCIATION RULE MINING", "text": "Based on the morphological characteristics of the above medical data distribution and according to the probability density function shape under different distribution parameters, this paper divides each distribution pattern association rule into different distribution parameters, which is roughly subdivided into 498 distribution pattern association rules. It is shown in table 1.\nIn practical applications, a large amount of data may obey the probability distribution. This section builds the data distribution pattern association rule mining model. The model is mainly divided into two layers: the first layer is to cluster the data distribution, and the data with similar characteristics is classified into the same class; the second layer is to mine the classified features by using BP neural network.\nUsually, multiple experiments are used when constructing network data samples. In this study, data distribution pattern association rule in Table 1 is used as network parameter input, data distribution pattern association rule is used as network data output, and then distribution pattern association rule mining of medical data stream is completed based on compound neural network. Specific steps are as follows:\nThe samples that need to be input in the compound neural network have the same data length. The data samples are normalized in this paper. Assume that the input data sample set is S, and the data reference mode set is E, which are expressed as:\nIn the above formula, s m represents the coordinate vector of the m-th point of S, and e m represents the coordinate vector of the m-th point of E. A unified mapping transformation is performed on the data sample set and the data reference pattern set, and S is converted to a new position vector S , namely:\nIn the above formula, J represents a two-dimensional matrix, and b is a variation vector coefficient.\nThe normalized sample is:"}, {"section_title": "B. INPUT AND OUTPUT OF DATA DISTRIBUTION PATTERN ASSOCIATION RULE", "text": "In the first layer of the network layer, this study inputs characteristic parameters such as correlation coefficient, variance, mean, skewness and cumulative probability into the network, makes statistics over the data distribution pattern association rule, and classifies the distribution pattern association rule, so as to obtain different classification groups and memory rights for input sample patterns. The data obtained by the above classification is trained in the BP neural network, and the final network output is the data distribution pattern association rule. In the BP neural network training, even if there is only one output layer node, as the input unit increases, the number of connections between nodes in the network will continue to increase exponentially, which leads to an increase in the corresponding extraction rules. Besides, this brings a lot of difficulties to the extraction of mining rules for the medical data stream distribution pattern association rules. As a result, the network needs to be further trained to facilitate the extraction of easyto-understand mining rules [41] , [42] .\nThe training process of the neural network is as follows: Assuming that the input mode of the neural network is x I l , I ∈ {1, . . . , K }, I ∈ {1, . . . , M }, l represents the set of input tuples in the data set. K is the maximum number of tuple sets. I is the input mode dimension. M is the maximum mode dimension. Assuming that W m l represents the connection weight of the l-th neuron in the input layer to the m-th neuron in the hidden layer. Then the activation value of the m-th neuron in the hidden layer can be expressed as:\nwhere, f (·) represents the neuron activation function of hidden layer, which is non-linear function. f (·) is defined as hyperbolic tangent function. R m represents the m-th neuron bias of the hidden layer, which maps the larger value of the activation [−1, 1]. If the activation of neuron in the hidden layer is obtained, the output value of the P-th neuron in the output layer can be expressed as:\nwhere, σ (·) represents the neuron activation function in the output layer, σ (·) is defined as a simiod function, which maps the larger value of activation value to a smaller interval [0, 1]. V m P represents the connection weight of the m-th neuron in the hidden layer to the P-th neuron in the output layer.\nAn input tuple can be accurately classified, assume that it satisfies the max |S I P − t I P | ≤ γ 1 condition, where γ 1 represents a positive number less than 0.5. Assuming that the input mode x I belong to C J , and its target output is expressed as an o-dimensional vector t I P , P ∈ {1, 2, . . . , O}. When P = J , t I P = 1, and conversely t I P = 0. The main purpose of neural network training is to find a set of optimal connection weights, and then to enable the network to achieve element classification with high accuracy [43] . For the purpose of measuring the classification error value, the training process is transformed into a process of minimizing the error function by adjusting the connection weights (w, v), the error function is cross-entropy function E(w, v) . The function can be expressed as:\nThe purpose is to convert more connection weights into a very small value, which is convenient for network pruning . P(w, v) is introduced. The expression of the compensation term is as follows:\nwhere, ε 1 and ε 2 represent two positive weight decay parameters, h represents the number of neurons in the hidden layer. O represents the number of neurons in the output layer.\nIn the training process of neural network, we should first assign very small random number (w, v) (0) to each weight value, such as [−1, 1], and then iteratively update the weight value, so that E(w, v)+P(w, v) is the smallest and the training is over.\nSubsequently, this paper randomly selects any of the cluster groups, and describes the corresponding data distribution (Normal distribution, Beta distribution and Weibull distribution), as well as the corresponding hidden layer's neural network and number of neurons. Among them, the number of neurons is determined by the data distribution pattern association rule. The other classification groups are described in a similar manner."}, {"section_title": "C. RULE EXTRACTION AND DATA PROBABILITY PATTERN MINING IMPLEMENTATION", "text": "In this paper, the random data distribution sequence selected by computer is used to calculate the eigenvalues of the data sequence and input it into the network. The data is clustered in the first layer network layer and belongs to each cluster group. After training the BP neural network at the second layer, the cluster group data pattern is mined according to all the rules that are derived.\nAlthough neural network pruning can simplify the whole structure, it is still difficult to find a clear correlation between input tuples and output tuples. The main reason is that it is more difficult to extract mining rules [44] . According to the requirements of reality and mining accuracy, the steps of extracting mining rules from distribution patterns of medical data streams are set as follows:\n(1) Discreteness and classification of active values Set ε ∈ (0, 1), D represents the number of discrete active neurons in the hidden layer, and δ 1 represents the number of active neurons in the hidden layer during the input of the first mode in the training sample set. Suppose H (1) = δ 1 , count(1) = 1, sum(1) = δ 1 , D = 1.\nFor all patterns I = 1, 2, . . ., K, in the training sample set, assuming that δ is its active value. If the subscriptJ can make . . , D, according to the mean of activity value subordinated to this category. Replacing δ I with active value δ d of subordinate category of neuron activity value δ I in hidden layer and its accuracy is tested. Assuming that its accuracy is lower than the required level, the value of ε is reduced and step 1 is performed iteratively.\n(2) Enumerating discrete active values and calculating network output. All rules are derived by combining the active value of hidden layer neurons with the corresponding output value. (4) According to the rules generated in (2) and (3), all the rules under the combination of input value and output value are derived, and the final result is the mining rules of probability distribution pattern of medical data stream, according to which the research purpose of the subject can be achieved."}, {"section_title": "VI. ANALYSIS OF EXPERIMENTAL RESULTS", "text": "The experiment was carried out in the environment of VC++6.0 and MATLAB. Considering the advantages and disadvantages of programming conditions, in the process of implementing medical data stream distribution pattern association rule mining algorithm based on density estimation, the algorithm functions are realized by calling the interface functions of MATLAB and VC++6.0 in VC++6.0, with VC++6.0 as the main part and MATLAB as the auxiliary part. In this experiment, 550 groups of medical data from ADNI (the Alzheimer's Disease Neuroimaging Initiative) database (adni. loni. usc. edu) were used to ensure that the experimental data were normal. 550 groups of images were disorganized in order. 150 groups of data were used as abnormal sample data, 400 groups of data were used as test data, and the number of repeated experimental data analysis was up to 110 times.\nThe structural parameters of the compound neural network are shown in Table 2 .\nThe experimental indicators are as follows: 1. Data redundancy probability In the early stage of medical data mining, redundant data was eliminated and data quality was improved, in order to verify the performance of this operation, the data redundancy probability is selected as the indicator for analysis. The formula for calculating the data redundancy probability is as follows:\nIn the above formula, C represents the amount of repeated medical data, and R represents the total amount of medical data."}, {"section_title": "Histogram density estimation", "text": "In this paper, we study the mining of association rules based on density estimation of medical data flow distribution pattern. Density estimation is a novel point in this paper. It is necessary to analyze the operation effect of this step."}, {"section_title": "Stability of medical data distribution pattern", "text": "Based on the distribution of medical data sample points, the stability of the method is verified.\n4. Mining result approximate root mean square error The root-mean-square error is the deviation between the true value and the theoretical value. The root-mean-square error is an important indicator to measure the performance of the data distribution association rule. If RMSEA is less than 0.08, it means that the performance of the research results is superior; if the root-mean-square error is larger, it indicates that the research results are poor. The formula for calculating the indicator is as follows:\nIn the above formula,X represents the average value of the medical data set, and q represents the number of experiments."}, {"section_title": "Time-consuming data mining", "text": "Taking the data mining time as an indicator, the method is compared with the literature [22] , literature [23] , and literature [24] to verify the performance of the proposed method."}, {"section_title": "A. DATA REDUNDANCY PROBABILITY COMPARISON", "text": "Duplicate data detection is an important step in mining probability distribution patterns of medical data streams. The main purpose is to eliminate redundant data. In order to fully verify the superiority of this algorithm, the probability of redundant data is used as an index for comparative analysis. The results are shown in Figure 2 .\nThe data nodes in Figure 2 are the components of the medical data stream. The higher the probability of data redundancy is, the more repetitive actions exist in the mining process, which will seriously reduce the mining efficiency and affect the mining accuracy to a certain extent. The lower the probability of data redundancy, the higher the mining efficiency and the lower the energy consumption. As shown in Figure 2 , the proposed medical data stream distribution pattern association rule mining algorithm based on density estimation is well controlled under different number of nodes, with the probability of data redundancy not exceeding 2%, which is much lower than the results of literature research. The proposed algorithm detects duplicate data in medical data stream by data field similarity registration, reduces the probability of data redundancy, and effectively enhances the real-time mining."}, {"section_title": "B. HISTOGRAM DENSITY ESTIMATION", "text": "In the data stream distribution pattern association rule mining process, the histogram density estimation reflects the true probability density function u (x) and the probability density estimation u (x). The smaller the degree of advancement is, the closer the upper contour of the histogram is to the parameter probability density function, the better the grouping effect is, and the more accurate histogram density estimation will be; vice versa, the worse the histogram density estimation is. According to Figure 3 , compared with other literature methods, the contour curve of the method has the closest degree to the true probability density curve. The main reason is that this paper constructs the medical data stream distribution model and selects the non-parametric estimation method to model the medical data, so it can effectively grasp the data distribution of the data stream and quickly find the sparse or dense areas in the data stream. Therefore, after the proposed algorithm is applied, the histogram density estimation is more accurate, which lays a good foundation for the mining of medical data stream distribution pattern association rule."}, {"section_title": "C. STABILITY OF MEDICAL DATA DISTRIBUTION PATTERN", "text": "The distribution characteristics of medical data are mainly used to determine the uniformity and stability of medical data changes. The tighter the distribution of sample points, the higher the stability of the medical data distribution, and vice versa.\nAccording to Figure 4 , the sample points are closely distributed on the distribution line, which proves that the medical data distribution of the proposed algorithm has high stability performance. The main reason is that the proposed algorithm analyzes the three characteristics of data concentration, dispersion and morphological characteristics of data distribution, and obtains the distribution pattern of medical data, thereby having good stability. "}, {"section_title": "D. COMPARISON OF RMSEA", "text": "The research results of this paper are compared with the root-mean-square error of the literature research results. It is shown in Figure 5 . According to Figure 5 , although several results presented in the literature also have small errors, the overall fluctuation of the error value is relatively large, the reliability is low, and many data points have the RMSEA values exceeding 0.08. The overall RMSEA value of the proposed algorithm mining results is less than 0.03, which shows good mining performance. The result is mainly due to the proposed algorithm pre-processing the medical data before carrying out the excavation operation and training the network after constructing the neural network. Therefore, the proposed algorithm facilitates the extraction of easy-to-understand mining rules, enhances the mining performance, and improves the mining accuracy."}, {"section_title": "E. TIME-CONSUMING COMPARISON OF MINING", "text": "The research results of this paper are compared with mining time-consuming of literature research results. It is shown in Table 3 . Table 3 shows that the mining results of the literature research are time-consuming, which is equivalent to about 3.5 times of the proposed mining algorithm, indicating that the mining of the medical data stream distribution pattern association rule is less time-consuming and can be quickly completed. The reason is that the proposed algorithm uses the active value δ d of the active value of the neuron in the hidden layer to replace the δ I , and the accuracy is detected, so it is easier to find a clear correlation between the input tuples and the output tuples, reducing the data mining time."}, {"section_title": "VII. CONCLUSION", "text": "Medical data mining is a feasible way to improve medical technology and patient satisfaction. In order to deal with the high probability of redundancy and large mining result RMSEA in the existing research results, combined with actual needs, this paper proposes a medical data stream distribution pattern association rule mining algorithm based on density estimation. By taking the pre-processing of medical data as the mining support, the author adopts the compound neural network algorithm to construct the neural network, trains the network and extracts the medical data stream distribution pattern association rules, and completes the mining research. Experiments and discussions show that the proposed mining algorithm obtains more accurate histogram density estimation; the medical data has higher stability and can effectively detect duplicate data and reduce data redundancy; the mining results have a RMSEA of 0.03, with less mining time. Therefore, the proposed algorithm is a feasible medical data mining algorithm. It can effectively solve the problems existing in the existing research results.\nThe author has done a lot of data preparation works in the research process and achieved good research results. However, in-depth research is needed for adapting to the actual situation.\nIn this paper, the medical data flow distribution pattern association rule mining is carried out under an idealized condition. If there is a single or even multiple external disturbances in actual operations and applications, it may affect the research results. Therefore, the next step will be to analyze the distribution pattern and density of the data under different external disturbance conditions and deep mining data features, further improve the performance of the mining algorithm and effectively apply it in the medical field."}]