[{"section_title": "", "text": "New Doctorates as a Percentage of Total Employment of Doctoral Scientists andEngineers, 1973-1987 ......,y Source: National Research Council, Survey of Doctorate Recipients and Survey of Earned Doctorates death and retirement) would also be less than half the growth rate of science and engineering Ph.D. employment since 1973, and less than half the growth rate of real basic and applied research expenditures in the U.S. over the past decade (National Science Board, 1987]. The level of science and engineering doctorate awards to U.S. citizens and permanent residents has been constant in the range of 9,300 to 9,900 degrees since 1976. Prior to that the history of awards was erratic: awards increased steadily after World War II to achieve 9,500 in 1968, then they shot up rapidly to 12,500 in 1971 and fell rapidly to about the present level in 1976. Because of foreign student enrollments, total awards have always exceeded awards to U.S. students. Prior to 1976 a rapid growth of doctorate employment in science and engineering was accommodated by rapid growth in degree awards to U.S. citizens and permanent residents. Since 1976 the number of these awards has been flat but employment has continued to grow, increasing by nearly 50 percent over a decade. This growth in employment in the face of constant degree awards was possible because (1) there was increased employment of foreign national degree recipients with temporary visas, and (2) the current level of degree awards was enough to accommodate substantial growth a decade ago --because the same level of degree awards then exceeded replacement needs for retirements by a larger margin than at present. Since 1983 the employment of doctorates in science and engineering jobs has increased, but at a slower rate than it did from 1973 to 1983. due to death and retirement av-rage about 2 percent of the doctoral work force, awards to U.S. citizens and permanent residents totaling 3.3 percent are insufficient to allow the doctorate population to grow at the same rate as total employment of scientists and engineers. However, we come closer to having enough to meet the needs of growth and replacement if all doctorate recipients, including foreign students on temporary visas, are available to join the U.S. work force."}, {"section_title": "Federal Graduate Student support", "text": "Federal support for graduate education grew dramatically during the late 1960s but then fell sharply during the early 1970s. Since the mid-1970s federal support of graduate students in science and engineering has increased moderately. Though this paper defines science to include only the natural sciences, it is relevant to note that during the period since 1975 federal support of social and behavioral science has been cut in half. Thus, modest growth for the natural sciences and engineering have been accomplished in part by reallocation of funds. Another important trend has been the decline in the relative importance of fellowships and traineeships relative to graduate research assistantships as a support mechanism. When federal fellowship support peaked in 1968 this was the dominant federal mechanism [National Board on Graduate Education, 1974, p. 33]. Since that time there has been a shift towards the use of research grants to faculty. These can employ graduate students as research assistants. This approach assures students are supported in fields where there is federal research interest, and it involves them in research projects. One important 150 difference is that federal fellowships are almost always restricted to persons who are qualified to take employment in the U.S. after graduation, (U.S. citizens and permanent residents) while research assistantships can be and frequently are used to support foreign students on temporary visas. Foreign students make a great contribution to the U.S. Although information on this is incomplete, it appears that about half of foreign doctorate recipients on temporary visas stay here to work after graduation, clearly increasing the average quality of the workforce [Greenwood and McDowell, 1986;National Research Council, 1988a). Graduate faculty express some preference for U.S. graduate students, but ad..it large numbers of foreign students because they feel they need to maintain high quality [Barber and Morgan, 1987). However, for federal policy makers trying to increase U.S. student involvement in graduate science and engineering education it must be acknowledged that the current support mechanism --i.e., the graduate research assistantship --has an important limitation. Even though federal policy makers may have values which differ from graduate faculty regarding the appropriate mix of U.S. vs. foreign students, federal policy makers have little or no contr,31 over the mix as long as most students are supported by research assistantships, and research assistants are selected by the faculty. The lack of federal influence on the mix of students is more obvious when one recognizes that federally supported students make up fewer than 25 percent of all full-time science and engineering graduate students in doctorate granting departments [National Science Board, 151 1987, p. 205]. As long as others provide the support for most graduate students, a federal preference for U.S. citizens will likely have little effect on the total mix of students --even if all federal support were subject to U.S. citizenship requirements."}, {"section_title": "The Labor Market for Scientists and Engineers", "text": "Economists have been describing and modelling the labor market for scientists and engineers for three decades [Arrow and Capron, 1959;Hansen, 1961;Folk, 1970;Freeman, 1971;Cain, Freeman and Hansen, 1974;Freeman and Breneman, 1974;Shamia, 1986;Syverson, 1988]. They have established that there is a functioning market; but also, because of the long time needed to educate scientists and engineers, supply responds to changes in demand with a lag. Much of the research literature has discussed the issue of shortages. The consensus view of \"shortages\" seems to agree with Arrow and Capron, that shortages are a normal part of the process of movement toward equilibrium in a dynamic setting. In this view, shortages are part of the normal operation of the labor market. While this literature documents the influence of government subsidies (e.g., fellowships) for increasing supply, it also suggests a market that is largely self-regulating, i.e., shortages bring forth increases in supply while surpluses bring forth reductions in supply. Recent stud:ies by the National Research Council and others emphasize the fact that an increase in degree awards is only one of the adjustments to shortages; in the short run there are several other adjustments that frequently occur in the market [National Research Council, 1986, 1988bCollins, 1988]. The shortage that signals the need to increase degree awards is usually indicated by a rise in the wage received by scientists and engineers, and sometimes by unfilled job openings as well. These also affect employers' behavior. to those who conduct it. Therefore, the private rate of return on investment in R&D is below the social rate of return [Mansfield, es al., 1977, National Research Council, 1986c [Mansfield, 1988]. A tax credit can have little impact on this. However, federal support of graduate students can cause more research to occur from a given level of federal R&D funds. This happens directly from graduate student involvement in research, and indirectly because smaller Ph.D. salaries 155 are needed to attract graduate students when higher levels of graduate student support are available [Shamia, 1988]."}, {"section_title": "Other Market Imperfections", "text": "Government cannot cure all market imperfections. Indeed, since Adam Smith, it has been recognized that government has often been the cause of market imperfections. In the case of science and engineering education and labor market imperfections the most often cited problem is that while most science and engineering specialties earn top salaries, public institutions tend to eschew the use of these market signals in setting tuition levels, stipends and wages. Thus we see, A single uniform teacher salary schedule in most school districts, with the result that teachers who have math, computer and physical science skills are underpaid relative to their market wage more often than other teachers in the same districts [Murnane and Olsen, 1988]. Pay caps in the federal government mean that the highest paid specialties (science and engineering) are often paid below market wages [National Research Council, 1988c]. Federal laboratories offer below market starting salaries in some high wage fields, e.g., engineering, in spite of \"special rates\" [National Research Council, 1983, p. 18]. Salary compression at universities. Some colleges and universities use uniform salary policies, just like pre-college schools, and most of those lacking uniform salary policies compress market salary differences so that they are not as 156 great in the public and non-profit sectors as in the private sector where the market is allowed to work more freely. Uniform tuition policies. These tend to benefit those admitted to science and engineering departments (where costs are above average) but they also mean that the colleges and universities are often unable or unwilling to expand enrollments in high cost departments. Uniform stipends for graduate students and postdoctoral students. While there is some variation in stipends in some programs and universities, many programs offer stipends that do not vary by discipline !National Research Council, 1988d;Nelson, 1988]. Intervention to increase the supply of scientists and engineers will tend to increase the quality and/or lower the cost of these personnel to the federal government and its contractors. In contrast, fewer than 10 percent of the doctoral institutions reported shortages in arts and humanities, foreign languages, social sciences, education, and vocational-technical fields [El-Khawas, 1988]. There have also been a series of surveys of engineering faculty vacancies. Since 1980 the survey reported a vacancy rate in the range of 7 to 10 percent for funded engineering faculty positions [Atelsek and Gomberg, 1981;Doigan, 1984Doigan, , 1989. This has been widely interpreted as a sign of a rather severe shortage of engineering faculty. However, it is difficult to interpret because we don't know what the \"natural\" vacancy rate is, i.e., the rate that would still prevail if the supply of engineering teachers were fully adequate. .541ariu. A recent OTA report concluded that, \"...although salaries are not increasing --a sign of steady supply --at all degree levels scientists and engineers enjoy the highest average starting salaries relative to other fields\" [U.S. Congress, 1988a]. This general assessment can be corroborated by data from other sources [Korb, 1987;National Science Board, 1987]. We might disagree about salaries not Indeed, science and engineering disciplines in general, and especially the highest paying fields (engineering, math, computer and physical science) attract students with very high ability, especially quantitative ability [Hartnett, 1985]. No doubt some of the salary differential enjoyed by these graduates is a reflection of this ability. Until recently I knew of no research which could be used to test whether the earnings of science and engineering graduates was superior to the earnings of other graduates after controlling for ability. However, an important study was recently completed using the 1986 follow-up study of the high school class of 1972 [James, et al., 1988]. This study controlled for ability using the students' SAT scores and also controlled for other background variables. It examined earnings in 1986, about 9 to 10 years after a typical student in the class of 1972 would have completed the bachelor's degree. It found that engineering graduates earned the highest salaries and that science and math majors earned above average salaries. Significantly, it also controlled for math courses taken in college so that these returns to the majors were over and above the return to taking math courses which science and engineering majors take in substantial numbers. To the extent that salaries indicate productivity it provides evidence that math courses and that science and math majors provide additional 163 productivity compared with the education of other college students. The study also found a high positive return to the business major. Business and elgineering were the highest paying undergraduate majors after controlling for ability, math courses taken and other factors. However, it found that business majors earned a differential only when they obtained management jobs. Engineering majors, in contrast, earned substantially the same large differential even when employed in nonengineering jobs. This is significant because the high school class of 1972 selected their majors during the early 1970s, a time when there was a relatively weak labor market for engineers and physical scientists. The finding that engineering majors do well even when they take ,ion-engineering jobs is important because it means that the payoff from this investment is not dependent on the state of the somewhat cyclical engineering labor market. Other studies confirm the finding that engineering graduates earn high salaries even when they take non-engineering jobs. One is a follow-up study of 1983-84 bachelors graduates conducted by the U.S. [Korb, 1987]. The same was generally true of mathematics, computer science, and physical science majors except for the approximately 9 percent in these majors who took jobs as teachers."}, {"section_title": "Department of Education", "text": "(This is probably due to the fact that most elementary and secondary schools have uniform pay policies, i.e., do not adjust pay to the market opportunity costs of different majors). I conclude that the high salaries earned by most scientists and engineers do indeed indicate what seems to be a productivity differential apart from the ability of the students who currently major 164 in those fields. There is fairly strong evidence to support the view that the productivity of the U.S. economy would be enhanced if more students who would otherwise major in other fields switched into science or engineering or took more mathematics courses in undergraduate school. One possible exception to this statement is biological science. At the B.S. level Korb found that 45 percent worked full-time after graduation and only the 13 percent of these working as biological scientists or health professionals earned salaries comparable to those of other science majors [Korb, 1987, p. 10 for the mid-case scenarios to be high or low in past projections [Dauffenbach, 1986). Thus, we must judge the BLS forecast to be very plausible.  [Collins, 1988). It can be argued that our economy can cope with these problems during, the 1990s just as it has during the 1980s. Indeed, a recent inquiry by the National Research Council failed to find severe quality problems in the engineering labor force that occurred from the adjustments to shortage that occurred during the 1980s [National Research Council, 1988b]. However, the National Research Council studies concluding that we coped with the shortfall of U.S. citizen engineers during the 1980s have also indicated that there is a need to train more U.S. students in science and engineering fields. They have recommended that, while the influx of foreign scientists and engineers has been beneficial, we should nevertheless increase the supply of U.S. citizens going into these fields. Separate studies of physics and mathematics have also called for increased degree awards [National Research Council, 1984, 1986b. The NSF analysis suggests there may be a need for federal government action to increase the number of U.S. citizens enrolling in science and engineering at virtually all levels. While college enrollments may hold up in spite of the declining number of 18-22 year olds, all plausible projections of college enrollments suggest that they will grow very little if at all during the next 5-10 years because of the reduced number of 18-22 year olds, the demographic trough following the peak of the baby boom [Gerald, at al., 1988, Ahlburg et al., 1981. Thus, if the number of science and engineering graduates is to grow roughly in proportion to the needs of the economy between now and the end of the 1990s, then the proportion of 18-22 year olds earning bachelors degrees in science and engineering fields will have to increase to historically high levels [NSF, 1987b, p. 5 However, there are reasons to suspect that we will experience less market response than we have in the past. One is the recent (1E36) tax law change which makes taxable many graduate school stipends which had been previously been tax free (e.g., fellowships and graduate research assistantships). Another is the presence of large numbers of foreign doctorate recipients. To the extent they stay in the U.S. in greater ntmbers than at present they will help to moderate salary increases that would otherwise signal more young U.S. citizens to enter graduate school."}, {"section_title": "171", "text": "I conclude that we need to equip and encourage more U.S. students to enter graduate school, especially in engineering, mathematics and the physical sciences. The mention of specific disciplines is done with some hesitation. There is not a convincing case that the federal government can or should attempt to \"fine tune\" the labor market by adjusting supply to projected future demand in specific fields. However, there is a case for general support of science and engineering to increase supply. This case is strongest for the fields of engineering, mathematical, computer and physical sciences because there is evidence that market imperfections are causing greater problems in these fields.  Congress, 1988a, p. 68]. Pros. This is a proven approach with well established mechanisms. Administrative costs are reasonable. Fellowships tend to attract the best students and to draw attention to the fields where they are located (e.g., science and engineering generally in the case of NSF fellowships; specific disciplines or technologies in the case of fellowships from mission agencies such as DOE, DoD, NASA and NIH.) There is ample evidence that fellowship students finish faster, and have greater early career success than non-fellowship students [Harmon, 1977;Coggeshall and Brown, 1984;Snyder, 1988]. Of course, fellowship students are usually superior students to begin with, but there is some evidence that federal fellowship winners achieve somewhat higher success than other comparable students who are not recipients [Snyder, 1988]. Another advantage of this form of support from the point of view of national policy makers is that the criteria 173 for awards can be specified by law (e.g., restrict to U.S. citizens, assure geographical balance within U.S.). The department of Health and Human Services uses this mechanism extensively. Other federal agencies (e.g., NSF) used this mechanism extensively in the past and are now considering its use again, in light of a perceived need for increased graduate student support. About 20 percent of federally supported graduate students were supported by traineeships in 1985 [Finn, 1988]."}, {"section_title": "Cons", "text": ""}, {"section_title": "Research Assistantships", "text": "Federal research grants made to universities support graduate students (and a few undergraduates) as research assistants. This mechanism has increased greatly in relative importance since the early 1970s and now supports about 80 percent of the graduate students now receiving federal funding [National Science Board, 1987]."}, {"section_title": "Pros or Cons?", "text": "Nearly all of the distinguishing characteristics of this mechanism may have effects that might be argued as pros by some and cons by others. For example, graduate assistants are selected by the professors who employ them. Thus, student support is tied to research. This has positive and negative effects. On the positive side we might cite the assurance that the student is involved in research. However, this system ties student support to research priorities, which do not always change in line with student support needs. Research grants are a very indirect way of aiding students, and the number of students aided can be less than expected.  Finn, 1988b, p. 7]. Also debate arises from the fact that research grants place the selection of federal student aid recipients in the hands of the university. While there are undeniable merits to this approach it reduces the ability of national authorities to influence selection. Furthermore, the federal government's interest in the mix of students may differ from the mix of students generated by the sum of many In spite of weaknesses in reliance on research assistantships for graduate student support, the R&D program of the federal government is a major source of direct graduate student support. Further, the level and distribution of R&D spending shapes the job market for scientists and engineers and can indirectly affect future supply. Increased stability, possibly through the mechanism of multi-year budgeting can improve the effect of R&D funding on supply [National Research Council, 1986, p. 41].  178"}, {"section_title": "Undergraduate Education", "text": "The federal Government spends about $10 billion on undergraduate student aid, but with few exceptions this vast sum is distributed without any expression of preference towards the undergraduate student major. One of the exceptions to this generalization is the Minority Access to Research Careers (MARC) program of the National Institutes of Health. An evaluation by the National Research Council showed this to be effective in increasing minority participation in science [Garrison and Brown, 1985]. Further, it found that a feature which this program shares with many other federal undergraduate science programs, student participation in off-campus research, was cited by students as the most influential However, it should be noted that enrollments in some fields with the strongest job markets (e.g., electrical engineering and computer science) seem to be limited by capacity in most universities. For these fields an expansion of Ph.D. degrees and 179 financial aid which helps the college or university acquire faculty and equipment is likely to be more effective than programs to stimulate student interest."}, {"section_title": "Tax Incentives", "text": "The federal tax treatment of tuition paid by employers and of stipends paid to students clearly affects the after tax cost of education. There is ample evidence that enrollment and degree completion is affected by the level of tuition at the undergraduate level, but the evidence for graduate students is mixed [Finn, et al., 1988]. Nevertheless, the Engineering Deans' Council recommended that the federal government should restore tax exclusion for both tuition remission and graduate student stipends [Engineering Deans' Council, 1988, p. 780]."}, {"section_title": "Employee Educational Assistance", "text": "Employers currently support graduate science and engineering education for their employees in a number of ways. For example, they pay all or part of tuition costs and sometimes give release time for classes. All employers could be given greater incentive to help employees return to graduate school for full or part-time study by paying tuition and living expenses. Expansion of such benefits for federal employees and employees of federal laboratories might not only increase degree awards, but also increase the attractiveness of federal employment and the quality of the federal work force."}, {"section_title": "180", "text": "Preferential tax treatment of student stipends and of employer educational assistance have in the past been available to all students. It might be very expensive to reinstate such tax treatment for all in terms of the size of the impact on science and engineering enrollments. This may well be justified because of the need for more U.S. graduate students in other disciplines, but that is beyond the scope of this paper. 181"}]