[{"section_title": "Abstract", "text": "There has been a cry of alarm about the need for a new generation of thinkers, innovators, linguists, and creative problem solvers to meet the demands of the 21st century global economy and our national security needs. Thus far, the response to the clarion call has been underwhelming. The nation has not yet committed itself to changing K-12 education in a way that would put more students-from every population and sector of society-on the path to high levels of talent. Research has already provided some important data and successful programs and services are available to replicate. In 2012, the National Association for Gifted Children (NAGC) convened a summit of scholars, practitioners, and policy experts to share information about school-based and supplemental programs that are achieving academic success with these learners. Experts identified numerous factors considered central to their program's success as well as the barriers, primarily in schools, to student achievement. Based on the summit presentations and discussion, we suggest six broad areas that were common threads across the programs, and across research, that can be a roadmap for others seeking to increase the numbers of low-income and racially, ethnically, and linguistically different students who are identified as gifted and achieve at high levels."}, {"section_title": "", "text": "3 of performing at above grade level, or how we go about moving more students to those levels.\nThe results of that inattention are sobering. Simply put, on numerous measures of student achievement we are doing a poor job of moving capable students into the highest levels of achievement. For capable culturally different and low-income students, the results are deplorable. For example, national and state data on the National Assessment of Education Progress (NAEP) exams reveal that not only are we moving only small numbers of students to the advanced level, we're moving far fewer culturally different and low-income students to those levels. The difference is an example of an achievement gap dubbed, the \"excellence gap\" (Plucker, Burroughs, & Song, 2010) . A recent national example: In 2001, 11% of white students reached the advanced level on the NAEP 8 th grade mathematics exam, yet only 2% of black students and 3% of Hispanic students reached that level (NCES, n.d.) . The NAEP mathematics data for 12 th grade students is even more discouraging. So few students of color and low-income students reached the advanced level in 2009 that the estimates rounded to zero.\nOnly 3% of white students reached this benchmark (Education Trust, 2013) . The results at the advanced level on state achievement tests are woefully similar (Center for Evaluation and Education Policy, 2013) .\nSomething is obviously very wrong when students with the ability to achieve at high levels fail to reach those goals, or when high achieving students lose ground while in school. For example, in a national study Reardon found that initially high achieving black students fall behind their white peers between kindergarten and fifth grade at a rate twice as fast as do initially low--achieving students. (Reardon, 2008) . In some cases, students' failure to exceed grade-level performance may be due to a lack of access to more rigorous coursework. For example, while 4 55% of high schools offer calculus, only 29% of high schools with the highest enrollments of African American and Hispanic students offer this course. The percentages for physics are similar (66% vs. 40%). The percentages for Algebra II are not as disparate (82% vs. 65%), but overall these data present a picture of unequal access to courses needed for selective colleges and future STEM careers (U.S. Office for Civil Rights [OCR], 2012) . In other cases, schools fail to create inclusive processes that would ensure that their gifted education programs reflect the diversity in the school district. Black and Hispanic students are disproportionally underrepresented by more than 50% in these educational opportunities (OCR, 2012; Ford, 2011) . For high-ability students in the regular classroom, it's not likely that their teachers will have had any training in how to work with advanced students (Farkas & Duffett, 2008) . Together, these data indicate significant lack of opportunity for challenging coursework and other strategies to develop the skills, habits of mind, and content mastery needed to achieve at high levels and move on to challenging post-secondary options and careers that meet students' abilities and interests as well as the nation's needs.\nAs the nation becomes more diverse and as increasing numbers of children live in poverty (DeNavas-Wait, Proctor, & Smith, 2010) , the question of how we develop high levels of talent in all groups of children -to provide both equity and excellence in our schools -becomes an even more urgent question."}, {"section_title": "Supporting Excellence", "text": "There is research and practice that can inform the discussion of how to identify potential in racially, ethnically, and linguistically different learners and cultivate that potential into high achievement. The field of gifted education can cite research conducted under the auspices of the federal Javits Gifted and Talented Students Education Act (Javits) (Javits, 2002) that has increased our understanding of the design of identification systems and assessment instruments to better include non-English speakers and minority students in gifted education programs (VanTassel-Baska, Feng, & Evans, 2007) . Javits-funded research also provided examples of projects that combined challenging curriculum and teacher training to uncover students from a range of backgrounds with potential for high achievement and move them to increasing levels of performance (Gavin, Casa, Adelson, Carroll, & Sheffield, 2009; VanTassel-Baska, Bracken, Feng, & Brown, 2009 ). There is a growing body of research from the field of psychology emphasizing the critical role of non-cognitive factors in achievement. These include personal attributes such as grit, self-control and mindsets towards ability and effort, as well as psychological dimensions within learning environments such as sense of belonging and stereotype threat. This research suggests that not only are these factors important because they directly affect students' achievement and use of varied and productive learning strategies, but they are malleable and some can be deliberately cultivated in students (Aaronson & Juarez, 2012; Farrington, Roderick, Allensworth, Nagaoka, Keyes, Johnson, & Beechan, 2012; Good, 2012,) .\nBuilding on this research and other best practices in gifted education and psychology, school districts, non-profit organizations, foundations, institutions of higher education, and others have been providing programs and services aimed at identifying greater numbers of low-income and culturally and linguistically different students for success in advanced coursework and/or gifted education programs and moving them along to selective colleges and universities (Castellano & Frazier, 2011) . In 2012, the National Association for Gifted Children (NAGC) convened a summit of scholars, practitioners, and policy experts to share information about school-based and supplemental programs that are achieving academic success with these learners. Experts identified numerous factors considered central to their program's success as well as the barriers, primarily in schools, to student achievement. The findings from the summit were published in a national report (Olszewski-Kubilius & Clarenbach, 2012) and are incorporated into the discussion below."}, {"section_title": "Key Factors Critical to Success", "text": "Success varied with culturally different students in the programs highlighted at the NAGC summit, including significant growth on state and standardized tests, placement in honors level courses, increases in enrollment in Advanced Placement Courses and International Baccalaureate programs, and acceptance at competitive and selective high schools and colleges (OlszewskiKubilius & Clarenbach, 2012) . Based on the summit presentations and discussion, we suggest five broad areas that were common threads across the programs, and across research, that can be a roadmap for others seeking to increase the numbers of low-income and racially, ethnically, and linguistically different students who are identified as gifted and achieve at high levels.\n1. Match identification procedures and programming with level of developed talent. As students move through school and become more expert in a specific area, programs to support their continued talent development (e.g. AP courses) tend to have specific and selective criteria for admission and retention, ones that emphasize demonstrated achievement. Conversely, successful programs for younger students cast a wide net and use a broader range of qualifying criteria, allowing more students to gain exposure to advanced skills and curriculum and affording the opportunity for teachers to look for indicators of readiness to move on to more advanced coursework. There are multiple ways to cast a wide net. Project Excite, a collaboration between the Evanston (IL) School District and Northwestern University identifies culturally and linguistically different children with potential for advanced work in STEM at the third grade.\nThe program uses standardized tests for this purpose, but includes students within a wider range of achievement -top 25% -one that is appropriately calibrated to the students' level of developed talent, their younger ages, and their previous opportunity to learn. The goal of Project Excite is to provide supplemental, outside of school opportunities that raise students' achievement to the top 5% so that they qualify for placement in honors level courses in the 9 th grade (Center for Talent Development, n.d.).\nThe Young Scholars program in Fairfax County (VA) Public Schools uses challenging curriculum with kindergarten through second graders to help reveal exceptional thinking, interest, and motivation in students. Teachers are trained to take a multi-dimensional look at 8 evidence of gifted potential through a review of daily learning activities, performance assessments, and interactions with their students. Students' abilities are further nurtured by cluster grouping them within classrooms taught by teachers trained to provide differentiated, advanced lessons. Like many of the programs highlighted at the summit, the Young Scholars program creates a gateway for young students to start on a path of continuous talent development and the first step towards subsequent gifted programming and advanced coursework offered by the school district (Fairfax County Public Schools, n.d.).\n2. Build awareness about diversity of high-ability learners. Most educators understand that not all gifted students are alike, but there are also misconceptions about giftedness and gifted learners that must be addressed school-wide. For example, giftedness is often viewed narrowly as already fully developed talent manifested in the form of high achievement on test scores (Neumeister, Adams, Pierce, Cassady, & Dixon, 2007) . This high-performance view tends to overlook students with the potential to achieve but who first need access to challenging curriculum and enriched learning opportunities before they are able to demonstrate their advanced ability. Creating a school culture that rejects deficit thinking about low-income and racially, ethnically, and linguistically different students is essential to creating pathways to high achievement for these students. The beliefs of teachers and administrators about the nature of talent and giftedness and specifically that ability is malleable and achievement reflects previous opportunity to learn, are critical to creating a school culture that is focused on the talent development of all children with high potential (Subotnik, Olszewski-Kubilius, & Worrell, 2011 Teachers of young children work side-by-side with gifted specialists to learn how to increase the challenge level of their lessons. They are also trained to spot behavioral indications of advanced reasoning and thinking in their young students. Through this focus on teacher training, many more students' talents have been revealed and more culturally and linguistically diverse students have entered school and district gifted programs (Fairfax County Public Schools, n.d.).\nIf we are serious about talent development, we must understand that some students will come to school with high levels of already developed talent, evidenced by high test scores and abovegrade level achievement. Others have exceptional potential that may not be demonstrated in outstanding achievement. We must serve all these gifted students, providing acceleration for those who are ready to soar ahead and enrichment and talent development opportunities for students whose talents and motivation are just emerging. In the field of gifted education, we have traditionally been locked into a process of \"identify first, and then provide opportunity.\"\nHowever, if our field is to embrace the mission of cultivating the talents of all children, including those from poverty and culturally and linguistically different backgrounds, we must shift our thinking to a sequence that focuses on developing talent first, through early enrichment and challenging educational opportunities, followed by assessment and formal identification.\n3. Attend to non-cognitive factors affecting achievement. There are a host of psychosocial factors that affect student achievement and are important to address in programs for high-ability culturally different students. These factors include mindsets, or students' beliefs about intelligence and ability. Those who believe that intelligence and ability is fixed tend to attribute success as a result of ability alone and tend to blame lack of success on a lack of talent (Dweck, 2012) . Instead, it's important for educators to help students develop a growth mindset, which emphasizes that high levels of talent can be developed through hard work, effort, and deliberate practice (Duckworth, Kirby, Tsukayama, Berstein, & Ericsson, 2011; Ericsson, Krampe, & Tesch-Römer, 1993) . Having this mindset can help students persist in the face of setbacks (Good, 2012) and take risks, which in turn can build high self-esteem and help students resist negative stereotypes (Aronson & Juarez, 2012 ) that can affect test performance, willingness to engage in challenging academic activities, and ultimately, long-term academic development (Steele, 2010) .\nAnother important psychosocial factor that teachers and school counselors can help instill in high-ability students is motivation to succeed. Researchers investigating academic decision making have found that if students believe the doing well is important to their future success and will reap the same rewards for them as for others, they are more likely to work hard to get good grades (Eccles, 2006; Graham, 2009 teachers and counselors so that they could effectively support students as they encountered significantly increased academic rigor in their pre-AP classes. All of the programs were committed to maintaining high expectations and rigorous, advanced curriculum coupled with increased supports for students. An essential equation underlying these programs was \"challenge + support = student success\" (NAGC, n.d.).\nMany successful programs highlighted at the NAGC summit found ways to increase time on task and to extend the school day for low-income and culturally diverse students. Although extended learning time has been a component of programs aimed at low-income, low-performing students (Stonehill, et al., 2009 ), it has not been widely utilized for higher achieving students, but can provide students with additional supports to prepare for success commensurate with their abilities. Programming through Project Excite was conducted completely outside of school.\nExcite students participated in more than 400 hours of after-school, weekend, and summer programming from grade 3 through grade 8. SEO involved high school students in the equivalent of 60 additional school days via summer and after-school classes and programs. One of the advantages of outside of school programs, noted by Project Excite students, was the freedom to showcase their abilities without fearing negative peer reactions (Lee, Olszewski-Kubilius, & Peternel, 2009 ). The school-based Young Scholars program used school breaks and summers to\ngive students additional academic enrichment. SEO and TEAK Fellowship involved high school 13 students in various types of summer programming focused on academic enrichment and leadership. NGVF provided academic advising for high school aged students to ensure that they took and succeeded in academically rigorous courses and significantly supplemented in-school coursework with distance education courses and summer programming (NAGC, n.d.).\nIt's also important to remove barriers to gifted students making continuing progress in their talent areas. For example, schools should provide access to advanced courses earlier than usual for students who are ready for them; create multiple and alternative paths for students to qualify and enter advanced courses and programs of study including portfolios and criteria adjusted for previous opportunities to learn; create preparatory programs utilizing summers, weekends, and after-school time, to ensure that students at the cusp of meeting qualifying criteria have the opportunity to participate in advanced courses and programs; train teachers on how to create inclusive classrooms and supportive environments; and change policies that prevent acceleration or earning credit for outside-of-school courses. In sum, educators must provide opportunities that expand access.\n4. Deliberate cultivation of support networks for students. All students need support for academic success. For promising students from diverse or low-income backgrounds, it's important to be in advanced classes with other bright, talented students like them (Miller, 2004) .\nEducational opportunities that increase the challenge level for students must be coupled with deliberate efforts to create cadres of peers who share students' goals of high achievement and provide encouragement. Project Excite identifies third-grade students with emergent talent across 14 multiple schools in a large K-8 district. Students participate in outside of school gifted programs designed only for them as well as programs involving other gifted children. Peer cohorts are deliberately arranged and peer friendships cultivated through program activities including courses and family events-with the specific purpose of creating a supportive peer network for students when they matriculate to their large high school. In addition, Excite student networks are also explicitly expanded to include gifted students beyond their school district so that they are prepared for the diverse peer environment they will likely encounter later in post-secondary education (Center for Talent Development, n.d.).\nPeer networks, together with supportive and well-trained adults, can help change students'\npersonal expectations so that they have the motivation and mindset for the hard work necessary to develop advanced skills and knowledge and the resiliency to persist in challenging courses of study. Providing access to older, successful students who can offer advice and guidance about negotiating school challenges unique to talented minority and low-income students, and adults who can serve as guides and mentors will help students envision their futures in higher education and on career paths. Project Excite used older Excite students-of high school age-to work with younger Excite students, and SEO and TEAK assigned adult mentors to each student.\nProject Nexus called on the local businesses, universities, and community leaders to expose students to careers and higher education. Also, many low income high-ability students, particularly those who are first generation college attendees, need additional, personalized college counseling to navigate the intricacies of the process so that they are not deterred from applying to more selective schools with high price tags. SEO, NGVF, and TEAK Fellowship all provided additional, one-on-one college counseling and advising to supplement what students 15 received in their schools. NGVF assigned each student an advisor who stayed with that student from program entrance at grade 8 to matriculation to college. The advisor counseled students regarding course choices in high school, guided students on how to build a college resume, helped in identifying institutions of higher education that matched students interests and goals, served as a liaison to students' schools, and assisted in troubleshooting academic and personal problems (NAGC, n.d.).\nSchools should actively assist students with finding outside of school programming opportunities, as these often offer additional academic preparation, support, and career guidance.\nSome talent fields are developed primarily in school and some mostly outside of school, but no talent is developed exclusively in school (Subotnik, Olszewski-Kubilius, & Worrell, 2011) .\nRather than being viewed as an \"extra\" or non essential activity, outside of school programs are vital for the full development of talent for all gifted children, but especially for children whose home schools may not provide the academic rigor and supportive peer environments they require. The challenge for all of us is increasing access to outside of school opportunities.\nIt's important to include parents, caregivers, and other family members in these efforts (Davis, 2010) . Some programs presented at the summit had strong parent education components, such as Project Excite, which regularly gathered parents together in meetings to assist them in implementing strategies to support their child's goals and aspirations at home and become stronger advocates for their child at school. The TEAK Fellowship sponsored a parent support group to families while students were in the program (NAGC, n.d. college planning sessions for their students. NGVF partnered with universities to provide a summer program on business entrepreneurship, advanced and accelerated courses, and distance education courses. By partnering and collaborating with universities and community-based organizations, programs were able to offer a rich array of opportunities and services to their students resulting in a more comprehensive and ultimately successful program (NAGC, n.d.)."}, {"section_title": "Change Needed", "text": "More work is needed to identify additional programs across the country that are succeeding in identifying and serving culturally and linguistically different gifted students and low-income gifted students, specifically looking beyond the gifted field where exceptional, successful models are being developed. We suspect many more exist but they are difficult to uncover as program administrators are busy conducting them rather than writing about them. These could serve as helpful models-starting points--for educators looking for ways to identify and serve the high ability and high achieving culturally and linguistically different students in their schools and districts. Further research is also needed on these programs so as to better understand their critical components and underlying processes, and to investigate their replicability and scalability. We also need research that looks simultaneously at various interventions so as to discern generalizable features across programs. In sum, we need to know \"what works, when, and with whom\" (Olszewski-Kubilius & Clarenbach, p. 21, 2012).\nHowever, because the situation is dire, we cannot wait for all the research to come in before intensifying our efforts, especially since there is a body of research that points toward important factors affecting the achievement of under-served gifted learners and programs already exist that have records of success, such as the ones highlighted here.\nWe have learned from these programs that high expectations on the part of teachers, administrators, parents, and students are critical-and these must be reinforced with experiences 18 of success in challenging classes. With deliberate reflection and concerted action, barriers at all levels -school, district, state, and federal -that inadvertently thwart the identification of emergent talent and continuous learning growth can be identified and removed. The programs discussed here were not flush with money but found creative ways, through partnerships, collaborations, and the use of alums and community members, to offer a wide range of supports to students that built content-related competency and skills and helped students meet the social and psychological challenges they faced in stepping onto and traveling a path of high achievement.\nGifted education leaders must find their voice in addressing the nation's education problemsspeaking loudly and consistently about the need to simultaneously address excellence as well as achievement gaps among our students in our education policies, funding priorities, and local programmatic efforts. We must also make it clear to the broader education community that our field cares very much about and is vital to the development of high levels talent in students from all sectors of our society and that we have viable solutions to offer. The field of gifted education must hold itself accountable for reaching the goal of having the percentages of culturally and linguistically different students within gifted programs and advanced courses match their representation within the population.\nWe must continue to emphasize the importance of training for all educators so as to identify and provide appropriate educational opportunities for all the high ability and high achieving students in their schools and classrooms. This training and education must include specific strategies and procedures for meeting the needs of culturally and linguistically different gifted learners. As a 19 field we must provide more professional development in gifted education strategies and advocate for a greater focus on gifted learners within pre-professional teacher education programs to ensure that all classroom teachers and other school professionals are prepared to respond to the academic diversity of students in the building and district.\nIncreasing success for all gifted students including those whose talents are still emerging will require a variety of strategies and approaches. Gifted education professionals and supporters must challenge all educators to acknowledge our failings to date and set into motion a new approach that reflects a belief -and commitment -that our schools cast off unequal expectations for students based on income or cultural or racial group and instead recognize, support, and celebrate the highest levels of achievement of which each student is capable."}]