[{"section_title": "Abstract", "text": "OBJECTIVE-To assess the effect of subsyndromal symptoms of depression (SSD) on ratings of disability for individuals with mild cognitive impairment (MCI).\nNeuroimaging Initiative (ADNI) study were analyzed. Participants were evaluated at baseline and at six month intervals over two years. Severity of depressive symptoms was rated utilizing the Geriatric Depression Scale. Disability was assessed utilizing the Functional Assessment Questionnaire (FAQ). Other clinical variables included white matter lesion (WML) and intracranial brain (ICV) volumes derived from MRI, ratings of overall cognitive function (Alzheimer's Disease Assessment Scale; ADAS), and ApoE status. Demographic variables included age, education, and gender. Publisher's Disclaimer: This is a PDF file of an unedited manuscript that has been accepted for publication. As a service to our customers we are providing this early version of the manuscript. The manuscript will undergo copyediting, typesetting, and review of the resulting proof before it is published in its final citable form. Please note that during the production process errors may be discovered which could affect the content, and all legal disclaimers that apply to the journal pertain. * Data used in preparation of this article were obtained from the Alzheimer's Disease Neuroimaging Initiative (ADNI) database (www.loni.ucla.edu/ADNI). As such, the investigators within the ADNI contributed to the design and implementation of ADNI and/or provided data but did not participate in analysis or writing of this report. ADNI investigators include (complete listing available at http://www.loni.ucla.edu/ADNI/Collaboration/ADNI_Manuscript_Citations.pdf\nAuthor manuscript Am J Geriatr Psychiatry. Author manuscript; available in PMC 2017 August 08. \nAuthor Manuscript Author Manuscript RESULTS-SSD individuals had a lower volume of WML and higher frequency of ApoE ε4 alleles than depression free participants but the two groups did not differ with respect to other clinical or demographic variables. At baseline SSD individuals were 1.77 times more likely to have poorer FAQ scores than individuals with no symptoms of depression after controlling for the effect of cognitive functioning, ICV, WML, and ApoE status. The presence of SSD at baseline was not associated with poorer course of disability outcomes, cognitive functioning, or conversion to dementia over 24 months.\nCONCLUSIONS-SSD demonstrated a significant impact on disability for MCI individuals who are also at high risk for functional limitations related to neurodegenerative disease. Therefore, the treatment of SSD may represent a significant avenue to reduce the burden of disability in this vulnerable patient population."}, {"section_title": "Introduction", "text": "Major Depressive Disorder (MDD) is now recognized as being the leading cause of lifetime disability and the 4th leading contributor to the global burden of disability worldwide (1) . It has been estimated that approximately 3-5% of the general elderly population experience depressive symptoms meeting criteria for MDD (2) and MDD is consistently shown to be particularly disabling for older adults (3) . MDD is also a frequently co-occurring syndrome of neurodegenerative disease in later life and many studies have estimated the prevalence of MDD in patients with Mild Cognitive Impairment (MCI) and dementia to exceed 20% (4) . Further, MDD has been shown to be a strong contributor to disability in both dementia patients (5) and individuals with MCI (6) and has also been reported as a significant independent risk factor for early institutionalization of dementia patients (7) . As such, the impact of MDD on disability among individuals with neurodegenerative disease is typically not disputed, however the impact of mild depressive symptoms on disability in this patient population is less clear.\nAn emerging literature is currently developing which suggests that the presence of mild or subthreshold depressive symptoms, i.e. subsyndromal symptoms of depression (SSD), may also be a significant contributor to disability in older adults. SSD is typically defined as the presence of depressive symptoms at a frequency or intensity not meeting DSM-IV diagnostic criteria for major or minor depression (8) . The prevalence of SSD for older community dwelling adults is often estimated at 15% (9) and in MCI estimates of up to 50% have been reported (10, 11) . Further, SSD have also been shown to be significantly associated with disability and functional limitations in community dwelling older adults (12, 13) . However, to date, the impact of SSD on disability for individuals with neurodegenerative disease is not well understood. Of particular salience is the degree to which SSD impacts disability in the early stages of neurodegenerative disease, i.e. MCI, given that SSD has been identified as a significant factor associated with poorer quality of life in MCI patients (14) . However, to our knowledge, there have been no reported studies which have specifically evaluated the impact of SSD on measures of disability in MCI populations. Further, of the limited studies evaluating the impact of depressive symptoms on conversion to dementia, for which disability is a critical feature, the results have been equivocal (15, 16 ).\nAn important aspect of determining the relationship of SSD to disability in MCI populations will be the degree to which SSD is associated with structural brain abnormalities that may also contribute to depression and disability. MRI markers of cerebrovascular disease are particularly relevant given consistent findings that white matter lesions (WML) are strongly associated with MDD in older adults (17) and WML can directly influence disability through reduced motor speed and coordination, muscular strength, oculomotor function, and balance (18, 19) . Although the independent contributions of depressive symptoms and structural brain abnormalities on disability is understudied, one recent investigation reported that WML was associated with increased disability in a community sample of older adults independent of cognitive functioning and depressive symptom severity (19) . As such, evaluating the degree to which WML is associated with SSD and may contribute to disability outcomes in MCI individuals with SSD is an important consideration. Similarly, Apolipoprotein E (ApoE) is an important susceptibility gene for Alzheimer's disease which could influence disability outcomes, and while most studies evaluating the relationship of MDD to APOE have largely been negative (20) , the relationship of ApoE to SSD has not been adequately evaluated.\nThe present study was conducted to evaluate the impact of SSD obtained from standard clinical measures on disability ratings for a sample of older adults meeting criteria for mild cognitive impairment who participated in the Alzheimer's Disease Neuroimaging Initiative (ADNI). We hypothesized that SSD in MCI participants will be common, will significantly impact disability ratings at baseline, and will be predictive of a poorer course of disability and more rapid conversion to dementia over two years. Further, we hypothesized that SSD would be associated with an increased burden of white matter lesions and that white matter lesions will also significantly contribute to disability ratings independent of SSD, ApoE status, and level of overall cognitive functioning."}, {"section_title": "METHODS", "text": "The Alzheimer's Disease Neuroimaging Initiative (ADNI): ADNI was launched in 2004 by the National Institute on Aging (NIA), the National Institute of Biomedical Imaging and Bioengineering (NIBIB), the Food and Drug Administration (FDA), private pharmaceutical companies, and non-profit organizations. More than 800 participants, ages 55-90, have been recruited from 59 sites across the U.S. and Canada to be followed for 2-3 years. The primary goal of ADNI is to determine whether serial magnetic resonance imaging (MRI), positron emission tomography (PET), other biological markers, and clinical and neuropsychological assessment can accurately measure the progression of MCI and early AD. The identification of specific biomarkers of early AD and disease progression will provide a useful tool for researchers and clinicians in both the diagnosis of early AD and in the development, assessment and monitoring of new treatments. For additional information about ADNI, see www.adni-info.org. Demographic information and clinical data utilized for this study were downloaded from the ADNI clinical data repository (https:// www.loni.ucla.edu/ADNI/Data/ADCS_Download.jsp). The July 19, 2009 version of the ADNI clinical database was used for all analyses."}, {"section_title": "Participants", "text": "Four hundred and five participants who received a diagnosis of MCI at baseline were included in analyses. The criteria for diagnosis of MCI included: 1) age between 55 and 90 years, 2) complaints of memory loss by the patient and confirmed by a family relative, 3) Mini-Mental State Exam(21) score of 24 and higher, 4) overall Clinical Dementia Rating scale(22) score of 0.5, and 5) quantitative evidence of memory impairment relative to age and education matched peers. Exclusion criteria at baseline included: 1) the presence of Major Depressive Disorder or significant symptoms of depression (Geriatric Depression Scale(23) score of 6 or higher), 2) modified Hachinski ischemia score greater than 5, 3) significant neurological or psychiatric illness, 4) use of antidepressant drugs with anticholinergic side effects, and 5) high dose of neuroleptics or chronic sedatives or hypnotics, antiparkinsonian medication, and use of narcotic analgesics. All subjects had their blood ApoE genotype determined. Diagnoses of dementia at follow up evaluations were made by consensus and at multi-disciplinary case conference meeting according to NINCDS/ADRDA criteria (24) ."}, {"section_title": "Assessment of Disability", "text": "The Functional Activities Questionnaire (FAQ)(25)-The FAQ evaluates the ability of participants to complete 10 domains of complex activities (e.g. managing finances, preparing a meal, shopping alone). The total score on the FAQ was utilized as the primary measure of disability and scores ranged from 0-20 with higher scores representing increased disability."}, {"section_title": "Assessment of Symptoms of Depression", "text": "Short Form Geriatric Depression Scale(GDS)(23)-The GDS consists of 15 \"yes\"/\"no\" questions and total scores range from 0-15 with higher scores denoting more depressive symptoms. Scores of 6 or greater on this scale are often viewed as representing symptoms consistent with major depression (26) . For this study, individuals scoring >0 and ≤5 on the GDS were classified as exhibiting SSD."}, {"section_title": "Assessment of Cognitive Functioning", "text": "The Alzheimer's Disease Assessment Scale Cognitive Scale (ADAS-Cog) (27) -The ADAS-cog is a widely utilized 11-item instrument devised to assess the severity of cognitive impairment in patients with AD. The total score range is 0 to 70 points, with a higher score indicating poorer cognitive performance."}, {"section_title": "MRI Methods", "text": "All subjects had MRI at 1.5T. The data were collected at multiple ADNI sites using a standardized MRI protocol (http://www.loni.ucla.edu/ADNI/Research/Cores/index.shtml), which was developed after a major effort evaluating and comparing 3D T 1 -weighted sequences for morphometric analyses (28) . In this study, the MRI data came from 58 centers. Details of MRI acquisition and processing are described previously (29) . Briefly, for each subject 2 T 1 -weighted MRI scans were collected using a sagittal volumetric magnetization prepared rapid gradient echo (3D MP-RAGE) sequence with the following acquisition parameters: echo time (TE) of 4 ms, repetition time (TR) of 9 ms, resolution: 0.94 × 0.94 × 1.2 mm. The ADNI MRI quality control centre at the Mayo Clinic (Rochester, MN, USA) selected the MP-RAGE image with higher quality based on standardized criteria (30) . More details about MRI standardization in the ADNI study can be found in reference (28) ."}, {"section_title": "White Matter Lesion Volumes", "text": "Automated white matter lesion volume segmentation was performed with FreeSurfer software package, version 4.4 (http://surfer.nmr.mgh.harvard.edu/fswiki). MP-RAGE images from individual participants were used in automated atlas-based segmentation to classify brain image voxels into WM, GM, CSF and hypointense WML tissue compartments which is a commonly utilized approach (31) . To correct for differences in head size, intracranial volume (ICV) measurement (in mm3) obtained by FreeSurfer brain extraction were used as a covariate in analysis of WML volumes (in mm3). A full description of the FreeSurfer processing steps is previously published (32) .\nStatistical Analyses-To evaluate the relationship of SSD to demographic and clinical characteristics of the sample, bivariate associations were assessed using Wilcoxon Mann Whitney tests (age, education, WML) and Fisher's exact tests (APOE, Gender). To evaluate the impact of SSD on functional disability at baseline, a proportional odds logistic regression (POLR) model was utilized. POLR is a more robust form of regression, allowing for the skewed and non-normal distribution of FAQ scores at baseline. In this case, POLR models the log-odds of moving from any cumulatively lower category into a cumulatively higher (worse) category of FAQ. Response-stratified means of each predictor were compared to their expected values, conditional on the response, to evaluate the proportional odds assumption. Measures of FAQ were taken every 6 months over 24 months of follow up. To assess the rate of change in FAQ scores over 24 months and its association with each of the covariates of interest, a longitudinal analysis was performed using generalized estimating equations (GEE) assuming an exchangeable correlation structure. FAQ scores were collapsed into three categories (FAQ = 0, 1 to 5, and 6+) to allow for model estimates to converge. The categories were designed to have approximately even sample sizes. Odds ratios from both the GEE and POLR model were reported to evaluate the relationship between function and symptoms of depression. In a secondary hypothesis, the rate of change in ADAS scores was modeled using GEE to assess the relationship between cognition and symptoms of depression. Demographic variables (age, education, and gender) were removed from the final model due to a lack of relationship with FAQ scores but WML was retained due to a significant relationship with FAQ scores and symptoms of depression. Models were also adjusted for ApoE status, ICV, and overall cognitive function (ADAS-Cog) because of their known association with functional outcomes and because of their observed associations with depressive symptom categories. We assessed time to conversion from MCI to dementia using an interval-censored parametric survival model. Time to conversion was known to have occurred between 6-month visits and not on an exact date, requiring interval-censoring.\nResidual plots showed the Weibull distribution to be an appropriate fit for the data. A ratio of mean time to conversion was used to compare the SSD group to individuals with no symptoms of depression. Covariates were included using the same criteria as the POLR models."}, {"section_title": "Results", "text": "The demographic and clinical characteristics of the sample are provided in Table 1 . At baseline, 312 (77%) of 405 MCI participants had GDS scores of greater than zero and less than 6 and were categorized as exhibiting subsyndromal symptoms of depression (SSD). SSD participants were marginally younger and had a higher frequency of ApoE ε4 alleles than depression free participants but the two groups did not differ with respect to education, gender, ratings of mental status (MMSE), or overall cognitive function (ADAS-Cog; see Table 1 .). WML data was available for 311 of the 405 MCI participants and individuals with WML data did not differ from those without WML data (n=94) with respect to gender, age, depression severity, FAQ score, MMSE or ADAS-Cog scores. SSD participants had lower WML volumes than depression free individuals after adjusting for total intracranial volume ( Table 1 ).\nThe median FAQ scores at baseline in the depression free and SSD groups were 1 and 3, respectively. SSD participants were 1.77 times more likely to have worse FAQ scores than individuals without symptoms of depression after adjusting for ApoE4 allele status "}, {"section_title": "Discussion", "text": "Our major findings include the following: 1) SSD is common among MCI participants, as hypothesized, 2) SSD was significantly associated with baseline ratings of disability for this patient population, as hypothesized, 3) SSD was associated with lower burden of white matter lesions, which was unexpected, and 4) SSD was not associated with poorer course of disability or conversion to dementia over two years, which was also unexpected. Each of these findings will be discussed below.\nOur results indicate that a majority (77%) of MCI participants in this sample exhibited SSD. Given the elevated rates of MDD in MCI samples, this finding was not unexpected but highlights that the incidence of SSD in this sample was substantially higher than what is typically reported in studies of community dwelling older adults (9) . Given the incidence of SSD in this patient population we believe that our finding that SSD have a significant impact on disability in MCI participants at baseline is particularly salient for several reasons. First, and perhaps most importantly, SSD and minor depression are treatable (33) and while an association between SSD and disability does not imply a casual relationship, there is the potential that functional deficits associated with SSD may be prevented or minimized in individuals with MCI with appropriate intervention. While most medication treatments for depression are not commonly utilized for occasional or subthreshold symptoms of depression, there are several psychosocial interventions that may be particularly effective in the treatment of SSD in individuals with MCI (34) (35) (36) . To date, however, the efficacy of these approaches for the treatment of SSD for individuals with MCI have not been specifically evaluated but there is an emerging evidence base to suggest that individuals with MCI can benefit from psychotherapeutic interventions for major depressive disorder (37) . With effective treatment of SSD, the burden of disability in MCI patients may be significantly reduced. Second, given the incidence of SSD in this sample, evaluating the impact of SSD on functional outcomes among individuals with neurodegenerative disease should be more routinely employed to clarify the etiology of disability in this patient population.\nWe did not see a relationship between increased WML and the presence of SSD as we expected. Conversely, in our sample individuals with SSD had significantly less WML than depression free individuals. Given this finding we would conclude that while significant symptoms of depression, i.e. MDD, may be associated with white matter abnormalities due to a direct contribution of structural brain abnormalities to depressed mood, i.e. the vascular depression syndrome (38) , this relationship is not as strong for milder symptoms of depression in MCI participants. However, our findings of a modest relationship of APOE status to SSD do suggest a potential genetic risk factor for SSD in MCI patients. Similarly, our finding that increased WML was not a significant contributor to greater burden of disability at baseline in this sample did not support our hypothesis and was inconsistent with results from a recent study of older community dwelling adults (19) . We interpret our finding to suggest among individuals with MCI, who as a group are at higher risk for developing Alzheimer's disease than a sample of community dwelling older adults, the presence of white matter lesions may have less of a direct impact on disability.\nOur findings that SSD was not associated with a poorer course of disability or cognitive functioning over two years suggests that SSD are not features of MCI individuals who are at higher risk for poor functional outcomes over time. These findings contrast findings in community based samples in which baseline depression symptom severity has been shown to be one of the strongest predictors of future disability (39) . Similarly, our results also did not support our hypothesis that SSD at baseline would be associated with more rapid conversion to dementia. Therefore, based on our data, we would conclude that the treatment of SSD in MCI participants will not likely significantly delay the onset of dementia.\nOverall, this study has several strengths including a large sample size, very good characterization of MCI status, informant ratings of disability, APOE status, MRI measures of cerebrovascular disease, and a relatively long follow up period. Despite these strengths, there are several limitations to the study which should be highlighted. First, it is important to note that for our designation of SSD we did not require specific depressive symptoms of the GDS to be endorsed and we did not exclude any individual items of the GDS from our statistical analyses. This approach was chosen because while the GDS total score has been validated as a measure of depression in MCI patients (40) , the psychometric properties of specific items from this scale have not been adequately evaluated with MCI patients. Therefore, some items of the GDS, and in particular item 10, i.e. \"Do you feel you have more problems with memory than most\" may be viewed as being more directly related to insight into cognitive deficits than as a symptom of depression in this patient population. However, we elected in retain this item, and not require specific clusters of depressive symptoms to be present in our designation of SSD, because our primary intent was to evaluate the degree to which SSD obtained from standardized clinical scales impact disability in MCI patients. Nonetheless, further evaluation of the validity of the GDS, and specific items from this scale, for use in MCI populations is warranted.\nAdditional limitations of this study include that diagnostic evaluations of minor depression were not conducted and therefore it is possible that some of the patients that we designated as exhibiting SSD may have in fact met diagnostic criteria for minor depression. Further, the sample represented a fairly selective group in that participants with cerebrovascular disease were excluded from participation and that our analyses focused on baseline symptoms of depression predicting functional declines over the evaluation period. As such, it is also possible that some of the participants that initially did not meet criteria for major depressive disorder may have worsened over time to the point that they would have met criteria for major depression at follow up evaluations contributing to poorer disability ratings for the group. Because our stated aims were focused on following individuals with SSD at baseline over time we elected not to exclude individuals whose symptoms of depression worsened over the two year follow-up period from our analyses. We also did not evaluate the degree to which the presence or absence of SSD fluctuated over the two year interval and we recognize that SSD may not have been consistently exhibited over this interval. Additionally, the determination of WML volumes was based on T1 weighted images which is less well suited than T2-weighted contrasts, such as fluid attenuated inversion recovery (FLAIR) to detect white matter lesions. Therefore, we cannot exclude that this factor contributed to our failure to demonstrate the hypothesized association between SSD and WML. Lastly, we averaged WML volumes over the whole brain to evaluate the relationship of white matter abnormalities and SSD which might be a less specific measure than regional WMSH volumes given that previous studies have shown that frontal WML may have stronger associations with depressive symptoms than WMSH in other brain regions (41) .\nDespite these limitations, the results of this study suggest that SSD are common in individuals with MCI and have a significant impact on disability. Given that SSD is treatable, interventions for SSD may be effective for reducing disability in this patient population. Although we observed a modest correlation between SSD and APOE status, we did not see a positive relationship between SSD and MRI measures of white matter abnormalities as we expected. As such, further study will be necessary to identify potential biological contributors to SSD in MCI patients. Further, although SSD was associated with disability ratings at baseline, SSD was not linked to poorer course of cognitive or functional outcomes over time, suggesting that SSD is not a sensitive phenotypic marker of individuals at risk for poorer functional outcomes and that the treatment of SSD will not likely slow the progression of dementia. "}]