[{"section_title": "Abstract", "text": "Abstract-Objective: To investigate the relationships between age-associated decreases in endogenous serum total testosterone (T) and a free T index (FTI) in men and the subsequent development of Alzheimer disease (AD). Method: The authors used a prospective, longitudinal design with follow-up in men since 1958. Participants were from the Baltimore Longitudinal Study of Aging, a community-dwelling volunteer sample with baseline ages of 32 to 87 years. All subjects were free of AD at baseline T assessment. Five hundred seventy-four men assessed at multiple time points were followed for a mean of 19.1 years (range, 4 to 37 years). Diagnoses of AD were based on biennial physical, neurologic, and neuropsychological evaluations. Results: Diagnosis of AD was associated inversely with FTI by itself and after adjustments for age, education, smoking status, body mass index, diabetes, any cancer diagnoses, and hormone supplements. In separate analyses, total T and sex hormone binding globulin were not significant predictors after adjustment with covariates. Increases in the FTI were associated with decreased risk of AD (hazard ratio ϭ 0.74; 95% CI ϭ 0.57 to 0.96), a 26% decrease for each 10-nmol/nmol FTI increase. Conclusions: Calculated free testosterone concentrations were lower in men who developed Alzheimer disease, and this difference occurred before diagnosis. Future research may determine whether higher endogenous free testosterone levels offer protection against a diagnosis of Alzheimer disease in older men. NEUROLOGY 2004;62:188 -193 A sizable literature now exists relating age-related alterations in the endocrine environment to cognitive changes 1-3 and the onset of Alzheimer disease (AD) in women. [4] [5] [6] [7] The comparative dearth of similar research in men may be attributable primarily to the fact that testosterone replacement therapy (TRT) has been used much less commonly in men than hormone therapy in women. Moreover, TRT has not been administered for time periods that are sufficiently long to establish linkages to AD. Nevertheless, androgen levels in men decrease substantially with age, raising the question of whether this decrease may contribute to the development of AD. 8, 9 Although numerous studies have demonstrated contributions of testosterone (T) to selected cognitive functions in young [10] [11] [12] and old men, 13-15 to date there have been no studies assessing prospectively the risk for AD associated with the so-called \"andropause.\"\nDecreased total T levels have been reported in men with AD compared with age-matched control subjects. 16 However, these data are ambiguous because the depleted T levels may be a consequence rather than a cause of the disease. To assess the impact of T decline in the subsequent manifestation of AD, it is essential to obtain measures of T that precede the development of the disease.\nIn the present study, we followed 574 men whose ages at baseline T assessment ranged from 32 to 87 years for a mean duration of 19.1 years. We collected multiple serum samples for determination of total T, sex hormone binding globulin (SHBG), and the calculated free T index (FTI) and evaluated presence or absence of a diagnosis of AD as the principal outcome variable. We report here the first prospective longitudinal study assessing the impact of long-term total and estimated free T levels on the development of AD.\nMethods. Subjects. Subjects were men who volunteered to participate in the Baltimore Longitudinal Study of Aging (BLSA), a study performed by the National Institute on Aging (NIA).\n17 Participants were community dwelling and returned every 2 years to the Gerontology Research Center of the NIA for comprehensive medical and neuropsychological evaluations. Androgen data were available for a large number of BLSA men whose blood samples were assayed as part of a study of prostate health and disease."}, {"section_title": "", "text": "A sizable literature now exists relating age-related alterations in the endocrine environment to cognitive changes [1] [2] [3] and the onset of Alzheimer disease (AD) in women. [4] [5] [6] [7] The comparative dearth of similar research in men may be attributable primarily to the fact that testosterone replacement therapy (TRT) has been used much less commonly in men than hormone therapy in women. Moreover, TRT has not been administered for time periods that are sufficiently long to establish linkages to AD. Nevertheless, androgen levels in men decrease substantially with age, raising the question of whether this decrease may contribute to the development of AD. 8, 9 Although numerous studies have demonstrated contributions of testosterone (T) to selected cognitive functions in young [10] [11] [12] and old men, [13] [14] [15] to date there have been no studies assessing prospectively the risk for AD associated with the so-called \"andropause.\"\nDecreased total T levels have been reported in men with AD compared with age-matched control subjects. 16 However, these data are ambiguous because the depleted T levels may be a consequence rather than a cause of the disease. To assess the impact of T decline in the subsequent manifestation of AD, it is essential to obtain measures of T that precede the development of the disease.\nIn the present study, we followed 574 men whose ages at baseline T assessment ranged from 32 to 87 years for a mean duration of 19.1 years. We collected multiple serum samples for determination of total T, sex hormone binding globulin (SHBG), and the calculated free T index (FTI) and evaluated presence or absence of a diagnosis of AD as the principal outcome variable. We report here the first prospective longitudinal study assessing the impact of long-term total and estimated free T levels on the development of AD.\nMethods. Subjects. Subjects were men who volunteered to participate in the Baltimore Longitudinal Study of Aging (BLSA), a study performed by the National Institute on Aging (NIA). 17 Participants were community dwelling and returned every 2 years to the Gerontology Research Center of the NIA for comprehensive medical and neuropsychological evaluations. Androgen data were available for a large number of BLSA men whose blood samples were assayed as part of a study of prostate health and disease.\nThe Institutional Review Board of the Johns Hopkins Bayview Medical Center approved this study, and all subjects provided written informed consent to participate in BLSA studies of physical and cognitive health.\nProcedure. Hormone determinations. Blood was collected at each visit since 1963 and stored at Ϫ70°C. As part of the BLSA prostate study, 3,621 samples were analyzed to examine the longitudinal changes in serum T in 901 men, of whom 547 had outcome data after age 55 years. 9 Samples selected for assay were those from the three visits just before 1995 and visits closest to 10, 15, and 20 years before the most recent visit for each subject. Blood samples were drawn between 6 and 8 AM after an overnight fast. All serum T and SHBG measurements were performed at Covance Laboratories (McLean, VA). The FTI was calculated by dividing serum T by SHBG. The FTI, calculated from radioimmunoassay (RIA) of total T and SHBG, has been shown to be well correlated with measures of free T by dialysis (apparent free testosterone concentration [AFTC] ) and bioavailable T by ammonium sulfate precipitation (BT) and is simpler to obtain. 18 Vermeulen 19 and Morley 18 have demonstrated recently that calculation of an index from T and SHBG, as determined by immunoassay, provides a rapid, simple, and reliable index of bioavailable T, highly correlated with AFTC or BT. This methodology is suitable for clinical determinations, except for pregnant women, in whom SHBG concentrations are high.\nDetails of the hormonal assays have been published previously. 9 T levels were determined in duplicate using 125 I double antibody RIA kits obtained from Diagnostic Systems Laboratories (Webster, TX). Samples were assayed in batches during a several month period. The mean minimum detectible T levels were 0.42 nmol/L, with intra-assay and interassay coefficients of variance of 4.8 and 5.7% at concentrations of 7.74 and 7.29 nmol/L, and 3.3 and 6.4% at concentrations of 44.7 and 42.9 nmol/L. SHBG concentrations were measured using RIA kits purchased from Radim (Liege, Belgium) that use 125 I-labeled SHBG and polyethylene glycol-complexed second antibody. The sensitivity of the SHBG assay was approximately 10 nmol/L. The coefficient of variation at 5 nmol/L was 22% and at 25 nmol/L was 5%, with intra-assay and interassay coefficients of variance of 3.4 and 10.8% at concentrations of 22 and 19 nmol/L, and 1.8 and 7.7% at concentrations of 117 and 118 nmol/L. Preliminary analysis of data from the samples stored between 1961 and 1995 revealed a significant increase in T level with length of storage, independent of subject age. On investigation, we were able to demonstrate that the increase was caused by a date-related assay artifact. 9 A mixed-effects model was used to adjust T, SHBG, and the FTI for the date effect, and these are the values used in this article. 20 Based on 3,651 samples from the original study, mixed-effects models considering baseline age, year, and elapsed time from first measurement were used to estimate values adjusted for the date artifact. Additionally, a constant of 4.02 nmol/L was added to all T values to adjust for a constant and systematic underestimate compared with the standard (extraction) assay. Numbers of assays per subject ranged from 2 to 10; 90% of the men had 6 or fewer assays, 35 men (6%) had 7 assays, and 15 men (3%) had more than 7 assays. Because assays were performed originally to assess the impact of androgens on prostate health, other steroids of interest, such as estradiol, were not available for analysis.\nDiagnosis of AD. Procedures for the diagnosis and follow-up evaluation of AD in BLSA participants have been described in detail elsewhere. 21 Diagnoses were determined during consensus conferences using data from neurologic, neuropsychological, laboratory, and imaging assessments. Diagnoses of dementia and AD were based on the criteria of the Diagnostic and Statistical Manual of Mental Disorders, 3rd edition, revised (DSM-III-R) 22 and National Institute of Neurologic and Communicative Disorders and Stroke-Alzheimer's Disease and Related Disorders Association (NINCDS-ADRDA). 23 Active BLSA participants aged Ͼ65 years were followed every 2 years as part of their routine BLSA visits; participants aged 55 to 64 years were assessed if they scored three or more errors on the Blessed Information-MemoryConcentration (BIMC) test. Inactive participants aged Ն55 years were screened with a telephone version of the BIMC (TIMC), and a family informant was screened by telephone using a structured questionnaire. Participants with three or more errors on the TIMC or informant reports of cognitive decline received home visits, including neurologic and neuropsychological evaluations.\nCT scans and laboratory studies were performed for participants meeting criteria for dementia. In addition, a 15% age-stratified random sample of individuals with two or fewer TIMC errors received home visits. In the present sample, 54 men were diagnosed with AD, of whom 32 were probable diagnoses, 13 were possible diagnoses, and 9 were diagnoses consistent with AD (i.e., met criteria for probable AD but were missing laboratory testing).\nAnalyses. We performed time-dependent proportional hazards with SAS PROC PHREG (SAS Institute Inc., Cary, NC) to examine the risk for AD associated with serum values of FTI, total T, and SHBG. 24 The dependent measure was time from entry into the cohort to AD diagnosis. We performed three sets of primary analyses with and without covariates of FTI, total T, and SHBG separately. To facilitate interpretation of hazard ratios (HRs), we rescaled the FTI by multiplying by 10 and rescaled the SHBG concentration by dividing by 100. In the first set of analyses, we predicted AD onset from time-dependent values of FTI, total T, and SHBG in three separate analyses without adjustment for covariates. In the second set of analyses, we added timedependent and fixed covariates that might modify or account for the association between T measures and risk of AD. Timedependent covariates were age (years), smoking status (ever vs never), body mass index (BMI), diabetes (diagnosis vs no diagnosis), any diagnoses of cancer (diagnosis vs no diagnosis), and use of hormone supplements, including thyroid replacement, sex steroids, glucocorticoids, and gonadotropin-releasing hormone (GnRH) agonists (use vs no use). We added one fixed covariate: years of education. To avoid confounding dementia with other neurologic disorders, men with neurologic disorders other than dementia were censored at the time of diagnosis.\nTo avoid the effects of concurrent T values predicting diagnoses because changes in T could be a consequence of AD, assay values were included in analyses only when they preceded diagnoses of AD by Ͼ2 years. In secondary analyses, we increased the \"lag\" between the last T measure and AD from 2 years to 5 and 10 years to increase the likelihood that T was not determined by disease outcome. Because the FTI, total T, and SHBG values are continuous measures, the risk reflects the incremental effect per unit change in hormone concentration-per 10 nmol/nmol for the FTI, 1 nmol/L for total T, and 0.01 nmol/L for SHBG. In the final secondary set of analyses, we examined the risk for all-cause dementia associated with FTI, total T, and SHBG.\nResults. Primary analyses. Table 1 shows the means and proportions of the baseline and last measures included in the time-dependent proportional hazards analyses for the complete sample and separately for men with and without diagnoses of AD. Men were followed for 19.1 years (range, 4 to 37 years). Men diagnosed with AD were followed for 17.3 years (range, 4 to 33 years); men with no diagnosis of AD were followed for 19.2 years (range, 3 to 37 years). Men with diagnoses of AD were approximately 7 years older than men without AD diagnoses (p Ͻ 0.01). AD was not associated with total T at baseline or last assay. However, the FTI was associated with AD at baseline and last assay (p Ͻ 0.01). Men with AD were leaner at baseline and last assay (p Ͻ 0.01) as indicated by their lower BMI. There were no significant differences between groups in SHBG, educational level, smoking history, diabetes incidence, cancer incidence, or use of hormone supplements.\nAs shown in table 2, significant reduction in risk for AD was associated with higher FTI (HR ϭ 0.41; 95% CI ϭ 0.34 to 0.50). After adjusting for the effects of age, education, smoking status, BMI, diabetes diagnosis, any cancer diagnoses, and hormone supplementation, a significant reduction in the risk for AD associated with FTI (HR ϭ 0.74; 95% CI ϭ 0.57 to 0.96) remained evident. These results indicate an approximately 26% reduction in the risk of AD for each 10-unit (nmol/nmol) increase in FTI.\nSignificant risk for AD also was associated with age, years of education, smoking status, BMI, diabetes diagnosis, and hormone supplementation (see table 2 ). Age and smoking were associated with increased risk, whereas education, BMI, diabetes, and hormone supplementation were associated with reduced risk for AD. In separate analyses, significant reduction in risk for AD was associated with higher total T and SHBG considered alone but not after adjustment for covariates (table 3) .\nSecondary analyses. The effect of removing T values that were concurrent with the preclinical phase of AD was examined by reanalyzing these data by increasing the temporal separation (lag) between the last T assay and the outcome from 2 years to 5 and 10 years (see table 2 ). The results of the reanalyses were virtually identical to the results of the primary analyses, and the same effects were significant and nonsignificant in both sets of analyses.\nTo determine whether these findings generalize to allcause dementia, we examined the risk associated with FTI on all-cause dementia (see table 4 ). In addition to 43 men with AD, there were 25 men with other diagnoses of dementia, including vascular dementia (n ϭ 13), Parkinson disease with dementia (n ϭ 2), other dementia (n ϭ 2), and dementia unspecified (n ϭ 8). Although there was a significant unadjusted risk for any dementia associated with FTI (HR ϭ 0.51; 95% CI ϭ 0.44 to 0.60), the covariateadjusted risk was not significant (HR ϭ 1.06; 95% CI ϭ 0.88 to 1.29). We obtained similar results after increasing the temporal separation between the last T assay and the outcome from 2 years to 5 and 10 years.\nDiscussion. The results of the present study demonstrate a significant association between long-term endogenous calculated free T concentrations and subsequent diagnoses of AD. After controlling for the influence of covariates, there was an approximately 26% reduction in the risk of AD for each 10-unit (nmol/nmol) increase in FTI.\nOne previous study found lower total T levels in patients with AD, but these researchers could not discern if the lower T concentrations occurred before or after diagnosis of AD. 16 Importantly, T measures in the present study were determined over multiple time points before the onset of AD and demonstrated greater reductions in FTI values among those who ultimately went on to develop AD. Our findings suggest that decreasing FTI levels may contribute to, rather than result from, AD. The latter conclusion is supported further by our finding that the significant effect of high FTI in reducing the risk for AD was observed even restricting analyses to T values 5 and 10 years before the diagnosis of disease.\nIn our analyses, the FTI proved to be a better predictor of subsequent AD diagnosis than did total T concentration. This suggests that our findings are not the result of the confounding influence of age because both measures show a similar pattern of age-related decline. 9 Additionally, this finding provides evidence that the associations are significant physiologically because the FTI is more highly correlated with bioavailable T. 19 In addition, the FTI effect persists when controlling for diabetes mellitus and is not likely a result of the relationship between SHBG and insulin resistance. Moreover, our results did not generalize to all-cause dementia.\nSeveral covariates also were associated with risk for AD. Age and smoking were associated with increases in risk, whereas education, BMI, diabetes, and hormone supplementation were associated with a reduced risk for AD. The increased risk associated with age and decreased risk associated with higher education levels are consistent with studies of risk and protective factors associated with AD. 21, [25] [26] [27] [28] The reduction in risk associated with diabetes may reflect the fact that those individuals have higher mor- tality rates than people without diabetes and therefore may not live sufficiently long to pass through the risk period for AD. Observational studies and some small randomized clinical interventions suggested that hormone therapy in women might exert beneficial effects on specific cognitive functions 1-3 and might reduce the incidence and delay the onset of AD. 4, 5, 29 Research published recently from the Women's Health Initiative Memory Study (WHIMS) has called into question these earlier findings. Data from the large multicenter randomized clinical trials of the WHIMS indicated an increased risk for dementia among women assigned to combination estrogen plus progestin therapy compared with placebo, 7 a finding that might reflect an increased risk for vascular dementia. 30 These findings suggest that caution is warranted in interpreting the present observational data but also highlight the need for more comprehensive studies of the effects of T in men.\nNumerous investigations support the biologic We coded dichotomous covariates in the direction of risk (risk of smoking, risk of diabetes, risk of cancer diagnoses, and use of prescription hormone supplements) and continuous variables in the direction of increasing value (increasing T, increasing age, increasing years of education, and increasing body mass index).\nHazard ratios reflect incremental changes in AD risk per one nMol/L change in Total T and per 0.01 nMol/L change in SHBG.\nAD ϭ Alzheimer disease; SHBG ϭ sex hormone binding globulin; HR ϭ hazard ratio. plausibility of a neuroprotective effect of T on cognitive and brain function. In rodents, strain-specific age-related deficits in long-term memory have been associated with decreased serum T concentrations, 31 and androgen treatment modulates memory deficits in mice expressing human APOE-⑀4, a genetic risk factor for AD. 32 Androgen treatment prevents NMDA excitotoxicity in hippocampal CA1 neurons 33 and may facilitate recovery after injury by promoting fiber outgrowth and sprouting in hippocampal neurons. 34 Moreover, T decreases ␤-amyloid secretion from rat cortical neurons 35 and reduces ␤-amyloidinduced neurotoxicity in cultured hippocampal neurons. 36 In the latter study, T increased the secretion of nonamyloidogenic amyloid precursor protein via aromatase-mediated conversion to estradiol. In humans, T suppression for management of prostate cancer resulted in a twofold increase in plasma ␤-amyloid concentrations in elderly men, suggesting that endogenous T might reduce plasma amyloid concentrations in humans. 36 Moreover, T was found to be protective of human primary neurons in culture, and this neuroprotection was independent of estrogen action. 37 Taken together, these findings suggest that T may exert important neurotrophic and neuroprotective effects and play a critical role in ␤-amyloid biochemistry, making it a potential therapeutic agent for the prevention and management of AD in men.\nThe present data combined with those of previous studies in men without dementia suggest the possibility that T may inhibit cognitive decline and reduce the incidence or delay the age at onset of AD in men. [10] [11] [12] [13] [14] [15] [38] [39] [40] These findings also are more broadly consistent with important CNS functions of T that have been demonstrated in human and nonhuman species. 6, 41 Although our data suggest the possibility of a protective effect of T on the development of AD, we cannot confirm a causal impact of T given the observational nature of the study. It is possible, for example, that high T concentrations in older men may be reflective of enhanced physical or mental health. Several features of our analyses argue against such an interpretation. First, we controlled statistically for several health-related factors that might potentially affect T concentrations or cognitive aging, including age, education, smoking, BMI, and diabetes status. Most importantly, FTI, but neither total T nor SHBG, was associated significantly with AD outcome.\nResults of the current study suggest that in aging men, maintenance of endogenous free T concentrations in the higher part of the normal range may decrease the risk of AD. Randomized clinical trials appear warranted to assess the safety of T administration in men, to determine whether T administration can prevent or delay the onset of AD, and to investigate whether androgenic or estrogenic mechanisms, or both, mediate neuroprotection. Such studies will determine whether there are clinical benefits of T substitution in elderly men and the effects of steroid hormones on cognitive aging and other brain functions. We coded dichotomous covariates in the direction of risk (risk of smoking, risk of diabetes) and continuous variables in the direction of increasing value (increasing FTI, increasing age, increasing years of education, and increasing body mass index). Hazard ratios reflect incremental changes in AD risk per 10 nMol/nMol change in FTI.\n* p Ͻ 0.05. † p Ͻ 0.01.\nAD ϭ Alzheimer disease; FTI ϭ free testosterone index; HR ϭ hazard ratio."}]