[{"section_title": "INTRODUCTION", "text": "The primary funding stream for child care assistance in the USA is the Child Care and Development Fund (CCDF), a program that was established alongside the passage of welfare reform in 1996. One of the CCDF's main objectives is to ease the financial burden associated with child care so that low-income parents may seek and maintain stable employment. The creation of an employment-based child care subsidy system represents an important shift in the USA's approach to early care and education policy but one that is reflected throughout much of the contemporary social safety net. Indeed, since its creation in 1996, CCDF child care subsidies have become an increasingly important policy tool aimed at raising work levels among economically disadvantaged women with young children. A full account of the US child care subsidy system requires a thorough understanding of the ways in which subsidies influence both parents and their children. With respect to parents, the most heavily studied outcome is employment, which is not surprising in light of the CCDF's work mandate. Accordingly, a large number of studies have consistently found large, positive effects of child care subsidy receipt on parental employment (e.g., Tekin, 2005Tekin, , 2007aTekin, , 2007bBlau and Tekin, 2007;Herbst, 2010a) as well as participation in education and job training (Herbst and Tekin, 2011a). However, there are growing concerns over the implications of employment-based subsidies for child and maternal well-being (e.g., Blau, 2001;Adams and Rohacek, 2002;Tekin, 2010a, 2010b). Regarding child well-being, these concerns appear to find support across several strands of the empirical literature. First, a large body of work consistently finds that by itself, early and later maternal employment leads to small reductions in children's cognitive ability (e.g., Brooks-Gunn et al., 2002;Ruhm, 2004Ruhm, , 2008James-Burdumy, 2005), increases in a number of adverse health outcomes (Morrill, 2011), and increases in childhood obesity (Anderson et al., 2003). Second, a number of papers have studied directly the impact of child care subsidies on preschool-aged children's health and development. This work finds that subsidy receipt lowers cognitive ability test scores, increases a variety of behavior problems, and increases the prevalence of overweight and obesity (Herbst and Tekin, 2010a, 2010b, 2011b. In this paper, we turn our attention to the question of whether child care subsidies influence other dimensions of family well-being, namely, maternal physical and mental health, and the quality of child-parent interactions. 1 We hypothesize that subsidy receipt may affect family well-being through several mechanisms. First, the work requirement embedded in the CCDF forces a shift in mothers' time allocation from non-market activities-including leisure and time spent with children-to formal work. As a result, employment-based child care subsidies increase the opportunity costs associated with leisure, thus making time-intensive well-being investments less likely. Subsidized mothers may therefore participate in fewer recreational activities, spend less time exercising and maintaining a healthy diet, and decrease the utilization of formal medical and mental health services. Aside from the shift in time allocation, the employment-driven effects of child care subsidies may depend on the characteristics and quality of the jobs in which mothers are engaged. It is possible that subsidized mothers endure substantial job-related stress because of the inaccessibility of reliable transportation, presence of hazardous work conditions, or unpredictable and non-standard work schedules. Alternatively, mothers may move into family-friendly work environments with access to high-quality health insurance options, paid family and medical leave, and on-site child care arrangements. The existing empirical evidence, however, suggests that parents receiving subsidies work disproportionately in low-wage occupations that offer few training opportunities and benefits (Berger and Black, 1992;Okuyama and Weber, 2001;Danziger et al., 2004;Davis and Jefferys, 2007;Ha, 2009). Furthermore, a related literature on welfare reform shows that the introduction of Temporary Assistance to Needy Families (TANF) led to reductions in health insurance coverage and health care utilization among single mothers (Bitler et al., 2005). Given that many subsidy recipients were influenced by the TANF reforms, it is plausible that they too experienced such declines. Second, child care subsidies may affect family well-being through changes in income and consumption. Insofar as the receipt of a subsidy represents a positive income shock, such assistance is predicted to alter the mix of health-related goods and services purchased. These changes can have conflicting effects on family well-being. Subsidy-induced increases in income may increase unhealthy activities if these are normal goods. Expenditures on alcohol and cigarettes could increase, and families may invest fewer resources in the home production of meals. Conversely, subsidy-induced increases in income may increase investments in personal growth and allow mothers to purchase household technologies that reduce stress and promote healthy lifestyles. Families may also shift away from the consumption of calorie-dense foods (e.g., fast food) and sedentary activities (e.g., television) and toward the consumption of health-promoting foods and activities. Finally, employment-based child care subsidies may reduce or fundamentally alter the nature and quantity of maternal time with children (Baker et al., 2008). Children are likely to spend fewer hours per day in parental care and more hours in the care of a child care provider. Depending on the relative productivity of maternal care, this environmental shift may have implications for child and maternal well-being. In addition, a range of parenting behaviors-from nurturance and emotional receptivity to disciplinary practices-may change, especially in the short-run, as subsidized women with little employment experience adjust to the dual demands of paid work and childrearing. In addition, several aspects of the home environment could change in ways that affect the quality of maternal interactions with the child. Mealtime and bedtime might fluctuate, and the types of activities that structure parent-child interactions could shift as mothers adjust to volatile work schedules or experience the physical and psychological effects of working. Previous research on the impact of maternal employment or child care subsidy programs on family well-being remains surprisingly sparse. A recent paper by Chatterji et al. (forthcoming) uses the NICHD Study of Early Child Care to examine the impact of early maternal work on maternal health and parenting quality. It finds that maternal work intensity is negatively correlated with self-reported health and positively correlated with depressive symptoms and parenting stress. Perhaps the most relevant papers to the current study are the evaluation of Brodeur and Connolly (2012) and Baker et al. (2008) of Quebec's child care subsidy program (i.e., the so-called $5-perday program). Although the new subsidy system increased maternal labor supply, parents experienced a reduction in happiness, poorer health, more hostile parenting, and a reduction in marital satisfaction. This paper provides the first evidence on the implications of the US child care subsidy system for family wellbeing. A key innovation of the paper is that it draws upon three nationally representative surveys, providing us with a rich set of family well-being outcomes, some of which are virtually identical across the surveys. Combining complementary information on family well-being using a multi-dataset strategy should add both breadth and depth to our understanding of the influence of child care subsidies on family well-being. Another innovation of the paper is the use of different empirical strategies both within and across the surveys to identify the impact of child care subsidies on family well-being. In addition to simple ordinary least squares regressions, we attempt to deal with the potential endogeneity of subsidy receipt through the use of value-added models, a unique instrumental variables strategy, and exploiting program eligibility rules to create treatment and comparison groups. Thus, a finding of similar subsidy effects across each survey and empirical method should bolster our confidence in the results. Our findings consistently show that child care subsidies are associated with reductions in maternal physical and mental health, and poorer interactions between parents and children. Subsidy receipt lowers the likelihood that a mother reports being in good health and increases symptoms consistent with anxiety, depression, and parenting stress. Subsidized mothers also reveal more psychological and physical aggression toward their children. Overall, our findings suggest that public policies aimed at increasing the employment of low-skilled mothers may undermine their health and have negative implications for the parent-child relationship. Such findings are broadly consistent with previous work showing that child care subsidies have detrimental effects on child well-being (Herbst and Tekin, 2010a, 2010b, 2011b. Section 5 discusses the possibility that changes in maternal health represent a potential mechanism through which subsidy receipt influences child outcomes."}, {"section_title": "OVERVIEW OF CHILD CARE SUBSIDY POLICY IN THE USA", "text": "A key feature of the CCDF is the substantial flexibility granted to state authorities in the design and administration of the subsidy system. 2 In exchange for this increased flexibility, CCDF rules stipulate that funds can only be used when parents are engaged in a state-defined work activity, including paid employment, job training, and education. Expenditures through the CCDF have increased over time, eclipsing those of other early childhood education programs (e.g., Head Start and state pre-kindergarten). In 2010, approximately $9.5 billion in combined federal and state CCDF funds were distributed to more than 1.7 million children and 998,600 families each month (Administration for Children & Families, 2011). Eligibility for CCDF assistance is conditioned on three primary factors: (i) the presence of at least one child under age 13 years in the household; (ii) a means-test, such that household income must not exceed 85% of the state's median income; and (iii) parental involvement in a state-defined work activity (e.g., formal employment, education, job training, or job search). Nevertheless, states have the authority to establish key parameters of the subsidy system, including eligibility thresholds, reimbursement rates, and co-payment levels. States periodically conduct market rate surveys to determine the reimbursement rate that would, in principle, ensure parental access to high-quality child care. The federal recommendation is to set reimbursements at the 75th percentile of the local child care price distribution, but most states establish lower rates because of funding constraints. Low levels of reimbursement not only limit parental access to high-quality child care but also weaken incentives for providers to make quality-enhancing investments (Herbst and Tekin, 2010a). To encourage rapid entry into the paid labor force, parents are free to use child care subsidies to purchase most legally operating child care services, including unregulated relatives or in-home caregivers. Indeed, approximately one-fifth of subsidized children are exposed to legally operating unregulated providers, with 60% of this care produced by relatives (Administration for Children and Families, 2011). Consequently, it seems likely that parental child care decisions are guided by such factors as convenience, word-of-mouth recommendations, and cultural preferences, all of which may result in the purchase of sub-optimal child care quality (Pungello and Kurtz-Costes, 1999). Another concern is that the CCDF's employment emphasis may discourage child care providers from making costly investments to improve quality. In particular, providers that rely heavily on subsidized children may experience revenue shortages when parents lose eligibility because of income or employment changes. Consistent with this concern, the Child Care Subsidy Dynamics Study team (2002) finds that the average duration of subsidy receipt is fairly short, ranging from 3-7 months. Ha (2009) also shows that 50% of initial child care subsidy spells end within 6 months, and among children beginning a new spell, 61% do so with a different provider."}, {"section_title": "DATA AND MEASURES", "text": "3.1. Data sources 3.1.1. Fragile Families and Child Well-Being Study. The Fragile Families and Child Well-Being Study (FFCW) is a longitudinal birth cohort survey of approximately 5000 children born between 1998 and 2000 in 20 medium to large US cities (Reichman et al., 2001). Parents included in the FFCW were first interviewed at the time of the focal child's birth (baseline), with follow-up telephone interviews occurring when the child reached approximately 12 (one-year follow-up), 36 (three-year follow-up), and 60 (5-year follow-up) months of age. 3,4 Our FFCW analyses rely primarily on the 36-month core and in-home surveys, in which the maternal well-being and child-parent outcomes were measured and parents were asked about the focal child's current child care arrangements. Of the full FFCW sample (N = 4898), our analyses rely on a sub-set of 3100 children and parents. We make exclusions from the sample if the parent did not complete an interview during each of the first three waves of data collection (889 cases), the parent or child did not complete any component of the 3-year in-home module (856 cases), the child did not reside with the mother at the time of the 12 or 36-month follow-up (31 cases), and data on child care subsidy receipt were missing at 12 or 36-month follow-up (22 cases). 3.1.2. Early Childhood Longitudinal Study-Kindergarten Cohort. The Early Childhood Longitudinal Study -Kindergarten Cohort (ECLS-K) is a nationally representative survey of approximately 21,000 children who entered kindergarten in the fall of 1998. Children in the sample are followed through the end of eighth grade, with parent and child interviews administered in the fall and spring of kindergarten (1998 and 1999) and the spring of first (2000) and third (2002). Over 20 children per school from over 1200 public and private schools are included in the sample. The ECLS-K analyses draw on the fall and spring of kindergarten waves of data collection, in which survey items inquiring about family well-being (spring of kindergarten) and child care arrangements (fall of kindergarten) are available. Our analysis sample retains children living with an unmarried biological mother or female guardian (related or unrelated) at the start of kindergarten. We focus on unmarried mothers because, as previously stated, this group constitutes a large majority of eligible subsidy recipients (Herbst, 2008a). Exclusions from the sample are made if the child or parent is missing information on all of the outcome variables (2236 cases) or the entire fall of kindergarten parent interview (740 cases), the questions regarding child care subsidy receipt (35 cases), and census tract identifiers (2,256 cases). We exclude an additional 12,607 children who do not meet our requirements for residence with an unmarried mother. The resulting analysis sample includes 3378 children and their parents. 5 3.1.3. DDB Worldwide Communications Life Style survey. Each year since 1975, the advertising agency DDB Worldwide Communications Commissions Market Facts, a commercial polling firm, to conduct the Life Style Survey on a sample of approximately 3500 Americans (Putnam and Yonish, 1999;Putnam, 2000;Herbst, 2011). The Life Style Survey covers a remarkably diverse set of topics that includes battery of questions on self-reported quality-of-life and in particular, a standard question tapping global life satisfaction. We create the analysis sample by pooling cross-sections of Life Style Surveys between 1986 and 2004 and retaining unmarried women (never married, separated, divorced, and widowed) ages 18-45 years irrespective of the presence of children in the household. Single mothers are defined as such if they have at least one child ages 0 to 17 years. As explained in more detail in the next section, our identification strategy relies in part on the differential policy treatment of single mothers (who are eligible to receive a subsidy) and single childless women (who are ineligible to receive a subsidy). Our analytic strategy further distinguishes between single mothers with children of different ages. In particular, CCDF rules stipulate that an eligible child must be under age 13 years. Therefore, single mothers with children ages 0 to 12 years comprise the policy treatment group, whereas those with children ages 13-17 years comprise the comparison group. Our final analysis sample includes 5669 unmarried women, of which 2594 have at least one child in the household. These datasets have several complementary qualities that make them advantageous for undertaking the current analysis. 6 First, the datasets together provide a rich set of outcomes, allowing us to examine multiple dimensions of family well-being, including self-reported global health and happiness, measures of anxiety, depression, and child-parent interactions. Furthermore, many of the outcomes found in the FFCW are identical to those in the ECLS-K. Thus, a finding of consistent subsidy effects across the outcomes common to both surveys provides a powerful robustness check on the relationship between subsidy receipt and family well-being. Second, using these datasets together allows us to explore family well-being at multiple points during children's preschool-age and school-age years. The FFCW, for example, measures subsidy receipt when children are 12 and 36 months old, whereas the ECLS-K measures subsidy receipt in the year before children enter kindergarten. The Life Style Survey, on the other hand, provides information on maternal well-being until children reach age 5 Additional deletions are made because the mother reported a nonsensical age (six cases), or information from parent interview could not be merged with the geographic variables (two cases). 6 Another potentially useful dataset for studying subsidy receipt is the Early Childhood Longitudinal Study-Birth cohort (ECLS-B). There are several advantages associated with these data. First, the ECLS-B is a longitudinal birth cohort study intended to investigate the impact of early childhood experiences on short and longer-run outcomes. As such, the ECLS-B could allow researchers to track subsidy receipt at multiple points between birth and kindergarten entry. Second, the ECLS-B's longitudinal structure allows analysts to construct panels of children and include individual fixed effects in the regression models. Finally, the ECLS-B includes a rich set of child outcomes. Nevertheless, for several reasons, we excluded these data from the current study. The ECLS-B has already been used by researchers to investigate questions similar to those studied here, whereas the datasets used in this paper have not been previously used to for our purposes. In addition, it contains comparatively little information on maternal health, which is a key focus of the current paper. Third, relative to the FFCW data, the ECLS-B does not collect information on the parent-child relationship, which is another key focus of the current paper. Finally, given the strengths associated with the three dataset chosen for this study, it was determined that adding a fourth a dataset would substantially increase the length of the paper while adding comparatively little in terms of substance. 17 years. Therefore, we are able to examine whether subsidy receipt differentially affects family well-being throughout periods in which mothers return to work after childbirth, children spend a growing share of time in non-parental care, and after they enter formal school. Finally, these datasets allow us to explore both short and longer-run consequences of subsidy receipt. In particular, whereas the FFCW and Life Style Survey outcomes are measured contemporaneously with subsidy receipt, the ECLS-K outcomes are measured approximately 1-2 years after the reference period for receiving a subsidy. Given the finding by Herbst and Tekin (2010b) that subsidies have attenuating effects on child well-being, it is important to examine this issue for other dimensions of family well-being."}, {"section_title": "Measures of child care subsidy receipt", "text": "The key independent variable in the FFCW and ECLS-K is a binary indicator that equals unity if a given focal child is coded as receiving a child care subsidy. In the FFCW, parents during the three-year follow-up were asked whether the focal child is currently receiving non-parental child care on a regular basis (i.e., occurring at least 1 day/week during the previous month). Parents answering affirmatively were then asked a series of questions about specific child care arrangements as well as whether they received help paying for child care expenses. Specifically, parents were asked the following: 'Does any person or any agency give you money, a voucher, or a scholarship to help pay for child care?' Seven choices were presented to parents, and we code those selecting 'government agency' as receiving a child care subsidy. Approximately 14% of FFCW children are coded as receiving subsidized care at the 36-month follow-up. In the ECLS-K, subsidy receipt is measured in the year prior to the child's entry into kindergarten. Specifically, during the fall of kindergarten interview, parents were asked about non-parental child care arrangements utilized throughout the previous 12 months. For each arrangement, a set of follow-up questions were then directed at parents to ascertain whether any help was received in paying for child care expenses. Specifically, parents were asked the following: 'Did any of the following people or organizations help to pay for this … provider to care for {CHILD} the year before {he/she} started kindergarten?' Four choices were then presented to parents, and we code those answering 'a social service agency or welfare office' as receiving a child care subsidy. Approximately 13% of ECLS-K children are coded as receiving a child care subsidy. 7 We take a different approach to measuring child care subsidies in the Life Style Survey. We parameterize changes to child care subsidy policy through a state-level variable capturing total federal and state expenditures through the CCDF. In particular, we express this variable as a ratio of real (in 2005 dollars) federal and state CCDF spending (and its predecessor programs) to the number of children ages 0 to 12 years in a given state and year. We then merge this aggregate information with the Life Style Survey over the period 1986-2004. Total CCDF spending grew from zero dollars in 1986 to approximately $77 in 1996 and $182 in 2004. Such a measure has been used extensively in previous work to proxy both the generosity of states' subsidy systems and the likelihood that a given low-income family will receive child care assistance through the CCDF (e.g., Meyer and Rosenbaum, 2001;Fang and Keane, 2004;Herbst, 2008b;Washbrook et al., 2011). As expected, this work consistently finds that an increase in the generosity of states' CCDF spending is associated with an increase in single mothers' labor supply and a reduction in welfare participation rates."}, {"section_title": "Family well-being outcomes", "text": "Together, the FFCW, ECLS-K, and Life Style Survey provide us with 14 measures of family well-being, with nine of these outcomes coming from the FFCW, four coming from the ECLS-K, and one coming from the Life Style Survey. Tables I and II provide detailed descriptions of the FFCW and ECLS-K family well-being outcomes, respectively, and show summary statistics for each measure. What follows is a brief overview of the outcomes explored in this analysis. The first four outcomes in Table I focus on maternal physical and mental health. We first examine selfreported overall health status through a binary indicator that equals unity if a given mother stated that she is in 'very good' or 'excellent' health. We then examine two dimensions of mental health as measured by the Short Form of the Composite International Diagnostic Interview (CIDI-SF) (Nelson et al., 1998). We create a binary indicator for each that equals unity if, on the basis of the responses to several individual items, a given mother meets the clinical criteria for Generalized Anxiety Disorder or a Major Depressive Episode. The mental health outcomes are particularly important for our purposes, given that previous work has found them to be All outcomes are drawn from the 3-year follow-up of the Fragile Families and Child Well-Being Study. The stratification by subsidy receipt status is based on a survey item in the 3-year follow-up inquiring about current child care subsidy participation. The number of observations varies across each outcome measure. influenced by maternal employment (Chatterji et al., forthcoming) and to influence child well-being (NICHD, 1999). The final outcome in this cluster is a measure of parenting stress, based on four items from the Panel Study of Income Dynamics' Child Development Supplement. This aspect of maternal well-being is also found to be affected by employment (Chatterji et al., forthcoming) and to have implications particularly for children's behavioral outcomes (Barry et al., 2005). The remaining outcomes in Table I capture various dimensions of the quality of the child-parent relationship. We first examine two outcomes related to maternal nurturance-responsive and sensitive parenting-both of which are drawn from subscales of the Home Observation for Measurement of the Environment, a widely used interviewer-based evaluation of the quality of the home environment. We express both outcomes as binary indicators that equal unity if a given mother is found to be 'fully responsive' or 'fully sensitive' to the child. The next two outcomes measure psychological and physical aggression toward the child. On the basis of the five items each from the Conflict Tactics Rating Scale, these measures capture harsh disciplinary practices used by parents. The individual items inquire about the frequency of various parental actions toward the child, and we create continuous measures of psychological and physical aggression by summing over the individual categories. The final indicator of child-parent interactions is a binary indicator that equals unity if the mother reported spanking the child in the month prior to the interview. The use of spanking is an important dimension of parents' overall disciplinary approach, and there is some evidence that it is correlated with both maternal employment (Berger, 2007;MacKenzie et al., 2011) and children's behavioral development (Gershoff, 2002). Table II provides a description of the family well-being outcomes included in the ECLS-K. These outcomes correspond to those found in the FFCW and thus offer a unique opportunity to check the consistency of the estimated subsidy effects across two independently drawn samples. A few points, however, are worth mentioning. The index of maternal anxiety is based on five items tapping the frequency during the previous week that respondents felt unusually 'bothered by things', experienced restless sleep, had trouble focusing, felt fearful, and felt that everything was an effort. Many of the items in this index are similar to those in the FFCW's CIDI-SF data source, but it should be noted that there is insufficient ECLS-K documentation to confirm that these items are drawn from the CIDI-SF. The index of maternal depression is based on the Center for Epidemiologic Studies Depression Scale, a widely used All outcomes are drawn from the spring of kindergarten wave of data collection in the Early Childhood Longitudinal Study-Kindergarten Cohort. The stratification by subsidy receipt status is based on a survey item in the fall of kindergarten survey inquiring about subsidy participation in the year prior to kindergarten entry. psychiatric tool for assessing depressive moods and somatic problems. The full scale is based on 20 items measuring the number of times in the previous week that respondents felt 'lonely', 'sad', or 'depressed' or 'could not shake off the blues'. The measure used in this study is based on a sub-set of seven items. The well-being outcome drawn from the Life Style Survey is a standard questionnaire item intended to measure respondents' life satisfaction: 'I am very satisfied with the way things are going in my life these days'. Respondents are asked to indicate the direction and intensity of their agreement with this statement on a scale of 1 ('definitely disagree') to 6 ('definitely agree'). 8 As previously discussed, this item measures global subjective well-being, in that it reflects an averaging of quality-of-life evaluations over multiple life domains (Kahneman et al., 1997;Kahneman and Deaton, 2010). 9 Survey-based measures of subjective well-being generally elicit views on the cognitive-or 'remembered'-dimensions of one's happiness or life satisfaction as a whole, as opposed to emotional well-being-or the instantaneous feelings of happiness, sadness, and other affectations in one's short-run experiences (Kahneman and Krueger, 2006). Such measures are gaining considerable traction in policy research, as they have been used to study the well-being effects of cigarette taxes (Gruber and Mullainathan, 2005), welfare reform (Herbst, 2013), macro-economic conditions (Wolfers, 2003), and unemployment insurance (Di Tella et al., 2003)."}, {"section_title": "EMPIRICAL IMPLEMENTATION AND RESULTS", "text": ""}, {"section_title": "Fragile Families and Child Well-Being Study", "text": "We begin by considering the following baseline model for the relationship between child care subsidy receipt and family well-being: where Y ist is one of the family well-being outcomes for family (i.e., mother) i in living in state s and in year t, and S ist is a binary indictor of subsidy receipt. The X' represents a vector of family characteristics, including maternal age, race and ethnicity, marital status, educational attainment, Peabody Picture Vocabulary Test score, and pre-birth work experience; the presence of other children in the household; the presence of grandparents in the household; and family income at the 12-month interview. 10 Also included are controls for the focal child's gender, age, and low birth weight status. The P' represents a rich set of census tract characteristics that may be correlated with subsidy receipt and family well-being, including median household income, racial and ethnic composition, percent foreign born, gender composition, percent of female-headed households, educational attainment and employment status, percent of households receiving public assistance, neighborhood vacancy rate, and percent of housing units without phone service. We also include a set of state-fixed effects, η s , which accounts for time-invariant differences across states in macro-economic conditions and social policies aimed at low-income families. Finally, all models include a set of year-of-interview dummy variables, quarter-of-interview dummy variables, interactions between the two, and an FFCW pilot city dummy variable. The temporal survey design controls account for within-wave annual and seasonal shocks to the demand for child care subsidies that may affect family well-being, whereas the pilot city dummy accounts for changes to the survey design and administration after the FFCW was implemented in the pilot cities. 11 The coefficient of interest in (1) is γ, which captures the average effect of child care subsidy receipt on family well-being conditional on a rich set of maternal and child characteristics, as well as the neighborhood and the state policy and economic environment. There are two important considerations regarding the estimation of (1). The first deals with the interpretation of γ, the coefficient on the binary indicator of subsidy receipt. Given that S ist takes a value of one for all subsidy recipients (and zero for all non-recipients), the empirical framework assumes homogenous policy treatments and treatment effects across geographical units, child care providers, and dosages of subsidy receipt. This is clearly a strong assumption. States and localities vary substantially in the administration of their subsidy systems, including the operation of eligibility and benefit reimbursement rules. Furthermore, subsidy policy by design allows children to enroll in a variety of child care arrangements, some of which are included in the formal market whereas others operate outside states' regulatory regimes. Finally, child care subsidy spells are known to be short, and it is common for children to experience multiple spells within a brief period (Ha, 2009). These considerations suggest that it is prudent to interpret γ as the average of heterogeneous effects of subsidy receipt across families exposed to varying amounts of the policy treatment and who operate in different policy environments (Herbst and Tekin, 2012). The second concern deals with the potential endogeneity of subsidy receipt. This is likely because subsidy recipients may differ from non-recipients in ways that are correlated with the measures of family well-being. Although some of the differences between recipient and non-recipient families can be accounted for by the control variables in (1), other differences are unobserved or difficult to measure. For example, parents who place a higher value on market work may be more likely to seek and accept a child care subsidy. If these parents are also more resilient to stress and depression or in better physical health, then they might attain higher levels of family well-being even in the absence of a child care subsidy. Alternatively, it is possible that parents who experience difficulties adjusting to the responsibilities of parenthood may increase their effort to obtain child care assistance. Failure to account for the unobserved differences between recipients and non-recipients that are correlated with family well-being will lead to biased estimates of subsidy receipt. To guard against omitted variable bias, we begin by adding clusters of control variables to (1) and observing the extent to which the coefficient on subsidy receipt changes. Results from this exercise are presented in columns (1) through (5) of Table III. We then estimate a value-added model, shown in column (6), which regresses measures of family well-being on contemporaneous child care subsidy receipt, contemporaneous family covariates, and a lagged measure of family well-being. We utilize the lagged outcomes from the 12-month interview to implement this analysis. 12 In principle, lagged outcomes capture the unobserved determinants of family well-being as well as unobserved endowments contributing to maternal health (Todd and Wolpin, 2003). The lagged variables account for baseline differences in family well-being across subsidy recipients and non-recipients up to and including the period in which the lagged measures are taken (i.e., 12-month interview). Given that subsidy receipt is measured at the 36-month interview, the lagged outcomes will not capture unobserved shocks to family well-being in between the two interview dates. However, we attempt to proxy the risk of a well-being shock by including in the valueadded models a rich set of observable maternal and child controls. Note that lagged dependent variables are available for only a sub-set of four well-being outcomes: self-reported health, anxiety and depression caseness, and spanking. As shown in Table III, adding controls incrementally appears to attenuate the coefficient on subsidy receipt. Nevertheless, the coefficient on child care subsidies remains statistically significant across seven of the nine family well-being models in the fullest specification [column (5)]. The estimates provide consistent evidence that subsidy receipt is associated with reductions in family well-being. The one exception is responsive parenting, which appears to be positively associated with subsidy receipt. Looking first at the maternal health 12 Including a lagged dependent variable is relevant for contexts in which there is a well-defined pre-treatment period (in this case, pre-subsidy-receipt). As we are able to observe whether a child received a subsidy during the 12-month interview, one might be tempted to exclude children receiving a subsidy at this interview date. However, this might introduce a form of sample selection bias if there is time dependence in the propensity to receive a subsidy. Our value-added models therefore constrain the analysis sample to families that did not receive WIC-a program also directed at low-income families-during the 12-month interview. In auxiliary analyses, we experimented with several other sample constraints, including maternal employment status and subsidy receipt at 12 months, and the results are similar to those reported here. outcomes in column (5), we find that subsidized mothers are 4.6 percentage points less likely to report being in 'very good' or 'excellent' overall health. Given that 62.1% of non-recipients are in 'very good' or 'excellent' health, the coefficient on subsidy receipt translates to a 7.4% reduction in health. Similarly, child care subsidies are associated with increases in the prevalence of depression caseness and increases parenting stress. The implied effect sizes for these outcomes are 19.5% and 3.1% [0.10 standard deviations (SDs)], respectively. The outcomes relating to child-parent interactions also imply a worsening of family well-being. Subsidized mothers are more psychologically and physically aggressive with their children. Acts of psychological aggression increase 11.6% (0.14 SDs), whereas those regarding physical aggression rise 13.3% (0.11 SDs). We also find that the use of spanking among subsidized mothers is 8.3% higher. Results from the value-added models [column (6)] also suggest that child care subsidies are negatively associated with family well-being. Estimates in the first and third rows imply that subsidy receipt is associated with a 13.7% decrease in the likelihood of being in 'very good' or 'excellent' health and a 32.7% increase in the likelihood of depression caseness. Both estimates are larger in magnitude than those in column (5), suggesting that subsidy receipt is positively correlated with baseline maternal health. It is plausible that healthier mothers self-select into subsidy receipt or that program administrators give priority to the most employable parents. Finally, we find that conditional on baseline spanking behavior, subsidized mothers are no more likely to spank their children. It is important to point out that the FFCW results discussed earlier are derived from a sample of married and unmarried mothers. In robustness checks, we estimate (1) on the sub-set of unmarried mothers to be consistent  Source: Authors' analysis of the Fragile Families and Child Well-Being Study, Three-Year Follow-Up. Each cell contains the coefficient on child care subsidy receipt, at 36 months, and robust standard errors (in parentheses). All maternal and child-parent interaction outcomes are measured at 36 months. See the text for a list of variables included in each regression. The survey design controls include dummy variables for the FFCW pilot cities, year-of-interview, quarter-of-interview, and interactions between the latter two. The number of observations in the lagged dependent variable models is 1812, 1807, 1809, and 1810, respectively. *p < 0.10, **p < 0.05 and ***p < 0.01. with the construction of the ECLS-K sample. Our results are virtually identical to those discussed earlier; if anything, the results point to larger negative effects of subsidy receipt. Unmarried subsidized mothers are 4.9 percentage points less likely than their unsubsidized counterparts to report being in 'very good' or 'excellent' overall health, and 3.3 percentage points more likely to meet the clinical criteria for depression caseness. Such mothers also score 0.10, 0.15, and 0.12 SDs higher on the measures of parenting stress, psychological aggression, and physical aggression, respectively, and are 5.5 percentage points more likely to engage in spanking. With the exception of the depression estimate, these results are statistically significant at conventional levels. The value-added version of (1) was also estimated on the sub-set of unmarried mothers, and the pattern of larger (negative) subsidy effects holds for these women as well. One final issue deserves attention. Recall that the binary indicator of subsidy receipt is coded zero for all nonrecipients, irrespective of employment or child care use status. Given that the CCDF creates strong incentives to move into employment and to shift from parental (or informal) child care to center-based (or formal) services, one could argue that a more appropriate counterfactual includes only non-recipients who use non-parental child care. Therefore, we recode the subsidy variable so that a value of zero is assigned to mothers who meet these alternative criteria. For comparison purposes, we create a second recoded subsidy variable in which the counterfactual includes non-recipients who use only parental care. In results available upon request, we find that relative to both counterfactual groups, well-being is consistently lower among subsidized families. Moreover, the magnitude of the well-being is fairly similar across both groups. Such results provide initial evidence that recipients' increased use of non-parental child care may not explain the reduction in family well-being."}, {"section_title": "Early Childhood Longitudinal Study-Kindergarten Cohort", "text": "Our next set of results comes from an analysis of the ECLS-K. We begin with a simple reduced form model to explore the relationship between subsidy receipt in the year before kindergarten entry and family well-being in the spring of kindergarten. To make the ECLS-K results more comparable to those from the FFCW, we make an attempt to include an analogous set of control variables in the regression model. Formally, the equation is specified as follows: (2) where Y ist is one of the family well-being outcomes and S ist is a binary indicator of child care subsidy receipt in the year prior to kindergarten. The vector given by X' contains a number of family characteristics, including maternal age, race and ethnicity, educational attainment, early work experience, the number of other children in the household, and total household size. The child characteristics include gender, age, premature birth status, low birth weight status, the presence of a disability, and a binary indicator for whether the child is a first-time kindergartner. The P' represents a set of census tract characteristics, including median household income, population density, racial and ethnic composition, percent foreign born, the age composition of children living in female-headed households, percent ages 65 years and older, and percent female. As discussed in Section 3, the family well-being outcomes included in the ECLS-K focus on maternal health and are very similar to those available in the FFCW. Columns (1) through (5) of Table IV provide the ordinary least squares (OLS) estimates of the effect of subsidy receipt on maternal health. Consistent with the story emerging from the FFCW, we find that subsidy receipt is associated with reductions in maternal health. Looking at the most comprehensive models in column (5), we find that subsidy receipt is associated with a 8.4 percentage point decrease in the likelihood that a mother reports being in 'very good' or 'excellent' health. Given that 59.1% of non-recipients are in 'very good' or 'excellent' health, the coefficient on subsidy receipt translates to a 14.2% reduction in overall health. Subsidized mothers also score higher on the indexes of anxiety (0.03 SDs) and depression (0.08 SDs), and such women exhibit higher levels of parenting stress (0.09 SDs). Although these results provide additional evidence that subsidy receipt is associated with reduced maternal health, concerns remain over the presence of unobserved heterogeneity. To improve the causal interpretation of γ in (2), we utilize an instrumental variables (IV) strategy to identify the impact of subsidy receipt. The IV strategy requires at least one variable that satisfies two conditions. First, it should be correlated with the potentially endogenous variable (subsidy receipt). Second, it should be uncorrelated with the outcome of interest (family well-being) expected through its relationship with subsidy receipt. Our proposed IV is based on the approximate distance that parents must travel from home to reach the nearest public social service agency that administers the subsidy application and benefits procedures. As discussed in detail elsewhere (e.g., see Tekin, 2010b, 2012), this strategy was implemented by creating a database containing the location (building number, street name, city, state, and zip code) of virtually every public social service agency in the USA. The database includes only those agencies involved in eligibility and benefit determination for CCDF child care subsidies. Armed with addresses of approximately 3600 social service agencies, the next step involved geocoding the location of each office by assigning a latitude and longitude coordinate to each. In the final step, we calculated the Euclidean (or as-the-crow-flies) distance (in miles) between the location of social service agencies and the centroid (or geographic center) of the census tract in which ECLS-K families reside. The distance measure is based on families' census tract because residential addresses are not available in the ECLS-K. Furthermore, given that states' child care subsidy programs are administered primarily at the county-level, we use families' county of residence as the geographic boundary for calculating the distances. 13 Regarding the first identifying criterion, there are several reasons to expect a negative relationship to emerge between families' travel distance to social service agencies and child care subsidy receipt. First, low-income families already face significant work-related and child care-related costs because of the limitations of public transportation systems and low car ownership rates (Ong, 2002;Berube and Raphael, 2005;Allard, 2009). Indeed, Edin and Lein (1997) find that single mothers' commute time to work is approximately 10 h/week, on average, and Michelson (1985) shows that mothers' daily trip from home to the child care provider increases total commute time by 28%. Furthermore, the travel distance to a social service agency can influence subsidy utilization at multiple stages of families' interaction with the subsidy system. Generally speaking, parents either voluntarily make or are required to make one or multiple personal visits to an agency. Of particular importance are policies regarding 13 Please refer to Appendix A in the work of Tekin (2010b, 2012) for a detailed description of the process for creating the distance-based instrumental variable. Each cell contains the coefficient on child care subsidy receipt, measured during the year prior to kindergarten entry, and the standard error (in parentheses). Robust standard errors are reported in columns (1) through (5), whereas clustered standard errors (at the census tract level) are reported in column (6). All maternal outcomes are measured in the spring of kindergarten. See the text for a list of variables included in each regression. County-by-travel distance interactions are used as the identifying instruments in column (6). *p < 0.10, **p < 0.05 and ***p < 0.01. Early Childhood Longitudinal Study-Kindergarten Cohort, Spring of Kindergarten. eligibility recertification. The time-limited nature of child care subsidies-usually lasting 3-12 months-implies that parents need to restart the eligibility process every few months to avoid benefit termination. Arranging these visits can be difficult for low-income parents because they typically lack reliable automobile transportation and experience frequent job turnover and seasonal or irregular work schedules (Ong, 2002;Waller, 2005;Holzer and Martinson, 2006;Layzer and Burstein, 2007). Together, the aforementioned considerations appear to have strong empirical support: previous work by Tekin (2010b, 2012) shows that low-income families' travel distance is in fact negatively correlated with child care subsidy utilization. The plausibility of the distance measure as an identifying instrument hinges on whether it can validly be excluded from (2). A key concern is that low-income parents may choose to live near a social service agency to increase the ease of accessing benefits. In addition, these agencies might locate in low-income neighborhoods so as to be close to potential clients. If the location decisions of parents and agencies are either indirectly correlated with maternal health (e.g., through strong preferences to work or make well-being investments) or related to other local demographic and economic determinants of well-being (e.g., through the close proximity of social service agencies to community resources that influence well-being), our exclusion restriction would be invalidated. Tekin (2010b, 2012) discuss in detail a number of reasons that families' travel distance should not be directly related to family well-being. First, previous empirical work finds that individuals do not Tiebout sort geographically to access public benefits (Rhode and Strumpf, 2003). This is especially plausible in the case of child care subsidies, given that these benefits serve only a small percentage of eligible families and are heavily rationed by local administrators. It is therefore unlikely that low-income families would use the geographic accessibility of child care subsidies as a reason for selecting one residential location over another. Endogenous location among social service agencies is also unlikely to be problematic. Allard (2009) finds that agency location choices are constrained in such a way as to reduce their ability to relocate quickly in response to changes in the geographic distribution of low-income families. Indeed, our ad hoc analysis of the agencies in our database confirms that most had been at the same address for several years. Nevertheless, we take a number of steps to empirically control for the neighborhood characteristics that are likely to be correlated with location preferences and family well-being. We include in (2) a set of controls for the neighborhood environment in which ECLS-K families reside. These census tract variables include the log of median household income; log of population density; percent non-Hispanic white; percent foreign born; percent ages 65 years and older; percent female; and percent ages 0-2, 3-5, 6-11, 12-13, 14, and 15-17 years in female-headed households. In addition, we add controls for the neighborhood environment in which social service agencies are located: log of median household income, log of population density, percent non-Hispanic white, percent foreign born, percent ages 65 years and older, percent female, percent of households receiving welfare, and percent of employed females ages 16 years and older. These variables control for the unobserved determinants of agency location decisions that may be correlated with the distance parents must travel to apply for child care subsidies. Finally, our models include state-fixed effects to account for permanent demographic, economic, and social policy differences across states that may influence subsidy utilization and family well-being. 14 Adopting the distance measure as an instrument imposes the assumption that the distance-subsidy receipt relationship is identical across all jurisdictions. However, this assumption is unlikely to hold for various reasons. As explained by Tekin (2010b, 2012), the spatial accessibility of social service agencies may exhibit substantial variation across urban and rural jurisdictions, older versus newly developed jurisdictions, or areas with different topographies (e.g., land-locked, mountainous, or other physical barriers). In addition, the accessibility of social service agencies likely depends on the extent to which local roads and highways are developed as well as the availability of public transportation. It is also the case that local agencies are assigned to serve different geographic areas. For example, in many states, there is one agency available per county, whereas in others, a single agency is assigned to serve individuals from multiple counties (e.g., Washington). Together, these insights suggest that it is unrealistic to constrain the relationship between travel distance and subsidy receipt to be identical for families across all jurisdictions. Following Tekin (2010b, 2012), our IV strategy therefore permits the travel distance-child care subsidy relationship to differ across families' county of residence. With 237 travel distance-county instruments, this approach allows us to leverage considerable power in the firststage equation, producing an F-statistic on the set of travel distance-county interactions of 32.4 and a partial Rsquared of approximately 10%. Results from the IV analysis are presented in column (6) of Table IV. These estimates continue to suggest that child care subsidies are detrimental to family well-being. In fact, the coefficient on subsidy receipt is statistically significant in every model. We find that subsidies substantially lower the likelihood that a mother reports being in 'very good' or 'excellent' health. The marginal effect translates to a reduction in self-reported health of approximately 37%. Subsidy receipt also leads to increased scores on the indexes of anxiety (0.34 SDs), depression (0.35 SDs), and parenting stress (0.45 SDs). A comparison between the OLS and IV results displayed in columns 5and 6show that the IV estimates are considerably larger in magnitude than those obtained from OLS. Assuming that our identification strategy is plausible, this finding is consistent with several explanations. First, measurement error in the ECLS-K child care subsidy variable could lead to downward bias in the OLS estimates. Second, this pattern is indicative of positive selection into child care subsidy receipt. Local subsidy administrators may ration benefits according to specific parent and child characteristics. In doing so, caseworkers may deliberately target healthier or more employable parents to maximize the return on public investments (Herbst and Tekin, 2010b)."}, {"section_title": "DDB Worldwide Communications Life Style survey", "text": "Our final empirical analysis examines the relationship between the generosity of states' child care subsidy regimes and self-reported life satisfaction. Specifically, we estimate versions of the following reduced form regression model: where Y* is a continuous latent representation of the ith respondent's life satisfaction score, Y. Given the ordered nature of the response categories in Y, we estimate (3) by using an ordered probit, which standardizes the measure of life satisfaction conditional on the right-hand-side variables. The S represents the sum of real federal and state expenditures through the CCDF per child ages 0 to 12 years (/100), and the vector given by X' captures several observable demographic controls, including age, race and ethnicity, marital status, the presence of children ages 0 to 17 years in the household ('has kids'), and educational attainment. The P' represents a number of state-level social policy and economic controls, including separate dummy variables for the implementation of welfare waivers and TANF, maximum AFDC/TANF benefits for a three-person family, maximum Child Tax Credit, unemployment rate, (log of) per capita income, and (log of) population density. Also included in (3) are controls for state-specific and year-specific unobserved heterogeneity that may be correlated with states' CCDF spending decisions and individuals' subjective well-being. Although the model includes a number of explicit controls for social policy reforms and economic conditions, there likely remain unobserved differences between states or years that determine the generosity of child care assistance policies. Therefore, we introduce a vector of state-fixed effects, η s , to account for permanent differences across states that may confound the estimated effect of CCDF spending. We also add a set of year dummy variables, ϕ t , to account for time-varying national shocks (e.g., nationwide business cycles, natural disasters, or changes in federal legislation) or changing national attitudes regarding the role of the social safety net (e.g., increased public support for work-conditioned programs). Finally, we experiment with state-specific linear time trends to purge the model of within-state unobservables that are trending over time and follow a time path similar to that of states' CCDF spending (e.g., evolving attitudes toward welfare recipients). The coefficient of interest in (3) is γ 1 , which returns the estimated effect on life satisfaction of a $100 increase in CCDF spending per child ages 0 to 12 years. Given that the ordered probit coefficients represent standardized changes in the dependent variable (conditional on the covariates), the coefficient on CCDF spending can be interpreted as the SD change in life satisfaction because of a $100 increase in per-child CCDF expenditures. We also report marginal effects (evaluated at the covariate means) associated with the likelihood of definitely agreeing and definitely disagreeing with the life satisfaction statement. These effects capture changes in life satisfaction at the top (most satisfied) and bottom (least satisfied) ends of the distribution. All regressions provide robust standard errors, clustered by the state-year. Identification of γ 1 comes from multiple sources. First, there is substantial year-to-year variation in child care spending. Prior to 1991, for example, funding for child care assistance did not exist. Given that our analysis begins in 1986, we use the years 1986 to 1990-the pre-reform period-to leverage variation in child care funding. Expenditures then grew rapidly beginning in the early 1990s and again in the mid to late 1990s because of the establishment of new funding sources, thus generating additional year-to-year variation in subsidy generosity. Second, given that our dataset includes single mothers (who are eligible to receive child care assistance) and single childless women (who are ineligible to receive child care assistance), we rely on the differential policy treatment of women with and without children to identify the impact of CCDF spending. Note that using single childless women as a comparison group in combination with the availability of pre-reform survey data makes our identification strategy tantamount to the difference-in-differences framework used throughout much of the welfare reform literature (e.g., Kaushal and Kaestner, 2001;Meyer and Rosenbaum, 2001;Bitler et al., 2005). A final source of identifying variation takes advantage of the CCDF's rules for determining the age-eligibility of children who can receive assistance. In particular, to be eligible for a subsidy, a family must have a child between the ages of 0 and 12 years. Given that our dataset includes women with children ages 0 to 17 years, those whose youngest child is over age 12 years are ineligible to receive assistance. This eligibility rule therefore creates another potentially exogenous source of variation that is used to identify to impact of CCDF spending. Table V presents the ordered probit coefficients and marginal effects on the CCDF spending variable. It appears that progressively adding controls has little effect on the CCDF spending coefficients. Consistent with the results from the FFCW and ECLS-K, an increase in child care assistance funding is associated with a reduction in subjective well-being. The raw ordered probit coefficient in column (4) implies that a $100 increase in per-child CCDF spending lowers self-reported life satisfaction by 0.07 SDs. Translated into marginal effects, the coefficient implies a 1.1 percentage point decrease in the likelihood of being in the top well-being category ('definitely agree') and a 1.6 percentage point increase in the likelihood of being in the bottom well-being category ('definitely disagree'). Given that 8% of single mothers are in the top life satisfaction category and 18.6% are in the bottom category, the marginal effects imply well-being reductions of about 14% and 9%, respectively. The remaining results in Table V are based on stratified samples of low-income [column (5)] and high-income [column (6)] women. 15 If the main results are in fact due to child care subsidy policy, then we expect the results from the more disadvantaged sample to be similar to (or larger than) the main results, whereas those from the less disadvantaged sample should be smaller in magnitude. As shown by the ordered probit coefficients in columns (5) and (6), we find strong support for this proposition. For low-income single mothers, the estimated effect of CCDF spending is nearly twice as large as that from the full sample and over seven times larger than that from the high-income sample. The marginal effects imply large reductions in life satisfaction: a $100 increase in per-child CCDF spending reduces the likelihood of being in the top well-being category by 25% and increases the likelihood of being in bottom well-being by 18%."}, {"section_title": "CONCLUSION", "text": "Since the passage of welfare reform in 1996, child care subsidies have played a central role in public efforts to reduce welfare dependency and increase employment among disadvantaged women with children. The consensus from early research is that subsidies have been largely successful at accomplishing this goal. More recent work has begun to focus on the implications of subsidy receipt for children's health and development (Griffen et al., 2010;Herbst and Tekin, 2010a, 2010b, 2011b. Using three nationally representative datasets, this paper considers two additional domains of family well-being-maternal health and the quality of parent-child interactions-providing evidence that child care subsidies are associated with reductions in both. An important question to consider is the mechanism(s) through which child care subsidies influence family wellbeing. Given that subsidized mothers are equally worse off than non-recipients using both parental and non-parental arrangements, it is unlikely that the increased use of non-parental care is a viable channel. Another potentially important mechanism operates through the employment mandate imposed by the CCDF. Recall that the employment effects of subsidy receipt could influence well-being by inducing vulnerable women-many of whom do not have extensive work histories-into paid work fairly soon after childbirth. The increased opportunity costs of leisure, coupled with the stress and anxiety of beginning a new job, could reduce family well-being. Section 1 also suggests that, conditional on any work, the type of employment in which subsidized mothers are engaged might influence well-being. Although it is beyond the scope of this study to provide a complete analysis of mechanisms, we offer some preliminary evidence in support of the detrimental effect of the CCDF's employment mandate. We stratify the FFCW sample according to whether a given mother was working at the 12-month follow-up. We then estimate regressions of each well-being outcome on subsidy receipt (all measured at 36 months) on both  , 1986-2004. All models are estimated using an ordered probit regression. Each cell in the top row contains the coefficient (and standard error, in parentheses) associated with the total federal and state CCDF spending per child ages 0 to12 (in 2005 dollars). Standard errors are adjusted for state-year clustering. The dependent variable is based on the statement: 'I am very satisfied with the way things are going in my life these days'. Responses categories are: 6 = definitely agree, 5 = generally agree, 4 = moderately agree, 3 = moderately disagree, 2 = generally disagree, and 1 = definitely disagree. The figures in the next two rows are the marginal effects (evaluated at the mean of each covariate) associated with the probability of 'definitely agreeing' and 'definitely disagreeing' with the life satisfaction statement. The demographic covariates include age, race and ethnicity, educational attainment, and marital status. The state controls include separate dummy variables for welfare waivers and TANF, AFDC/TANF benefits, maximum child tax credit, unemployment rate, (log of) per capita income, and (log of) population density. Dummy variables are also included to account for missing data on the demographic controls. The low-income subsample includes individuals whose household income is at or below the sample median ($29,939). The high-income sub-sample includes individuals whose household income is above the sample median. *p < 0.10, **p < 0.05 and ***p < 0.01. sub-groups. Assuming that employment at 12 months is a proxy for pre-subsidy receipt work experience, it is plausible that the negative subsidy effects are pronounced for mothers who were not working prior to receiving a subsidy. We find strong support for this proposition: subsidy receipt is associated with large reductions in virtually every well-being domain among mothers without prior work experience. In only case do we find evidence that subsidy receipt is negatively associated with well-being among mothers with prior work experience, and in two cases, we uncover evidence that it improves well-being. This evidence suggests that although the employment 'shock' from the CCDF's work mandate may have detrimental consequences for family well-being, they could be short-run effects that fade as subsidized mothers adjust to the dual responsibilities of home and market work. Results in this paper may also shed light on the negative effects that subsidies have on child well-being. In particular, Herbst and Tekin (2010a, 2010b, 2011b focus on maternal employment and various CCDF design features to explain the negative relationship between subsidy receipt and child well-being. Results in this study, however, suggest that changes in maternal well-being could be a third mechanism through which subsidy receipt influences children. Indeed, there is a vast literature in psychology emphasizing the dynamic interplay between child and parental well-being and the role played by mothers in shaping the health and achievement arc of children (e.g., National Research Council, 2000). The home environment as well as specific parenting behaviors regarding nurturance, communication, and discipline is known to influence children's health and development (Bornstein, 2002;Anderson et al., 2011). Parental health markers-including anxiety, stress, and depression levels-are also strongly correlated with child development, primarily because they have implications for the amount of quality time parents spend with their children (NICHD Early Child Care Research Network, 1999;Barry et al., 2005). Therefore, insofar as child care subsidies reduce maternal health and lead to worse parent-child interactions, these changes in the family environment could be partially responsible for the negative effects on children.   , 1986-2004. Standard deviations are in parentheses."}, {"section_title": "APPENDIX", "text": "Appendix Table 2. Continued"}]