[{"section_title": "Table of Contents", "text": "List of            Tables   Table 3. 1 Model Variables ............................................................................................................ Table 3.2 Descriptive Statistics ..................................................................................................... Table 4.1 Coefficient Estimates ...................................................................................................."}, {"section_title": "vi", "text": ""}, {"section_title": "List of", "text": ""}, {"section_title": "Chapter 1 -Introduction", "text": "Over the past few decades, the prevalence of obesity and diet-related diseases has steadily increased and become a major public health concern. For 2009-2010 the CDC reported that 35.7% of adults were obese. Outside of the public health concerns raised by obesity, there are also costs associated with this epidemic. Not including the morbidity and mortality costs resulting from decreased labor productivity and premature death, the medical costs associated with obesity reached $147 billion dollars in 2008. Obesity rates have increased so much so that it has become the second largest cause of preventable death. Part of the problem has been attributed to the large quantity of unhealthy (energy-dense) foods U.S. consumers include in their diets. Figure 1.1 shows the shift in consumer food purchases towards processed packaged foods and fast food. In 1970, Americans spent $6 billion on fast food; in 2001 they spent more than $110 billion, which is more than expenditures for movies, books, magazines, newspapers, videos, and recorded music combined (Schlosser, 2004). Consumer food choices are driven more by convenience and ease of preparation rather than considering weight management (Schlosser, 2004). This phenomenon may be attributed to the increased number of females working outside of the home, as women hold the traditional role of \"homemaker\" (Glanz et al., 1998). This changing dynamic decreases the amount of time devoted to traditional roles of the past, such as preparing \"home cooked\" meals. It is important to also address the lack of access to affordable healthy foods hindering consumers from consuming healthier foods. Statistics on food environment suggest that some areas and households have easier access to fast food restaurants and convenience stores but limited access to supermarkets. Limited access to nutritious food and relatively easier access to less nutritious food have been shown to lead to poor diets and, ultimately, to obesity and dietrelated diseases (see Chapter 2 for a review of the literature). These issues may more negatively affect some communities than others, particularly rural communities as they tend to be further away from food outlets compared to urban areas. In the 2008 Farm Bill, the U.S. Congress charged the U.S. Department of Agriculture (USDA) to conduct a study to evaluate the magnitude of the problem of limited access, identify characteristics and causes, consider the effects of limited access on local populations, and outline recommendations to address the problem (Dutko, Ver Ploeg, & Farrigan, 2012). In completing this task, the USDA identified areas within the nation that are designated as \"food deserts\". \"A food desert is defined as a lowincome census tract where a substantial number or share of residents has low access to a supermarket or large grocery store\" (Dutko, Ver Ploeg, & Farrigan, 2012, p. 5).\" AA census tract is classified as \"low-income\" if either at least 20 percent of residents fall below the federal poverty line, or a median family income is at or below 80 percent of the area's median family income. In a \"low-access\" census tract, at least 500 people and/or at least 33 percent of its population reside more than one mile (10 miles if the census tract is rural) from a supermarket or large grocery store. Rural tracts are classified by the Economic Research Service (ERS) Rural-Urban Commuting Area (RUCA) codes 1 . 1 The RUCA codes classify U.S. census tracts using measures of population density, urbanization, and daily commuting. The classification contains two levels. Whole numbers (1-10) define areas as metropolitan, micropolitan, small town, or rural based on the size and direction of the largest commuting flows. These ten codes are further segmented to permit stricter or looser definition of commuting areas, based on the second largest commuting flows. Urban is comprised of RUCA codes: 1.0, 1.1, 2.0, 2.1, 3.0, 4.1, 5.1, 7.1, 8.1, 10.1. Rural tracts include large rural, small rural, and isolated rural areas. Large rural is comprised of RUCA codes: 4.0, 4.2, 5.0, 5.2, 6.0, 6.1. Small rural is comprised of RUCA codes: 7.0, 7.2, 7.3, 7.4, 8.0, 8.2, 8.3, 8.4, 9.0, 9.1, 9.2. Isolated areas are comprised of RUCA codes: 10.0,10.2,10.3,10.4,10.5,10.6. In the United States, a total of 13.5 million, or 4.8 percent of the population, live more than one mile from a supermarket (Dutko, Ver Ploeg, & Farrigan, 2012). 65% of U.S. counties are classified as rural (ERS Rural Urban Continuum Code 4,5,6,7,8,or 9) and have an average of 25% of their residents 10 miles or more from a supermarket. In February 2010, the Obama Administration proposed a $400 million Healthy Food Financing Initiative that, in part, would promote healthy food retailers to move to underserved urban and rural communities (Bitler & Halder, 2011); the announcement of the initiative directly cited the prevalence of food deserts as its motivation. A number of studies have shown that limited access to healthy food options is associated with lower intake of some foods like fruits and vegetables and even to outcomes such as higher rates of obesity (see Chapter 2). While only 15.2% of the nation's counties are classified as food deserts, some regions of the country face more acute challenges with food access. In Kansas, for example, over 30% of counties are classified as food deserts, with 10.6% (approximately 303,248) of Kansans living in these areas. Kansas has a higher average percentage (35.8%) of its population with low access to supermarkets, as compared to other U.S. rural counties (24.7%), urban counties (21.1%), and the Figures 1.2 and 1.3 also illustrate the food access and food desert numbers for rural and urban areas nationwide. Both areas suffer from low access to supermarkets-with rural areas being slightly more severe-but a much greater proportion of rural counties are classified as food deserts. In this research, Kansas and Nebraska represent rural Midwestern counties, which are shown to be more destitute than rural areas elsewhere in the nation (Blanchard & Lyson, 2002). For this reason, Kansas and Nebraska serve as the basis for comparison against the nation for the purposes of this research. The lack of access experienced by residents of rural food deserts may be appeased by smaller community grocery stores. In formulating the food desert definition, the USDA classifies low access areas based on proximity to a large grocery store or supermarket. Focusing only on supermarkets and larger grocery stores is likely to underestimate the availability of healthy foods Source: USDA Food Atlas since some of these foods are also available at small grocery stores, convenience stores, pharmacies, dollar stores, farmers' markets, and restaurants."}, {"section_title": "Figure 1.2 Kansas Residents Living in Food Deserts", "text": "Source: USDA Food Atlas"}, {"section_title": "Figure 1.3 Nebraska Residents Living in Food Deserts", "text": "The livelihood of many rural grocery stores is now being threatened by larger chain stores that have begun to occupy nearby communities. These supermarkets are able to offer residents of rural communities a greater selection and generally lower prices than their local, independently owned stores. A key concern for people who live in areas with limited access is that the small grocery or convenience stores they rely on may not carry all the foods needed for a healthy diet, or these healthier foods may be offered at higher prices. Studies have shown that when consumers shop at smaller grocery or convenience stores, prices for similar goods are, on average, higher than at supermarkets (Block & Kouba, 2005). As a result, many consumers will choose to travel further to shop at supermarkets versus local groceries. When factoring these smaller stores into the food desert definition, it becomes vital to determine if local consumers will actually patron these stores. Social capital refers to the capacity for cooperation, for trust and civicness, and to a particular form of local culture (Trigilia, 2001). Food can be used as a tool for community development. Projects such as farmers' markets, community gardens, promotion of culturally specific foods for ethnic minorities, local food production and promotion, youth agricultural and culinary training programs, and many other types of programs display a community's dedication to self-sustainment (Ver Ploeg, 2010). These active community members will be more likely to frequent a community grocery store and to assist neighbors when in need. A community's measure of social capital could measure the citizens' support of their community, and may therefore be used to proxy whether or not they would shop in their local grocery. In areas without a rural grocery store, social capital can estimate the likelihood of neighbors to lend a helping hand to others within their community. Support from community members may be just the relief someone needs to make it through a tough time. The social environment of rural communities can be characterized as having a high degree of interconnectedness within the community, so that \"everybody knows everybody else\" (Beggs, Haines, & Hurlbert, 1996). This unique social network in rural communities facilitates the buildup of social capital, which incorporates models of reciprocity and the willingness to do things for members within the network. This may include taking neighbors without access to a vehicle to the grocery store, loaning money or food in the time of need, or any similar act of benevolence for members of one's community."}, {"section_title": "Research Question", "text": "The causal link between residents of food deserts and an increased incidence of healthrelated issues has been established through various past studies (Cotterill & Franklin, 1995;Giang et al., 2008;Rose & Richards, 2004;Morland et al., 2002;Weinberg, 1995). The objective of this research is to determine to what extent, if any, social capital and grocery stores mediate health issues in rural food deserts on both the national level and in the Kansas-Nebraska region. Locations of Kansas rural grocery stores were gathered from the Rural Grocery Initiative (RGI) database. The RGI has identified nearly 200 grocery stores in rural towns across Kansas with populations under 2,000 to identify and develop models to sustain retail sources of food for rural Kansas citizens. The locations of Nebraska rural groceries were obtained from the SNAP (Supplemental Nutrition Assistance Program) provider list maintained by the U.S. Department of Agriculture, Food and Nutrition Service, after which it was confirmed whether the location was a grocery store and also met the population limit. I will evaluate whether including rural groceries into the food desert definition will affect the estimated impacts of food deserts on health related issues in these areas. In addition, I will use the county level social capital estimates to proxy patronage of these rural stores and potential assistance from neighbors that may decrease effect of access. In the following chapters, I will first review past research studies that have considered causal relationships between food access, social capital, demographic and socioeconomic factors, regional effects and negative health status. After which, the data collected and models utilized for econometric analysis will be detailed. Finally, regression results and concluding remarks will be presented."}, {"section_title": "Chapter 2 -Literature Review", "text": "The aim of this study is to determine the effects of social capital and grocery stores on the obesity rates of residents in rural food deserts. In determining which variables are important to model this effect, past research on food environments, rural-urban influence, socioeconomic status, demographics, and regional differences related to health served as a guide."}, {"section_title": "Food Environments", "text": "Public policy discussion of the problem of food deserts has concentrated on proximity to retail food stores providing nutritious, affordable foods. Because supermarkets or supercenters offer a wide variety of healthful products at relatively low prices, physical access to these larger outlets has come to be the standard of adequacy. It is important to remember that consumer needs are not static and may change from week to week, from day to day, and from situation to situation, and choice is about having the means to satisfy these needs (Kirkup et al., 2004). A focus group containing residents of four suburbs of Portsmouth, England revealed that true choice is about having flexibility and options, allowing residents to change behavior according to circumstances and mood. Many of the focus group participants hadd a disdain for their local shops, citing expensiveness of products, lack of fresh fruits and vegetables, lack of product selection in general as key deterrents (Kirkup et al., 2004). A common generalization is that consumers prefer larger chain stores over a smaller community store because there is a greater product selection and lower prices. This notion was further investigated by Block and Kouba (2005) using a market basket comparison. This study reports that many smaller groceries in Austin, Illinois, carry produce that is usually competitively priced, but often of unacceptable quality. Austin supermarkets had the best selection with the lowest prices being at discount supermarkets. Prices of packaged items were higher at independent stores than at chain supermarkets, but some fresh items were cheaper. To investigate the level of access to fruits and vegetables of residents living in select rural and urban communities in Minnesota, Hendrickson, Smith, and Eikenberry (2006) also conducted a market basket price comparison along with a focus group and survey. In the selected rural communities, some items were found to be more expensive than the market basket price while others were less expensive. Most rural residents of the focus group reported shopping at smaller stores within their communities because of the distance and cost associated with shopping elsewhere. One resident stated they did not see the purpose of traveling to larger stores to shop, simply because the savings you receive in food costs would be transferred to travel costs rather than actual savings. Other rural residents claim to shop in their community stores to support these businesses and ensure they are able to remain in operation, indicating that consumers with higher levels of social capital are more likely to support local business. Kyureghian and Nayga 2012 Thus, although there is not a consistent result of whether or not food items from small independent stores are more expensive than larger chain stores, it can be concluded that they offer many of the same (if not similar) products. A healthy and nutritious diet requires an appropriate mix of nutritious food servings from several food groups. In addition, healthy and nutritious food must be geographically close enough to a consumer to be useful. Determinants of whether the lack of fresh fruits and vegetables in grocery stores is problematic will be influenced by the availability of other sources (farmers' markets, restaurants, schools, and specialty shops) and forms (canned, dried, and frozen) of fruits and vegetables. Many consumers may be unaware of the fact that other stores, particularly smaller outlets, have healthy and affordable selections. Their lack of knowledge of alternate food outlets increases their dependence on larger chain stores. When these larger stores are inaccessible, consumers' diets may suffer as a result of smaller outlets being ignored. As large retail chains continue to emerge, smaller independent stores are being forced out of business because they are unable to compete with the economies of scale the larger stores are able to take advantage of. Some large chain stores (i.e. Safeway, Kroger, and Albertsons) focus their operations on urban markets, while the majority of Wal-Mart stores are located outside of urban areas. Although there are some larger chain stores located outside of urban areas, there is still a large population of underserved consumers in rural areas. Utilizing ArcView GIS mapping software, Blanchard and Lyson (2002) report that 34% of the Midwest's population is more than ten miles away from a supermarket or supercenter, which falls into the USDA definition of a food desert. Midwestern nonmetropolitan counties without a city of at least 10,000 residents have the highest proportion of residents who live in food deserts. Nonmetropolitan counties with no city larger than 2,500 residents have, on average, 80% of their population residing in low access areas. It is plausible to infer from these statistics that rural Midwestern counties are truly food deserts and suffer from lack of access to food. Schafft, Jensen, and Hinrichs (2009) examine the relationship between food deserts and childhood obesity, particularly in rural areas. GIS was used to identify food desert areas in rural Pennsylvania. Student BMI data along with census and school district level data for the 1999-2000 academic year were used to determine the extent to which the percentage of a school's district population residing within food desert is positively associated with increased incidence of overweight among students within the district. Regression analysis reveals a positive relationship between rates of childhood overweight and percentage of the district population residing in a food desert (for every 1% increase in the percentage of a district's population residing in a food desert results in a .06% increase in students at risk or overweight). Using 2007 National Survey of Children's Health, Singh, Siahpush, and Kogan (2010) examine the impact of neighborhood socioeconomic conditions and \"built environments\" on obesity and overweight prevalence among U.S. children and adolescents. The facets of \"built environment\" include access to grocery stores selling healthy foods, proximity and safety of playgrounds or other recreational space, and adequate housing. Data for this study were gathered through phone interviews with the parent or guardian who knew most about the child's health and health care, resulting in a total sample of 91,642 children. Logistic analysis of the responses shows the odds of a child being obese or overweight were 20-60 percent higher among children in neighborhoods with the most unfavorable social conditions such as unsafe surroundings, poor housing, and no access to sidewalks, parks, and recreation centers than among children not facing such conditions. Moore et al. (2008) investigate the relationship between consumers' food environment and the probability of a healthy diet. Data utilized for this study were gathered from the 2000-2002 examination of the Multi-Ethnic Study of Atherosclerosis (MESA). Participants were adults aged 45-84 years of age residing in Baltimore City County, Maryland, Forsyth County, North Carolina, or New York, New York. The sample was comprised of approximately 1,000 White, Black, and Hispanic residents with varying levels of income. The Alternate Healthy Eating Index (AHEI), a summary index of dietary patterns and eating behaviors that have been associated with a lower risk of chronic disease, was used to measure the healthiness of participants' diets. Higher scores on this index indicate higher intakes of fruits and vegetables, nuts and soy protein, white meat (as opposed to red meat), and unsaturated fat (as opposed to saturated fat). The food environment of MESA participants was characterized by the density of supermarkets within one mile of their home, self-reported availability of healthy food, and reported perceptions of availability from non-MESA participants. Results show that participants who had no supermarkets near their homes were 25-46 percent less likely than participants in the highest supermarket density to have a healthy diet. Similarly, participants living in neighborhoods with the worst-ranked healthy food availability, by their own reports or by their neighbors' reports, were 22-35 percent less likely to have a healthy diet than those living in the best ranked neighborhoods. White participants were more likely to have a healthy diet than other groups by the AHEI measure. On the basis of AHEI scores, income was positively associated with the probability of having a healthy diet. To determine if there is an association between the availability of supermarkets, grocery stores, and convenience stores and cardiovascular disease (CVD) risk factors, Morland, Diez Rouz, and Wing (2006) conducted a cross-sectional study of men and women participating in the Atherosclerosis Risk in Communities (ARIC) Study. The analyses included 10,763 participants residing in one of 207 (ARIC) eligible census tracts located in Maryland, Minnesota, Mississippi, and North Carolina. The location of food stores and food service places in the given census tracts were collected from the local departments of environmental health and state departments of agriculture and were geocoded to census tracts. The 1997 NAICS codes were used to define the types of food stores. Supermarkets were defined as large corporate owned \"chain\" food stores; grocery stores are defined as distinguished grocery stores, or smaller non-corporate-owned food stores; and convenience stores include all food stores that carry a limited selection of foods, mostly snack foods, whether or not attached to a gas station. CVD risk factors were defined for overweight, obesity, hypertension, and hypercholesteremia. 2 Binomial regression results showed a 9% lower prevalence of overweight, a 24% lower prevalence of obesity, and a 12% lower prevalence of hypertension for people who live in an area with at least one supermarket compared to those in an area without any. The negative relationship between presence of supermarkets and prevalence of CVD factors persisted, after accounting for other food stores. The presence of grocery stores was associated with a 6% higher prevalence of overweight, 21% higher prevalence of obesity, 33% higher prevalence of diabetes, and 17% higher prevalence of hypertension. The presence of convenience stores is associated with a 6% higher prevalence of overweight, 14% higher prevalence of obesity, 4% lower prevalence of diabetes, and 7% higher prevalence of hypertension. Accounting for all types of food stores and service places, gender, race/ethnicity, age, income, education, and physical activity reduced the positive associations between supermarkets and CVD factors, reduced the negative associations between grocery stores and CVD factors, and increased the negative associations between convenience stores and CVD factors. Research conducted by Coveney and O'Dwyer (2009) found that living in a food desert did not, by itself, impose food access difficulties. Far more important was the access to alternate means of transportation to stores. Owning a vehicle, or at least having access to a vehicle or some form of public transportation, lends a greater variety of stores from which to choose to shop. In the U.S. car-reliance is high, and has resulted in shopping centers, suburbs, and even whole cities being developed with car ownership and vehicle access in mind which makes it easier and more convenient for households with cars to access healthy food (Burns and Inglis,2 Overweight and obesity were defined based on BMI, where individuals with a BMI of >25 to 30 were categorized as overweight and ≥30 as obese. Individuals were categorized as diabetic if they reported taking medications for diabetes, had glucose levels of ≥200 mg/dL, and/or 8-hour fasting glucose levels above 126 mg/dL. Individuals were considered hypertensive if they reported taking medication for high blood pressure within the last 2 weeks, or if the average of two successive blood pressure measurements resulted in a systolic measurement of ≥140 mmHg or a diastolic measurement of ≥90 mmHg. Respondents with serum total cholesterol levels of >200 mg/dL, or who reported taking cholesterol-lowering medications in the past 2 weeks, were classified as having high cholesterol. 2007). According to the 2010 American Community Survey, about 8.9% of American households (about 10.1 million) do not have a car. Participants in the study conducted by Coveney and O'Dwyer (2009) were separated into two groups: those who did not have a car because of disability, old age or infirmity, and those who were without a car because of financial reasons. Disabled or elderly participants generally had a support system to assist them with food shopping. This came in the form of an in-home aid, volunteer services, or access to a taxi voucher scheme. Those without cars due to financial difficulties were generally worse off, regardless of distance from home and shops. Many of these were families were low income households which did not receive any benefits or assistance to help with food shopping. Generally, individuals who are older or disabled will receive more assistance from family members and/or their communities. The social capital within a consumer's neighborhood could play key role in helping to mitigate access issues within food desert communities. After identifying the food insecurity risk within seven counties in the metropolitan area of Minneapolis, Minnesota, Larson and Moseley (2010) conducted surveys and interviews of food insecure residents of these areas. In addition to utilizing local, state, and federal resources (i.e., SNAP, WIC, free/reduced lunch), residents benefitted from the social capital of their community. 50% and 28.6% stated they relied on friends and family and/or local food banks, respectively, when they did not have enough food. A study conducted on food access in Lawrence, Kansas, reveals that vehicle access is particularly important in determining the detriment of residing in a food desert. Hallett and McDermott (2011) apply the technique of measuring the total cost of travel to obtain groceries, and then comparing those costs with total expenditures on food to identify areas in which residents need to spend an unbalanced share of their time or income to obtain food. The average consumer unit in the Midwest spends $5,793 annually on food purchased for consumption at home (Bureau of Labor Statistics, 2009). Assuming two shopping trips per week, the average grocery trip is for $55 worth of food. Hallett and McDermott (2011) define underserved areas as those in which the consumer has to spend 10% or more of his food budget just to get to and from the grocery store. In this instance, underserved areas are those for which the one-way travel cost is greater than $2.78; whether that cost is incurred as operating costs for a vehicle or opportunity costs for foot travel. These analyses suggest that almost no Lawrence residents with cars live in underserved areas or food deserts. The only neighborhoods exceeding the threshold for travel cost to a grocery are located in the rural areas outside the city limits. Using cost factors that apply to a traveler on foot, about half of this community's consumers without cars are underserved. Again, we must note that access to transportation (whether public or private), is vital in determining the number of stores that residents, especially rural, can access."}, {"section_title": "Demographic and Socioeconomic Factors", "text": "Currently, more than two thirds of U.S. adults and approximately one third of U.S. children and adolescents are overweight or obese, and some minority and low-SES groups are disproportionally affected. Wang and Beydoun (2007) find that non-Hispanic Blacks had the highest prevalence of obesity. Minority groups (i.e., non-Hispanic Blacks and Mexican Americans) had a higher combined prevalence than non-Hispanic Whites by almost 10 percentage points. The corresponding rates of prevalence in 2003-2004 were 76.1 percent and 75.8 percent versus 64.2 percent. In the United States, evidence tends to support the notion that access to supercenters and grocery stores is limited for those living in low-income neighborhoods. Consequently, price and choice deter healthy eating habits and may help explain higher rates of poor diet and obesity. In impoverished communities, parents may be faced with difficult economic situations where their focus is solely on ensuring their families have something to eat rather than ensuring they eat healthy food (Bulbitz et al., 2011). This short term focus emphasizes the immediate need of satisfying hunger due to limited resources, rather than putting effort into purchasing and preparing foods that will result in better health in the long run. As a result of changes in the structure of the grocery industry, many stores are being shut down and/or replaced with larger stores. Often times this can leave the community that has lost a store without any other nearby options, therefore creating a food desert. Guy, Clarke, and Eyre (2004) analyze changes in food provision given store openings and closings from 1989-2001. Data from the Welsh Index of Multiple Deprivation, which takes into account income, health, employment, education and skills and housing deprivation, as well as geographical access to services, was utilized for this study. Results show that of the top 50 most deprived areas, 20 suffered a decline in accessibility levels over this time. Access levels in affluent areas increased at a greater magnitude compared with only slight increases in lower income areas, suggesting there has been a tendency for poor levels of access to become more concentrated within areas of deprivation. Varying areas of deprivation can be a sign of income inequality. Income inequality has multiple negative effects, one of which Kawachi et al. (1997) cites as being mortality. A hypothesis is that rising income inequality results in increased levels of frustration, which may have damaging behavioral and health consequences reflected in mortality rates (Kawachi et al., 1997). Societies that develop large disparities in income also tend to underinvest in human capital (i.e., education), health care, and other factors that promote health (Kawachi et al., 1997). To examine the effects of income inequality (as measured by the Robin Hood Index) and social capital (as measured by social trust) on mortality, Kawachi et al. (1997) conducted a path analysis based on a causal model in which inequality affects mortality through its impact on social capital. Weighted data from the General Social Survey, conducted by the National Opinion Research Center, was used to estimate state variations in group membership and levels of social trust, which are proxies for social capital. The Robin Hood index approximates the proportion of aggregate household income in each state that has to be taken from households above the mean and transferred to those below the mean in order to achieve equality in distribution of incomes. The results show that as income inequality increases, so does the level of social mistrust, which is in turn associated with increased mortality rates. A major finding of this study is that the size of the gap between the rich and the poor is significantly and negatively correlated with the level of investment in social capital. In other words, disinvestment in social capital appears to be one of the avenues through which growing income inequality wields its effects on population-level mortality. Zhang and Wang (2004) apply a summary index, the concentration index (CI), to assess the degree of inequality in the distribution of obesity across socioeconomic status (SES) using a national representative survey data set from the National Health and Nutrition Examination Survey III. The CI of obesity (BMI≥30) was -0.055 and was statistically significant (P<0.05), indicating that socioeconomic inequality favors higher SES groups. In other words, SES was negatively related to obesity. The age group which was most effected by SES and obesity was middle-age (40-49) for both men and women. Consumers living in poverty face many challenges as a result of lacking sufficient resources. The root of poverty often is more than a lack of money, but also lack of social networks and support included in social capital. Accessibility involves real or perceived economic access (influenced by relative prices and disposable income) which might lead to selfexclusion (Barratt, 1997). Preferences are only real when consumers have the power to express them (London Economics, 1997). Social capital consists of multiple components and it requires a broad measurement strategy. A county-level index was developed by Rupasingha and Goetz (2008)  interaction (Rupasingha, Goetz, & Freshwater, 2006). Organizations of principal interest used in generating this social capital index are the number of the following establishments in each county: civic organizations; bowling centers; golf clubs; fitness centers; sports organizations; religious organizations; political organizations; labor organizations; business organizations; and professional organizations (Rupasingha, Goetz, & Freshwater, 2006). The composite social capital index was created by extracting principal components from the variables voter turnout, census response rate, and the associational density. Higher values of this index are concentrated in the upper Midwest and Northwest counties, while the Southeast and Southwest counties have lower index values (Rupasingha, Goetz, & Freshwater, 2006). Using the social capital measure which they had previously generated, Goetz and Rupasingha (2006) sought to determine how the presence of Wal-Mart affects the social capital in areas where they exist. According to Goetz and Rupasingha (2006), large chain stores lead to the erosion of social capital in communities which they enter. Through evaluating the levels of local social capital before and after the emergence of a Wal-Mart in a community, Goetz and Rupasingha (2006) report decreased levels of social capital. Additionally, communities experience compounded negative externalities as a result of the causal chain of unutilized resources. Introductions of Wal-Mart stores cause the disappearance of locally-owned stores and decreased use of supporting firms (i.e. warehousing, logistics, publishing, etc.). When locally-owned stores leave a community, the historical social relationships and trust associated with these establishments also leaves. Food insecurity and hunger have negative impacts on a person's physical, mental and emotional health. Food insecurity has been shown to have a positive association with overweight and obesity. Individuals who are food insecure are less concerned with nutrition, and focus on simply satisfying hunger. Martin et al. (2004) asserts that social capital is associated with decreased risk of hunger. At the household level, households that know and trust their neighbors may be more likely to borrow food, borrow a car to get to the supermarket, or reciprocate with childcare responsibilities. These seemingly trivial favors could conceivably make a large difference in terms of access to food, especially for low-income households (Martin et al., 2004). A survey of Hartford, Connecticut, residents with incomes below 185% of the federal poverty level yielded a total sample of 600 surveys. Participants were asked questions regarding how often they ran out of food or skipped meals (to approximate food security), as well as to use a likert-scale to rank the helpfulness of the neighborhood in which they live (to approximate social capital). Results show that 55 percent of the residents in areas with high social capital were food secure and 28 percent food insecure, with 17 percent experiencing hunger. Compared with areas of low social capital, 43 percent of residents were food secure and 28 percent food insecure, with 29 percent experiencing hunger. Having a reliable social network, rather formal or informal, leads to several benefits including increased food security resulting in decreased health risks."}, {"section_title": "Summary", "text": "In sum, although there may be no relationship between increased food outlet availability and purchase of fruits and vegetables (Kyureghian and Nayga, 2012), multiple studies have found an association between residing in a food desert area and increased negative health effects (Schafft, Jensen, and Hinrichs, 2009;Moore, Diez Roux, Nettleton, and Jacobs, 2008;Morland, Diez Rouz, and Wing, 2006). In addition to simply residing in a low access area, the environment (Singh, Siahpush, and Kogan, 2010) and vehicles access (Coveney and O'Dwyer, 2009;Hallett and McDermott, 2011) appear to be key contributors to the food access issue. Individual demographic (Wang and Beydoun, 2007;Moore et al., 2008) and socioeconomic factors (Zhang and Wang, 2004;Moore et al., 2008;Bulbitz et al., 2011), as well as income inequality of the neighborhood (Kawachi et al., 1997;Guy, Clarke, and Eyre, 2004) can determine a person's likelihood of being obese. Minorities and individuals of lower income levels are generally in worse health than their counterparts (Wang and Beydoun, 2007;Moore et al., 2008). As large chain stores continue to overtake smaller independently-owned stores, rural areas are becoming more deserted since chain stores are generally not located in these areas (Blanchard and Lyson, 2002). This desertification puts rural residents at a greater risk for obesity and other health-related issues. As a result of supercenter placement, consumers in low access areas may sometimes only have smaller independently-owned that are accessible to their homes. Consumers who do not shop at these local stores are unsatisfied with the product offerings and prices (Kirkup et al., 2004;Block and Kouba, 2005;Hendrickson, Smith, and Eikenberry, 2006), while those who choose to patron these locations do so simply to support their community business (Hendrickson, Smith, and Eikenberry, 2006). Choosing to support local business is an indicator for high social capital, which contributes to the well-being of residents within low access communities (Martin et al., 2004;Goetz and Rupasingha, 2006;Coveney and O'Dwyer, 2009;Larson and Moseley, 2010). Communities with higher levels of social capital have an interest in the success and improvement of their neighborhood and neighbors. Compassion for neighbors may help decrease the negative health impact of residing in low access areas. The aforementioned studies explore the impact of food environments, rural-urban influence, socioeconomic status, demographics, and regional differences on health status. This study is unique in that it looks to link social capital and grocery stores to obesity rates of residents in rural food deserts."}, {"section_title": "Chapter 3 -Model Variables and Data", "text": ""}, {"section_title": "Model", "text": "For the purposes of this study, health status is modeled as a function of the food environment, rural-urban environment, socioeconomic factors, demographic factors, and regional difference: (food environment, rural-urban classification, socioeconomic indicators, demographics, regional differences) This general model was applied both the National dataset and the Kansas-Nebraska datasets, using distinct sets of variables available in the respective dataset to measure various aspects of the factors. The selection of model variables was influenced by variables included in previous research studies as well as the USDA Food Atlas Database. The study focused on rates of obesity as a measure of health. Food environment considered percentage of residents meeting the food desert definitions, density of food outlets and hospitals, and social capital. To evaluate the effects of rural grocery stores on health status of rural residents, a variable for these smaller stores (RURGROC) was included in the Kansas-Nebraska model. Rural-urban classification is defined using the USDA Rural-Urban Continuum codes. Socioeconomic indicators used are unemployment rate, poverty rate, Gini coefficient, and median household income, among others. Chosen demographics are age, childhood obesity rate, education, and race. The United States is divided into four geographic regions: South, Northeast, West, and Midwest (see Figure 3.1). Nearly half (45.5% ) of the observations in this national sample belonged to Southern states, 7.5% Northeastern states, 12.4% Western states, and 34.6% Midwestern states."}, {"section_title": "Data", "text": "The data used for this research are county-level observations for the 48 contiguous states for 2010. Table 3.1 provides a detailed listing of the variables used in the econometric analysis, their definitions, and sources. Table 3.2 presents summary statistics for the national and Kansas-Nebraska samples. Of the 3,107 counties in the U.S., the national sample is comprised of 2,637 counties. Similarly, of the 198 counties in both Kansas and Nebraska, the Kansas-Nebraska samples consists of 141 counties; 58% Kansas counties and 42% Nebraska counties. Counties with missing observations for the selected model variables discussed below were not included in the analysis, therefore reducing the sample size. The model variables are as follows: were used to improve the precision of the year-specific county-level estimates of diagnosed diabetes and selected risk factors. The average obesity rates for the national and Kansas-Nebraska samples are 30.4% and 31.3%, respectively (see Table 3.2). In Kansas and Nebraska, which are generally rural areas, the region's average obesity rate is slightly higher than the national average thus justifying why we should give special attention to explaining what is affecting health in rural areas. Regionally, approximately one in three adults located in the South and Midwest are obese, as opposed to approximately one in four adults living in the Northeast and West coast (see Figure 3.2). There are limitations to using body mass index measurements to represent health status because it depends only upon weight and height thus making certain assumptions about the distribution between lean mass and adipose tissue. BMI generally overestimates adiposity on those with more lean body mass (e.g., athletes) and underestimates excess adiposity on those with less lean body mass (National Institutes of Health, 2007). An individual considered \"normal\" weight does not necessarily indicate this person will be of good health (and vice versa for individuals \"overweight\" or \"obese\"). This index dates back to the 19th century, and may therefore be outdated. A composite health index comprised of several health indicators (hypertension, hypercholesterolemia, diabetes, etc.) would likely give a more accurate depiction of health. Calculating BMI is simple, quick, effective and applies to adult men and women, as well as children. For these reasons, widespread information can be gathered on this particular health identifier. Despite the limitations of BMI measures, it still serves as the health indicator for this study to ensure the largest sample size when collecting national data. Therefore, if a business does not return the CBP survey nor files a tax return, the establishment will not be reported in the database and results in a missing observation (treated same as if there were no establishments of a given type in that area). Consumer access was evaluated using three different variables. PCTLOACCESS is equal to the percentage of people in a county living more than 1 mile from a supermarket or large grocery store if in an urban area, or more than 10 miles from a supermarket or large grocery store if in a rural area. This definition of access is in accordance to the official USDA definition of 'food deserts', and was obtained from the USDA Food Atlas Database. The average percentage of residents with low access in the national sample is 20.2%, and 28.5% in the Kansas-Nebraska sample (see Table 3.2).  PCTHUNV is equal to the percent of household in a county that do not have a vehicle. PCTHUNVLOAC is equal to the percent of household in a county that do not have a vehicle and live further than 1 mile (in urban areas) or more than 10 miles (in rural areas) from a supermarket. All food outlets are measured as counts per one thousand persons in terms of the 2010 county population. This specification is consistent with that used by the USDA Food Atlas Database. The GROCERY variable comprises of stores that are classified by the NAICS as 445110, which is comprised of grocery stores primarily engaged in retailing a general line of food, such as canned and frozen foods; fresh fruits and vegetables; and fresh and prepared meats, fish, and poultry, and 445120, which is comprised of convenience stores or food marts (excluding those with fuel pumps) primarily engaged in retailing a limited line of goods that generally includes milk, bread, soda, and snacks. The number of stores located in each county was identified using the Census Bureau County Business Patterns (CBP) database. The total number of stores from both NAICS code 445110 and 445120 were combined and analyzed as a merged grocery variable to diminish the number of missing observations occurring from specifying them separately. The number of grocery stores per 1,000 county residents is lower in the Midwest (0.297) than the South (.302), Northeast (0.379), West coast (0.338) and the U.S. as a whole (0.311) (see Figure 3.4). FASTFOOD is comprised of establishments primarily engaged in providing food where patrons generally order or select items and pay before eating. Grocery stores in rural areas are represented by the variable RURGROC. These stores are identified as non-corporate owned stores located in towns with populations less than 2,500 residents. Data on these locations are collected and maintained by the Rural Grocery Initiative Center at Kansas State University. Rural grocery stores in this database are classified as independently-owned grocery stores located in counties with populations of 2,000 or less. To be consistent with the previously mentioned food outlets, this measure is also standardized per one thousand persons in the 2010 county population. The CONVSTR variable comprises stores that are classified by the NAICS code as 447110, which is comprised of establishments engaged in retailing automotive fuels (e.g., diesel fuel, gasohol, gasoline) in combination with convenience store or food mart items. These outlets are also gathered using the Census Bureau CBP database. Again, Figure 3.4 shows that the Midwest has a slightly lower average number (0.506) of convenience stores per 1,000 persons in a county than the national average (0.508). As convenience stores have limited food offerings, this study does not focus on these outlets. The SNAPSTR variable comprises stores in the county authorized to accept SNAP (Supplemental Nutrition Assistance Program, previously called Food Stamp Program) benefits. Stores authorized for SNAP include: supermarkets; large, medium and small grocery stores and convenience stores; super stores and supercenters; warehouse club stores; specialized food stores (retail bakeries, meat and seafood markets, and produce markets); and meal service providers that serve eligible persons. This variable was retrieved from the USDA Food Atlas database, with the location data originally being gathered from the USDA's Food and Nutrition Service, SNAP Benefits Redemption Division. Despite the broad number of store categories that accept SNAP benefits, Figure 3.4 still shows that the Midwest has a lower average number of SNAP stores per 1,000 persons in a county than the national average. In the national data sample, the average SNAP stores per 1,000 persons equal 0.98, while only 0.79 in the Kansas-Nebraska sample (see Table 3.2). As this food outlet variable encompasses various types of food stores, this further demonstrates the need for attention to access issues in rural Midwestern counties. The FASTFOOD variable includes restaurants that are classified by the NAICS code 722211, which is comprised of establishments primarily engaged in providing food services (except snack and nonalcoholic beverage bars) where patrons generally order or select items and pay before eating. Food and drink may be consumed on premises, taken out, or delivered to the customer's location. These outlets were gathered from the Census Bureau CBP database. The Midwest has a lower (0.55) average number of fast food restaurants per 1,000 persons in a county than the national average (0.58) (see Figure 3.4). The Kansas-Nebraska sample also has a lower average number of fast food restaurants (0.56) compared to the national sample (0.59), further strengthening the assertion of rural Midwestern counties suffering from low access to various food outlets leading to desertification (see Table 3.2). The HOSPITAL variable comprises establishments that are classified by the NAICS code as 622110, which is comprised of establishments known and licensed as general medical and surgical hospitals primarily engaged in providing diagnostic and medical treatment (both surgical and nonsurgical) to inpatients with any of a wide variety of medical conditions. These establishments usually provide other services, such as outpatient services, anatomical pathology services, diagnostic X-ray services, clinical laboratory services, operating room services for a variety of procedures, and pharmacy services. The national sample has a significantly lower average number of hospitals per 1,000 residents (.045) compared with the Kansas-Nebraska model (.129). This may be an indication that residents of the Midwest have a greater need for hospitals due to the poorer health of residents. SocCap is an index of measures used to calculate the social capital of an area. Social capital is a tool that can be utilized to mediate negative health effects in rural areas. The Pennsylvania State University Northeast Regional Center for Rural Development compiled a composite measure consisting of the following variables for 2005: total associations (an aggregate of the number of bowling centers, civic and social associations, physical fitness facilities, public golf courses, religious organizations, sports clubs, managers and promoters, membership sports and recreation clubs, political organizations, professional organizations, business associations, labor organizations, and membership organizations not elsewhere classified) per 10,000 people, number of not-for-profit organizations per 10,000 people, census mail response rate for 2005, and votes cast for president in 2004 divided by total population age 18 and over. Effects of social capital are likely more persistent than a year, and therefore the 2005 observation was considered as a valid measure of social capital in 2010. As suggested by Beggs, Haines, and Hurlbert (1996), social capital averaged much higher in the Kansas-Nebraska sample (1.57) than the national sample (-0.15), indicating a greater likelihood of assisting one's neighbors (see Table 3.2). GROWTH00 represents the rate of population growth in a county from the year 2000 to 2010. The aim of this variable is to capture the effect of \"boomtowns\" in rural areas. In a community in which the population rapidly increases with new residents, the \"everyone knows everyone\" aspect of social capital is likely diluted The Kansas-Nebraska sample indicates an average outmigration (-0.02) from the areas within this sample, whereas the national sample shows a slight average growth (0.061)."}, {"section_title": "Rural Classification: County classifications (CTYNONMETRO, NotAdjLowPop,", "text": "NotAdjMedPop, NotAdjHiPop) were specified using the ERS RUC Codes, which range from 1-9. Counties are classified based on whether or not the county is a metropolitan area; if not metropolitan area, whether or not it is adjacent to a metropolitan area; and the population of the largest city within the county (less than 2,500; between 2,500 and 19,999; or 20,000 or larger). CTYNONMETRO describes all counties that are classified as nonmetropolitan areas, corresponding to the ERS RUC code of 4, 5, 6, 7, 8, or 9. NotAdjLowPop describes nonmetropolitan counties which are not adjacent to a metropolitan county and with no city larger than 2,500 residents. The corresponding RUC codes for these areas are 8 and 9. NotAdjMedPop describes nonmetropolitan counties which are not adjacent to a metropolitan county and with the largest city having between 2,500 and 19,999 residents. The corresponding RUC code for these areas is 7. NotAdjHiPop describes nonmetropolitan counties which are not adjacent to a metropolitan county and with no city larger than 20,000 residents. The corresponding RUC code for these areas is 5. RUC codes 1, 2, and 3 are associated with urban areas, and as this research is concerned with rural residents, these areas are not considered. The most rural of the above classifications, NotAdjLowPop, has the highest concentration in the Midwest (10.7%) compared to the South (6.6%), Northeast (0.5%), West coast (5.8%), and total U.S. populations (2.3%). As expected, the KS-NE sample has a higher percentage of residents residing in these rural areas than the national sample, with 81.6% (vs. 62%), 63.1% (vs. 27.1%), 23.4% (vs. 7.4%), 29.1% (vs. 15.1%), and 10.6% (vs. 3.5%) of the sample residing in CTYNONMETRO, CTYNOTADJ, NotAdjLowPop, NotAdjMedPop, and NotAdjHiPop, respectively (see Table 3.2)., This reaffirms the assumption the conclusion that Kansas and Nebraska will serve as good representatives for rural community comparison. The Kansas-Nebraska sample has a lower average unemployment rate (5.5%) and poverty rate (12.8%) when compared to the national sample (9.5% and 16.9% respectively; see Table 3.2). This demonstrates the weakened effect of the recession on the Midwest, possibly due to the strength of the agricultural industry. POVRATE equals the percent of county residents with household incomes below the poverty threshold for their given household size. Data for this variable was collected using the 2010 Census collection results. GINI represents the Gini coefficient for each county, which measures the income inequality of the area. The Gini index is calculated by measuring the difference between a diagonal line (the purely proportionate distribution) and the actual distribution of household income (a Lorenz curve). These values range from 0 to 1, with 0 indicating perfect equality where there is a proportional distribution of income. Gini coefficients were obtained from the American Community Survey (ACS). The Kansas-Nebraska model has a marginally lower Gini coefficient (0.41) than the national average (0.43), indicating there is a slightly less inequality within the Kansas-Nebraska sample. PCTLOWINC equals the percent of people within a given county having an annual income of less than or equal to 199 percent of the Federal poverty threshold. This variable is based on an approximation similar to that developed by the USDA Food Atlas database, using data from the American Community Survey. Although the average percentage of residents with low income levels is slightly lower in the Kansas-Nebraska sample (33%) than the national sample (35.4%), the average percentage of residents with low incomes who reside in low access areas is higher (9.7% as opposed to 7.1%; see Table 3.2). This signals low access residents in the Kansas-Nebraska sample are more likely to be under financial stress than those of the national sample. Again, affirming the assumption that rural Midwestern counties are worse off than the rest of the nation. PCTLOACLOINC is the percentage of people in a county with low income and live more than 1 mile from a supermarket or large grocery store if in an urban area, or more than 10 miles if in a rural area. For this variable, low-income is defined as annual family income of less than or equal to 200 percent of the Federal poverty threshold given family size. This variable was obtained from the USDA Food Atlas database. HHINC is equal to the median income by household; income level that divides county households in half, one half with income above the median and the other half with income below the median. This measure includes income of all household members 15 years old or older, and was gathered from the U.S. Census Bureau. Table   3.2 shows a higher average median household income for the Kansas-Nebraska sample ($44,459) compared with the national sample ($43,296). Surveillance System data. Children in the rural areas of the Kansas-Nebraska sample are less obese (13.2%) than the national sample (14%) (see Table 3.2). respectively). In the Kansas-Nebraska sample, there were relatively fewer residents aged 18-24 (8.7%) and more residents over age 65 (17.4%) than in the national sample (9.2% and 15.2%"}, {"section_title": "POP18UND", "text": "respectively; see Table 3.2). Collected from the American Community Survey, COLLEGEGRAD is the percentage of the county population that has earned a Bachelor's degree or higher. This average percentage was slightly higher in the Kansas-Nebraska sample (20.2%) than the national sample (19.1%)."}, {"section_title": "BLACK, HISP, ASIAN, and NATAMER represent the percentage of residents identifying with", "text": "respective ethnicity in a given county. The highest proportions of ethnicity for the national sample were in the African-American (9.2%) and Hispanic (8.4%) communities. Asians (1.2%) and Native Americans (1.2%) represented a small portion of the national sample (see Table 3.2). Ethnic composition in the Kansas-Nebraska sample was not diverse, with the exception of Hispanic residents. For this reason, ethnicity was not considered in the Kansas-Nebraska regression model. White was chosen to be the base against which other ethnicities were compared, and was therefore not included. These values were assembled using data from the 2010 U.S. Census.  "}, {"section_title": "Chapter 4 -Regression Results", "text": "In this section, the regression equations for the National model and the Kansas-Nebraska model are presented. Ordinary Least Squares (OLS) was used to obtain the coefficient estimates. As discussed in the previous chapter, the general model for the adult obesity rate in county i is: For the national model, the following variables were included for each factors: where Midwest was specified as the base. In addition, interaction terms were specified and included between race and region, between grocery and rural-urban classifications, between social capital and rural-urban classifications, and between poverty rate and rural-urban classifications. For the Kansas-Nebraska model, the degrees of freedom were more limiting, and the following variables were specified for the factors: In addition, interaction terms were included between population growth and rural-urban classifications, poverty and rural-urban classifications, and grocery and rural grocery and social capital. Table 4.1 lists the estimated coefficients for the both models. The R 2 and adjusted R 2 values are also reported for each model. Food Environment: The National model yielded five statistically significant food environment results. PCTHUNV has a negative coefficient and is significant at the 5% level; this implies that, all else equal, a 100 percentage point increase in housing units within a county with no access to a vehicle leads to 4.4% decrease in residents classified as obese. As there is no designation of these households being located in low access areas, it is safe to conclude that this measure includes residents outside of food deserts without access to vehicles. This counterintuitive negative coefficient may be due in part to urban residents walking to food outlets, which decreases the prevalence of obesity. GROCERY and CONVSTR both have negative coefficients and are significant at the 1% and 5% levels, respectively. Consistent with previous research (Schafft, Jensen, & Hinrichs, 2009;Moore et al., 2008;Morland, Diez Rouz, & Wing, 2006), the increased presence of food outlets (GROCERY and CONVSTR) in an area is associated with increased levels of positive health for residents of the area. The above results show with one additional store per 1,000 persons in a county, the percentage of residents who are obese decreases by 2.3% (GROCERY) and 0.6% (CONVSTR), respectively. The interaction term GROCERYNonMetro has a positive coefficient and is significant at the 5% level, which indicates one additional grocery store per 1,000 persons in a nonmetropolitan county results in 2.0% increase in the percentage of obese residents. Combined with the overall GROCERY coefficient (-2.3%), there is a net effect of a 0.3% decrease in adult obesity rates with the addition of one grocery store per 1,000 county residents. Thus, grocery stores in nonmetropolitan counties are not as effectively contributing to healthier food access than in metropolitan counties all else equal. GROCERYNotAdj, was also positive but not statistically significant. GroceryNotAdjLowPop and GroceryNotAdjMedPop, although insignificant, have negative coefficients indicating the addition of grocery stores in nonmetropolitan counties which are not adjacent to metropolitan areas (with low and medium population levels) leads to decreased rates of obesity even more than the nationwide average. The SocCap variable has a positive coefficient and is significant at the 10% level. This coefficient does not support the hypothesis that higher levels of social capital leads to decreased prevalence of obesity. Instead, it indicates that a one unit increase in the social capital index results in a 0.19% increase in adult obesity rates. As the SocCap measure accounts for residents' participation in associations, the positive correlation with obesity may be a result of the types of gatherings with which members engage. For example, gatherings of a bowling league will take place in a bowling alley which typically serves unhealthy foods and alcohol. Being active in this bowling league may contribute to poor eating habits, leading to increased rates of obesity. The negative coefficient for SocCapNonMetro indicates that a one unit increase in the social capital index in nonmetropolitan counties leads to 0.23% decrease in obesity. This effect essentially offsets the 0.19% increase in obesity rates associated with social capital overall. Thus, social capital seemingly has little effect on obesity rates in nonmetropolitan counties. In more rural counties, social capital seems to effectively promote healthier lifestyle and is associated negatively with obesity rates. SocCapNotAdjLowPop, SocCapNotAdjMedPop, and SocCapNotAdjHiPop are all significant and have negative coefficients whose magnitude in absolute terms are bigger than the positive coefficient on SocCap. The net effect ranges from a decrease of 1% to 2.3% in obesity rate for every unit increase in social capital in a given county. GROWTH00 has a negative coefficient and is significant at the 1% level. This indicates that a 100 percent increase in the population growth rate for a county leads to a 1.94% decrease in the obesity rates of adults within that county. This could be attributed to healthier people being more mobile. People with health conditions may be more restricted to where they are able to live by the types of health care facilities located in an area. Although statistically insignificant, the remaining food environment variables of the positive coefficient, which indicates that as the number of fast food restaurants in a county increases, the obesity rates of adults in the county also increase. SNAPSTR has a positive coefficient, implying as the number of SNAP-authorized food outlets in a county increases, so does the rate of obesity. This may be a result of food outlets becoming authorized to accept SNAP benefits due to a large number of recipients located near their establishment. This implies that the amounts of SNAP benefit receipts could be an indicator of potential health status. Contradictory to expectations, HOSPITAL has a positive coefficient, indicating one additional hospital per 1,000 county residents results in a 1.8% increase in obesity rates. This may attributed to hospitals being located in areas with the most need for them, similar to SNAPauthorized retailers. The Kansas-Nebraska model yielded five statistically significant food environment results, with one associated interaction term that was statistically significant. PCTHUNVLOAC has a positive coefficient and is significant at the 10% level, yet this variable was not significant in the national sample. It could be explained by the greater proportion of residents of low access areas in the rural Midwest (see Figure 3.3). The significant positive coefficient implies that, other things equal, a 100 percentage point increase in county residents living within the food desert threshold and with no access to vehicle, leads to a 36.6% increase in the percentage of residents classified as obese. Contrary to the national findings, GROCERY yields a positive coefficient and is significant at the 5% level in the Kansas-Nebraska sample. This coefficient implies one additional grocery store per 1,000 persons in a county causes rates of obesity to increase by 5.2%. The general consensus is that an increased number of food outlets will lead to better health for residents who can access that store. This contradictory finding may be a result of the explicit account of rural grocery stores and interaction with social capital within this model. Indeed, the negative coefficient of RURGROC (p-value<0.1), in the Kansas-Nebraska model affirms the hypothesis that rural grocery stores can decrease the incidence of obesity in the communities they serve. With one additional grocery store per 1,000 persons in a rural county, rates of obesity decrease by 4.3%. SocCap has a positive coefficient and is significant at the 1% level in the Kansas-Nebraska model, indicating the same contradictory effect as in the national model at a slightly greater magnitude; a one unit increase in the social capital index results in a 0.84% increase in adult obesity rates. The interaction terms provide further insight on the roles social capital and grocery stores offer in rural areas. GROCERYSocCap is negative and statistically significant at the 10% level, suggesting that additional grocery stores in communities with higher social capital contribute to healthier population. The effect more than offsets the net negative (health worsening) impact of social capital. The interaction term between rural grocery stores and social capital (RurGrocerySocCap) is positive but not statistically significant, so the health improving effect of rural grocery stores is not affected by the amount of social capital present in the community. SNAPSTR, also significant at the 10% level, has a negative coefficient which implies one additional SNAP-authorized food outlet per 1,000 persons in a county decreases obesity rates by 1.5%. In the national sample, SNAPSTR yielded a positive coefficient; this difference between the two sample sets can in part be attributed to the slightly higher median income and lower average poverty rate in the Kansas-Nebraska sample. In a community with relatively fewer folks in financial stress, SNAP-authorized stores may merely represent an additional food outlet. In the Kansas-Nebraska sample two statistically insignificant factors were of the same sign as in the national model, mirroring their intuitive findings. GROWTH00 has a positive coefficient again indicating the aforementioned relationship between population growth and economic growth through increased number of businesses. PCTHUNV has a negative coefficient, which indicates that as the percentage of household without vehicles increases, the percentage of obese residents decreases as residents not located in low access areas may walk to food outlets, decreasing prevalence of obesity."}, {"section_title": "Rural-urban classification:", "text": "There was only one variable that was estimated to be statistically significant within this category. With urban counties serving as the base for comparison, CTYNONMETRO has a negative coefficient and is significant at the 5% level. This indicates residents in nonmetropolitan counties are 1% less obese than residents of urban areas, all else equal. This result suggests that controlling for negative consequences of food access issues in rural areas illustrated in Figure 1.2 and literature (Blanchard and Lyson, 2002), rural residents on average are equally as healthy as urban residents. NotAdjLowPop, NotAdjMedPop, NotAdjHiPop were all statistically insignificant in the national sample but have positive coefficients, indicating that residents of these rural areas are more obese than more urbanized areas. In the Kansas-Nebraska sample, CTYNOTADJ was insignificant but has a positive coefficient implying that residents of nonmetropolitan counties which are not adjacent to a metro area are more obese than residents of more urban areas, all else equal. Statistical insignificance of these rural-urban variables suggest that other model variables have successfully captured the differences in rural-urban environments contributing to the differences in health status measured by the BMI index."}, {"section_title": "Socioeconomic:", "text": "The National model yielded three statistically significant socioeconomic results, one of which coincides with the variables included in the Kansas-Nebraska model. POVRATE is significant at the 1% level and has the expected positive coefficient, showing that a 100 percentage point increase in residents living below the poverty threshold, results in an 8.4% increase in the percentage of residents who are obese. PovertyNotAdjMedPop and PovertyNotAdjHiPop are significant at the 10% and 5% level, respectively, with positive coefficients. This implies increased poverty rates in nonmetropolitan counties which are not adjacent to metropolitan areas (with medium and high population levels) leads to increased rates of obesity. The impacts are dire with over 40% increase. The magnitude of this impact of socioeconomic factors is similar to that of other studies. Moore et. al (2008) reports a 135% increase in the percentage of participants with a healthy diet between per capita income levels between $15,000-24,999 and ≥ $35,000. The measure of income inequality (GINI) is significant at the 1% level and has a contradictory negative coefficient, indicating that a one unit increase (away from perfect equality) in the income equality index causes a 5.9% decrease in the percentage of residents who are obese. An area where there is increased income disparity leads to larger areas of low income residents. As shown through earlier studies, and this study (see Figures A.1 and A.2), there is a negative correlation with income and obesity; indicating poorer people are less healthy. PCTLOWINC has a positive coefficient and is significant at the 5% level in both the national In general, impacts of economic status appear more severe in the Kansas-Nebraska findings than in the national findings. Such differences may be due to varying attitudes towards receiving government assistance and awareness of available benefits. Researchers have found that low levels of nonmetropolitan welfare participation are due to less awareness of welfare programs among the nonmetropolitan poor (Osgood, 1977;Rank and Hirschl 1998  17.3% (Kansas-Nebraska). All race/ethnic variables (except ASIAN) included in the national model were statistically significant. With White being the reference race, the National model reveals Native Americans (NATAMER) and African Americans (BLACK) were more obese, 5.9% and 6.5%, respectively. Hispanics (HISP) were 5.2% less obese; all significant at the 1% level. Hispanics in the south (HispSouth) has a negative coefficient and is significant at the 10% level, implying Hispanics in the south are 1.66% less obese than Hispanics elsewhere. ASIAN, although statistically insignificant, has the expected negative coefficient (Wang and Beydoun, 2007;Moore et al., 2008). This implies that Asians are less obese compared to Whites. But, Asians in the west (AsianWest) has a positive coefficient and is significant at the 5% level, implying Asians in the West are 12.69% more obese than Asians elsewhere. Region: Compared against Midwestern counties, both Northeastern (NE) and Western (WEST) counties are less obese, by 1.1% and 3.7% respectively. The negative coefficients for NE and WEST are both significant at the 1% level. SOUTH, which was not statistically significant, does have the expected positive coefficient. The positive coefficient of SOUTH indicates people residing in the South are more obese than those of the Midwest; this result confirms results of Figure 3.2, even after controlling for all the factors in the models."}, {"section_title": "Chapter 5 -Conclusion", "text": "The goal of this analysis is to see what effect, if any, social capital and rural grocery stores would have on obesity rates specifically in rural areas with low food access. Regression models were developed based on past research to determine the obesity rates of consumers as a function of their food environment, rural vs. urban setting, socioeconomic factors, demographics, and region of residence. Using ordinary least squares regression, the national model shows the established relationship between increased number of food outlets and decreased obesity. One result that sets this research apart is the negative relationship between obesity and social capital in nonmetropolitan counties in the National model. Another key finding is the negative relationship between obesity rates and rural grocery stores in the Kansas-Nebraska model. These conclusions lend insight into ways to decrease the level of obesity in rural areas. Given that rural food deserts are a result of both supply and demand issues, government policy intervention must consider both aspects. As the fixed costs of operating a retail outlet are substantially higher for retailers in poor and or rural areas, it is more costly for these outlets to provide affordable healthy products and these costs are in turn transferred to consumers. A government program that subsidizes higher fixed or operating costs of retailers might be effective for increasing consumption of nutritious food. Passage of Obama's Healthy Food Financing Initiative in the current session of Congress could very well be an effective step towards addressing and resolving health issues in the United States. Correcting for supply side problems without addressing demand concerns would be useless as consumers' income constraint and lack of education on the importance of a healthy diet would remain unchanged. Given the negative stigma that rural residents hold towards welfare and public assistance, educational information should be targeted at these groups to help increase their awareness of benefits available to them as well as change the perception of receiving assistance. It may be more beneficial to send informational materials through avenues that disadvantaged residents may utilize (i.e. food banks, shelters, etc.) as opposed to mail or within welfare offices. This approach will reach the appropriate audience through means they are already familiar and comfortable with. A public health campaign (similar to Michele Obama's \"Let's Move\" campaign) promoting the importance of healthy eating habits along with increased SNAP benefits targeted at healthy food items could potentially boost demand for and consumption of healthy food. A tax discount for healthier food items (i.e. fruits and vegetables) or a premium for less healthy items (i.e. soda and chips) could also help to sway purchases towards healthy eating patterns. Another policy option could be to restrict the types of foods able for purchase, similar to the limits enforced by the Women, Infants and Children (WIC) program. The above mentioned policy initiatives aim to improve the diet of consumers which has a causal effect of health status of individuals. A unanimous measurement of social capital has not yet been established, but previous studies show there a multiple benefits for communities who invest in social capital. Notably, this analysis shows it has a positive effect on decreasing obesity. To continue and expand this effect, communities must begin to implement initiatives that encourage social capital efforts that promote healthy lifestyles. Securing for community-sponsored social capital events in the local government budget is an active stance that will ensure community-promoting events (i.e. Taste of Chicago, Jazz in the Park, Back-to-School supply drives/giveaways, Fall Festivals, etc.) will be carried out after initial planning and enthusiasm has faded. In addition to community gardens, which will help teach the skills necessary to begin forming healthy eating habits, programs promoting exercise and weight loss will also be important. For example, a program similar to TV's \"The Biggest Loser\" will encourage the competitive spirit of participants. At the time of sign up, each participant will weigh in and identify a weight goal they would like to reach. Through exercise and healthy eating, participants will compete to win a cash prize (or other incentive) by having the highest percentage of weight lost (pounds lost divided by initial weight) over a specified time period. This program can be utilized at the office, neighborhood, and/or county level. This type of program will be most beneficial combined with a \"Get Fit Club\" program aimed at motivating members to engage in physical activities. Whether it is a group of neighbors or coworkers, who walk a set distance, play softball or flag football, it is imperative that healthy eating is paired with some form of exercise. There were a few limitations to the data used and the data available. One limitation is that we were unable to include supercenters in the food environment analysis, as complete information on these locations was not readily available. If supercenters were in similar locations as existing stores in the sample, the presence of supercenters would take away explanatory power from the other food outlets as supercenters will most likely be consumers' first choice. If supercenters were located in different locations than existing stores in the sample, there will be little to no effect on the impacts of other food outlets (including grocery stores) since consumers will have to consider travel costs when accessing supercenters. Updated data for fast food expenditures, detailed in the Economic Census, had not yet been released and were therefore not utilized. Rural grocery locations were only accessible for Kansas and Nebraska, which excluded the rest of the nation from the rural-focused Kansas-Nebraska sample set. Future analyses should attempt to control for these variables. "}]