[{"section_title": "INTRODUCTION", "text": "For many years scientists and clinicians hypothesized that loss of mobility and physical disability with aging was attributable, at least in part, to age-associated changes in body composition, namely decline of muscle mass and increase in other less metabolically active tissues, mostly fat and connective tissue (1)(2). Contrary to this view, studies conducted in the last decade found independent associations between muscle strength but not muscle mass with lower extremity function, mobility and mortality (3,4). Thus, it appears that change in characteristics of muscle tissue have functional consequences of greater importance than those caused by the decline in muscle mass alone. The hypothesis that decline in muscle mass causes mobility disability was based on the assumption that the force generated by muscle contraction is proportional to its mass. Indeed, while studies of growth in children show proportional increments of muscle mass and strength (5), such proportionality fades with aging. In the late 1990s, Metter and colleagues used data from the Baltimore Longitudinal Study of Aging (BLSA) to show that age-related decline in muscle strength significantly exceeded that predicted by the decline in muscle mass and suggested that aging is associated with a decline in muscle quality, defined as the amount of strength generated by a unit of muscle mass (6). However, in the study of Metter and colleagues, muscle mass was estimated by anthropometrics or dual energy x-ray absorptiometry (DXA) and these measurements have limited validity for local-regional assessment of muscle mass, especially in older persons (7). Subsequently the Health ABC study, a study limited to high functioning subjects 70 years and older, confirmed that change with aging in quadriceps cross-sectional area only explained about 6-8% of the betweensubject differences in isometric strength (8). In the present analyses we attempt to overcome limitation of previous BLSA analyses by assessing muscle mass by computed tomography (CT) scan rather than DXA and we expand the Health ABC observation to participants over the whole adulthood age range. Using cross-sectional data from the BLSA we describe differences in muscle quality ratio, the ratio of knee-extension strength to thigh muscle cross-sectional area, with age as well as the differences in muscle strength and mass that underlay such differences in aging men and women. After characterizing the distribution of muscle quality ratio across age, we evaluated the correlation of muscle quality ratio with biological as well as clinical factors including measures of body composition, biomarkers of carbohydrate metabolism, hormones, vitamins, as well as functional measures of the central and peripheral nervous system with a goal of identifying mechanisms that may impair force generation in aging muscle. Understanding whether the decline of muscle occurs early in adulthood and identifying potential causes of muscle quality impairment may help developing new preventive strategies. Given recent evidence that in the absence of specific interventions, maintaining or gaining muscle mass does not prevent age related declines in muscle strength (8) and that interventions aimed at increasing muscle anabolism have limited impact on physical function and disability (9)(10)(11), alternative treatment approaches are highly needed."}, {"section_title": "METHODS", "text": ""}, {"section_title": "Study population", "text": "The design, study population and measurement protocols of the BLSA have been previously described (12). Begun in 1958, the BLSA is a continuously enrolled cohort study of community dwelling adults conducted by the National Institute on Aging Intramural Research Program. Participants free of major chronic conditions and functional impairments are enrolled in the study and came to the study clinic for follow-up visits at intervals of one to four years with more frequent follow-up for older participants. Isometric knee extensor strength testing was introduced in the BLSA in 1992 and thigh CT scans in 2006 (see below). In this analysis we considered data collected from January 2006 to January 2011 in 786 BLSA participants at the first visit when thigh muscle area and isokinetic quadricep strength were measured. In preliminary analyses we found that muscle quality ratio was associated with body size (height), which lead us to question the evaluation of the magnitude of the effect of obesity (weight independent of height) on muscle quality in cross sectional analyses. To address this problem, we performed a matched pair analysis on a subset of the initial study population. Participants with poor muscle quality (muscle quality ratio below the median) were matched to those with good muscle quality (quality ratio equal or higher than the median) according to sex, quartiles of height and quartiles of thigh muscle area. Overall 290 matched pairs were identified for a total of 580 participants. Study participants provided written informed consent and all BLSA study protocols have been approved by the internal review board of the Medstar Research Institute."}, {"section_title": "Muscle strength, mass and quality ratio", "text": "Peak torque was measured using the Kinetic Communicator isokinetic dynamometer (Kin-Com model 125E, version 3.2, Chattanooga Group, Chattanooga, TN). Maximum quadricep strength was defined as the highest value of torque from either leg in up to three consecutive measures of concentric knee extensor strength at an angular velocity of 0.52 rad/s (30°/sec) (13). Cross-sectional thigh muscle area was measured from 10mm CT images captured at midfemur by a Somatom Sensation 10 CT scanner (Siemens, Malvern, PA) and quantified using Geanie software version 2.1 (BonAlyse, Jyvaskyla, Finland; http:// www.bonalyse.com). Different tissues in the analysis were separated according to different density thresholds: a density value of 35 mg/mm was used to separate fat from muscle tissue, and 180 mg/mm to separate muscle from bone tissue. Analyzed images were visualized and checked for mistakes in the identification and contouring of different tissue. Macroscopically detectable intramuscular fat was not included in the calculation of muscle area. Muscle quality ratio was defined as the ratio: maximum quadricep strength (torque) (Nm)/thigh muscle area (cm 2 )."}, {"section_title": "Independent variables", "text": "Demographic characteristics and medical history of BLSA participants were obtained through structured interviews. Anthropometric and functional measurements are obtained using standardized protocols. Factors that may influence muscle quality were selected among five conceptual domains of measures potentially important for muscle quality: 1. General adiposity and the distribution of adiposity were assessed by weight (kg) and waist circumference defined as the mean of available upper abdominal circumference measurements (cm), as well as subcutaneous and visceral fat areas (cm 2 ) derived from abdominal CT image at L4-L5 using customized software (16). 2. Dysfunction of the central nervous system was explored through inclusion of measures cognition and motor control and coordination. The sum of five verbal memory immediate recall trials in the California Verbal Learning Test (CVLT) as well as recall after a 15 to 20 minute delay were used to assess memory. The Digit Span Test of the Wechsler Adult Intelligence Scale-Revised evaluated memory and attention (14). The trail making test part A was also used as an indicator of both attention and speed while part B evaluated executive function. To assess motor control and coordination, participants were asked to tap a designated keyboard key as quickly as possible for ten seconds in three consecutive trials with each hand. In these analyses the mean time between taps calculated across all trials, as well as the standard deviation of these interval times were used in the analysis; 3. The role of peripheral nervous system was assessed by nerve conduction velocity (m/s) measured in the peroneal nerve with stimulus at the fibular head using standard electromyographic techniques (15). 4. Nutritional and metabolic factors that may affect muscle quality included total 25-hydroxyvitamin D (ng/mL) assessed by liquid chromatography-mass spectrometry at Mayo Clinic laboratories (Rochester, MN); bioavailable testosterone (ng/dL) assessed by RIA (Diagnostic Systems Laboratories, Inc., Webster, TX); homeostasis model assessment: insulin resistance (HOMA-IR) (fasting glucose (mg/dl) × fasting insulin (μU/ml) / 405) and 2-hour standard oral glucose tolerance test; Plasma leptin (ng/mL) and adiponectin (μg/mL) measured, respectively by enzyme-linked immunosorbent assay (ELISA) and by radioimmunoassay (Millipore, Billerica, MA). 5. Inflammatory status was assessed by serum levels of interleukin-6 (pg/mL) (IL-6) and C-reactive protein (μg/mL) (CRP) measured by ELISA (R & D systems, Minneapolis, MN and Alpha Diagnostic International, San Antonio, TX). CRP values ≤ 0 were imputed as 0.001 (n = 5) and both IL-6 and CRP were log transformed in all analyses."}, {"section_title": "Statistical analysis", "text": "Cross-sectional relationships of thigh muscle area, quadricep strength and muscle quality ratio with age and sex were explored graphically and evaluated in linear regression models. The distributions of demographic, biological, and clinical characteristics were compared across tertiles of muscle quality ratio by ANOVA and Fisher's exact χ 2 test. Quantitative variables included in regression models were z-score transformed to obtain comparable coefficients. The association of each independent variable of interest with muscle quality ratio was evaluated adjusting for age, sex, and height (cm). Variables associated with muscle quality ratio (p-value < 0.1) were evaluated in multivariate models in a subset of participants with complete covariate information (n = 441). A parsimonious set of covariates was selected using stepwise backward selection by Akaike information criterion (AIC), age, sex, height and weight were excluded from removal: variable selection was carried out in 10,000 bootstrap samples and variables that appeared in more than half of the reduced models were included in the final model. A secondary case-control analysis evaluated the association of variables of interest with lower muscle quality ratio in a subset of participants matched on sex, quartiles of height, and quartiles of thigh muscle area. The association of variables with case status was evaluated in conditional logistic regression models adjusted for age. All analyses were performed using R version 2.15.1 (R Foundation for Statistical Computing, Vienna, Austria)."}, {"section_title": "RESULTS", "text": "The study sample included 786 participants, 51.9% male, with a mean age of 66.3 years: range 26 -96 years, 10.8% < 50 years, 14.1% > 80 years. Participants with lower muscle quality ratio were older, shorter, had greater adiposity and tended to have worse cognitive scores (Table 1). Cross-sectional observations suggest that both muscle mid-thigh cross-sectional area and quadricep strength decline non-linearly with age and that the rate of decline varies by sex: estimates of quadratic age terms in regression models indicate negative associations of greater magnitude at later ages (p age2 <0.05) and among men compared to women (p age×sex <0.001) ( Figure 1A-B, Table S1). Muscle quality ratio becomes progressively lower at older ages but, differently from what is observed for muscle area and muscle strength, the pattern of muscle quality ratio reduction with older ages was similar in men and women ( Figure 1C). The absence of statistically significant age 2 or sex terms in the regression model estimating the association between muscle quality and age indicate a relationship that is linear across the adult life span and consistent between men and women (Table S1)."}, {"section_title": "Association analysis", "text": "Variables associated with muscle quality ratio in linear regression models adjusted for age, sex and height, (Table S2) were simultaneously included in a multivariate model predicting muscle quality ratio (Table 2, Model 1). A parsimonious model was selected in an AIC based backward selection process (Table 2, Model 2). Weight, height, and adiposity (subcutaneous fat area, β: 0.06 95% CI: 0.01, 0.11), as well as peripheral and central nerve function (peroneal conduction velocity, β: 0.04 95% CI: 0.01, 0.07; CVLT delayed recall, β: 0.04 95% CI: 0.01, 0.07) were independent predictors in the final model."}, {"section_title": "Nested case-control analysis", "text": "A trend of higher muscle quality ratio in taller participants was observed across all strata of thigh cross-sectional area (Table S3). Interestingly, after matching within quartiles of height and muscle cross-sectional area, the association of weight with muscle quality ratio was reduced and other measure of adiposity were not statistically significantly associated with poor muscle quality ratio. In these models, muscle quality ratio was associated with 2-hour glucose, fine motor control (finger tapping) as well as memory (CVLT immediate recall and CVLT delayed recall) (Table S4)."}, {"section_title": "DISCUSSION", "text": "In this study we found that muscle quality, operationalized as the ratio between mid-thigh muscle cross-sectional area and isokinetic knee extension max torque was progressively lower with older age. We observed a linear pattern of age-decline that was surprisingly similar in men and women across the entire life course. While our study extends to the whole adult life course previous observations that muscle quality declines with aging (17), we found no evidence for previous claims that muscle quality tends to be lower in women and declines more rapidly with aging in men (18). In the multivariate analysis, we found that independent of age, sex, and height, higher weight was a significant predictor of lower muscle quality ratio. This finding is consistent with studies showing that obesity, and in particular central obesity, is associated with intermuscular and intra-muscular fat infiltration, which is generally considered one of the important anatomical correlates of poor muscle quality (19)(20)(21)(22). Our observations reemphasize the role of anatomical and physiological properties of the whole muscle in addition to changes at the fiber level with age. Interestingly, when we matched participants by height and muscle cross-sectional area, we could no longer detect any significant, independent correlation between muscle quality ratio and weight, but independent of age and sex, taller people tended to have higher muscle quality ratio. These findings suggest that taller individuals may have different structural characteristics of muscle that lead to higher muscle quality ratio as defined in this study. The cross-section of the muscle obtained by computed tomography scanning is orthogonal to the muscle long axis but not to the direction of muscle fibers, due to the pennate organization of muscle fibers in most muscles of the thigh. The force contributed to the entire muscle by individual fibers is inversely proportional to its pennation angle (23). Under the assumption that taller individuals have longer muscle and longer fibers, to stay in the same cross sectional area these fibers should be more parallel to the major axis leading to higher muscle quality ratio as currently measured. This is consistent with previous suggestions that muscle size and pennation angle are correlated (23). Beyond anthropometrics, we observed that measures of fine motor control (finger tapping), peripheral nerve function (peroneal conduction velocity) and memory (CVLT), were strong predictors of muscle quality ratio, and their relevance was confirmed in the matched analysis. Though these variables are only proxies for the functional integrity of the nervous system our findings do suggest that muscle quality is affected by dysfunctions that occur in the central and peripheral nervous system. This view is consistent with the term \"dynapenia\", which has been proposed by Clark and Manini to explain the disproportional decline of muscle strength with aging (24,25). Many of the changes in the central and peripheral nervous system with aging may account for changes in muscle quality observed in our study. A voluntary contraction entails the development and execution of a motor program that recruits motor neurons and excites muscle fibers in a coordinated fashion. Higher activation of neurons in the primary motor cortex with increased firing of corticospinal neurons generates higher force (26). There is strong evidence both from autopsy and imaging studies that aging is associated with volumetric reduction in the premotor cortex, loss of white matter and myelinated nerve fibers and reduced connectivity (27)(28)(29)(30)(31). It has been hypothesized that decreases in cognitive and motor functions with aging are similarly connected with changes in neurotransmitters and their receptors (32)(33)(34)(35). Aging is associated with a progressive loss of motor-neurons, less and larger motor units due to the compensatory collateral sprouting by surviving neurons (36)(37)(38)(39). In older animals neuromuscular junctions show abnormalities, including higher presynaptic nerve terminal branching and changes in the post-synaptic distribution of acetylcholine receptors (40,41). Our findings underline that the study of the multifaceted neurological contribution to agerelated muscle impairments is a very important area of investigation. While the analyses presented in this report represent a step in understanding change in muscle quality, limitations of this study suggest avenues for additional investigation. Our study population was limited to participants who were eligible for CT scan and isokinetic dynamometry, which are not feasible in some of the frailest individuals. Additionally, the BLSA is a cohort of volunteers characterized by good health, high socioeconomic status and education consequently the external validity of our conclusions should be verified in different populations. We have assessed five domains that may contribute to muscle quality using surrogate measures with varying levels of associated measurement error and proximity to underlying processes of interest. Limitations in measurement may have restricted our ability to evaluate some domains and additional insight may be gained through the use of more precise methods. While our data point to an association between neurologic function and muscle quality, direct measures of potential neurological causes were not available and should be explored in future studies which are specifically designed to address factors affecting muscle quality with aging. It is also possible that the same age-related biological processes that affect muscle quality also affect neurodegeneration: for example, mitochondrial dysfunction may impair neurological function and muscle contraction, without any necessary causal connection between them. It is also plausible, given the paracrine effects on muscle metabolism and the potential for myokine driven crosstalk between systems (42) that the observed neurological associations are a direct or indirect consequence of changes in muscle quality. However, we are unable to address either alternative hypothesis in the current cross-sectional analyses. Future studies aimed at identifying longitudinal predictors of accelerated decline of muscle quality may partially address this problem. Finally, our analysis is limited to the knee extension movement and cross sectional measurement of muscle area at mid-thigh which may not sufficiently capture the mechanical properties of muscle as noted above. New methods to measure 'in vivo' pennation angle as well as the evaluation of different muscle groups, joints and movements may further clarify our understanding of muscle quality. In conclusion, we found that muscle quality ratio declines linearly with aging, and is correlated with measures of neurological function. A greater understanding of the mechanisms that impair muscle quality with aging may reveal targets for intervention aimed at improving mobility in this population. This research is important because interventions that stimulate muscle anabolism have had little success in improving mobility in older persons and because muscle quality and strength, rather than muscle mass, appears to be the most important predictors of mobility disability and other geriatric outcomes."}, {"section_title": "Supplementary Material", "text": "Refer to Web version on PubMed Central for supplementary material. A -Thigh muscle cross-sectional area, B -maximum quadriceps strength and C -muscle quality ratio (maximum quadriceps strength/thigh muscle cross-sectional area) versus age among Baltimore Longitudinal Study of Aging participants. Cross-sectional trends are summarized separately in men and women by estimates from linear regression models including terms for age, age 2 , sex, age × sex, and age 2 × sex. Table 1 Distribution of selected characteristics by muscle quality ratio tertile a among Baltimore Longitudinal Study of Aging participants in the study sample (n = 786).  Abbreviations: HOMA-IR -homeostasis model assessment: insulin resistance, IL6 -interleukin-6, CRP -C-reactive protein, CVLT -California Verbal Learning Test."}, {"section_title": "Table 2", "text": "Multivariate linear regression models estimating the independent association of potential risk factors for poor muscle quality and muscle quality ratio in Baltimore Longitudinal Study of Aging participants with complete covariates (n = 441). All quantitative variables were centered and scaled to 1 standard deviation. "}]