[{"section_title": "Abstract", "text": "Research in cognitive science and neuroscience has made enormous progress toward understanding skilled reading, the acquisition of reading skill, the brain bases of reading, the causes of developmental reading impairments and how such impairments can be treated. My question is: if the science is so good, why do so many people read so poorly? I mainly focus on the United States, which fares poorly on cross-national comparisons of literacy, with about 25-30% of the population exhibiting literacy skills that are low by standard metrics. I consider three possible contributing factors, all of which turn on issues concerning the relationships between written and spoken language. They are: the fact that English has a deep alphabetic orthography; how reading is taught; and the impact of linguistic variability as manifested in the Black-White \"achievement gap\". I conclude that there are opportunities to increase literacy levels by making better use of what we have learned about reading and language, but also institutional obstacles and understudied issues for which more evidence is badly needed.\nIs there an area in cognitive science and cognitive neuroscience that has been more successful than the study of reading? Let's not underestimate the amount that has been learned. We, the community of scientists who study reading (including my colleagues Perfetti and Treiman, whose own research is described in accompanying articles) understand the basic mechanisms that support skilled reading, how reading skill is acquired, and the proximal causes of reading impairments.\nWe understand the fundamental problem facing the beginning reader: how to relate a new code, a written script, to an existing code, spoken language. We know which behaviors of 4 year old pre-readers are strong predictors of later reading ability, how children make the transition from pre-reader to reader, and the obstacles that many encounter. We know what distinguishes good and poor readers, younger and older skilled readers, \"typical\" readers from those who are atypical because of either constitutional factors (such as a hearing or learning impairment) or environmental ones (for example, poor schooling or poverty).\nWe know how basic skills that provide the child's entry into reading relate to other types of knowledge and capacities that support comprehending texts of increasing variety and difficulty. We understand that some aspects of reading are universal (because people's brains are essentially alike) and that some are not (because of differences among writing systems and the languages they represent)."}, {"section_title": "", "text": "Neuroimaging studies have been successful in identifying the main brain circuits involved in reading and the anomalous ways they develop in dyslexics, and several probable causes of such impairments. We have computational models that specify the mechanisms that underlie basic reading skills, how children acquire them, and how differences in experience (with spoken language and reading) and individual differences (in learning and memory capacities, motivation and other factors) result in varied reading outcomes. This vast research base has led to the development of intervention and remediation methods that can reliably help many children who need it. Researchers disagree about many details-it's science, not the Ten Commandments-but there is remarkable consensus about the basic theory of how reading works and the causes of reading successes and failures (for reviews, see Rayner et al., 2001; Pennington, 2006; Morris et al., 2010; Gabrieli, 2009; Pugh et al., 2012) .\nMy question, then, is this: if the science is so advanced, why do so many people read so poorly? In America not long ago we had a \"Sputnik moment,\" occasioned by the release of the results of the 2009 round of the PISA cross-national assessments of the academic performance of 15 year olds (OECD PISA, 2009 ). As in previous years, US performance was close to the average for the 34 OECD countries. However, this round was the first to include data from Shanghai and Singapore, which along with Korea, Hong Kong, and Japan, scored higher than the US. These findings received far more attention than the fact that for many years the US has scored lower than countries such as Canada, Australia, Finland and New Zealand on the PISA exercise. The president, the secretary of education, and the commentariat (e.g., Finn, 2009 ) all treated the results as evidence of a crisis in American education that called for immediate action. But 2010 was not 1957 and so the second \"Sputnik moment\" passed quickly, rapidly dropping out of public discourse (Fig. 1 ).\nAlthough the PISA results made the news, there is plenty of in-house data about the literacy problem in the US, posted on the Department of Education's web site (http://ies.ed.gov). The National Assessment of Adult Literacy (2003) found that about 93 million adults read at \"basic\" or \"below basic\" levels. At these levels, a person might be able to find the listing for a television program on cable TV, but not understand the instructions and warnings that come with their blood pressure medication (Lesgold & Welch-Ross, 2012) . Results on the NAEP (\"the nation's report card\") document the origins of low literacy in the performance of 4 th and 8 th graders (http://nces.ed.gov/nationsreportcard). Like everything else about education in the US, this assessment exercise has been the focus of controversy, with different stakeholders spinning the data in different ways. People who emphasize how well American education is doing point to the finding that since 1992, when the modern form of the NAEP was introduced, between 59-67% of 4 th graders and 69-76% of 8 th graders scored at the \"basic\" level or higher. People who think we should be doing better-I am in this camp-can point to the fact that 66-71% of 4 th graders and 66-71% of 8 th graders scored at \"basic\" or \"below basic\" levels. Put another way, there are far too many children scoring in the lowest tier (about a third of the 4 th graders and a quarter of the 8 th graders are \"below basic\"), and far too few in the highest (6-8% of the 4 th graders and a mere 3% of the 8 th graders are \"advanced\" readers by this measure). The American polity is in a test-happy phase and so there is much other data about who can read and how well than can be reviewed here. It is fair to say that assessments of adults and children consistently indicate that large numbers of individuals in the US read poorly, and that this has been true for many years.\nLow literacy's consequences for the affected individuals and for society are vast, as we all know. It creates serious challenges to fully participating in the workforce, managing your own health care, and advancing your children's education. Looking at these facts, and knowing something about how reading works, I've asked myself whether our science has anything to contribute to improving literacy outcomes in this country and others. It might not. Literacy failure could be due to factors well outside the boundaries of this science: poverty, for example. Poverty has many sequelae, including higher infant mortality rate, atypical brain development, shorter life span, worse health and health care, higher crime and incarceration rates, lower educational achievement, higher dropout rates, poorer schools with less experienced teachers and toward the bottom of a list that could go on much longer, poor reading (General Accounting Office, 2007) . Surely reducing poverty would have a bigger impact on literacy than anything inspired by our research. Any person with a politically-acceptable plan to substantially reduce or eliminate poverty should step forward immediately.\nIf poverty were all that mattered, this article could end here. However, the relationship between socioeconomic status and reading achievement is not simple. It is difficult to isolate effects of SES (itself a complex construct; Duncan & Magnuson, 2005) from the many other factors with which it is correlated. Nonetheless, data from a variety of sources suggest that there is much about observed literacy outcomes that SES does not explain. I return to this issue in the final section of this article in the context of the Black-White \"achievement gap\", where the confound between SES and achievement is of particular concern. Here I merely want to cite some representative findings suggesting that although poverty has enormous impact, it is not the whole story.\nThe PISA assessments provide a wealth of data (so to speak) about the relationship between national wealth and reading performance. The 2009 data set includes multiple measures related to a country's economic health for a core group of 34 OECD countries. The main findings are quite interesting. 1 In brief, two economic factors, the country's gross domestic product (GDP) and amount spent on education, are only weakly related to reading performance. The proportion of socio-economically disadvantaged students in each country has a bigger impact, with higher proportions associated with lower scores. However, the US does not score poorly because lower income students are overrepresented; in fact, the US clusters with many OECD countries on this measure, and reading scores in this group vary widely. It is also of interest that parents' education level is a much stronger predictor than economic indicators across countries. Of course, it takes more complex analyses to identify relations among such factors and their relative contributions. Nonetheless, even these descriptive data indicate that both SES and other factors are important determinants of outcomes.\nThe NAEP assessment also includes information regarding the moderating effects of a variety of factors, including race/ethnicity, gender, and eligibility for subsidized or free school lunch, a common (though rough) proxy for SES. 2 Again there are strong indications that both SES and other factors affect outcomes. There is a large, consistent effect of SES as indexed by the subsidized lunch proxy in every year of testing. However, there are similar results for other factors, such as gender. Females have scored significantly higher than males in every year of NAEP testing. Females also scored significantly higher than males in every participating country/municipality in the 2009 PISA assessment. (The US had one of the smaller gender gaps, whereas Finland, a perennial high-scoring country, had one of the largest.) The gender differences within and across countries may be related in some complex manner to SES, but the consistency of the effect across countries with widely varying economic profiles suggests that SES is not the main determinant.\nInsofar as the US does not seem likely to substantially reduce or eliminate poverty any time soon and SES is not the only factor affecting reading outcomes, this article will not end here. To restate the question: what are the main causes of reading failures in the US (and perhaps other countries where similar conditions exist) and does reading science have anything to contribute to substantially reducing them, the considerable impact of poverty notwithstanding? I'll consider this question by examining three quite different kinds of factors often thought to be relevant to literacy outcomes in the US."}, {"section_title": "Blame English?", "text": "One possibility is that a certain number of people are doomed to fail to learn to read well because of intrinsic properties of English. The child's initial task is to learn how the written code relates to the spoken language they already know. The writing system is alphabetic, and we tell beginning readers that letters correspond to sounds, but then we teach them early reading vocabulary that includes HAVE, GIVE, SAID, SOME, WAS, WERE, IS, ME, ONE, WHO, SCHOOL, and many other words with atypical spelling-sound correspondences. These inconsistencies are a much commented-upon property of English. Other alphabetic writing systems are indeed more consistent at this level of analysis, many of them conforming (to a very high degree but not perfectly) to the principle that each symbol in the writing system (a \"grapheme\" consisting of one or more letters) correspond to a single unit (a phoneme) in the spoken language. English is said to be a \"deep\" orthography, whereas Italian, German, Russian, Finnish, Korean, Serbo-Croatian, and many other alphabets are \"shallow\" (Katz & Frost, 1992) . Written English is obviously a workable system but the learning curve is steep and a greater proportion of individuals may be left behind than if the writing system were shallow. This hypothesis is contradicted by the consistently high reading achievement in countries such as Canada, New Zealand, Australia, and Singapore where English is also the main language of instruction (Quebec exception duly noted). Although these results suggest that written English is not the whole problem, perhaps performance would be even higher in these countries (and the US) if it were not so peculiar. These cross-national findings are correlational of course. What is needed is more direct evidence as to whether it is easier to learn to read in shallow alphabetic orthographies, holding other factors aside to the extent possible.\nResearchers in many countries have attempted to address this question. By now it is quite clear that it is easier to learn to read words and nonwords aloud in shallow alphabetic orthographies compared to English (for reviews, see Aro & Wimmer, 2003 , and several chapters in Hulme, 2005, and in Joshi & Aaron, 2006) . The advantage for shallow orthographies has been observed in Italian, Spanish, German, French, Finnish, Serbian, Turkish and other languages. \"Learning to read in Albanian\" is \"A skill easily acquired\" according to Hoxhallari et al. (2004) because the alphabet is so shallow. Children know the full set of spelling-sound correspondences for Finnish, which has a shallow orthography, by the time formal schooling commences (at age 7 following a compulsory year of preschool). 3 Tested on their skill at reading words and nonwords aloud, children in Wales learning to read in Welsh (which has a shallow alphabetic script) outperform children from the same area who are learning to read in English (Hanley et al., 2004) . The Welsh studies permitted comparisons that excluded many potentially confounding socioeconomic and cultural factors. Such studies suggest in short, that shallow is easier. Share (2008) argues that theories of reading have been led astray because of overreliance on studies of English, an \"outlier\" among writing systems. Perhaps there would be higher literacy achievement in the US if the writing system were more like Finnish or Albanian.\nI don't think so. For one thing, this comparative research on reading acquisition makes the mistake of equating the task of reading words and nonwords aloud with \"reading\" (as in Aro & Wimmer, 2004 , Spencer & Hanley, 2003 , and many other studies). Children are sometimes called upon to read aloud, in classrooms and in experiments; reading aloud provides overt evidence about the child's knowledge of words and the opportunity to provide explicit feedback (e.g., corrections of mispronunciations). Because of the nature of the writing system, the child's ability to name words and nonwords aloud in English is a major step in reading acquisition. The task has also provided a domain in which to explore statistical learning procedures (Harm & Seidenberg, 1999) that are relevant to language acquisition, visual cognition, and much else. The goal of reading, however, is comprehension. Reading aloud is much more strongly related to comprehension in English than in shallow orthographies (see, e.g., Lindgren, deRenzi, & Richman, 1985) . In shallow orthographies, reading aloud can be achieved without comprehending what is being said, indeed without knowing the language. I know this to be true because I proved it at my Bar Mitzvah. Modern Hebrew can be written with or without vowels. With the vowels included, the writing system is shallow: words have simple and consistent spelling-sound correspondences, which can be learned rapidly, comprehension not required. Fortuitously, Hebrew is a good \"Bar Mitzvah language\" , as are Finnish, Albanian, Welsh, Italian and other shallow alphabetic orthographies.\nOne would not want to confuse barking at print with reading comprehension, however. Phil Gough would not have. According to his \"simple view of reading\" (Hoover & Gough, 1990 ), children's reading comprehension is a function of decoding skills (recognizing letters, relating print to sound) and knowledge of spoken language (vocabulary and grammar). These skills are dissociable. If the writing system is sufficiently shallow, a person can learn to read aloud without comprehension (my Hebrew). Conversely, a person can know a spoken language quite well without being able to read it (as is true of most 5 year olds who speak English). Among clinicians and researchers, there is a move to reserve the term \"dyslexia\" for a developmental reading impairment that interferes with acquiring basic printrelated skills, especially ability to relate print to sound, independent of spoken language comprehension . Other children acquire adequate decoding skills but comprehend texts poorly; these children are also \"poor readers,\" but a different diagnostic category is needed because their poor reading comprehension is secondary to deficiencies in spoken language.\nGranted that it is easy to learn to decode in shallow orthographies, does this confer a comprehension advantage as well? Few studies have closely examined reading aloud, reading comprehension, and spoken language abilities in the same children, although there are some interesting leads. The studies of children learning to read in Welsh and English yielded an interesting tradeoff: whereas the Welsh children performed much better at reading common words and simple nonwords aloud, the English children scored higher when tested on comprehension. As Hanley et al. (2004) noted, \"This result suggests that a transparent orthography does not confer any advantages as far as reading comprehension is concerned. As comprehension is clearly the goal of reading, this finding is potentially reassuring for teachers of English\" (p. 1408). Why the English children exhibited better comprehension with poorer reading aloud cannot be determined with certainty from these studies. The comparison between Welsh-learning and English-learning children is not entirely clean because the sociolinguistic context is such that English is the dominant language. The Welsh-learning children therefore have substantial knowledge of English (and are bilingual to some degree), whereas the English-learning children have much less knowledge of Welsh and are essentially monolingual. What is clear is that ability to read aloud may say little about the child's reading comprehension. Durgunoğlu (2006) reached a similar conclusion from extensive studies of reading in Turkish. Turkish has a shallow orthography and a complex, highly productive agglutinating morphology. Summarizing, she noted that \"Phonological awareness and decoding develop rapidly in both young and adult readers of Turkish because of the transparent orthography and the special characteristics of phonology and morphology. However, reading comprehension is still a problem.\" (2006, p. 226) . In her experiments, children's comprehension lagged substantially behind their ability to pronounce words aloud, which she attributes to properties of the spoken language, specifically that complex morphological system, which takes native speakers many years to learn. Whereas comprehension develops more rapidly than production in learning a first language, shallow orthographies create the opposite effect: production-reading aloud-can advance more rapidly than comprehension.\nEven within English, accuracy in reading aloud and reading comprehension frequently decouple. Skilled readers are able to read and comprehend many words they mispronounce. Here are some I collected from students and colleagues-words they did not know how to pronounce or systematically mispronounced for many years: Seidenberg and McClelland (1989) model learned to pronounce QUAY as / kweI/ because the training lexicon was created by hand and that is how I thought it was pronounced (it was corrected in later models). As a land-locked kid growing up on the south side of Chicago, I knew the word from reading but not speech. These cases show that a person can know the meaning of a written word but lack secure knowledge of the pronunciation. People frequently generate erroneous pronunciations that they would not have heard in spoken language. If words like these were used in a reading-aloud experiment, even adult, highly skilled readers of English would perform more poorly than Welsh or Turkish subjects. Nation and Cocksey (2009) found that 7 year old English-speaking children often know the meanings of words they incorrectly read aloud. Familiarity with the spoken form of a word (as indexed by auditory lexical decision performance) was related to accuracy in reading it aloud, especially for words with irregular spelling-sound correspondences. Across subjects, 521 words were read aloud incorrectly; the correct definition was provided for 328 of them (63%). Of course the fact that ability to comprehend and pronounce words can dissociate should have been obvious from the mere existence of severely hearing impaired deaf individuals who do not receive oral training, do not know the pronunciations of words, but are nonetheless good readers. (The fact that it difficult to become a skilled reader under these conditions is an important but separate issue; Goldin-Meadow & Mayberry, 2001 ).\nIn summary, reading aloud is not a good index of reading comprehension or a basis for evaluating \"ease of learning to read\" different writing systems. We should therefore be skeptical of claims that it is easy to learn to read in shallow orthographies, and of the corollary belief that English is especially difficult. Over the past 20 years or so, researchers in many countries have correctly recognized the importance of obtaining data about reading in languages other than English, but attempted to correct the imbalance by replicating studies that had been conducted in English using reading aloud, a task that is more closely related to comprehension in that language precisely because of orthographic idiosyncrasies they were trying to surmount."}, {"section_title": "The relationship between writing systems and spoken languages", "text": "The orthographic depth hypothesis is an example of a very interesting idea that drew attention to an important issue (differences in how writing systems represent phonology and their potential impact on reading) and stimulated an enormous amount of research but turned out to be wrong. The hypothesis narrowly focused on the computation of phonology from print. Given the dependence of reading on spoken language, it seemed to follow that writing systems for which it was easier to compute phonology, the shallow ones, would also be easier to comprehend, other factors being equal. This prediction did not turn out to be correct because other factors are manifestly unequal. Looking across languages and writing systems, it can be seen that the properties of writing systems are related to properties of the languages they represent, in particular the complexity of the language's inflectional morphology. Inflectional morphology is an especially important component of language because it is an interface system conveying information about words and the syntactic structures in which they participate, and a major source of typological variation. Languages such as Welsh and Turkish have shallow writing systems but they are morphologically complex, marking properties such as case, number and gender. English and the Sinitic languages (Mandarin, Taiwanese, Cantonese, et al.) exhibit the opposite pattern: the writing systems are deep but their inflectional systems are simple. Looking at English, Gough had observed that early reading comprehension is a function of knowledge of print and knowledge of spoken language. With a cross-linguistic perspective it becomes clear that the two components are not independent. What has to be learned about print depends on properties of the writing system, which bear a non-arbitrary relationship to spoken language typology.\nI have attempted to unify these broad cross-linguistic tendencies under the concept of \"grapholinguistic equilibrium\" . The writing systems that have survived support comprehension about equally well. A writing system's capacity to support comprehension can be thought of as a constant that is maintained via trade-offs between orthographic complexity (\"depth\", number and complexity of symbols, etc.) and spoken language complexity (particularly morphosyntactic). For languages such as Welsh or Turkish, the spelling-sound correspondences are easily learned, but the morphology is not. These conditions allow children to accurately read aloud sentences that they would not be able to produce or fully comprehend given their still-developing knowledge of the spoken language. Written English is deep but the inflectional system is trivial and little impediment to comprehension. Under these conditions, children easily produce and comprehend sentences that they cannot accurately read aloud.\nA deep orthography would be highly dysfunctional, possibly unlearnable, in languages with complex morphosyntax. To illustrate consider Serbo-Croatian. Classic studies focused on its highly consistent spelling-sound correspondences, so different from those in English (Katz & Frost, 1992) . My colleagues and I have been more interested in its inflectional system (Mirković et al., 2004 (Mirković et al., , 2011 , which is also very different from English. The system is unquestionably complex. Both nouns and verbs are inflected and there are inflections for number, gender, case, and tense. The inflections are not independent: Number on nouns, for example, depends on case and gender. The inflections are not discrete beads on a string, either: the system is fusional, such that a single suffix encodes multiple inflections. Then there is an additional wrinkle: the realization of an inflection depends on phonological properties of the root to which it is attached ( Table 1 ). The base form SAVETNIK (masculine, \"advisor\") is zero-inflected. The final consonant K [/k/] is not retained throughout the inflectional paradigm, changing to C [/ts/] and Č [/tʃ/]. The inflection -E is used for both the vocative singular and the accusative plural; in the former, it is preceded by Č, in the latter by K. It is clear even from this sliver of the language that there is a lot to learn.\nNow imagine trying to read this language in a script that is more like English, with single letters that represent multiple vowels (e.g., DOSE, LOSE, POSE). Then toss in a few random consonants with multiple pronunciations, such as C (as in CAP and CENT), G (GOAT, GIN), and Y (YOUNG, EDGY). The complexity of the inflectional system is already high. Adding ambiguity in the pronunciations of written letters would increase it enormously. The proper form of an inflection depends on the pronunciation of the previous consonant, but now the pronunciation of the letter representing that consonant will sometimes also depend on context (as with the ambiguous English letters). There would be further penalties if mastery of a complex morphological system requires formal instruction that itself involves reading.\nIt would take quantitative analyses or simulation models to determine the effects of additional orthographic indeterminacy and establish when the system would become intractable for human learners. The historical fact that languages with complex morphological systems have shallow orthographies is itself suggestive of pressures to maintain this equilibrium, however. Indeed, many times the alignment of language and writing system has been achieved with active intervention, as with the Armenian alphabet in the fifth century, Hangul in 15th century Korea, and Serbo-Croatian in the 19 th century (see Daniels & Bright, 1996) .\nIn summary, there is no free orthographic lunch. The child does gain entry into reading more quickly if the associations between units in the written and spoken languages are simple and consistent. However, learning to read aloud in shallow writing systems is a bit like learning to play the violin in the Suzuki method. Both allow the child to rapidly begin performing with relatively little instruction. A four year old's performance of the \"Twinkle Variations\" may well be the musical equivalent of barking at print. Being able to pronounce words aloud is a helpful skill to possess if your task is to learn a complex, quasiregular morphological system over a many-year period that extends into formal schooling. But, there is little evidence that precocious knowledge of spelling-sound correspondences confers a comprehension advantage, or that the irregularities in written English present an especial burden. 4"}, {"section_title": "What About How Reading is Taught?", "text": "American educators have never been able to settle on how to teach children to read. The issue has been debated since Horace Mann was head of the Massachusetts Board of Education in the 1840s. Mann described letters as \"skeleton-shaped, bloodless, ghostly apparitions\" and encouraged teaching children to read whole words at a time-a lesson that \"would be like an excursion to the fields of Elysium\" compared to other practices. Mann's tone-authoritative assertion coupled with contempt for other views-is characteristic of much of the subsequent 150 years of debate. 5\nHow much of the literacy problem in America is due to the way reading has been taught? Everyone knows about the \"reading wars\" of the past 30 years-the debate over \"phonics\" and \"whole language\" approaches. The 2000s saw the emergence of a compromise called \"Balanced Literacy,\" said to incorporate the best aspects of the two approaches. \"Balanced literacy\" is a Treaty of Versailles solution that allowed educators to declare the increasingly troublesome \"wars\" over without having seriously addressed the underlying causes of the strife. The issues are complex, controversial, and ongoing. Here I want to briefly examine some basic considerations, from the perspective of a scientist who studies how reading works, which suggest that how reading is taught is indeed a significant part of the literacy problem in the US and other countries. There are three main points: (a) Contemporary reading science has had very little impact on educational practice mainly because of a twocultures problem separating science and education; (b) This disconnection has been harmful. Current practices rest on outdated assumptions about reading and development that make learning to read harder than it needs to be, a sure way to leave many children behind; (c) Connecting the science to educational practice would be beneficial but is extremely difficult to achieve. The current environment limits the amount of collaborative work at the allimportant translational interface. In the US, the conflicting and often strongly entrenched interests of various stakeholders-educators, politicians, scientists, taxpayers, labor organizations, parent groups-make it hard to achieve meaningful change within the existing institutional structure of public education.\nMy comments about the culture of education (by which I mean beliefs and attitudes about how children learn and the functions of schooling, particularly with respect to reading) may seem harsh to readers who are not close to the issues. Many people will naturally assume that although scientists and educators may have different views, both have much to 4 Is Hebrew the outlier writing system? Seemingly contrary to my analysis, it is morphologically complex but also orthographically deep in the default, unpointed form. Note, however that children learn to read using the shallow form in which vowels are indicated by diacritics (niqqud). Learning to read using the unpointed form would be vastly more difficult (though perhaps it was achieved by the ancient scribal elite prior to the development of the diacritic system). 5 The Mann quote (which I first encountered in Adams, 1990 ) is from an 1844 report he prepared as Secretary (head) of the Massachusetts Board of Education in which he was highly critical of the local schools, comparing them unfavorably to the classrooms he had observed in Prussia and Scotland (shades our modern-day envy of educational practices in Finland and Shanghai!). Greatly offended, schoolmasters from the Boston public schools published a rejoinder in which they remarked that \"Our dissent from [Mann's] views arises from an honest conviction that, if adopted, they would retard the progress of sound learning.\" Mann was advocating what later became known as the whole-word or \"look and say\" method, which involves memorizing words as patterns, without regard to the functions of the component letters. The Boston educators favored a \"phonetic\" teaching method. Their take-down of Mann's \"new method\" was thorough and incisive but settled nothing. The arguments on both sides will be easily recognizable to anyone familiar with the \"Reading Wars\" of the past 30 years. All the documents (the sides went back and forth a few times) are available as Ebooks on Google Play and highly recommended.\ncontribute and the path to greater progress is through cooperation. Every academic is aware of the importance of interdisciplinary work and of the challenges involved in communicating across disciplines. We also know that the successful creation of crossdisciplinary bridges can have transformative effects, sometimes leading to the emergence of new fields that are much more than the sum of the disciplinary parts. Such a transformation is needed in education and I hope it can be achieved. The question is how. It may be hard for people who are unfamiliar with the landscape to appreciate just how difficult the challenges are. As someone who has been immersed in these issues for many years I have struggled with finding ways to have a positive impact, and that is reflected in the material that follows (see also Seidenberg, 2012) .\nYou may believe, as I usually do, that the collegial and politically-astute approach is to assume that well-intentioned individuals can transcend their differences in the service of a shared goal. Disciplinary barriers only exist as long as we allow them to. We can all do better jobs communicating what we do and what we've learned. Bridges are built on a foundation of mutual respect for individuals and diverse viewpoints. People are doing the best they can; neither side knows everything. I fully support creative bridge-building and have engaged in it myself, but I have come to question whether good intentions and greater effort can be any more effective going forward than they have been in the past. These positive and sincere impulses might have a better chance of succeeding if there were better understanding of the deep differences between the cultures of science and education, which are manifested in their discordant approaches to reading (see also Seidenberg, forthcoming).\nIt is important to note that there is plenty of good science relevant being conducted within schools of education, often in departments such as Educational Psychology; however, it is isolated from programs focused on professional training and the development of curricula and instructional practices. My comments on the culture of education focus on the trainingand-practices side. I should also stress that my concerns are not about teachers, but rather about what teachers are taught (about child development in general and reading in particular) and about how curricula and instructional practices are created and evaluated. I am not challenging anyone's integrity, commitment, motivation, effort, sincerity, or intelligence. But I am challenging some deeply-held beliefs that have guided educational policies and practices for many years. I would expect this to be discomfiting for many people, but also recognizable as relevant to their deep commitments to helping students learn.\nFinally, I must acknowledge that my treatment of these issues is incomplete, given this article's length limitations. Below I mainly characterize the current situation rather than how it arose. The resistance to the reading science of the recent past also needs to be considered in a historical context, which includes earlier attempts to base educational practices on the science of the moment. It also needs to be considered in light of other challenges to educators' traditional control over educational policies and practices (including federal intervention via legislation such as No Child Left Behind, and powerful new educational philanthropies; Ravitch, 2011) . I provide this broader context in Seidenberg (forthcoming)."}, {"section_title": "The Two Cultures of Science and Education", "text": "Learning to read is an educational issue, historically the purview of educators, specifically schools of education. The history of education in the US has been extensively documented, mainly from the perspective of educators themselves (e.g., Ravitch, 2000; Cremin, 1988) . Popping up a level, one sees that science and education occupy different territory in the intellectual world (literally so on many university campuses). The result is that people who are studying the same thing-how children learn to read, for example-can nonetheless have little contact. The cultures of education and science are radically different: they have different goals and values, ways of training new practitioners, criteria for evaluating progress. The two cultures also communicate their research at separate conferences sponsored by parallel professional organizations attended by different audiences, and publish their work in different journals. There are publishers that target one audience and not the other. These cross-cultural differences, like many others, are difficult to bridge.\nPsychologists have been studying reading since the 19 th century and educators have had an approach-avoidance conflict about it ever since. Education as a discipline embraced a few theorists with roots in modern psychology-Dewey, Vygotsky, Piaget, and Bruner among others-whose work underlies the deeply entrenched \"constructivist\" approach in education (Tobias & Duffy, 2009 ). There is deep skepticism about the relevance of empirical studies that utilize the tools of modern experimental cognitive and developmental psychology, whether in laboratories or classroom settings (e.g., Coles, 2000) ; however, it co-exists with a readiness to appropriate findings that are consistent with existing beliefs and practices. The special role of science-to find out, to the best of our ability, what is true, letting the implications fall where they may-is subverted if people selectively attend to the findings they find congenial: it transforms research studies into another form of anecdote. Educators also use our research as a source of novel findings that feed the relentless demand for educational innovation. Often this means getting far too carried away far too rapidly with findings that are interesting and new but also not solidly established or understood.\nThese conflicting attitudes about science and education are at the heart of controversies about reading instruction. What I'll call the Modern Synthesis about learning to read, reading skill, and the relationship between reading and language emerged from work conducted since the 1970s, beginning with Gibson and Levin (1978) , Liberman et al. (1977) , Gough (e.g., Gough & Hillinger, 1980; Hoover & Gough, 1990) , Stanovich (1980) , and others. Almost all of this research was conducted by scientists working outside traditional departments and schools of education. The empirical findings underlying the Modern Synthesis were summarized in several white papers commissioned by various agencies (Adams, 1990; Snow et al., 1998; National Reading Panel, 2000; Snow, 2002; Lonigan & Shanahan, 2009 ). This research called into question basic assumptions underlying how reading is taught and what teachers are taught about reading and development-most importantly the idea that the way that children acquire a first, spoken language provides a good model for learning to read-and yet it has had little subsequent impact on them. The conflicts between scientific and educational approaches to reading continue, centered on three issues.\n1. Deciding what is true-One of the major cross-cultural differences concerns attitudes about evidence. There is a movement to encourage evidence-based practices in education, analogous to the ones in medicine and clinical psychology (see http://ies.ed.gov/ncee/wwc). The effort founders, however, if the stakeholders do not agree on what counts as evidence, or who should decide. Many educators are dismissive of attempts to examine reading from a scientific perspective, which is seen as sterile and reductive, intrinsically incapable of capturing the ineffable character of the learning moment, or the chemistry of a successful classroom (Coles, 2000) . Education as a discipline has placed much higher value on observation and hard-earned classroom experience. This division was apparent in reactions to the NRP report (2000) . The panel reviewed the scientific literature relevant to learning to read, having established explicit a priori criteria for what kinds of studies would be considered. Those criteria excluded studies that educators value: mainly, observational, quasi-ethnographic studies of individual schools, teachers, classrooms, and children that do not attempt to conform to basic principles of experimental design or data analysis (see, e.g., Barton & Hamilton, 1998; Rasinski et al., 2011) . The report was therefore of little interest, to many educators except as evidence for a scientistic bias at odds with the educational establishment's core values (Krashen, 2001). 6 From the perspective of modern studies of cognition, educators' confidence in the reliability of their own observations and experiences in classroom settings is baffling. If teachers really could figure out how reading works and children learn just by observation and experience, there wouldn't be a literacy problem or debates about best practices. But what we can learn about reading this way is limited. Most of what we do when we read is subconscious: we are aware of the result-whether we understood a text or not, whether we found the information we were seeking. Neither teachers nor scientists can directly observe children's mental and neural processes; what can be intuited about them based on classroom experience is limited, and intuitions often conflict. Introspection and systematic personal observation were the main methodologies used by the founders of modern psychology (Boring, 1953) , but discovery of their limitations led to the adoption of less observer-dependent methods. The limitations are even greater than the early psychologists could have known. What people observe depends on what they believe (see Cox et al., 2004 , for a striking illustration). Inferences based on observation are subject to deep-seated biases that required Nobel-prize caliber research to uncover (Kahneman, 2011) . The limitations of personal observation and experience are among the reasons why we conduct this other, scientific, kind of research: to understand components of reading that would otherwise be hidden from view and to do it in an objective, independently verifiable way. A folk psychology about how we read based on intuition and observation does not become any more reliable when elevated to educational principle, but that is the modern history of educational theorizing about reading.\n6 See Allington and Woodside-Jiron (1999) , who believe that many of the research findings that contradict their own views were the product of research funded by Reid Lyon, an official at NICHD, as part of an anti-education political agenda. The founding document for this political movement, they claim, is Grossen (1997) , an obscure 22 page review of 30 years of reading research funded by NICHD. Allington and Woodside-Jiron's paranoia is so keenly focused on NICHD that they ignore the mass of similar findings from research conducted in many other countries. The same conclusions about learning to read are found in both American reports such as the NRP (2000) and the British Rose Report (Rose, 2006) . It would be easier to dismiss Allington's campaign against reading science (see also Allington, 2002) were he not a leading figure in reading education, former president of the International Reading Association, former president of the National Reading Conference, and a member of the \"Reading Hall of Fame\", http:// www.readinghalloffame.org).\n2. The socio-cultural approach-The Modern Synthesis developed out of research that examined reading within the broader context of research on human language and cognition and their neural and computational bases. Within education, a much more influential approach has emphasized the socio-cultural aspects of literacy, particularly the status of reading in different cultural, linguistic, and socio-economic subgroups (e.g., Gee, 1997; Au, 1998; Scribner & Cole, 1981; Moje & Luke, 2009 ). The approach emphasizes attitudes toward reading within such groups; the varied purposes for which people read in different contexts defined by situation, culture, language, or SES; the relevance of different readingrelated activities to learners in these contexts; and how socio-cultural factors affect a child's motivation to learn to read and which classroom practices will be successful.\nMuch of what is assumed within the socio-cultural approach seems true enough, at an informal level: reading isn't a unitary task; how we read depends on what we are reading and for what purpose; in developing a curriculum it would be wise to take into account the cultural and socio-economic context, including different attitudes toward reading and differences in experiences and opportunities outside the classroom that can greatly affect children's progress. These factors are likely to have a strong impact on the child's motivation to read, a very significant factor that reading scientists have largely ignored.\nThe socio-cultural research addresses important issues; they are deeply implicated in the \"achievement gaps\" discussed in the next section. The problem is that socio-cultural paradigm is positioned as an alternative to studies of the types of knowledge and processing mechanisms that underlie reading and how they are acquired, rather than addressing complementary issues. The tension between these approaches furnished the subtext for the \"reading wars\". The heart of the conflict was a debate about the validity of what were termed \"skills\" vs. \"literacy\" approaches, which, amazingly, were seen as competing alternatives. 7 The scientists were seen as focused on \"skills\" (e.g., learning to read words and sentences accurately and fluently; vocabulary development), whereas educators emphasized developing \"literacy\" (the child's appreciation the various types and uses of written language, by individuals with diverse backgrounds, values and cultural traditions). Classroom time is a zero-sum game and so choices between skills and literacy had to be made. Moreover, teaching basic skills to beginning readers was thought to be counterproductive because it stifles children's natural curiosity about reading and their motivation to learn. This basic skills stuff may be necessary but it is also poisonous in large doses, so the child should be exposed to as little of it as possible. The traditional goal of teaching children to read has been replaced by coaching: encouraging the appreciation of and engagement in \"multiple literacies.\" Educational theorizing has gone \"meta\" about reading: there's little about how reading works (i.e., its neurocognitive bases), and much about how reading is used (various \"literacy practices\") and by whom (various cultural/ ethnic/language groups).\n7 In the current climate, everyone has to favor a \"balanced\" approach to reading instruction, acknowledging the importance of both skills and literacy. Having seen and comprehended the writing on the wall, organizations that had gone to the mat in support of \"literacy\" approaches such as Whole Language have turned out guidelines for \"balanced literacy\" instruction (see, e.g., Cowen, 2003 , for an example, and Moats, 2007 , for a critique of such efforts).\nThis conflict-which I am by no means overstating-arises from a failure to assume a genuinely developmental perspective. The act of reading and comprehending text involves the coordination of cognitive, linguistic, perceptual, motoric, memory and learning capacities. Understanding these capacities, how they develop, and how they are recruited in support of reading is obviously relevant to being able to help children become successful readers. What is relevant to teach (or \"facilitate\") depends on where the child is on an extended developmental trajectory. The ability to read and comprehend words and their components is a basic, foundational skill. Helping children achieve this skill, without creating disinterest in reading, is the educational challenge. Acquisition of this foundation allows the child to benefit from other activities that promote further advancement: extended practice reading a variety of texts, with close checks on comprehension; reading texts for different purposes; gaining background knowledge relevant to what is being read. Socioeconomic and cultural factors are highly relevant to the child's ability to benefit from schooling, but they do not change the nature of the reading process, or the kinds of knowledge and skills that need to be acquired."}, {"section_title": "Scientific literacy-", "text": "The gap between the cultures ensures that people coming from the education side have little opportunity to gain an understanding of how research is conducted in relevant disciplines such as cognition, development, and neuroscience. Schools of education socialize prospective teachers into an ideology about children, learning, and reading. Prospective teachers are not exposed to other research that is relevant to their jobs, which is especially damaging given how difficult those jobs are. Educators are unprepared to engage this science in a serious way because they lack the tools to understand what is studied, how it is studied, what is found, what it means, and its relation to other kinds of research. This also leaves educators vulnerable to claims that are intuitively appealing but unproved, overhyped, or discredited. Educators embrace the importance of \"critical thinking skills\" and \"background knowledge\" in reading and learning, and so it is ironic when they are missing from discussions of research on reading and learning. I think that this deep ambivalence about the relevance of science to the educational mission explains seemingly contradictory features of educational culture such as the cherry-picking of selected findings, while at the same time discounting the relevance of basic research (e.g., Duke & Martin, 2011) . I think it also explains why the single most influential educational theorist in America is Lev Vygotsky, who lived in the Soviet Union, wrote in Russian, died in 1934, and never saw an American classroom, or a television, computer, calculator, videogame or smartphone, yet educators are also looking to the latest findings from neuroscience for help (e.g., Willis, 2007) . It is hard to know what Vygotsky, who founded the socio-cultural framework for education as an alternative to approaches based on psychology and biology, would have thought of this latest development."}, {"section_title": "Does It Matter?", "text": "The people who teach teachers and create curricula don't pay much attention to the science of reading, but is there reason to think that closer alignment of science and education would result in better outcomes? There have always been competing views about how reading should be taught, or, indeed, if it needs to be taught at all. People who have had vastly different educational experiences manage to become skilled readers. We know that teacher quality has a huge impact on educational outcomes (e.g., Hanushek & Rivkin, 2006) , but what about different ways of teaching reading?\nIt should matter. Reading is a learned skill, an \"unnatural act\" in Gough's memorable phrase. Some children find it easy to learn to read regardless of what happens in the classroom; many are well on their way by the onset of formal schooling. Other children will have difficulty learning to read regardless of what happens in the classroom because they are dyslexic: they have a developmental disorder that interferes with learning to read. Few teacher education programs provide any serious training related to developmental disorders such as dyslexia, how children at risk can be identified, and how such children can be helped. Whereas researchers are closing in on the neural and genetic bases of dyslexia (Gabrieli, 2009) , educational theorists are still debating whether dyslexia exists, and if it does, whether knowing that a child has the disorder should have any impact on classroom practices (Elliott & Gibbs, 2008) . Many of those children and adults who score poorly on national assessments are undoubtedly dyslexics whose condition has not been identified or addressed.\nBetween these extremes there is the great majority of children for whom how reading is taught matters a great deal. They are why we should care about what teachers are taught about reading. The main problem is that many of the basic assumptions about how children learn to read that have guided teacher education, classroom practices, and curriculum development have been contradicted by the basic research that lead to the Modern Synthesis. Beliefs about reading, learning, and development, reinforced over many years within the insular culture of schools of education, do not coincide with facts about reading, learning, and development uncovered using a variety of methods in laboratory and naturalistic settings. Rather than repeat details reviewed in sources I've already mentioned, let me try to capture the essence of the problem.\nEveryone agrees that children have to acquire basic skills related to processing the visual code (letter recognition, learning about orthographic structure and the relationships between orthography and phonology, etc.), which provide a foundation for developing the ability to comprehend different kinds of texts for different purposes. Beyond this basic observation, there are two contradictory views.\nEducators have assumed that basic skills are relatively easy to acquire, but comprehension is hard. Acquiring basic skills is mostly a matter of providing a literacy-rich environment with activities that engage and motivate the child. Learning to read was assumed to be like learning a spoken language. Children do not need to be explicitly instructed in how to read any more than they needed instruction in how to speak a first language. In practice-a Whole Language K-3 classroom-this meant de-emphasizing instruction related to acquiring basic skills. In the appropriate environment, full of \"authentic\" literature (rather than books written for the purpose of teaching reading), literacy activities focused on extended, \"multisensory\" engagement with a book (e.g., reading a book to the child, small groups of children reading the book aloud together, making a personal copy of the book, drawing pictures of the book, coloring the book, \"writing\" about the book using invented spelling, talking about the book, etc.), the child would discover the mechanics. Following John Dewey, discovering how reading works is assumed to have more value than being taught to read. The teacher's role is to promote literacy, not teach reading.\nComprehension, in contrast, was thought to be hard. The great fear was that children might develop basic skills and yet fail to comprehend texts. (Indeed it was thought that an initial focus on phonics would make it harder to become a good comprehender.) And so, inspired by theorists such as Frank Smith (1971, now in its sixth edition), curricula focused on developing the child's explicit knowledge about text structure, types of inferences, the varied relationships between author and reader, the varied goals of reading, how to monitor comprehension and repair errors, and so on.\nOn the science side, the story is the exact opposite. Basic skills are difficult to acquire (mainly because of the partial and abstract way that writing systems represent spoken language) and thus the area where instruction matters most. Comprehension, in contrast, depends on extended experience using spoken and written language for varied purposes. Environments and activities that provide such experience can therefore promote comprehension skill. Ironically, this aspect of becoming a skilled reader more closely resembles spoken language acquisition than does the acquisition of basic skills.\nReading comprehension initially depends on the child's knowledge of spoken language. Learning a first language involves encoding detailed information about the statistical structure of the utterances to which the child is exposed (Seidenberg, 1997) . This information is continually updated through the lifespan, via language use (Haskell, Thornton, & MacDonald, 2010) . Comprehension abilities vary among children because there are huge individual differences with respect to the sheer amount of spoken language to which the child is exposed, and the range of vocabulary items and sentence structures it includes. Thus, reading comprehension can be improved by enriching the child's knowledge of spoken language (Hoff, 2013) .\nChildren who are given the instruction and support to acquire basic skills can advance to reading varied texts for varied purposes, learning from feedback about whether they are succeeding rather than explicit instruction in how to comprehend. Promoting skill development through engagement and feedback is different from teaching the child a metatheory of comprehension. Eventually the relationship between spoken and written language becomes reciprocal and interactive. Knowledge of spoken language facilitates learning to read; the child can then acquire vocabulary and familiarity with diverse grammatical structures from reading as well as speech. What is learned from reading also contributes to the further development of spoken language skills. For skilled readers, the systems become closely knit, even at the neural level (Pattamadilok et al., 2010) .\nIn short, theorists on the education side had the instructional vs. experiential demands of acquiring basic skills vs. comprehension backward. Generations of teachers were then taught that the skills come naturally and that comprehension requires explicit instruction. That reversal has made learning to read harder for many children.\nFinally, because of this two-cultures problem, there is very little opportunity to focus on how to best integrate basic research with educational practices. The science of reading is highly advanced but it does not come with prescriptions about educational practice attached. It is one thing to know about how children learn to read and another to translate that knowledge into classrooms. The NRP report again offers a good illustration of the zeitgeist. The report did a good job describing the main elements involved in learning to read, and the supporting evidence. It was not within the panel's mandate to address the educational issue, how these components could be affectively addressed within an integrated, multi-year reading curriculum. Thus the report described the importance of elements such as phonemic awareness and vocabulary in early reading, but not the levels of competence that are developmentally appropriate or how to assess them, or the effectiveness of different instructional methods. This created an enormous loophole. It is very easy to design curricula that can be said to conform to the recommendations of the NRP, simply by touching on all of the components they listed, even if only for a day. There has not been a serious dialogue about the pedagogical implications of the science summarized in the report, one of the major factors contributing to the science's lack of impact."}, {"section_title": "The Impact of Language Variation in the Educational Context", "text": "There cannot be a serious discussion of literacy issues in the US without considering the \"achievement gap.\" The term refers to disparities in academic performance between groups of individuals. It is mainly used with reference to minority groups -African Americans, Hispanics, Native Americans -compared to whites, but there are many other \"gaps.\" There are huge \"gaps\" associated with income disparities (Reardon, 2011) , and there are gaps for other groups such as first generation children of immigrants to the US compared to later generation children. Such \"gaps\" are seen in reading, math, science and in other areas, and on a variety of indices, including grades, standardized test scores, the kind of classes students take, high school and college completion rates, and so on (Washington et al., in press ). My focus is on the achievement gap in reading and, again, whether what we have learned from our research could be brought to bear on it. 8 I am also going to limit attention to the gap for African Americans, even though they exist for groups defined in many other ways. Why single out this group? First, because this gap is a major issue for a very large number of affected individuals. Second, because it is part of a long history of racial inequality in the US. Third, because it has been the focus of attention from politicians, educators, and economists for many years (Jencks & Phillips, 1998; Equity and Excellence Commission, 2013) . Fourth, because this gap has been persistent. It has existed for as long as relevant data have been collected, with little change despite government efforts dating from the War on Poverty through No Child Left Behind to Race to the Top. Fifth, it is an area in which I am conducting research (Washington et al., in press ). Finally, the various achievement gaps in our society have varying causes. Conditions and circumstances that are highly relevant to one group may be moot for another. Although this focus is warranted it is also essential to recognize it as part of a much broader phenomenon affecting many diverse groups of people.\nThe causes of the achievement gap in reading for African Americans (and other groups) are obviously complex and cannot be covered fully here (see, e.g., Richardson, 2008; Magnuson & Duncan, 2006; Barton & Coley, 2009; Washington et al., in press ). The topic is also a sensitive one, having to do with generalizations about groups, within which there is enormous variation. What is said here cannot be assumed to apply to all members of a group, or to any individual within the group. It can also be harmful to raise issues about group differences in contexts that do not permit serious exploration and exchange of ideas. 9 I also know from experience that anything that is said about this issue, however wellreasoned, backed by evidence, and carefully stated with necessary qualifications attached can be spun for political purposes that researchers cannot control. My goal here is limited: to establish the relevance of research on reading and language to understanding and potentially ameliorating this gap. My only personal agenda is to encourage others to conduct research in the area, for the same reasons I became involved: because the issues are scientifically interesting; because existing research on reading and language acquisition is relevant; because there is a research gap insofar as the factors and conditions specific to African American children's reading acquisition are understudied; because this gap could be addressed by researchers who study other aspects of language acquisition and reading; and because the consequences of reading failures are so devastating."}, {"section_title": "Econometric Analyses: What Is Missing from this Picture?", "text": "The basis of the Black-White achievement gap in reading has been extensively studied by econometricians and sociologists. Several important analyses have utilized a large publiclyavailable data set, the Early Childhood Longitudinal Study (http://nces.ed.gov/ecls). These data were derived from extensive interviews with large numbers of individuals (about 20,000), supplemented with scores on assessment instruments. Consistent with other research, the ECLS data show that there is an achievement gap at the start of schooling: African American children are behind on measures of reading and pre-reading skills in kindergarten (Duncan & Magnuson, 2005) . Researchers have attempted to identify the bases of this gap by determining which factors in the data set account for the difference. Fryer and Levitt (2004) showed that six factors (out of over a hundred that were considered) accounted for the difference at the onset of schooling in this statistical sense: a composite measure of socioeconomic status, child's age at the start of kindergarten, birth weight, age of mother at time of first birth, whether the mother was a WIC (welfare) participant, and number of children's books in the home. These results are correlational, of course, and open to varied interpretation. This particular set of factors seems to be mainly tapping into SES and sequelae such as poorer health and health services, and fewer resources such as books in the home.\nThe results from additional waves of data collection yielded the surprising finding that the size of the gap increased through grade 3 (Fryer & Levitt, 2006 ; see also Magnuson & Duncan, 2006) . The causal interpretation is again unclear; schooling could either be exacerbating the gap, or the positive effects of schooling might be outpaced by the increasing impact of other factors. In either case, schooling was not acting as the \"great equalizer\". 10 Moreover, the six factors that had accounted for the gap in kindergarten did not account for the gap in third grade, nor did any other factors in the data set. Fryer and Levitt wrote, \"None of the explanations we examine [d] , including systematic differences in school quality across races, convincingly explain the divergent trajectory of Black students.\"\nThe fact that SES-related factors did not account for the increase in the gap is consistent with other findings indicating that the reading gap is not limited to lower income individuals. As noted above, performance on the NAEP is affected by SES, as indexed by the eligibility for subsidized lunch proxy. However, the black-white gap is highly consistent across the three levels of this measure (see Vanneman et al., 2009, p. 33) . Other studies have found that the gap exists for middle income blacks as well as low income (Gosa & Alexander, 2007) . Again it has to be emphasized that with overlapping distributions and imperfect correlations, there will be individuals who differ from these overall trends, including lower SES blacks whose reading achievement is on par with high-achieving, higher SES whites, a point that Magnuson and Duncun (2006, p. 368) emphasized, noting that nearly a quarter of the black kindergarteners in the ECLS-K outscored the median for white students However, the group differences merit attention.\nHere, then, is a puzzle. We are looking for a missing factor (or factors) with the following characteristics:\n1. It contributes to the increasing deficit from K-3."}, {"section_title": "It affects individuals at different SES levels.", "text": ""}, {"section_title": "It is not captured by the measures included in data sets like the ECLS.", "text": "What is it?-One possibility is: language. There are two elements to consider. One is knowledge of spoken language, which varies across children, like many other skills and capacities. The other is the nature of the linguistic codes to which children are exposed. I will focus on different dialects of English, although similar issues arise regarding exposure to different languages. I will consider each of these elements-language-general and dialectrelated-in turn.\nThere is very little data about children's language in large-scale data sets such as the ECLS, the NICHD Study of Early Child Care and Youth Development or the Children of the National Longitudinal Survey of Youth 79 survey. 11 The ECLS-K survey studied by Fryer and Levitt includes an item about whether English is spoken in the home and a \"cognitive assessment\" consisting of items taken from a variety of standardized tests, but no direct assessments of the characteristics of a child's language and linguistic environment. Yet there is a substantial body of evidence about the impact of these factors on children's school achievement, particularly reading (McCardle et al., 2001) . Children vary considerably with respect to knowledge of components of spoken language, including vocabulary size, morphology, and syntax (Bates et al., 1995) . People often refer to differences in verbal \"ability,\" but the relative richness of children's language is affected by exogenous factors and so this term seems unsuitable. Some refer to spoken language \"quality\", but in this context the term evokes the discredited idea that African American English is inherently inferior. Lacking a better term I will refer wherever possible to differences in general knowledge of spoken language. These differences could arise from constitutional, environmental, and socio-cultural factors.\nThe most widely studied such factor is SES. Differences in linguistic input associated with SES were documented in Risley and Hart's famous study (1995; see also Hansen & Joshi, 2010; Hoff, 2013) . Children will have difficulty learning words, grammatical structures, and discourse conventions to which they are not exposed. Vocabulary in particular is strongly related to progress in learning to read (NRP, 2000) . In short, children's success in making the transition into reading depends heavily on their knowledge of spoken language, which varies across individuals and is associated with differences in SES (Fernald & Marchman, 2011) . African American children are overrepresented at the lower end of the SES distribution; therefore, they will be disproportionately subject to the effects of low SES on language.\nThis argument is inconclusive, however. The SES-related factors that Fryer and Levitt identified may be relevant, in part, because of their association with differences in language input, but this cannot be determined because the ECLS-K data set does not include measures of child or caregiver vocabulary (or other aspects of spoken language). The relations between their six factors and the child's knowledge of spoken language are indirect at best. Moreover, these factors accounted for differences at the onset of schooling, but not the growth in the gap through grade 3. Thus, whatever aspects of the linguistic environment they might be picking up are not sufficient to explain the increase. Finally, there is the fact that the achievement gap is not limited to the lower SES cohort. Disentangling the complex relationship between SES and the achievement gap continues to be the focus of research (Duncan & Magnuson, 2012) . A cautious reading of the existing literature suggests that there must be other factors involved and that the contributions of language variability need to be assessed more directly.\nA further consideration not addressed by studies such as the ECLS is the nature of the linguistic code to which the child is exposed, in particular dialect. Dialects are variants of a language, spoken by individuals grouped by region, ethnicity, race, income, and other factors (Chambers & Trudgill, 1998) . Every native speaker of a language learns a dialect of that language. English has many dialects, identifiable at different grain sizes (e.g., American vs. British English; regional dialects in these countries, etc.). In the US, one major division is between so-called \"standard\" or \"mainstream\" American English (SAE) and African American English (AAE). As in other countries, which dialect is treated as \"standard\" is not a linguistic issue but rather is determined by demographic, cultural and political considerations. AAE and SAE overlap-they are both versions of English-but also differ with respect to specific elements of phonology, morphology, lexicon, syntax, and discourse/ pragmatics (Rickford, 1999) . Although like others I will refer to AAE, it is important to recognize that it has regional variants, as does SAE (Green, 2002; Wolfram & SchillingEstes, 2006) . Moreover, speakers vary in the extent to which they use characteristic features of AAE (a dimension termed dialect density; Thompson et al., 2004) ; thus the extent to which AAE differs from SAE also varies. AAE is used by most African Americans, at varying densities, across SES levels (Washington, 1996) . The question then is whether use of AAE contributes to the reading gap.\nResearch on this question extends back many decades (see Washington et al., in press , for more detailed review). One issue is whether an AAE speaker would be disadvantaged because the dialect is deficient in some manner. This issue was decisively resolved by the basic linguistic research on AAE conducted by Labov (1972) and subsequently many others (Rickford et al., 2004) . This research appropriately situated AAE in the context of dialectal variation as it occurs in languages around the world. One of the great achievements of this research was to establish how unexceptional AAE is as an example of linguistic variation (Chambers & Trudgill, 1998) . Whether dialect use affects school achievement is not a question about the linguistic status of AAE. The unresolved question is whether use of the minority dialect has an impact because of the conditions surrounding its use. Specifically, AAE usage could affect the child's ability to benefit from educational experiences because of sociological and cultural factors (e.g., AAE is a \"low status\" dialect; books are written in SAE; acquiring skill in SAE is an educational goal in American schools). It is because of these conditions that differences between the dialects are relevant, not because they are linguistically significant.\nLabov's research stimulated considerable research on the possible impact of AAE on the development of African American children's reading skills. Most of the early studies found that dialect usage had little effect on comprehension (Washington et al., in press ). Thus it was concluded that what mattered was the quality of linguistic experience, independent of dialect.\nThese studies were thought to have put the issue of AAE's impact on reading acquisition to rest, but they did so prematurely in my view. The early studies do not hold up well by modern research standards and the strong conclusions that were based on them need to be re-examined. In recent years, researchers have begun to reopen the issue, using what has been learned about reading, language, development, and cognition over the past several decades to generate more specific hypotheses that can be tested using more powerful research methods. The topic is still understudied and many empirical questions are unresolved.\nOne major question is this: if language variation is a major element in the achievement gap, to what extent does it involve language-general vs. dialect-related aspects of language? Early reading achievement is closely related to knowledge of spoken language. This relationship is general, applying across languages and, within a language, across dialectal variants. Whether young children differ with respect to skills such as phonological awareness, the ability to analyze spoken words at the phonemic level, vocabulary size, and spoken language comprehension should matter, not which variant of a language they happen to speak (Terry, in press; Terry & Scarborough, 2010) .\nIt is also possible that there could be dialect-related effects on reading outcomes. Such effects could arise from a variety of factors that emerge when linguistic differences between dialects converge with extralinguistic factors related to the educational and socio-cultural conditions under which dialects are used. The language-general and dialect-related possibilities are not mutually exclusive. They also may not be independent: for example, the acquisition of a language-general skill could be affected by dialect-related factors. General and dialect-related influences may also be difficult to differentiate because a child's general language ability is manifested in the use of a particular dialect. Finally, there may be advantages to exposure to multiple dialects, analogous to those associated with exposure to different languages (Bialystok et al., 2009) , although this possibility is rarely considered.\nThese issues can be illustrated with respect to vocabulary knowledge, a factor that has been the focus of much research and is known to have a major impact on reading acquisition. It is a fact about languages that they consist of inventories of words (among other elements). Vocabulary size, however, is a characteristic of a child-what he/she knows about this component of spoken language-not the dialect that is spoken. This observation suggests that research should focus on the child's knowledge of properties of spoken language, such as vocabulary, irrespective of dialect.\nA potential complicating factor is that differences in language background-e.g., use of a minority dialect, varying exposure to and knowledge of the mainstream dialect, dialect usage in the school context-could affect the child's acquisition of \"general\" elements of spoken language. A factor such as vocabulary size needs to be considered not just as a quantitative predictor of reading outcomes, but also with respect to a theory of how this knowledge is acquired. It could then be determined whether or to what extent specific aspects of dialect experience matter. Is vocabulary acquisition affected by properties of a dialect, or the need to accommodate two dialects? Are such effects positive or negative or both? Do the effects differ depending on the child's point in development? Are they modulated by individual differences in cognitive capacities such as executive function? These issues are not well understood. The bilingual literature suggests they are worth addressing, however. Many studies have shown that preschool-aged bilingual children have smaller vocabularies in each language than comparable monolingual speakers (Bialystok et al., 2005) , which then has an impact on learning to read in one of the languages. These effects also arise from conditions relevant to children's learning rather than properties of the languages. They also occur across SES levels. The bilingual burden is by no means insuperable, but the developmental time course may be affected, creating another \"gap\", but also the emergence of bilingual advantages (Bialystok et al., 2009) . Analogous issues may arise for AAE speaking children who are learning to read in SAE.\nAs an illustration, consider the optional deletion of final consonants in pronouncing some words in AAE. One consequence is that a given word (such as COLD) can be pronounced differently, at the phonemic level, in the two dialects. Deletion of final consonants also creates additional homophony: words such as COLD and COAL have different pronunciations (at the phonemic level) in SAE but they can be homophonic in AAE. Do these differences between the dialects have any impact on language learning or reading? Or are the differences inconsequential? I don't think we know. The existence of alternative pronunciations across dialects could create a more complex word learning problem, or it might be no more difficult than assimilating differences in pronunciation arising from pitch, speech rate, and so on. An increase in the number of homophones might facilitate vocabulary acquisition (fewer distinct phonological word forms to learn) or make it harder (because the child has to use other mechanisms to disambiguate homophones). Or the functional impact could be trivial. These unanswered questions suggest that it would be premature to treat vocabulary size as a general linguistic factor independent of dialect experience.\nGiven the limited evidence that is available, I believe that it would be a recapitulation of an earlier mistake to conclude at this point that dialect experience has no significant impact on reading or other aspects of school achievement. As Snow et al. (1991) noted, differences between home and school language could affect children's learning. For speakers of the mainstream dialect, the home and school dialects are the same. For speakers of the minority dialect AAE, the home and school dialects differ in varying degrees. Thus, dialect use is consistent across contexts for one group but not the other. AAE speakers have to learn about the mainstream dialect and use both dialects at the same time they are learning to read, write, and do arithmetic. SAE speakers do not have the additional language-related demands. Speakers of the minority dialect clearly have to do more work in order to succeed. They are nonetheless assessed against the same achievement milestones as SAE speakers. If this analysis is correct, it means that the achievement gap has been intractable because it is built in, guaranteed by prevailing circumstances unrelated to the linguistic validity of the dialect or the capacities of the child. 12 Stated another way, if by analogy to the Fryer and Levitt analysis the overhead associated with accommodating dialect differences were somehow factored out of the natural experiment, the gap in the first years of schooling would greatly narrow rather than grow.\nDifferences between dialects could potentially affect children's ability to benefit from classroom experience in numerous ways. For example, an SAE-speaking teacher will pronounce many words differently from the child and use different morphological and syntactic constructions. The additional processing and attentional demands associated with comprehending utterances in the less familiar dialect and switching between dialects could be expected to interfere with the child's opportunity to learn from what is being said. The impact would be exacerbated by the fact that the classroom context is a noisy one (literally, and in the information theoretic sense), degrading the quality of linguistic signals. The effect would be similar to imposing a delay on the on-line processing of spoken utterances. These demands could at the same time promote the development of other capacities such as executive function. There are opportunities for communication failures from the opposite side as well: a teacher who speaks SAE and does not know AAE may have more difficulty understanding the AAE speaking child. The teacher may also use discourse conventions 12 I owe this observation to Julie Washington, who made the point with great clarity and impact. The finish line may be in the same location, but paths to getting there are not of equal length or difficulty.\n(e.g., indirect speech acts) with which the child is unfamiliar, or misinterpret the child's own discourse conventions.\nThen there are specific ways in which dialect differences could affect learning to read. The child speaks one dialect but books and other materials are written in the other dialect, again imposing additional learning and processing demands compared to the child for whom the same dialect is used for both. A useful comparison is to hearing-impaired children who are fluent, native signers of ASL, who have high verbal skills, with large vocabularies and language that exhibits a high degree of syntactic variety and complexity-who are nonetheless poor readers. There is an \"achievement gap\" in reading for the hearingimpaired, due in part to the fact that they are learning to read in English, a different language. There are important differences between these two situations (e.g., the ASLEnglish differences are greater than the differences between English dialects; the use of different dialects is not associated with presence or absence of a perceptual deficit such as hearing loss), but the analogy is apposite.\nAnd what about acquiring basic reading skills? The beginning reader's initial challenge is to learn how the spoken language they know relates to the written code they are learning.\nMaking this connection is difficult for many children, for reasons that have been investigated in great detail (NRP, 2000) . Reading an alphabet involves learning to treat spoken words as if they consist of discrete phonemes. Units in the written code (letters and digraphs) can then be mapped onto units in the spoken code (phonemes). Making this abstraction is difficult for many children. The task is further complicated by inconsistencies in the mappings between spelling and sound in English. The task becomes even more complex when a substantial number of words are pronounced differently at the phonemic level in the two dialects. Consider just the subset of words in AAE in which the final consonant can be dropped (e.g., GOLD→/goυl /, BEST→/bes/). A teacher explains that the word \"gold\" is spelled G-O-L-D. For an SAE speaking child this is a lesson about the alphabetic principle and the correspondences between four letters and four phonemes. What is being taught an AAE speaking child who pronounces the word /goυl/? That there are different ways to pronounce the word? That if the spelling maps onto one pronunciation, the final letter is pronounced /d/, whereas for the other it is silent? The alternative pronunciations create additional inconsistencies in the mappings between spelling and sound. The learning problem is further complicated by the fact that this deletion is not obligatory, and thus may be used for a given word only some of the time, or for only some words in a similarly spelled neighborhood (e.g., -OLD words).\nIn short, the need to accommodate both dialects may place a variety of additional burdens on young learners. The potential for dialect-related factors to affect learning-and the need to determine where differences between the dialects do and do not have a significant impact, positive or negative-does not invalidate the relevance of dialect-independent variability in spoken language skills. Plainly, both could exert influence, creating in the worst case a debilitating double-whammy. However, the extent to which such effects occur and how much impact they have are not well understood.\nWhat is striking about dialect is how poorly it is addressed in America compared to other countries. Dialect variation is not specific to African Americans or English, but dialect differences seem to have greater prominence in this country than elsewhere. There are major dialect variants in countries such as Finland and Germany where literacy levels are higher than in the US. Although each situation is different in detail, the main challenges are the same. It appears that these countries do a better job of acknowledging and accommodating dialect differences. Are educators more familiar with dialect issues and their potential impact? Does teacher training include dialect-related issues? Is there less dialect-related prejudice in these countries? Is there greater exposure to alternative dialects prior to the onset of schooling?\nWe know that what works in one country cannot simply be ported to another where relevant circumstances are different. Nonetheless, there is information to be gained from examining how such issues play out in other countries and languages. This effort might suggest ways of changing the culturally-determined conditions that contribute to the achievement gap.\nLooking to the future, research on the achievement gap could take a page from research on reading and language disorders. Research on dyslexia, for example, has shifted from a focus on single causes (e.g., a visual or phonological deficit) to the view that outcomes arise from the aggregate effects of a set of risk factors Morris et al., 2010) . Each factor is probabilistic in the sense that it does not itself guarantee a particular outcome. The factors also vary in degree of severity and relative impact. Together these factors yield a range of behavioral outcomes. The crucial linkage between the risk factors and outcomes is provided by theories of reading that specify major subskills and how they are learned. By analogy, the poor reading outcomes seen in the \"achievement gap\" arise from a variety of risk factors that are also probabilistic, vary in severity and impact, interact in complex ways, are differentially amenable to intervention, and yield a broad range of individual outcomes. Risk factors relevant to African American children in American schools include knowledge of spoken language (\"general\" language skills), language experience (e.g., dialect usage, exposure to and knowledge of the alternative dialect, the cognitive demands of dialect switching), adequacy of educational responses to language variation, and poverty, among others. There is a further need to link these risk factors to specific components of reading and how they are acquired."}, {"section_title": "Conclusions", "text": "Reading failures arise from multiple causes. My goal has been to suggest that this serious societal issue can further benefit from the kinds of research that we conduct as scientists who study reading and language. Reading is often viewed as secondary to spoken language and of very little linguistic interest. Reading did not evolve in the species, it is true, but once the technology became available to many people, it became as central an expression of our capacity for language as speech, greatly changing the ways that language can be used. There are scientists who study reading qua reading, and we have made considerable progress in understanding this skill. But questions about how reading works and the determinants of reading skill invariably come back to issues about spoken language. I've tried to suggest that our basic research is highly relevant to a societal problem of enormous importance. The challenges are daunting, and the need is great. Number of times the phrase \"sputnik moment\" was uttered on CNN, an American cable news network over a two year period. The Larege spike followed the release of results from the 2009 PISA assessment and coincided with President Obama's 2011 State of the Union address. Note: All forms are masculine gender. K = /k/ as in Kevin, Č = /t?/ as in \"church,\" C = /ts/ as in \"pizza.\""}]