[{"section_title": "", "text": "how much thought have we put into ensuring effective adoption of educational technology in our education system? The successful implementation of educational technology in our schools does not stop at the acquisition of computer technology. Simply having the technology does not guarantee enhanced learning (Barton, 2000) .\nProfessional training of our teachers is important. The way our teachers are trained cannot be the same as before.\nOur current curriculum should permit teachers the flexibility to integrate educational technology into the teaching of mathematics in their own way (Mergendoller, 1997) .\nThe objective of this paper is to provide an overview of the current practice of educational technology in the learning and teaching of mathematics to the Form Two students in urban and rural Malaysia using data from the Trends in International Mathematics and Science Study (TIMSS) 2003. This study is important to provide understanding of the effect of computing technology on the learning outcome of mathematics. It also covers the issue of technology gap and scholastic difference in the performance of mathematics between the rural and urban schools."}, {"section_title": "Literature Review", "text": "The positive impact of technology on the learning of mathematics has been documented in many studies. Wilson (2006) In contrast, Papanastasiou, Zembylas & Vrasidas (2004) found that students who often used internet to communicate with other students and had teachers who frequently used computers in classrooms tend to have lower achievement scores than others without such condition. However, they revealed that students who own computers at home often had higher academic achievement than students who do not. The same was was not the computer use that has positive or negative effect on the achievement of students, but rather the way the computers were used. More studies are needed to understand the impact of pedagogical differences among teachers and prior achievement on the learning outcome and its relation with educational technology.\nThe gaps in school achievement between rural and urban schools are large and have been persistent. In a study by World Bank in 1995 found that students from rural areas received lower grades not only in mathematics but also in English. Rural students often have many more obstacles to overcome, than urban students in receiving their education such as longer traveling distances, inadequate school resources and constantly changing and inexperienced teaching staff. Although efforts have been made to remedy these problems by building more schools, hostels or teachers' residence, the difficulties remain thus far."}, {"section_title": "Data And Methods", "text": "The sources of data examined in this paper were the TIMSS student, teacher and school questionnaires contained in All analyses contained herein were carried out by SPSS 12 for Windows."}, {"section_title": "Results", "text": ""}, {"section_title": "The learning of mathematics and computing technology", "text": "Data from the TIMSS 2003 showed that computing experience was fairly common among our Form Two students with 89% reported they had used a computer before. Almost everyone had a calculator at home (95%). This is expected as calculator is required in the Form Two curriculum. Slightly more than half of them (57%) owned a computer at home. out of schools, the use of computers for academic purpose is scarce among our Form Two students. Referring to Table 5 , half the sample reported that they never used computer to write reports for school and some samples said the same about using computer for processing and analysis of data. Some 34% of these students never used computer to look up mathematical information. This result perhaps is a reflection of our current secondary curriculum which remain rather traditional in its pedagogical approach that lacks in technological implementation.\nThe Welch ANOVA and the related multiple comparison tests revealed significant negative relationship between computer use and mathematical achievement. "}, {"section_title": "The teaching of mathematics and school resources", "text": "Our findings summarized in Table 6 revealed, that majority of our teachers taught mathematics to the Form Two students without using a calculator. Fractions and decimals were only taught in some lessons. Students were occasionally asked to interpret data in tables, charts or graphs and write equation and functions to represent relationships. The fact that these topics were not commonly raised is not a problem however, because our secondary educational curriculum is centralized at the national level. Students sometimes worked in small groups.\nThey were also asked to relate mathematics to their daily life even though the frequency differed depending on the teachers. Very often students were required to explain their answers but rarely do they get to decide their own way of solving tough problem. TIMSS data also shows that many teachers appeared to stay away from problems with no clear method of solution. This implies a lack of opportunities for students to express their creativity in mathematics, which is considered relevant by many mathematics educators in fostering and rewarding mathematical creativity (Haylock, 1987) .\nReferring to To process and analyze data (n = 4,601)\nTo write reports for school (n = 4,583) (Table 8) .\nMathematical achievement wise, schools with no complain of shortage of equipment for the handicapped recorded higher scores than those with high complain as indicated by the significant F statistics and Tukey multiple comparison ( Table 7) . The same explanation goes for the school with no shortage of calculators for mathematics lessons which resulted in significantly higher achievement scores."}, {"section_title": "The mathematics achievement of urban and rural schools", "text": "The digital divide between the urban and rural schools in Malaysia is of great concern. Young (1998) showed in a study that after controlling student background variables, Table 9 : Average mathematics score by urban and rural significantly between the urban and rural students ( Table   9) . If the technological gap in mathematics instruction persists between the urban and rural schools in Malaysia, the achievement of the students in the different regions may possibly be unbalance in the long run."}, {"section_title": "Discussion And Conclusion", "text": "The study is not without limitations. Following the directive from the ministry, the medium of instruction for mathematics and science subjects was switched to English beginning 2001. Our Form Two students were already learning mathematics in English when they sat for the TIMSS tests in Malay language. Hence, this might have a negative effect on the overall achievement score for both subjects.\nFurthermore, the authors would like to caution that the use of calculator was first permitted in Form Two and were not be widely used at the time when this study was carried out.\nHence, students are not used up to calculator and this may be translated to lower achievement in mathematics. This technology was not given enough time to show its effect on mathematics achievement score.\nPapanastasiou, Zembylas & Vrasidas (2004) explained that"}]