[{"section_title": "Abstract", "text": "To discover new tumor-suppressor genes (TSG), we developed a functional genomics approach in which immortalized but nontumorigenic cells were stably transduced with large-scale shRNA pools and tested for tumor formation in mice. Identifi cation of shRNAs in resulting tumors revealed candidate TSGs, which were validated experimentally and by analyzing expression in human tumor samples. Using this approach, we identifi ed 24 TSGs that were signifi cantly downregulated in human lung squamous cell carcinomas (hLSCC). Amplifi cation of fi broblast growth factor receptor 1 ( FGFR1 ), which aberrantly increases FGFR signaling, is a common genetic alteration in hLSCCs. Remarkably, we found that 17 of the TSGs encode repressors of FGFR signaling. Knockdown of 14 of these TSGs transformed immortalized human bronchial epithelial cells and, in most cases, rendered them sensitive to FGFR inhibitors. Our results indicate that increased FGFR signaling promotes tumorigenesis in many hLSCCs that lack FGFR1 amplifi cation or activating mutations.\nA functional genomics approach identifi es new lung TSGs whose loss aberrantly increases FGFR signaling to promote tumorigenesis. These TSGs are frequently downregulated in hLSCCs, indicating that increased FGFR signaling promotes tumorigenesis in many hLSCCs lacking FGFR1 amplifi cation or activating mutations. Cancer Discov; 4(10); 1168-81."}, {"section_title": "INTRODUCTION", "text": "A goal of contemporary cancer research is to identify all genes responsible for neoplastic transformation. For example, the identifi cation of new tumor-suppressor genes (TSG) has important implications for both diagnosing and treating cancer. One of the ongoing efforts to identify the genes responsible for tumor formation is partial or complete sequencing of cancer genomes (reviewed in ref. 1 ) . Although this approach has revealed and will continue to reveal genes involved in tumorigenesis, there are specifi c challenges for the discovery of TSGs solely by sequence analysis of cancer genomes. First, the genomes of cancer cells are error prone (reviewed in ref. 2 ) , and thus many of the mutations found in cancer cells are not causally related to the transformed phenotype. Second, in many instances, TSGs are inactivated by transcriptional repression (commonly referred to as epigenetic silencing) rather than a mutational event, and thus would not be identifi ed by conventional genome-sequencing methods. Transcriptionally silenced TSGs bear several hallmarks, including repressive histone modifi cations and hypermethylated CpG-rich promoter regions (reviewed in ref. 3 ) .\nFunctional genomics approaches for TSG discovery are highly complementary to cancer genome sequencing efforts. Here, we describe and demonstrate a large-scale RNAi-based functional screen for TSG discovery."}, {"section_title": "RESULTS", "text": ""}, {"section_title": "A Large-Scale shRNA Screen Identifi es Candidate TSGs", "text": "To identify TSG candidates, we performed a large-scale shRNA screen for tumorigenesis in mice, which is summarized in Fig. 1A and discussed below. We used mouse NIH 3T3 fi broblasts, which are immortalized but not transformed and can be rendered tumorigenic by a wide range of oncogenic events (for examples, see refs. [4] [5] [6] [7] . We fi rst performed a reconstruction experiment to determine the minimal number of transformed NIH 3T3 cells required for tumorigenesis. To this end, 1,000, 100, or no Kras -transformed NIH 3T3 cells were added to 1 × 10 6 nontransformed NIH 3T3 cells and injected into the fl anks of nude mice. Figure 1B shows that 100 transformed NIH 3T3 cells (and likely fewer) are sufficient for detectable tumor formation.\nFor the primary screen, a genome-wide mouse shRNA library comprising 62,400 shRNAs ( 8 ) was divided into 10 pools, which were packaged into retrovirus particles and used to stably transduce NIH 3T3 cells. For each of the 10 stable cell populations, 1 × 10 6 cells were injected subcutaneously into the fl ank of a nude mouse. Thus, each of the 6,240 shRNAs in each pool was present in approximately 160 cells, which is greater than the 100 Kras -transformed NIH 3T3 cells that enabled tumor formation. We found that seven of the 10 shRNA pools gave rise to detectable tumors. After 2 weeks, tumors were dissected and genomic DNA was extracted. To identify the candidate shRNAs, the shRNA region of the transduced virus was PCR amplifi ed, cloned, and sequenced."}, {"section_title": "RESEARCH ARTICLE", "text": "In total, 39 independent shRNAs were recovered from the seven tumors.\nTo validate the candidates, single shRNAs directed against each gene were stably transduced into NIH 3T3 cells to derive NIH 3T3 knockdown cell lines. Quantitative real-time RT-PCR (qRT-PCR) confi rmed in all cases that expression of the target gene was decreased in the corresponding NIH 3T3 knockdown cell line ( Supplementary Fig. S1A ). We then tested the ability of the NIH 3T3 knockdown cell lines to form tumors following subcutaneous injection into nude mice. Figure 1C shows that 32 of the 39 shRNAs promoted tumor formation. We also tested the ability of the NIH 3T3 knockdown cell lines to form colonies in soft agar. As expected, knockdown of all 32 genes markedly increased anchorage-independent growth ( Supplementary Fig. S1B ).\nFor all 32 genes, a second, unrelated shRNA directed against the same target gene also promoted colony formation in soft agar ( Supplementary Fig. S1C ) and decreased the expression of the target gene ( Supplementary Fig. S1D ), ruling out off-target effects. For 17 of the genes that we analyze in greater detail below, we also tested the ability of a second, unrelated shRNA to promote tumor formation in mice. In all 17 cases, knockdown of the TSG with the second shRNA also resulted in tumor formation (Supplementary Fig. S1E ). Of the 32 candidate TSGs, unambiguous human homologs could be identifi ed in 28 cases ( Table 1 ) . Signifi cantly, several of the genes, such as IGF2R ( 9 ) , SEMA3B ( 10 ), and STK11 (also known as LKB1 ; ref. 11 ) , are well-documented TSGs, validating the overall experimental strategy. \nsignifi cantly hypermethylated in lung cancers (15) (16) (17) (18) , validating the methylation analysis. Moreover, of the nine TSGs that we found to be hypermethylated, six were also recently reported to be hypermethylated in hLSCCs ( 13 ) . These results indicate that epigenetic silencing due to promoter hypermethylation is one-but not the only-mechanism by which the TSGs are downregulated in hLSCCs.\nindicating that some of the TSGs repress FGFR1 transcription, whereas others act posttranscriptionally. Collectively, these results, which are summarized in Supplementary  Table S3 , indicate that these 17 TSGs repress FGFR signaling by three distinct mechanisms that modulate either tFGFR1 levels, pFGFR1 levels, or FGFR1-independent FRS2 activation.\nFor the seven TSGs that affected tFGFR1 levels, we investigated specifi city by asking whether their knockdown also affected the levels of other FGF receptors (FGFR2, FGFR3, and FGFR4) and growth factor receptors (EGFR and insulin receptor). Knockdown of the seven TSGs did not affect the levels of FGFR2, FGFR3, FGFR4, EGFR, or insulin receptor ( Supplementary Fig. S7C and S7D ).\n\nrestriction enzyme digestion, into Murine Stem Cell Virus (MSCV) PIG (Puro-IRES-GFP; Addgene plasmid 18751). For some genes, a 3xFLAG tag sequence was incorporated into the primers for cloning in-frame with the target gene. For further details, please refer to the Supplementary Methods."}, {"section_title": "Many Candidate TSGs Are Downregulated in Human Lung Squamous Cell Carcinoma Samples", "text": "To gain insight into the tumor types in which the candidate TSGs may play a role, we queried the Oncomine cancer profi ling database ( 12 ) . Notably, a large fraction of the candidate TSGs were downregulated in lung cancers (Supplementary Table S1 ). To confi rm and extend this fi nding, we analyzed the expression of the 28 genes in a series of human lung squamous cell carcinoma (hLSCC), lung adenocarcinoma, and normal lung samples. The results in Fig. 2A and Supplementary Fig. S2 show that 24 of the 28 candidate TSGs were downregulated greater than 2-fold in ≥70% of the hLSCC samples analyzed. In contrast, only fi ve candidate TSGs were downregulated greater than 2-fold in ≥70% of the lung adenocarcinoma samples ( Fig. 2B and Supplementary Fig. S3 ). Consistent with our results, eight candidate TSGs ( DAPP1 , GZMA , IGF2R , NAA38 , NME4 , NUP205 , SDF2L1 , and STK11 ) are located in the deletion peaks identifi ed in a recent hLSCC genomic characterization study ( 13 ) ."}, {"section_title": "TSG Promoter Hypermethylation in hLSCC Samples", "text": "To determine whether TSG downregulation was a result of epigenetic silencing, we analyzed promoter DNA methylation in paired primary hLSCC and normal lung squamous cell samples from 18 individuals. For each sample, genomic DNA was isolated, subjected to bisulfi te conversion, and hybridized to an Illumina Infi nium genome-wide DNA methylation array ( 14 ) . We then interrogated 26 of the TSGs ( GAPVD1 and PKD1L3 were absent from the array) against the whole genome dataset. Of the 26 TSGs analyzed, nine displayed a statistically signifi cant increase in promoter hypermethylation in hLSCCs relative to normal samples (Supplementary  Fig. S4A and S4B and Supplementary Table S2) . Notably, two of the nine genes, PTGIS and SEMA3B , are known to be "}, {"section_title": "Many of the TSGs Encode Repressors of FGFR Signaling", "text": "A common genetic alteration in hLSCC is amplifi cation of FGFR1 , which results in aberrant activation of FGFR signaling ( 19, 20 ) . We therefore hypothesized that some of the candidate TSGs might function as hLSCC tumor suppressors by repressing FGFR signaling. We fi rst asked whether repressors of FGFR signaling could be isolated in our primary screen by testing whether increased FGFR signaling would render NIH 3T3 cells tumorigenic. Figure 3A shows that NIH 3T3 cells ectopically expressing FGFR1 formed a tumor following subcutaneous injection into a nude mouse, consistent with a previous report that FGFR1 can transform NIH 3T3 cells ( 21 ) .\nWe next asked whether knockdown of each TSG (Supplementary Fig. S5A ) resulted in increased FGFR signaling. Supplementary Fig. S5B and S5C) . Moreover, the level of pFRS2-Y436 in several of the SA knockdown cell lines was comparable with that observed in NCI-H520 cells, an hLSCC cell line containing amplifi ed FGFR1 ( 19 ) . Notably, the level of total FRS2 (tFRS2) in these 17 SA knockdown cell lines was not increased. Increased FGFR signaling following knockdown of these 17 TSGs was confi rmed using two alternative markers of FGFR signaling, pFRS2-Y196 and phospholipase C-γ (PLC-γ; Supplementary Fig. S6A and S6B); similar results were obtained with a second, unrelated shRNA (Supplementary Fig. S6C and S6D). We also analyzed a representative subset of the 17 TSGs in NIH 3T3 cells, which were used in the primary screen. In all cases analyzed, knockdown of the TSG also resulted in increased FGFR signaling (Supplementary Fig. S6E ).\nPhosphorylation of FRS2 activates the MAPK signaling pathway ( 23 ) . We therefore monitored the levels of phosphorylated ERK1/2 (pERK1/2) in the 24 SA knockdown cell lines. The results of Fig. 3B show that all of the 17 SA knockdown cell lines with elevated pFRS2 also had increased pERK1/2 levels. Interestingly, of the seven SA knockdown cell lines that had normal pFRS2 levels, six had increased pERK1/2 levels (IGF2R, NAA38, MAP1A, PIGH, SEMA3B, and ZNF22), indicative of FGFR-independent activation of the MAPK pathway. Consistent with our results, IGF2R ( 24, 25 ) and SEMA3B ( 26 ) are known to negatively regulate MAPK signaling through an FGFR-independent pathway.\nFor the 17 SA knockdown cell lines with elevated pFRS2, we analyzed the levels of phosphorylated and total FGFR1 (pFGFR1 and tFGFR1, respectively) to delineate the step in the FGFR signaling pathway that is repressed. The results of Fig. 3C show that seven of these SA knockdown cell lines had increased pFGFR1 and tFGFR1 levels, four had increased pFGFR1 levels but normal tFGFR1 levels, and six had normal levels of pFGFR1 and tFGFR1. For the seven TSGs that affected tFGFR1 levels, we found that in some but not all cases, shRNA-mediated knockdown increased FGFR1 mRNA levels (Supplementary Fig. S7A and S7B), compared with an empty vector control. B and C, top, immunoblots monitoring phosphorylated (p) and total (t) FRS2 and ERK1/2 (B) or FGFR1 (C) in the SA knockdown cell lines and NCI-H520 cells. α-Tubulin (TUBA) was monitored as a loading control. Bottom, quantifi cation of the immunoblots. The red line indicates a 2-fold increase in phosphoprotein level relative to that observed in nonsilencing (NS) cells, which was set to 1. Genes in red indicate those whose knockdown increases pFRS2-Y436 levels (B) or pFGFR1 and tFGFR1 levels (C); blue, increased pFGFR1 but not tFGFR1 levels; and black, no effect on either pFGFR1 or tFGFR1 levels. "}, {"section_title": "Knockdown of FGFR Signaling Repressors Transforms Immortalized HBECs", "text": "The hLSCC cell line NCI-H520, which as stated above has amplifi ed FGFR1 , is highly dependent upon FGFR signaling for viability and proliferation ( 27 ) . We therefore predicted that ectopic expression of TSGs that encode repressors of FGFR signaling would inhibit proliferation of NCI-H520 cells. We obtained cDNAs for 14 of the 17 TSGs that encode repressors of FGFR signaling and found in all cases that ectopic expression ( Supplementary Fig. S8A and S8B) reduced proliferation, as measured in a soft-agar colony formation assay ( Supplementary Fig. S8C ). As expected, the decreased colony formation resulting from ectopic expression of the TSG was counteracted by coexpression of FRS2 ( Supplementary Fig.  S8D ). Also, as expected, ectopic expression of representative TSGs in NCI-H520 cells repressed FGFR signaling, as evidenced by decreased pFRS2-Y436 levels ( Supplementary Fig.  S8E ). In contrast, ectopic expression of the TSGs in HRAStransformed SA cells, which lack FGFR1 amplifi cation and whose growth is not dependent upon FGFR signaling (see below), had no signifi cant effect on colony formation (Supplementary Fig. S8F) .\nWe also selected a representative subset of eight of these 14 TSGs and tested their ability to inhibit tumor growth in mouse xenografts. Retroviral vectors coexpressing GFP and one of eight TSGs were transduced into NCI-H520 cells, and GFP-positive cells were isolated by fl uorescence-activated cell sorting 24 hours later and injected subcutaneously into nude mice. Supplementary Fig. S8G shows that ectopic expression of all eight TSGs tested markedly suppressed tumor growth.\nNext, we asked whether knockdown of TSGs that encode repressors of FGFR signaling would transform SA cells. We fi rst tested whether increased FGFR signaling was suffi cient for the transformation of these cells. SA cells ectopically expressing FGFR1, but not empty vector, formed colonies in soft agar ( Fig. 4A ) and tumors following subcutaneous ( Fig. 4B ) . Knockdown of all 17 TSGs that encode repressors of FGFR signaling enabled SA cells to form colonies in soft agar ( Fig. 4C ) . Following knockdown, 14 of these 17 TSGs increased colony formation >5-fold and were further analyzed in a tumorigenicity assay. Notably, all 14 SA knockdown cell lines formed tumors following subcutaneous injection into nude mice ( Fig. 4D ) . As expected, pFRS2-Y436 levels were higher in all 14 tumors compared with those formed from HRAS -transformed SA cells, indicative of increased FGFR signaling (Supplementary Fig. S9A ). Comparable results were obtained with a second, unrelated shRNA targeting each TSG ( Supplementary Fig. S9B-S9D )."}, {"section_title": "Knockdown of FGFR Signaling Repressors Sensitizes HBECs to FGFR Pharmacologic Inhibition", "text": "Human cancer cell lines in which FGFR1 is amplifi ed or contains an activating mutation are sensitive to FGFR pharmacologic inhibitors ( 27 ) . We therefore hypothesized that knockdown of TSGs that encode repressors of FGFR signaling would sensitize cells to FGFR inhibitors. In these experiments, we used ponatinib, a multitargeted tyrosine kinase inhibitor that displays potent pan-FGFR inhibition at nanomolar concentrations ( 27 ) . As controls, we used HRAS -transformed SA cells, whose ponatinib sensitivity is similar to that of parental SA cells (Supplementary Fig. S10A ), as well as NCI-H520 cells, which are highly sensitive to FGFR inhibitors. In these experiments, we analyzed the 24 TSGs that were downregulated in hLSCCs, 17 of which repress FGFR signaling and the other seven of which provided important negative controls.\nThe ponatinib titration experiment of Fig. 5A and B shows that SA knockdown cell lines that have increased tFGFR1 or pFGFR1 were highly sensitive to ponatinib treatment (see also Supplementary Fig. S10B and S10C ). In fact, the ponatinib sensitivity of several of these SA knockdown cell lines was comparable with that of NCI-H520 cells. In contrast, most SA cell lines depleted of TSGs that encode FGFR1-independent FRS2 activators, or that do not affect FGFR signaling, were, in comparison, relatively ponatinib insensitive. As expected, SA cells in which FGFR1 was ectopically overexpressed were also ponatinib sensitive (Supplementary Fig. S10D ).\nPonatinib can inhibit multiple tyrosine kinases in addition to FGFR1 (see, for example, ref. 27 ). As an additional control for specifi city, we analyzed the effect of shRNA-mediated depletion of FRS2, a downstream effector of all FGFRs, in the SA knockdown cell lines. Figure 5C shows that SA knockdown cell lines with increased tFGFR1 or pFGFR1 were sensitive to FRS2 depletion (see also Supplementary Fig. S10E ). This result strongly suggests that the ponatinib sensitivity in these SA knockdown cell lines was as expected, due to inhibition of FGFR signaling. Notably, SA cell lines depleted of TSGs that encode FGFR1-independent FRS2 activators were also sensitive to FRS2 depletion. Finally, the majority of SA cell lines depleted of TSGs that do not affect FRGR signaling were, as expected, relatively insensitive to FRS2 depletion.\nThese fi ndings raise the possibility that some hLSCCs without FGFR1 amplifi cation or activating mutations may be sensitive to FGFR inhibitors. To test this possibility, we analyzed A427 cells, a human lung carcinoma cell line that lacks FGFR1 amplifi cation or activating mutations but is unexpectedly sensitive to FGFR inhibitors ( 20 ) . We fi rst analyzed the expression of the 24 TSGs that were downregulated in hLSCCs (see Fig. 2 ) and found that three-DAPP1 , MYD88 and STK11 -were substantially downregulated in A427 cells compared with SA cells ( Fig. 5D ) or an independent immortalized but not transformed HBEC cell line ( Supplementary  Fig. S11 ). We then knocked down these three TSGs in SA cells, both singly and in combination, and measured ponatinib sensitivity in a soft-agar colony formation assay. The results of Fig. 5E show that TSG knockdown resulted in increased ponatinib sensitivity, and this effect was greater with multiple compared with single knockdowns. Notably, the ponatinib sensitivity of SA cells depleted of all three TSGs was comparable with that of A427 cells. TSG knockdown also increased the proliferation rate of SA cells, and again this effect was greater with multiple compared with single knockdowns (Supplementary Fig. S12 )."}, {"section_title": "The Splicing Regulator SRSF9 Represses FGFR Signaling through the Cytoplasmic Adaptor Protein SH3BP2", "text": "One of the TSGs, SRSF9 , encodes a member of a family of RNA-binding proteins that regulate pre-mRNA splicing ( 28 ) . We were intrigued by how a splicing factor could modulate tFGFR1 levels (see Fig. 3 ) and hypothesized that SRSF9 might regulate splicing of a pre-mRNA encoding a protein involved in FGFR1 expression or stability. We therefore performed transcriptome profi ling (RNA-Seq) experiments to identify pre-mRNAs whose splicing is altered by the loss of SRSF9. Briefl y, total RNA was isolated from SA cells stably expressing an SRSF9 shRNA or nonsilencing control, and RNA samples were processed and amplifi ed followed by paired-end deep sequencing ( Fig. 6A ) . Using stringent selection criteria (see Methods), we identifi ed 10 pre-mRNAs whose splicing was signifi cantly altered in SRSF9 knockdown cells, several of which, including EIF3C ( 29, 30 ), BCL2L11 ( 31 ), and APC ( 32 ), encode proteins that have been implicated in transformationrelated activities (Supplementary Table S4 ). However, we thought that the most potentially relevant to FGFR signaling was SH3BP2 pre-mRNA, which encodes a cytoplasmic adaptor protein previously reported to interact with several tyrosine kinases, including FGFR1 ( 33 ) .\nThe RNA-Seq analysis indicated that knockdown of SRSF9 led to the exclusion of SH3BP2 exon 10. To validate the RNASeq results, we analyzed SH3BP2 pre-mRNA splicing in two independent SRSF9-knockdown SA cell lines derived using unrelated SRSF9 shRNAs. Consistent with the RNA-Seq data, the qRT-PCR results of Fig. 6B show that following SRSF9 knockdown the level of SH3BP2 exon 10 was substantially reduced, whereas total SH3BP2 mRNA levels, monitored by analysis of unaffected exons 7 and 8, were normal. Exon 10 exclusion results in a frameshift that creates a premature stop codon ( Fig. 6C ) . Accordingly, the immunoblot results of Fig. 6D show that full-length SH3BP2 protein levels were reduced in SRSF9 -knockdown SA cells. Notably, the expected truncated SH3BP2 isoform was not detected, suggesting that it was unstable. Consistent with this idea, in an ectopic expression experiment, full-length SH3BP2 could be readily detected, whereas an engineered truncated SH3BP2 protein was again undetectable (Supplementary Fig. S13A and S13B). Figure 5 . Knockdown of FGFR signaling repressors sensitizes HBECs to FGFR pharmacologic inhibition. A, soft-agar assay measuring colony formation of SA knockdown cells treated with varying concentrations of ponatinib. Colony number was normalized to that obtained in the absence of ponatinib, which was set to 100%. B, soft-agar assay measuring colony formation of SA knockdown cells treated with 125 nmol/L ponatinib, normalized as described in A. Data, mean ± SD. C, colony formation assay measuring viability of SA knockdown cells expressing an FRS2 shRNA relative to that obtained with a nonsilencing (NS) shRNA. Viability was normalized to that obtained in NS shRNA-expressing cells, which was set to 1. Data, mean ± SD. D, qRT-PCR analysis monitoring expression of DAPP1 , MYD88 , and STK11 in A427 cells relative to SA cells. Data, mean ± SD (error bars are too small to be visualized). E, soft-agar assay monitoring colony formation of ponatinib-treated SA single-, double-, and triple-knockdown (KD) cells, normalized as described in A. Data, mean ± SD. *, P < 0.05; **, P < 0.01. CDK5R1  DDX52  SDF2L1  SPOP  STK11  TXNRD1  IGF2R  MAP1A  NAA38  PIGH  SEMA3B  PKD1L3  ZNF22   NCI-H520  ANGPT1  FLNA  GAPVD1  MYD88  PTGIS  SRSF9  SPAST  DAPP1  FPR3  NME4 overexpressing SH3BP2 (F) . G, coimmunoprecipitation analysis. Left, the FGFR1 immunoprecipitate was immunoblotted for SH3BP2. Right, the SH3BP2 immunoprecipitate was immunoblotted for FGFR1. The levels of the proteins in the input are shown. H, soft-agar colony formation assay. NIH 3T3 cells expressing an NS shRNA or one of two unrelated SH3BP2 shRNAs were analyzed for their ability to form colonies in soft agar. I, tumor formation in mice injected with NIH 3T3 cells expressing an NS shRNA or one of two unrelated SH3BP2 shRNAs. J, model depicting the mechanism by which loss of SRSF9 leads to increased FGFR1 levels. K, boxplots displaying log 2 -fold changes in expression of SH3BP2 exon 10 in normal lung samples, 27 hLSCC samples, and 10 human lung adenocarcinoma (hLA) samples. Boxed areas span the fi rst to the third quartile. Whiskers represent 15th and 85th percentiles. P < 0.05 for hLSCC versus hLA. **, P < 0.01. We next determined how a reduction in SH3BP2 levels affected FGFR1. Figure 6E shows that shRNA-mediated knockdown of SH3BP2 resulted in increased levels of both pFGFR1 and tFGFR1. Conversely, ectopic expression of SH3BP2 led to reduced tFGFR1 levels ( Fig. 6F ) . Finally, the coimmunoprecipitation experiment of Fig. 6G shows, consistent with the previous report ( 33 ) , that SH3BP2 and FGFR1 are physically associated in SA cells."}, {"section_title": "P T G I S S R S F 9 S P A S T D A P P 1 F P R", "text": "3 N M E 4 P T P N 4 C D K 5 R 1 D D X 5 2 S D F 2 L 1 S P O P S T K 1 1 T X N R D 1 I G F 2 R M A P 1 A N A A 3 8 P I G H S E M A 3 B P K D 1 L 3 Z N F 2 2 N C I -H 5 2 0 A N G P T 1 F L N A G A P V D 1 M Y D\nNotably, similar to SRSF9 knockdown, knockdown of SH3BP2 promoted colony formation in soft agar ( Fig. 6H ) and tumor formation in mice ( Fig. 6I ) , strongly suggesting that SH3BP2 is the key target through which SRSF9 suppresses ( Fig. 6J ) in which SH3BP2 interacts with FGFR1, resulting in decreased FGFR1 levels. Loss of SRSF9 alters SH3BP2 premRNA splicing, leading to decreased levels of SH3BP2 and a corresponding increase in FGFR1 levels, resulting in increased FGFR signaling and transformation. Consistent with this idea, knockdown of FRS2 or treatment with ponatinib signifi cantly suppressed growth of tumors derived from SRSF9 -knockdown SA cells (Supplementary Fig. S14A-S14C ), indicating that tumor growth is dependent upon FGFR signaling. Although it is possible that mis-splicing of pre-mRNAs other than SH3BP2 may contribute to activation of FGFR signaling and transformation, our results indicate that mis-splicing of SH3BP2 premRNA is suffi cient to promote both of these activities.\nFinally, to determine the clinical relevance of these results, we analyzed the SH3BP2 splicing pattern in hLSCC patient samples. The results of Fig. 6K show that in hLSCC samples in which SRSF9 was markedly downregulated (see Fig. 2A ), there was also substantial SH3BP2 exon 10 exclusion. In contrast, the extent of SH3BP2 exon 10 exclusion was signifi cantly less in lung adenocarcinoma samples in which SRSF9 was only modestly downregulated (see Fig. 2B ). Collectively, these results reveal a strong correlation between SRSF9 downregulation and SH3BP2 exon 10 exclusion in human lung cancers."}, {"section_title": "DISCUSSION", "text": ""}, {"section_title": "An RNAi-Based Mouse Tumorigenesis Screen for Identifying TSGs", "text": "Here we have described an experimental strategy for the systematic identifi cation of candidate TSGs. Analysis of the original 28 human TSG candidates using the NCBI SKY/M-FISH and CGH database (National Center for Biotechnology Information Spectral Karyotyping, Multiplex Fluorescence In Situ Hybridization and Comparative Genomic Hybridization; ref. 34 ) revealed that all the genes have been found to harbor deletions in either one or both copies in multiple cancer types (Supplementary Table S5 ). Similarly, analysis of the COSMIC (Catalogue of Somatic Mutations in Cancer) database ( 35 ) revealed that all of the TSG candidates have been found to have loss of heterozygosity in one or more cancer types, six have been found to undergo homozygous deletions, and 11 have been found to be recurrently mutated in various cancers (Supplementary Table S6 ). In addition, a query of The Cancer Genome Atlas Lung Squamous Cell Carcinoma project database ( 36 ) revealed that eight of the TSGs have high-frequency promoter hypermethylation in hLSCC samples (Supplementary Table S7 ). These fi ndings provide additional support for the role of these genes as clinically relevant tumor suppressors.\nSeveral of the genes we identifi ed were previously unrecognized TSGs, with well-established roles in processes other than growth suppression. For example, MYD88 is a gene best known for its role in innate immunity (reviewed in ref. 37 ) and, as described above, SRSF9 encodes a pre-mRNA splicing factor ( 28 ). Our results highlight the power of unbiased, large-scale functional screening for cancer gene discovery.\nOur screening strategy did not emphasize reaching saturation but rather sought to follow up, by directed experiments, candidate TSGs isolated in the primary screen. Our reconstruction experiment indicates that, in principle, the design of the primary screen was suffi cient to analyze all 62,400 shRNAs in the library. However, we suspect that our screen, like other large-scale shRNA screens (see, for example, ref. 38 ), did not achieve saturation for reasons including suboptimal effi cacy of some shRNAs ( 39 ) , unequal representation of shRNAs in the primary screen, and an insuffi cient depth of sequencing.\nIn addition, intrinsic limitations of the cell line used in the primary screen prevented identifi cation of all TSGs. For example, in NIH 3T3 cells, the TP53 pathway is inactivated because of biallelic deletion of the INK4A / ARF ( CDKN2A / CDKN2B ) locus. Thus, although TP53 and CDKN2A are TSGs that are frequently inactivated in a variety of cancers, including hLSCC ( 35 ), they would not have been isolated in our screen."}, {"section_title": "New hLSCC Tumor Suppressors That Repress FGFR Signaling", "text": "Following the identifi cation of candidate TSGs from the primary screen, we then carried out a series of bioinformatic, comparative expression, and functional experiments in human lung cancer samples and cell lines, which revealed that many of the genes identifi ed in the primary screen were hLSCC TSGs. We speculate that NIH 3T3 cells are particularly effective in identifying hLSCC TSGs because they are a fi broblast cell line and, as discussed above, FGFR signaling plays an important role in hLSCC development. Consistent with this idea, both NIH 3T3 cells and HBECs are transformed by the ectopic expression of FGFR1 or knockdown of FGFR signaling repressors ( Figs. 1C , 3A and 4A-D ) .\nUnexpectedly, we found that 17 of the 24 hLSCC TSGs encode repressors of FGFR signaling. For several of the TSGs, the mechanism by which FGFR signaling is repressed can be readily envisioned. For example, PTPN4, which we found inhibits FGFR1 phosphorylation, is a known tyrosine phosphatase ( 40 ) , suggesting that FGFR1 is a substrate of PTPN4. GAPVD1 has been shown to mediate ubiquitination and degradation of EGFR ( 41 ) and may similarly regulate tFGFR1. However, for most TSGs, the basis by which FGFR signaling is repressed remains to be determined, and could occur through either direct or indirect mechanisms.\nSeveral considerations allow us to conclude that the basis of transformation of HBECs following knockdown of the 17 TSGs that encode repressors of FGFR signaling is, in fact, increased FGFR signaling. First, ectopic expression of FGFR1 is suffi cient to transform HBECs ( Fig. 4B ) . Second, following knockdown of the TSG, FGFR signaling is increased ( Fig. 3B ) . Third, the transformed HBEC lines are sensitized to inhibition of FGFR signaling either by ponatinib addition ( Fig. 5A and B ) or FRS2 knockdown ( Fig. 5C ).\nAn important implication of our results is that aberrantly increased FGFR signaling may drive tumorigenesis of many hLSCCs that lack FGFR1 amplifi cation or activating mutations. Moreover, the increased FGFR signaling could render these hLSCCs sensitive to FGFR pharmacologic inhibitors, as we found in our cell culture experiments. Consistent with these ideas, a recent study analyzed a large collection of more than 500 human cancer cell lines for sensitivity to the FGFR inhibitor NVP-BGJ398, and found that 37.5% of the drugsensitive cell lines lacked genetic abnormalities in FGF and "}, {"section_title": "Functional Genomic Approaches for Identifi cation of Epigenetically Silenced TSGs", "text": "Functional genomics approaches for TSG discovery are highly complementary to cancer genome sequencing efforts. For example, a recent hLSCC genomic sequencing study ( 13 ) reported statistically recurrent mutations in 11 genes but only one of these, STK11 , was in common with the 24 TSGs identifi ed in this study. Thus, we discovered many hLSCC TSGs that were not identifi ed by cancer genome sequencing, apparently because they are inactivated by transcriptional repression and not mutation."}, {"section_title": "METHODS", "text": ""}, {"section_title": "Cell Lines and Culture", "text": "NIH 3T3, Kras NIH 3T3, NCI-H520, and A427 cells were obtained from the American Type Culture Collection (ATCC) and grown as recommended by the supplier. SA cells (provided by S. Randell, University of North Carolina School of Medicine) and HBECs (provided by J. Minna, UT Southwestern) were grown in BEGM medium (Lonza). NIH 3T3 cells, Kras NIH 3T3 cells, SA cells, and HBECs were routinely tested in soft-agar colony formation and mouse xenograft assays to confi rm the expected transformed or nontransformed phenotype. Otherwise, the cell lines used were not authenticated."}, {"section_title": "RNAi", "text": "For the reconstruction experiment, 0, 100, or 1,000 Kras -transformed NIH 3T3 cells were mixed with NIH 3T3 cells to achieve a fi nal population of 1 × 10 6 cells, and injected into the fl anks of BALB/c nu/nu mice ( n = 3; Taconic Farms). Tumor dimensions were measured every 1 to 2 days, and tumor volume was calculated using the formula π /4 × (length) × (width) 2 . Using the mouse shRNA mir library (release 2.16; Open Biosystems/ Thermo Scientifi c), 10 retroviral pools were generated as previously described ( 44 ) . NIH 3T3 cells (1 × 10 6 ) were transduced at a multiplicity of infection (MOI) of 0.2 with the retroviral stocks, and 2 days later selected for resistance to puromycin (1.5 μg/mL) for 7 days. For each pool, 1 × 10 6 cells were injected subcutaneously into the fl ank of a nude mouse. Tumors were excised and dissected, genomic DNA was extracted, and shRNAs were identifi ed as previously described ( 44 ) .\nTo validate candidates, NIH 3T3 cells (1 × 10 6 ) were infected with a retrovirus carrying an individual shRNA (listed in Supplementary  Table S8 ) and puromycin selected for 1 week. NIH 3T3 knockdown cells (2 × 10 6 ) were injected subcutaneously into nude mice ( n = 2); mice were sacrifi ced and photographed when the tumor size reached 1.5 cm. Animal protocols were approved by the Institution Animal Care and Use Committee at University of Massachusetts Medical School.\nFor all 32 genes whose knockdown promoted tumor formation, a second, unrelated shRNA directed against the same target gene was tested for the promotion of colony formation in soft agar and knockdown effi ciency of the target gene. Only candidates that validated with two shRNAs, both of which knocked down the target gene, were considered further."}, {"section_title": "qRT-PCR", "text": "Total RNA was isolated using TriPure Isolation Reagent (Roche). Reverse transcription was performed using SuperScript II Reverse Transcriptase (Invitrogen) followed by qPCR using Fast SYBR Green Master Mix (Applied Biosystems) using primers listed in Supplementary Table S9 . The expression level of each gene was normalized to that of GAPDH ."}, {"section_title": "Soft-Agar Colony Formation Assays", "text": "NIH 3T3 knockdown cells (5 × 10 3 ) were seeded using a CytoSelect 96-Well Cell Transformation Assay Kit (Cell Biolabs). For quantifi cation, colonies with >10 cells were counted and normalized to that obtained with a nonsilencing shRNA, which was set to 1 (Supplementary Fig. S1B ), or cells were lysed, stained with CyQuant, and analyzed using a 1420 Victor Multilabel Counter (PerkinElmer) and a 480/520-nm fi lter set ( Supplementary Fig. S1C ). Ponatinib (Selleck) was added to the medium at the concentration(s) indicated in Fig. 5A and B , and soft-agar colony formation assays were performed."}, {"section_title": "Identifi cation of Human Homologs", "text": "Human genes, identifi ed using NCBI's HomoloGene, were considered to be homologs if they shared greater than 50% identity at the protein level with the mouse gene."}, {"section_title": "Expression Analysis in Human Lung Cancer Samples", "text": "Total RNA from nine normal lung, 10 lung adenocarcinoma, and 27 hLSCC samples were obtained from the University of Massachusetts Medical School Cancer Center Tissue Bank. qRT-PCR was performed using the primers listed in Supplementary Table S9 . Boxplots and statistical analyses were done using R ( 45 ) . The Wilcoxon rank sum test was performed to determine whether expression of each TSG or SH3BP2 exon 10 in hLSCC or human lung adenocarcinoma samples signifi cantly differed from that in the normal lung. In Fig. 2 , to correct for multiple comparisons, P values were adjusted using the Bonferroni method, and genes with an adjusted P value <0.05 were considered signifi cant. A gene was considered \"positive\" if it was downregulated >2-fold in ≥70% of the samples and had a P value <0.05. In Fig. 6K , the results were normalized to that obtained in SA cells to correct for differences in primer effi ciencies."}, {"section_title": "Immunoblot Analysis", "text": "Immunoblots were probed using antibodies against tEGFR (Cell Signaling Technology), pERK1/2, tERK1/2 (Cell Signaling Technology), pFGFR1, tFGFR1 (Invitrogen), tFGFR2, tFGFR3, and tFGFR4 (Santa Cruz Biotechnology), pFRS2-Y436 (Abcam), pFRS2-Y196 (Cell Signaling Technology), tFRS2 (Santa Cruz Biotechnology), tIR (Cell Signaling Technology), tPLCγ (Santa Cruz Biotechnology), SH3BP2 (Abcam), pY (Invitrogen), and α-tubulin. Pairwise p and t proteins were analyzed on separate gels/immunoblots using the same protein lysate. Immunoblots were quantifi ed using the ImageJ software (NIH). For the coimmunoprecipitation experiments of Fig. 6G , the FGFR1 or SH3BP2 antibody was conjugated to Dynabeads (Invitrogen) overnight, added to NCI-H520 cell extract, and incubated at 4°C overnight."}, {"section_title": "Ectopic FGFR1 Expression", "text": "The human or mouse FGFR1 cDNA clone (MHS1010-7429513 or MMM1013-7510432, respectively; Open Biosystems/Thermo Scientifi c) and empty vector (pCMV-SPORT6; Open Biosystems) were transfected into SA or NIH 3T3 cells twice with 3 days in between to achieve maximum transfection effi ciency. For soft-agar colony formation assays, 1 × 10 4 cells were plated and colony number was counted after 3 weeks. For tumor formation assays, 2 × 10 6 NIH 3T3 or 1 × 10 7 SA cells expressing FGFR1 or vector were injected into nude mice ( n = 3)."}, {"section_title": "Ectopic Expression of TSGs", "text": "TSG cDNAs (see Supplementary Table S10) were cloned, by PCR (using primers listed in Supplementary "}, {"section_title": "Analysis of SA Knockdown Cells for Transformation Activity", "text": "To generate SA knockdown cell lines, SA cells (5 × 10\n3 ) were plated in 6-well plates and infected with a lentivirus expressing an individual shRNA at an MOI of 2. Soft-agar colony formation and tumor formation assays were performed as described above. For Fig. 5C , TSG knockdown SA cells were plated in 96-well plates and infected with an FRS2 or nonsilencing shRNA. Cell viability was monitored using PrestoBlue (Invitrogen)."}, {"section_title": "RNA-Seq", "text": "Total RNA from nonsilencing or SRSF9-knockdown SA cells was isolated using the TriPure Isolation Reagent (Roche), and mRNA purifi cation, cDNA synthesis, and amplifi cation were carried out according to the TrueSeq RNA sample preparation guide (Illumina). Libraries were sequenced as 100-bp paired end using Illumina HiSeq 2000. All reads were mapped to the human genome (hg19) using TopHat, followed by running Cuffl inks to assemble and quantify the transcriptome ( 46 ) . Alternative splicing events were fi rst determined using Cuffdiff2 and further analyzed as follows. Gene-level normalized isoform expression (NI) is defi ned as the ratio of the isoform level to the gene level (isoform FPKM/gene FPKM). Relative difference of NI (RDni), a differential alternative splicing event measurement, was calculated as NI for knockdown/NI for nonsilencing. Absolute difference of NI (ADni) was calculated as [NI for knockdown − NI for nonsilencing] to indicate the magnitude of the alternative splicing. Isoforms with RDni >1.2 or <1/1.2, and ADni >0.1, and gene level expression greater than median FPKM in both conditions (Supplementary Table S4 ) were selected for further validation. The RNA-Seq data have been deposited in NCBI's Gene Expression Omnibus ( 47 ) and are accessible through GEO Series accession number GSE47095."}, {"section_title": "Ectopic SH3BP2 Expression", "text": "The full-length SH3BP2 cDNA clone was obtained from the MGC collection (catalog #5103986). The truncated protein was generated using the QuikChange Lightning Site-Directed Mutagenesis Kit (Agilent) with the following primers: forward, 5′-GACGAGGAC TATGAGAAGGTTGTTCAAGGCTACAAG-3′ and reverse, 5′-CTTG TAGCCTTGAA CAACCTTCTCATAGTCCTCGTC-3′."}, {"section_title": "Database Mining", "text": "The Oncomine 4.3 Cancer Profi ling Database was searched using a threshold P value of 0.05, fold change of 2, and gene rank of \"All.\" The NCI/NCBI SKY/M-FISH & CGH Database was queried using NCBI's Entrez database Cancer Chromosomes, using the human chromosome location based on cytogenetic band information according to Entrez Gene. Searches of the COSMIC database were performed using release v63. Searches of the lung squamous cell carcinoma dataset using The Cancer Genome Atlas Data Portal queried DNA promoter methylation frequency using a criterion of ≥0.5 (intensity ratio of methylated and unmethylated DNA)."}, {"section_title": "Statistical Analysis", "text": "All quantitative data were collected from experiments performed in at least triplicate, and expressed as mean ± SD. Differences between groups were assayed by the two-tailed Student t test in Microsoft Excel using unpaired ( Figs. 5B-D and 6B ) or paired ( Figs. 4C and 6H ) comparisons. Signifi cant differences were considered when P ≤ 0.05; *, P < 0.05; and **, P < 0.01."}, {"section_title": "Disclosure of Potential Confl icts of Interest", "text": "No potential confl icts of interest were disclosed."}]