[{"section_title": "", "text": "Physically active or inactive lifestyle is nurtured during the early years of childhood. 1, 2 Children at young ages are physically active in general. With their rapid physical, cognitive, and social-emotional development and under the influence of adults and home and school environments, they either continue to be physically active and develop into physically active adults or lose their interest in physical activity and start a sedentary life.\nIn research on the effect of childhood lifestyle on adulthood, exercise scientists have attempted to examine both personal and social factors leading to the development of a healthful active or sedentary lifestyle. 3, 4 Significant findings include a) girls are less active than boys; 5, 6 b) adolescents are less active than younger children; 6 c) African Americans are less active than European Americans, 5 especially in girls; 6 d) those having high self-perception of physical competence are more active than those having low self-perception; 7 e) children who are taught to appreciate and enjoy physical activity tend to be more active than those who Made available courtesy of Human Kinetics: http://www.humankinetics.com/ ***Reprinted with permission. No further reproduction is authorized without written permission from Human Kinetics. This version of the document is not the version of record.\nFigures and/or pictures may be missing from this format of the document.*** are only exposed to various activities; 8 f) children whose parents and siblings are physically active tend to be more active than those whose family members are sedentary; 9, 10, 11 and g) children who can afford and have access to convenient playing space and equipment are more active than those who cannot. 4, 7 The findings imply that personal and environmental factors can have direct influence on the development of a healthful lifestyle in children."}, {"section_title": "The Role of Interest and Purpose of the Study", "text": "Interest is an important variable that drives children, especially young children, to adopt certain behavior in responding to the influence of their immediate environment. 12 It can be observed in daily life that children decide to approach or avoid an activity based on their original interests in the activity or on the extent to which the activity appeals to them. In research, interest is conceptualized as individual interest and situational interest. Individual interest is a person's psychological disposition in preference of an activity or action. 13 It is based on a high level of knowledge and values the person has developed during positive interactions with the activity or action.\n14 Situational interest, on the other hand, is the appealing effect of characteristics of an activity on individuals. 15 It depends on a person-activity interaction in which the person is able to recognize the appealing characteristics of the activity. 16 There is little doubt that one factor that determines children's physical activity participation is the extent of \"fun\" they experience in their interaction with the physical activity. 7, 8, 17 On the other hand, it was found that children as young as 3 to 4 years old can have well-developed individual interests. For example, Renninger revealed that children at this age persistently demonstrated higher attention, longer engagement time, a wider range of action types, higher ability, and stronger intention to continue in activities they are interested in. 12 At a young age, both situational and individual interests work hand in hand to have a combined impact on children's decision about what to do and play. Thus, their decisions to engage in an activity tend to rely on their intuitive interests resulting from the interaction between their developing individual interests and the \"play\" opportunity afforded by their immediate environment.\nActivities that young children choose in their free time are reflective of their intuitive interest that is both nurtured in and configured by the environment. 18 It can be assumed that choosing a physically active activity over a sedentary one or vice versa is reflective of children's intuitive interest. It also can be assumed that such intuitive interests are associated with their unique and immediate environment including their school and community.\nThe purpose of this study was to identify and examine the personal and environmental factors that are associated with and influence young children's intuitive interest in physical activities using a national sample. Specifically, the study was intended to examine the extent to which children's intuitive interest in physical activity can be predicted by characteristics of self (e.g., motor skills, body weight/height, gender), home environment (e.g., family structure and socio-economic status, neighborhood safety, TV impact), and school programs (e.g., access to organized physical activity and to free play, teacher teaching experiences).\nUnderstanding the impact of the factors on young children's intuitive interest in physical activity could assist researchers, health workers, and educators to develop intervention programs to effectively nurture young children for an active lifestyle. It has been pointed out that in many physical activity promotion programs, physical activities prescribed for adults are used for children. 19 Seldom are children's personal characteristics and environmental influences addressed in these programs. Consequently, children are reported to quickly lose their interest in the physical activities that are considered beneficial to them. As Corbin pointed out, it is necessary to better understand children's unique physical and psychological characteristics and their environmental influences to develop effective programs for them."}, {"section_title": "17", "text": ""}, {"section_title": "The Early Childhood Longitudinal Study", "text": "This study was conducted using a national database of early childhood development, the Early Childhood Longitudinal Study-Kindergarten cohort (ECLS-K)."}, {"section_title": "20", "text": "The ECLS-K is a comprehensive longitudinal, multi-context and multi-discipline study examining personal and environmental variables that influence the physical, cognitive, and social-emotional development of American children from a manyfaceted, holistic perspective. It provides a unique analytical context for an in-depth examination of children's lifestyle, which is otherwise difficult to investigate in isolated data sets. With its national representativeness and large number of variables, the ECLS-K data make it possible to identify and understand the influence of personal and environmental variables on the development of children's intuitive interest in physical activity. The data used in this study represented the kindergarten children of the United States during the 1999 to 2000 school year.\nThe ECLS-K study employed a multi-stage probability sample design to select a nationally representative sample. The first stage involved selecting primary sampling units consisting of counties (or county groups) with populations greater than 15,000. The sampling unit at the second stage was schools (both public and private) within the primary sampling units. At the third stage, students within schools were selected. During the sampling, multi-level linkages were established among the levels. For instance, a child was linked to his or her parents or guardians at home and to his or her teacher at school, and both homes and schools were linked to communities.\nIn ECLS-K, data were collected from parents, teachers, and children. All data were collected by 455 trained data collectors. Most were retired teachers, former educators, people experienced in working in schools and communities, and had previously collected data for other Department of Education national studies. 20 Their training for the ECLS-K included 8 hours of self study which included a training video with demonstration of the field procedures, child direct assessment protocols, and computer keyboard skills for recording data. An additional 8 hours of in-person training was provided that focused on interviewing techniques.\nData related to children's home/family and community environment were collected through parent interviews. The interviews were conducted primarily by telephone with a standardized protocol the data collectors were trained to follow. About 3% of parents did not have access to a telephone. In these cases, interviews were conducted in person. Interviews were conducted primarily in English; in cases where the parents had difficulty in English, the interviews were conducted in their native languages. These languages included Spanish, Lakota, Hmong, or Chinese. Of the approximately 7% of the interviews conducted in languages other than English, 94% were in Spanish. About 1% of the interviews could not be conducted because of language barriers. On average, each interview lasted about 50 min. The completion rate for parent interviews was 85.3%.\nData related to children's school experiences were collected through teacher questionnaires. Two sets of self-administered questionnaires were distributed to the teachers. Questionnaire 1 focused on general characteristics of the class (e.g., half-day or full-day program), children (e.g., number of children in class), class organization (e.g., more teacher-directed or child-selected), class activities (e.g., kinds of content, time spent on an activity), accessible equipment and facilities, and general information about the teacher. Questionnaire 2 contained questions about the child/children sampled for the study. In addition to demographic information, the teacher was asked to provide a detailed assessment of the child's performance in various content areas and abilities. One of those was physical ability in a \"structured play time\" such as physical education. The completion rate was 96.6% for Questionnaire 1 and 91.4% for Questionnaire 2.\nChildren's cognitive, social, and physical abilities and related variables were assessed directly by data collection teams in schools. The assessment was conducted primarily in classrooms or school libraries. Each child was signed out of his or her home room and assessed individually. Children whose primary language was not English were given an English language assessment using the Oral Language Development Scale. 21 Those who passed the assessment were administered the assessment in English; those who did not were assessed using their primary language. As a result, 4.4% of the children were assessed in Spanish and 3% in other languages. Each direct child assessment session lasted approximately 50 to 70 min. The completion rate was 89.9%.\nThe ECLS-K data provided a holistic view of the lives of 5-year olds in the United States. Examining and analyzing variables in the ECLS-K database might allow us to identify and understand important personal and environmental variables that have national implications for children's development of a physically active lifestyle. Its findings could pave a way for conducting continuous analyses on the ECLS-K longitudinal data when data from subsequent years become available. Findings might also provide evidence for developing a theoretical platform on which effective intervention programs for young children can be designed."}, {"section_title": "Method", "text": ""}, {"section_title": "The Sample", "text": "The sample for the analysis included 21,260 children enrolled in approximately 1000 US public and private kindergarten programs and their parents, teachers, and school administrators. The children were selected using a probability sampling technique that was designed to project the nation's kindergarten population (N = 3,865,946). The sampling took into account race, socio-economic status, disability, and a variety of early childhood experiences.\nThe data consisted of a) direct measures of children's physical/psychomotor, cognitive, and social/emotional development, b) parent/guardian surveys on home and community environment and children's at-home behavior, and c) teacher surveys on children's in-school behavior, the curriculum, teaching strategies, and educational environment. The parent/guardian survey was conducted with interviews, while the teacher survey employed detailed questionnaires. A structured procedure of identifying the child's primary caregiver (e.g., mother, father, or other) was followed to select the parent/guardian for the interview who spent the most time taking care of the child. 20 Validity and reliability of the individual measures have been reported at or beyond the acceptable level for all the measures used in this analysis. 20 Each data category contains a large number of variables organized in an Electronic Code Book (ECB) created by the Department of Education's National Center for Education Statistics. 20 The ECB and data were loaded on a CD-ROM to enable researchers to conduct further analyses. Special training is required to convert the data into an analyzable format. For instance, matching a child's direct assessment data in a physical activity pattern with his or her neighborhood safety data entails a special coding procedure before the impact of neighborhood safety on the child can be assessed."}, {"section_title": "Variable Selection and Reduction", "text": "Based on the purpose of the study and reviews of research literature, a set of variables were selected to reflect a) children's interest and engagement in physical activity, b) home and school environmental factors that might influence their interest and engagement in physical activity, and c) children's demographic information related to physical ability. Selected variables are briefly described below. Intuitive Interest. Children's interest was inferred from the parents' observation of their children's choice of the activities they engaged in in their free time. It was represented using parents' responses to the question: \"Child A prefers to spend his/her free time reading, playing video games, or watching TV. Child B prefers to spend his/her free time riding a bike, swimming, and playing sports. Is your child more like Child A, more like Child B, or similar to both Child A and Child B?\" The data quality of a differential (choice) scale, which is typically used in child and adolescent development research, has been shown in influential research projects such as Hater's study on young children's self-perception profile. 22 We labeled the Child A activity pattern as representing sedentary interest and Child B as representing active interest. Consistent with the conceptualization of the interest construct, 15, 18 this measure was designated intuitive interest in physical activity in this study of 5-year old children to distinguish it from a fully developed individual interest that is based on highly developed knowledge and value for a particular activity and from situational interest that is based entirely on situational factors. Demographic Variables. Gender and race were included in the subsequent analysis. These are two typical variables related to children's willingness to participate in physical activity. Body Mass Index (BMI). Body mass index [computed using the formula BMI = weight (kg)/height 2 (m)] is an indicator widely used as a measure for the appropriateness of body weight. * Children's height and weight were measured during ECLS-K data collection and BMI was computed and stored in the database. BMI was used in the analysis as an individual factor that was assumed to influence children's interest and engagement in physical activity.\nMotor Skill. Children's composite gross motor skill was measured using separate tests of four locomotor skills including alternate one-foot balancing, alternate one-foot hopping, skipping, and walking backward in a straight line. Fine motor skills were assessed by having the children copy basic figure drawings and construct forms with wooden blocks. In the analyses, we used the gross motor skill assessment because of its greater relevance to the type of physical activity that contributes to general health."}, {"section_title": "Family Socio-Economic Status (SES).", "text": "Family income was measured using total household annual income based on the information that the parents provided during the interview. The measure was based on the actual dollar amount reported.\nAthletic Events. This variable was included to indicate whether the child had the opportunity to watch sport events as spectators. It was based on \"yes\" or \"no\" responses of parents to the question, \"In the past month, has [the child] attended an athletic or sporting event in which [he/she] is not a player?\" Family Physical Activity. This variable was measured with parents' response to the question, \"In a typical week, how often do you or any other family members and [the child] play a sport or exercise together?\" The responses were coded as 1 = not at all, 2 = once or twice, 3 = 3 to 6 times, 4 = everyday. In analyses, we recoded 1 = twice or less and 2 = three or more times.\nWeekly TV Watching Time. This variable was measured on parents' reported hours that the child spent watching TV. The interview question was, \"In a typical week, how many hours does [the child] usually watch TV or videos on school days?\" The actual hours reported were used in the data analysis.\nChild Watching TV After School. This variable measured the number of minutes children spent watching TV in a typical day. The actual number of minutes reported by parents was used.\nNeighborhood Safety. The measure of this variable was based on parents' responses to the question \"How safe is it for children to play outside during the day in your neighborhood?\" There are three levels of responses: \"not at all safe,\" \"somewhat safe,\" and \"very safe.\" Physical Education Class Per Week. This variable was measured in the number of times (from 0/wk to daily) a child attended structured physical education classes in a week. The measure included four levels in the ECLS-K database: never, 1 to 2 times, 3 to 4 times, and daily (5 d/wk). The information was collected from the teacher who taught the child in the sample.\nTeacher Experience in Teaching Physical Education. This variable indicated whether or for how long (in years) a kindergarten teacher had experience in teaching * For children 5y, the range of acceptable BMI is 14.7 to 20 for boys and 16.2 to 21 for girls. A child with BMI greater than the upper limit is considered overweight, and could be at risk of obesity. 28 physical education. The teacher was asked to identify experiences to the nearest half-year in teaching a list of subjects, including physical education. This variable indicates the teacher's experience in teaching physical education regardless of whether his/her students were currently taught by a physical education specialist in a structured program or by the teacher him/herself. Recess. Recess represents unstructured physical activity opportunities in schools. It was measured as the number of days per week that children had recess between classes. The information was provided by the teachers. In the ECLS-K database, its measure was coded into six levels: no recess, one day, two, three, four, and five days per week."}, {"section_title": "Data Analysis", "text": "Given that we were examining differences in the variables between children with sedentary interest (Child A activity pattern) and those with active interest (Child B activity pattern), those children reportedly having interest in both activities (\"like both Child A and B\" in parent responses) were excluded from the analysis. In the descriptive statistical analysis, children with sedentary or active interests were compared in terms of their individual characteristic variables (gross motor skill, gender, race, and BMI), home environment variables (family SES, exposure to athletic events, physical activity at home, neighborhood safety, watching TV), and school influence variables (physical education class/week, recess time/week, and teacher experience teaching physical education). The analysis allowed the generation of a global description about what variables descriptively distinguished the two groups of children of different interests.\nIt is possible that the large sample sizes would result in high statistical power that declares meaningless or misleading statistically significant differences. In addition to using inferential statistics to test the differences between the groups, we compared the effect size in variables measured on the ratio/continuous scale between the groups. Cohen's d approach 24 was used, in which standardized mean differences between the groups were calculated.\nFor variables on a nominal scale (e.g., gender) and on an ordinal scale (e.g., family physical activity), hierarchical log-linear analyses were conducted to test the null hypothesis that children's intuitive interest in physical or sedentary activities was independent from these variables. In addition, comparisons on a frequency and percentage basis were conducted and reported to supplement the above analyses. We believe these approaches helped form a realistic parameter on which meaningful interpretation of the data could be made.\nA logistic regression analysis was conducted to examine the extent to which young children's intuitive interest in physical activity was predictable using the personal, home, and school variables. The dependent variable was intuitive interest measured using parents' responses to the comparison question of Child A and Child B (see above). In the regression analysis, we chose to enter the predictors in three blocks: individual characteristics, home environment factors, and school influences, as described above. A forward stepwise selection method was used to enter the variables in each block.\nTo maintain generalizability, adjusted sampling weights were computed individually for each analysis to take into account the design effects of the probability sampling used in data collection. 25 The design-effect adjusted sampling weights resulted in different sample sizes in the actual analyses for each variable reported in the following data tables. Table 1 reports the results of comparing the means of the variables measured on the continuous scale between the children interested in physical activities and those interested in sedentary activities. Statistically significant difference was found between the two groups of children in BMI, gross motor skill level, number of weekly physical education classes, and their teachers' years of experience in teaching physical education. Calculated effect size (Cohen's d) revealed that the differences in BMI and gross motor skill might have little practical meaning, although differences in the number of weekly physical education classes and teachers' teaching experience could be meaningful."}, {"section_title": "Results", "text": ""}, {"section_title": "Descriptive Analysis Results", "text": "The percentage difference reported in Table 2 is used as an index of comparison within the same variable category. A negative percent difference indicates that the number of children with sedentary interest exceeds the number of children with active interest within that category. In addition, the higher the positive percent difference, the more children there were who were interested in physical activities.\nThe data in Table 2 show that children's intuitive interest in physical and sedentary activities are associated with gender, race, neighborhood safety, athletic event, and family sport. For instance, more boys were interested in physical activity than girls. Proportionally more Native and Alaskan American (78%) and Caucasian (71%) children were interested in physical activities than those interested in sedentary activities. In contrast, it seems that more African (52%) and Asian (57%) American children were interested in sedentary activities.\nIt became clear that in an unsafe neighborhood the number of children interested in physical activities were fewer (52%) than their counterparts in a somewhat safe (57%) and very safe (68%) neighborhood. Among the children whose parents/guardians took them to various sport/athletic events as spectators, 26% preferred sedentary activities while 74% were interested in physical activities. Among the children who were not taken to the events, the comparison yielded 57% with active interest and 43% with sedentary interest. Among children who preferred physical activities, a majority of their parents involved them in playing some form of sports or engaging in physical activities (66% three times or more per week, 63% less than two times)."}, {"section_title": "Logistic Regression Results", "text": "The results, as illustrated in Table 3 , showed that children's personal characteristics predicted only 5% of the possibility of becoming intuitively interested in physical activity. Environmental influences at home and school each predicted 31% and 32% of the possibility, respectively. The expected (Exp) B (often referred to as odds ratio) represent the multiplicand change in children's intuitive interest in physical activity associated with one-unit change in each corresponding predictor. This indicator for the variables suggested that neighborhood safety, weekly physical education classes, and teachers' years of experience in teaching physical education had greater predictive impact than others. The variables of family physical activity and school recess did not enter into the regression equation.\nThe regression coefficients (B) revealed that race and exposure to sport events had negative predictive values for intuitive interest in physical activity. It seems that Caucasian children were more likely to be interested in physical activity than most minority children. In addition, attending sport/athletic events as spectators was not an effective predictor for intuitive interest in physical activity. Although the odds ratio of the variables indicate that these factors did not have as much predictive power as others in the regression equation, they were significant in that their suggested directions could be compelling."}, {"section_title": "Discussion", "text": "In this study, we attempted to explore the extent to which children's intuitive interest in physical activity was predicted by select personal, school, and family/home Note: Dependent variable: intuitive interest (dummy code: sedentary activities = 0, physical activities = 1, girl = 0, boy = 1, minority = 0, Caucasian = 1); R 2 is for the group of predictors specified, independent from other groups of predictors. When odds ratio = 1.0, odds are 50/50 for the event to occur; when odds ratio > 1.0, odds increase; when odds ratio < 1.0, odds decrease. environment factors. Our analyses revealed that children with different intuitive interests differed in terms of personal characteristics measures. For example, children who were interested in physical activities demonstrated higher scores in the gross motor skill tests and were lower in body mass index (BMI) than those who were interested in sedentary activities. Among nonparametric measures, gender and race appear to be influential. Boys seemed to be more physically active than girls and Native Americans and Caucasian American children were more physically active than African American and Asian American children.\nNeighborhood safety appears to be a significant factor. The data in Table  2 show that two out of three children whose parents considered their neighborhood very safe were interested in physical activities, compared with one in two in an unsafe neighborhood environment. Another important environment factor is school physical education programs. Children interested in physical activities had an average of three physical education classes each week, while children who liked sedentary activities had 2.82 classes (Table 1) . Although teachers' experiences in teaching physical education were not extensive for both groups of children, it seems apparent that physically active children were with teachers who had more experience in teaching physical education.\nWhen these personal, family, and school factors were compared, the results from the logistic regression analysis seem to suggest that environmental influences from family and school play a significantly more important role than children's personal factors such as gender, race, BMI, and motor skill. In the total variance accounted for by these factors, 31% and 32% were accounted for by family factors and school factors, respectively. It is worth noting, though, that the 32% variance accounted for by the school factor derived from two variables, number of classes per week and teacher experiences of teaching physical education. The results seem to suggest that a structured environment, such as schools, might be more effective in bringing about children's intuitive interest in physical activity.\nThe regression results appear to suggest that children attending sporting events as a spectator does not seem to help develop interest in doing physical activity. The variable \"athletic event\" depicts a family event where parents take children to athletic events as spectators. Although proportionally more children who attended sporting events as spectators were interested in physical activity, the results of the logistic regression analysis, where other influences were taken into account in the analysis at the same time, indicated that being spectators reduced the odds of developing intuitive interest in physical activity. It seems the function of the variable can be overridden by those from other variables. In contrast, the variable \"neighborhood safety\" based on which parents decide whether children play outside is an important predictor for children's interest in physical activity. It has been reported 26 that active engagement in activities deepens children's understanding of the activity and helps internalize the value of the activity. Consequently, active participation, rather than watching sports as a spectator, could lead to a greater interest in the activity.\nOur findings suggest a few implications for developing physically active lifestyles in children. Physical activity as a behavior is adopted very early in childhood and involves interaction between individual children and their living environments. 19 Malina has demonstrated a moderate persistence effect of early childhood physical activity patterns on that of adolescence. 27 Conceptualized as tracking, the persistence effect was found in adolescents who were physically active in their early childhood years. In other words, active children are likely to continue a physically active lifestyle at least into their adolescent years. Given the benefits of a physically active lifestyle and the tracking effect of childhood physical activity, it seems imperative to help children become physically active as early as they can. Logically, the very first step seems to help children develop high interest in many forms of physical activity.\nAccording to Renninger, 18 at 3 to 4 years of age children have developed relatively strong individual interest in approximately two activities or content areas central to their play experiences. They can identify themselves in the activities, spend much time interacting with the activities, exhibit high-level attention to specifics, and create multiple ways to develop skills by themselves in these areas. Interest has been viewed as a product of person-environment relationship. 13 For children, interest serves as an anchor or center that commands their daily activity. The environment created around them determines where the anchor will be planted and how it will function in their daily lives. Our findings seem to suggest that school physical education and neighborhood safety might be two factors that determine whether children anchor their interest around physical or sedentary activity.\nTaking children to athletic events as spectators might not create an environment where the child-physical activity relationship is identified with and anchored on doing physical activity. One could speculate that once watching becomes one of the primary areas of interest, it is likely to become a persistent behavior pattern that is difficult to change. On the other hand, when children have substantial opportunities to take part in physical activities, the child-physical activity relationship is defined in and anchored on the doing action in these activities. Actually participating in physical activities becomes central to the interest and will evoke continued interest in physical activity.\nAlthough family factors and school influences accounted for a similar amount of variance in children's intuitive interest in physical activity, it seems school influence should serve as the basis for future intervention programs which should also include parent involvement. Among family factors analyzed, neighborhood safety emerged as the most important. It is, unfortunately, a factor beyond the control of either parents or neighborhood-based physical activity advocates, especially in some inner-city communities with high crime rates. To instill interest in physical activity in children at an early age, the school should play a dominant role. Among the variables of teacher experiences in teaching physical education, number of physical education classes per week, and number of recesses per week, teacher experience and number of classes emerged as effective factors in the logistic regression analysis.\nUnfortunately, school physical education is in a \"high-need, low-demand\" marginalized status 28 where school administrators and teachers understand the importance of physical activity to children's health and development, but they give a very low priority to physical education. In most schools, physical education is taught only once or twice a week and might be substituted with other activities that involve some form of physical movement (e.g., band in high school). At preschool and elementary school levels, physical education can even be substituted with recess. In many schools, physical education is taught by teachers who are not content-certified.\nTo help children develop interest in physical activity, school physical education should be a central area of intervention. It is apparent in Table 1 that children with interest in physical activity had 3.22 physical education classes per week and their teachers had an average of 0.70 years (8.4 months) experience teaching physical education. By comparison, children with interest in sedentary activities had 2.82 classes a week and their teachers had an average of 0.18 years (2.2 months) teaching experience. Whether physical education was currently taught by the kindergarten teachers or specialists was not specified in the ECLS-K database. Nevertheless, the results seem to suggest that the more experience a kindergarten teacher has with teaching physical education, the more likely it is that his/her children are interested in physical activities. Although no definitive cause and effect conclusion should be drawn from this comparison, a speculative association can be made between children's interest and school physical education.\nThe finding leads to a focus for future physical activity intervention for children. Children are inherently active and their interest is likely to dictate their action. 17 Instead of inspiring them with great athlete role models, we should direct their attention to daily hands-on physical activities to nurture their interest. In an effort to address the high-need, low-demand phenomenon, Ennis 28 offered several \"imaginary\" curricula prototypes that could evoke interest in physical activities in children at various developmental stages. These curricula, the Medicinal Curriculum, the Active Curriculum, and the Portfolio Curriculum, are based on the constructivist principles that emphasize teaching physical education through creating an environment that maximizes the meaningfulness of physical activities. It might be assumed that intervention programs centered on school physical education can enhance children's interest in physical activity, help them to acquire the knowledge and skill needed to continue a physically active lifestyle, and develop a positive value system about physical activity in all children."}]