[{"section_title": "", "text": "enlargement correlate with these more global assessments in most studies. [5] [6] [7] Advanced analytic strategies allow the use of MRI to determine cortical thickness, a measure relevant to regional brain atrophy (see Figure 1 ).\nFunctional MRI demonstrates regional brain activation in response to specific cognitive tasks. It is most useful in patients with MCI or patients with mild AD; substantial patient co-operation is required for most activation tasks. Within this subgroup of patients, changes in functional MRI (fMRI) correlate with ADAS-cog scores. 8 Fluorodeoxyglucose (FDG) positron emission tomography (PET) reveals reduced metabolism in the precuneus/posterior cingulate and in the parietal regions bilaterally in patients with AD and in many patients with MCI who progress to AD dementia. 9, 10 Glucose is metabolized primarily by synapses and reduced FDG activity implies a reduction in synaptic function. FDG PET correlates with cognitive measures including the ADAS-cog, 11 and some investigators have observed correlations between higher CSF amyloid beta protein (Aβ) and greater PET metabolism, as well as poorer metabolism in patients with higher CSF total tau (t-tau) or hyperphosphorylated tau (p-tau)."}, {"section_title": "12", "text": "FDG PET is useful in differentiating AD from non-AD type of dementia, such as frontotemporal dementia. 13 Amyloid imaging is among the newest and most powerful biomarkers to emerge in AD diagnosis and drug development. Neurodegenerative Disease Alzheimer's Disease Figure 3 shows the relationship of biomarkers to the course of AD."}, {"section_title": "Drug-activity Biomarkers", "text": "Drug development is facilitated by employing a combination of biomarkers, including assessments documenting a direct effect of the drug on the biological target and biomarkers demonstrating an effect of the treatment on disease course. 31 Progress is being made in developing disease-course biomarkers through collaborative efforts such as the AD Neuroimaging Initiative (ADNI)."}, {"section_title": "32", "text": "Few drug-activity biomarkers have been identified. One promising approach is stable isotope labeled kinetics (SILK) in which an indwelling spinal fluid catheter is used to make serial measures of Aβ production and clearance. 33 A decrease in Aβ production has been shown with gamma-secretase inhibition. 34 Similarly, serum Aβ declines with gamma-secretase inhibition, suggesting that this measure may be responsive to drug treatment, although not a discriminating diagnostic measure. "}, {"section_title": "Biomarkers in Alzheimer's Disease Clinical Trials", "text": ""}]