[{"section_title": "Abstract", "text": "Community colleges are grappling with low rates of degree completion and transfer. The City University of New York's (CUNY) Accelerated Study in Associate Programs (ASAP) aims to improve graduation rates by providing a range of comprehensive support services to community college students in select majors. Using student-unit record data, we employed propensity score matching to examine short-term and 3-year outcomes from ASAP's first cohort, as well as logistic regression to identify program factors related to graduation. We found that ASAP participation was significantly positively related to retention, credit accrual, transfer, and degree attainment. Regression analyses indicated that a key influence on graduation is participation in advisement sessions. This study provides evidence that encouraging academic momentum via structured and comprehensive support can significantly improve community college graduation rates. It also provides evidence that ongoing and intrusive advisement can encourage positive academic outcomes among community college students."}, {"section_title": "", "text": "Community colleges around the nation are grappling with low rates of degree completion and transfer. As foundations, policymakers, and educators shift their focus from higher education access to completion, community colleges have been forced to rethink their mission, focus, and measures of success. Meeting the needs of students who enter community college with few academic, economic, and family resourcesand who are therefore least likely to graduate or transfer-is a fundamental challenge for these institutions. Recognizing this challenge, in 2007 the City University of New York (CUNY) developed and implemented Accelerated Study in Associate Programs (ASAP) to support new community college students and move them quickly toward an associate's degree. This article reports on 3-year outcomes from the program's first cohort."}, {"section_title": "Background", "text": ""}, {"section_title": "Statement of the Problem", "text": "Though a primary point of access to higher education, community colleges struggle to ensure that all of their students earn a credential. Of the first-time college students who entered a community college during the 2003-2004 school year, for example, 45% had left postsecondary education without earning a degree by 2006 (Provasnik & Planty, 2008) . Only 6% had earned some sort of credential during the same 3-year period. Looking only at those students enrolled full-time and who might be better expected to complete a degree quickly improves the statistics only slightly: 21% of first-time, fulltime students who enrolled in a public 2-year college in the fall of 2005 had earned a certificate or associate's degree 3 years later (Aud et al., 2010) .\nLooking over a longer period of time does not change the overall low rates of completion for beginning community college students. Analyses of data from the National Education Longitudinal Study of 1988 (NELS:88) indicate that 8 years after high school graduation, fewer than 40% of community college enrollees earned a credential (Bailey & Morest, 2006) . Another 11% transferred to a 4-year institution, though they had not earned a degree. These rates are even lower for Hispanic and Black students.\nNew York City's community colleges are not immune to low rates of completion and transfer. According to CUNY's Office of Institutional Research and Assessment (OIRA), of first-time freshmen enrolling in one of CUNY's community colleges in the fall of 2004, only 20% earned an associate's degree within 6 years (CUNY OIRA, 2011) . Another 8% had earned a bachelor's degree, and 9% were still enrolled.\nLow levels of postsecondary degree attainment are problematic at both the individual and the macro levels. For individuals, earning a credential is associated with significantly higher wages and earnings (Belfield & Bailey, 2011; Rouse, 2007) . Particularly for individuals, like those in CUNY's community colleges, who otherwise lack access to economic capital, earning a college credential is a key mechanism for long-term economic health and an important gateway to the middle class. From a macro perspective, ensuring that large numbers of individuals obtain postsecondary credentials has important economic and civil implications, such as increased tax revenues (Baum, Ma, & Payea, 2010; Hilliard, 2011; Rouse, 2007) , decreased unemployment (Baum et al., 2010) , and lower rates of criminality and welfare receipt (Baum et al., 2010; Belfield & Bailey, 2011) ."}, {"section_title": "The Office of the Mayor and CUNY's ASAP", "text": "Aware of the need to improve CUNY's graduation rates and provide more individuals with access to postsecondary credentials, in 2007 the Office of the Mayor's Center for Economic Opportunity (CEO) provided funds for CUNY to develop a new approach to community college education. The aim of the initiative was to help socially and economically disadvantaged students earn an associate degree as quickly as possible. Named the ASAP initiative, the program was designed to eliminate many of the economic and social barriers that hinder progression toward a degree. ASAP's stated goal was to have 50% of program participants earn an associate's degree within 3 years-a significantly higher proportion than the approximately 13% of CUNY community college students who typically do so.\nStudents were eligible for the initial fall 2007 ASAP cohort if they were a New York City resident, had fewer than 12 college credits, were pursuing an associate's degree in one of ASAP's approved majors, were not enrolled in any other special CUNY support program, and had completed any developmental education coursework prior to program enrollment. 1 Twenty-eight percent of the fall 2007 cohort completed developmental courses in the summer of 2007 to join the program.\nStudents were recruited for the 2007 ASAP cohort after acceptance to a CUNY community college and upon taking the CUNY Assessment Test, which measures college readiness in reading, writing, and math. All incoming students received preliminary information about ASAP with their CUNY acceptance materials, and, once test scores became available, ASAP college staff members reached out directly to eligible incoming students by email, mail, and phone. All eligible students were invited to group or individual information sessions to learn more about the program. Continuing students with fewer than 12 credits were also recruited by mail, through classroom visits, and by faculty referral. 2 To help students move quickly toward their degree goals, ASAP staff implemented a comprehensive array of services and program requirements. Key program components included:\n• • required full-time study (at least 12 credits per semester);\n• • a consolidated schedule, in which students took their courses in morning, afternoon, evening or weekend blocks to free up time for family, work, and other responsibilities; • • cohorts organized by major whereby students took classes with fellow ASAP students; • • full-time ASAP staff devoted to comprehensive and personalized advisement and career development services;\n• • twice-monthly required advising sessions for all students; and • • special programs for ASAP students, including tutoring, weekly seminars, employment services, leadership opportunities, and transfer advising.\nFrom its inception, ASAP has existed at six CUNY community college campuses. 3 ASAP students selected an approved program major; these majors are linked to the city's economic needs as well as transfer opportunities within the CUNY system. To ease the burden of required full-time attendance, ASAP students eligible for financial aid received tuition waivers to cover any gap between financial aid awards and a student's tuition and fees. All ASAP students also received free monthly Metrocards (for use in the city's public transit system) and access to textbooks.\nThe ASAP program is housed within the University's Office of Academic Affairs. The central office provides overall program support and guidance and consists of a University associate dean, a deputy director, an assistant director for research and evaluation, a research associate, a program coordinator, an outreach/scholarship specialist, and a program assistant who does clerical work. Each participating community college has its own ASAP staff overseen by a program director who reports to the Vice President for Academic Affairs. Each college staff includes a college director, two to four advisors (depending on program enrollment), a career and employment specialist, part-time tutors, and administrative support (clerical) personnel. All ASAP staff members are fully dedicated, and their positions are funded by the program budget, which is part of the general CUNY budget."}, {"section_title": "Conceptual Framework", "text": "ASAP's educational framework is rooted in a theory of action that assumes that college success is based in three interrelated constructs: students' ability to gain and maintain academic momentum, the development of college integration and belonging, and the ability to access timely and relevant support services (Linderman & Kolenovic, 2009) . Viewing college success in this manner encouraged initiative staff to develop a program that was comprehensive and multifaceted, yet grounded in theoretical and empirical understandings of the antecedents of college success. The theory of action assumes that while all three components of student success are important on their own, their efficacy is increased when they are implemented in concert, as they complement and magnify one another."}, {"section_title": "The Importance of Academic Momentum", "text": "A growing body of research finds that helping students earn credits quickly-generating academic momentum-is correlated with degree attainment (Adelman, 1999 (Adelman, , 2006 Attewell, Heil, & Reisel, 2011; Calcagno, Crosta, Bailey, & Jenkins, 2007; GoldrickRab, 2007; Swanson, 2008) . Adelman (1999 Adelman ( , 2006 , for example, found that for two large cohorts of students (NELS:88 and the sophomore cohort of the High School and Beyond study), one of the biggest predictors of bachelor's degree attainment is whether or not they earned a significant number of college credits during the first calendar year of postsecondary enrollment. Swanson (2008) found the same effect for a large group of highly motivated students within the NELS:88 data set. Examining a cohort of all new community college students in Florida and using event history analysis, Calcagno et al. (2007) found that reaching specific academic milestones, including earning 10 or more nonremedial credits, increases students' likelihood of earning a credential.\nFor students balancing work, family, and college, gaining and maintaining academic momentum is a particular challenge. Two common approaches to balancing these competing demands, part-time enrollment and temporarily stopping out of college, are strongly correlated with lower rates of bachelor's degree attainment (Adelman, 2006; Attewell et al., 2011; Swanson, 2008) .\nASAP builds and maintains students' academic momentum in a number of ways. Required full-time enrollment is a key element, of course, as it ensures that students move quickly toward earning enough credits to fulfill their degree requirements. Consolidated course schedules mean that there is less opportunity for other demands to interfere with college work. Support services such as advising and tutoring help ensure that students will pass their classes and earn college credits early and often. The financial support offered by the program decreases the likelihood that external barriers, such as the loss of transportation, will get in the way of student momentum."}, {"section_title": "Integration and a Sense of Belonging", "text": "ASAP is also grounded in Tinto's (1993) notion of integration and its influence on student persistence. Tinto argued that students who feel a strong sense of belonging and believe that they have a social and academic home in college are more likely to remain enrolled. Creating connections between students, their peers, and faculty and staff members can improve the likelihood of persistence and, presumably, graduation.\nTinto's theory of integration has become a classic in higher education. Though the theory was developed for traditional students, recent research indicates that it is also appropriate for students attending commuter and 2-year institutions (Deil-Amen, 2011; Karp, Hughes, & O'Gara, 2010 ). An array of community college interventions promoting student integration have had promising results, serving as a model for ASAP. Key among them are learning communities, in which cohorts of students take courses together to build strong relationships with one another and the institution (Engstrom & Tinto, 2008; Scrivener et al., 2008; Tinto, 1997) .\nIntegration and connection to college can also develop from strong relationships with faculty and staff members. Bensimon (2007) argued that \"institutional agents\" encourage students by providing interpersonal connections, advice, motivation, and information. Rendon (1994) made a similar point, while focusing on nontraditional students. She emphasized that such students, who often feel lost or out of place in college, are more likely to be successful if they can identify and interact with individuals who actively provide them with help navigating college and validation that they do, indeed, belong in postsecondary education.\nASAP develops students' sense of belonging through a variety of structures, all of them substantially different from \"business as usual\" on other CUNY community college campuses. Before they even begin their coursework, ASAP students are required to participate in a 2-to 3-day summer institute that includes ice-breaker and teambuilding activities, an orientation to program expectations, campus navigation activities, and small group discussions. These presemester activities allow students to begin building rapport and comfort with each other and on their campuses. Most orientation programs at CUNY, in contrast, are voluntary and last, at most, 1 day.\nOnce the semester begins, CUNY ASAP uses a cohort approach in which students take three to five classes with fellow ASAP students. By traveling together through gateway courses, students form study groups, attend ASAP tutoring together, and develop social networks that might be elusive to a typical CUNY community college student who frequently has different classmates in each course, leaves campus as soon as classes end, and is offered only optional support services. The program's intensive advisement component, in which students are required to meet with a dedicated advisor at least twice a month, encourages connections between students and staff members. Other CUNY students, in contrast, participate in voluntary and noncoordinated support and advising activities."}, {"section_title": "The Need for Timely and Relevant Support Services", "text": "The final prong in ASAP's conceptual framework is the importance of student access to support services. Such support is particularly important for students from educationally or economically disadvantaged backgrounds (Karp, 2011) . Students need to know which services are available and how to access them, but many of the students most in need of academic support are uncertain how to do so (Karp, O'Gara, & Hughes, 2008) . J. E. Rosenbaum, Deil-Amen, and Person (2006) noted that the organization of student support services in many colleges assumes that students have the knowledge, social skills, and motivation to access such services. This assumption may not always be valid, particularly for students from families and communities without collegegoing experience.\nThere is evidence that making academic and social support intrusive can improve outcomes. Random assignment studies of intrusive advising programs, in which students participated in required advising over the course of two semesters and in which advisors had dramatically reduced caseloads, have shown positive effects on students' likelihood to register for subsequent semesters and on the number of credits attempted (Scrivener & Au, 2007; Scrivener & Weiss, 2009 ). However, once the program ended, these results did not last, indicating that support must be sustained over time.\nASAP, in its comprehensive approach, draws from our understanding of the necessity of intrusive supports for community college students. Dedicated advisors are able to meet students' needs, whenever those needs arise and in whatever form. Required student meetings with advisors ensure that the need for help is identified early, and solutions are found and implemented before it is too late. ASAP advisors also check in with faculty members on a periodic basis to identify students in need of additional support. Such intrusive advising is supplemented with the weekly ASAP seminar, or group advising session, and supplemental programs such as career workshops and the ASAP leadership program. Such intensive and personalized advising differs significantly from most advising within CUNY community colleges, which is typically provided via short meetings with whichever generalist advisor is available when students come to the advising center."}, {"section_title": "Data", "text": "Data for this study come from the CUNY OIRA. OIRA collects student-unit records for all CUNY enrollees. Data include demographic variables, including race/ethnicity, age, and income (as reported on the Free Application for Federal Student Aid [FAFSA]); enrollment variables, including terms of enrollment and full-or part-time enrollment status; course data, including all courses in which the students enrolled, the term of enrollment for each course, and grades in the course; and outcomes data, including grade point average (GPA), credits earned, and degrees awarded. Though the OIRA data set used for this study is not linked to high school data, it does allow for the control of previous academic achievement via the inclusion of (a) the college admissions average score (a CUNY-calculated score based on high school performance and reflecting CUNY's college preparatory requirements), (b) English and mathematics scores on New York State Regents examinations, and (c) basic skills assessment test scores for placement into developmental education.\nWe conducted two types of analyses for this study. We first examined student outcomes using propensity score matching. We then examined factors related to ASAP students' graduation, using logistic regression. Our cohort of interest was ASAP's first group of enrolled students (2007-2008 school year, n = 1,132)."}, {"section_title": "Method", "text": ""}, {"section_title": "Propensity Score Matching", "text": "For analysis of student outcomes, we constructed a comparison group of CUNY students who met the same admissions criteria and enrolled in the same majors as ASAP students, but who did not participate in the ASAP program. Notably, comparison students entered CUNY in 2006 (the year prior to ASAP's start) to limit selection bias. Had we used 2007 comparison students, the two groups may have differed in terms of motivation or other unmeasured characteristics, as the comparison group would have been made up of students who could have entered ASAP but chose not to do so. In addition, students enrolled in other intensive support programs were excluded from the comparison group. 4 A total of 1,791 students were included in the comparison group.\nThis constructed comparison group serves as a base that allows us to assess whether the ASAP program in its entirety-mandatory full-time study combined with financial incentives, academic and career advisement, program seminar, and blocked and condensed courses-yields better outcomes than those of similar students who are not mandated to engage in or receive these services. The final data set used for this study contains student-unit records for all students in the treatment and comparison groups from initial entry into either CUNY (for comparison students) or the ASAP program (for treatment students) and continuing for three academic years.\nInitial comparisons between the ASAP and the comparison group found that the two groups differed on characteristics such as age, enrollment status, whether they are a continuing student, and income. When treatment and control groups are not randomly assigned and therefore may differ on characteristics that could potentially influence outcomes, propensity score matching is an appropriate statistical technique for addressing these group differences (P. R. Rosenbaum & Rubin, 1983) . In propensity score matching, subjects are \"matched\" based on a predicted probability, or propensity, of how likely they are to be in the treatment group, given demographic and other preintervention characteristics, and their outcomes are then compared (P. R. Rosenbaum & Rubin, 1983) .\nWith support from Metis Associates, CEO's external evaluator, we used an optimal full matching method for the propensity score analysis. Earlier attempts to use one-toone matching, also known as greedy matching, resulted in losing nearly half the sample due to suitable matches being unavailable. Optimal full matching uses a clustering matching procedure, and yielded better results with only a 2.5% sample loss. 5 In terms of matching variables, it is recommended that as many covariates that may have an effect on the outcome and on selection into treatment be included in the model (Heckman, Ichimura, Smith, & Todd, 1998; Smith & Todd, 2005) . We used the following matching variables in the propensity score matching analysis: gender, race/ethnicity, age, college attended, exemption from taking CUNY assessment test, admission type, dependency status for financial aid purposes, and Pell and TAP grant receipt as a proxy for income, as has been used in other studies (Muraskin, Lee, Wilner, & Swail, 2004; Engle & O'Brien, 2008) . Outcome variables of interest included 1-year retention, 2 and 3-year graduation, credit accumulation, and GPA."}, {"section_title": "Logistic Regression", "text": "To examine potential influences on student outcomes, specifically graduation, we also conducted a logistic regression analysis using a subsample of only ASAP participants. We used a sample of ASAP students who began in fall 2007 ASAP cohort and remained enrolled in their initial college each spring and fall for four semesters. Including only students who were continuously enrolled ensured that the results were not skewed by students on medical leave or who had other, nonmotivational, reasons not to attend program activities; 761 students met these criteria.\nOur analyses sought to examine the influence of academic momentum and integration on degree attainment. The specific predictor variables of interest in the model are academic achievement (measured as the number of credits accrued after one semester and cumulative GPA after two semesters) and intensity of program participation (measured as the number of ASAP advising sessions attended during the 2nd year of enrollment).\nWe estimated three separate logistic regression models predicting 2-year graduation. Using three models allowed us to verify model strength as additional predictors are added. Table 1 lists and operationalizes all variables used in these models. The first model includes demographic variables, as we know that student demographic characteristics alone can impact graduation (Cook & Cordova, 2007; Goldin, Katz, & Kuziemko, 2006 ). The second model adds high school achievement variables, which have been found in prior research to have an effect on college graduation (Adelman, 2006; Bowen, Chingos, & McPherson, 2009) . The final full model adds college performance and engagement variables, as these variables have been found to possibly affect retention and graduation (Adelman, 2006; Herzog, 2005; Rendon, 1994; Tinto, 1993) .\nTo include all 761 students in the analysis, we imputed missing data using the multiple imputation function in SPSS for 292 students who did not have a complete record. Of the entire sample, students had missing data on the following variables: Math Regents scores (25.5%), English Regents scores (24.3%), high school average (10.3%), and income (13.7%). Missing data for high school variables was mostly due to late applicants, whose high school data did not make it into the central database, and transfer applicants, because they did not have to provide a high school transcript. Missing data for the income variable was a result of students not filing the FAFSA. Multiple imputation uses all predictors in the model, besides the missing variable, to estimate the missing value by calculating a pooled estimate value for each missing data point based on five separate iterations. "}, {"section_title": "Results", "text": ""}, {"section_title": "Description of ASAP and Comparison-Group Students", "text": "Descriptive analyses indicate that ASAP is enrolling its target population. Table 2 shows the demographic and background characteristics of ASAP and comparison students upon entry into the study. ASAP students, like community college students nationally and within CUNY, were more likely to be female than male (54% vs. 46%). The majority were Hispanic (37%) or Black (32%). ASAP students were relatively young: Nearly 60% were 18 or younger at the time of program entry, and the average age of ASAP students at the time of admission was 20. The vast majority of ASAP students were first-time freshmen, though one quarter of the sample were continuing CUNY or transfer students. Most students were from economically disadvantaged homes, as 58% of the group was eligible for Pell grants and the mean family income was US$38,725. ASAP students were also relatively academically proficient, with high school academic grades averaging in the C range.\nAs noted, though the comparison group comprised students who met the same admissions criteria as ASAP participants, the two groups differed on a number of variables. ASAP students were more likely to be Hispanic or Black and less likely to be White or Asian. They were less likely to receive Pell grants and had higher household incomes than comparison-group students. ASAP students were also younger, with a much higher percentage of students who were 18 years old or younger at the time of college entry. Comparison students were less likely to be first-time freshmen and more likely to be continuing or transfer students.\nA primary goal of ASAP is to move students quickly toward a degree. Longitudinal data (not included in Table 2 ) reveal that after 2 years, 30% of ASAP students had earned a degree, while only 11% of comparison-group students had done so. Three years after enrollment, this difference in graduation rates remained, with 55% of ASAP students having earned an associate's degree as compared with 25% of comparisongroup students. One could argue that the difference in graduation rates is not necessarily affected by the ASAP program as a whole but is driven solely by the fact that ASAP students are required to enroll in college full-time for 2 years, while comparison students may have enrolled part-time after their first semester. However, when we look at only those students enrolled full-time for 2 years, the difference in graduation rates remain: 43% of ASAP full-time enrollees (n = 1, 132) graduated within 3 years; 30% of comparison students (n = 1,791) did so. This result indicates that full-time attendance alone is not responsible for this large difference in graduation rates. First, as noted, comparison students who did attend full-time for 2 years still graduated at lower rates than ASAP students. Second, ASAP students had the option of leaving the program and attending college part-time (just as comparison-group students decided each semester whether to reenroll full-time or drop to part-time status). ASAP students tended to remain enrolled full-time at a higher rate, which indicates that the broader ASAP program may influence students' enrollment decisions and subsequent graduation.\nIn this study, we were particularly interested in the effectiveness of the ASAP program in its entirety. Our contention-and what this study sought to test-is that the ASAP model encourages full-time enrollment and other behaviors that increase students' likelihood of completion. Therefore, the remainder of our analyses examines the complete comparison and treatment groups, to ascertain the influence of the ASAP model as a whole on student outcomes."}, {"section_title": "Outcomes After Optimal Full-Propensity Score Matching", "text": "Controlling for student characteristics via optimal full-propensity score matching, the short-term impact of ASAP participation on retention was statistically significant, with ASAP students having a 12% higher reenrollment rate (i.e., 1-year retention rate) in their initial CUNY college than comparison-group students. Moreover, after three semesters of enrollment, ASAP students had earned nearly four more credits than had comparison-group students. There were no impacts on students' GPAs during their early course taking. Table 3 summarizes these short-term outcomes and shows the average program impact for each outcome in the column showing statistical mean differences.\nThe academic momentum gained by ASAP students propelled them to stronger long-term outcomes than their nonparticipating peers. Again, after propensity score matching, ASAP students continued to be advantaged in terms of credit accumulation and, ultimately, graduation rates. Table 3 also shows long-term outcomes for these two groups of students, including the average program impact for each outcome. ASAP students continued to accumulate credits at a greater rate than their similar peers-on average, 6.6 more credits 3 years after initial college enrollment. However, ASAP students earned grades that were no higher than those earned by comparison-group students. The most striking differences between the two groups are seen when we look at their graduation rates. Two years after their initial enrollment in college, 30% of ASAP students had earned an associate's degree, compared with 12% of comparison students-a difference of nearly 20% and almost two-and-one half times as many students. After 3 years, the difference in graduation rates rises to nearly 30%; 55% of ASAP students had earned an associate's degree compared with 26% of comparisongroup students. In other words, for every one comparison-group student who graduated within 2 years, two ASAP students graduated."}, {"section_title": "Predictors of 2-Year Graduation", "text": "The above results indicate that the ASAP program, as a whole, leads to positive results for students. To better understand why ASAP appears to positively influence student outcomes, and to provide information on the potential efficacy of two key elements of the model, academic momentum and integration, we examined the influence of ASAP participants' academic performance and advising experiences on graduation. We used logistic regression analysis to compare similar ASAP graduates to nongraduates.\nAs noted in the methods section, we constructed a subsample of ASAP students, all of whom were enrolled continuously for four semesters. Descriptive information about this sample, which we refer to as the logistic regression subgroup, is shown in Table 4 . As with the full ASAP sample described earlier, the majority of students in this subgroup was female. The logistic regression subgroup was also similar in the percentages of Hispanic and Black students enrolled, with these two groups comprising nearly 70% of the subgroup. Forty-one percent of students in the logistic regression subgroup graduated within 2 years. Table 5 shows the results of the logistic regression models. We found that female students were more likely to graduate than male students and that there were no significant differences between racial groups. Expectedly, we found that continuing students were more likely to graduate in 2 years than first-time freshmen.\nIn the second model, which includes high school achievement variables, we found that college admission average was a significant predictor of graduation; however, that effect faded when college performance variables were included. In our full model with college performance and engagement variables, we found that all three variables (firstsemester credit accrual, GPA after two semesters, and advising sessions during the 2nd year) were significant predictors of 2-year graduation. That credit accrual and GPA influence graduation is not surprising, as these variables indicate that students are performing well and progressing toward a degree. The most interesting finding, however, is the large, significant effect of advisement on 2-year graduation. Results indicate that, while holding all variables constant, for a one standard deviation increase in the number of advisement meetings throughout the 2nd year (16 meetings), we expect to see a 53% increase in the odds of graduating within 2 years. Reporting this same effect using a delta-p calculation, we can also say that the probability of graduating increases by 10% for one standard deviation increase above the average number of advisement meetings.\nHowever, these results could be driven by student characteristics such as motivation, rather than the advising experience itself. We therefore investigated whether there was a relationship between number of advising sessions and student characteristics. We broke the logistic regression subsample into four quartiles, based on how many advising sessions students attended during their 2nd year of college enrollment, 6 and we compared characteristics of students in each of the four quartiles, using oneway analysis of variance to see whether there were any differences that might indicate a selection bias in the logistic analyses. Table 6 shows that there are few significant differences between quartiles on most variables. However, older students attended fewer advising sessions than younger students. Unexpectedly, both household income and the number of credits earned during the first semester were negatively correlated with advising. Though we might expect more advantaged and more academically successful students to make better use of available advising services, our data indicate that students who are most at risk of failure due to family or educational background actually see their advisors more often.\nThese findings indicate that the logistic regression findings are unlikely to be positively skewed due to student characteristics. Better-prepared students do not seek out advising at higher rates. This increases our confidence that the positive relationship between advising and graduation is driven by the advising itself."}, {"section_title": "Discussion", "text": "This study examined the impact of participation in CUNY's ASAP initiative on community college students' retention in and completion of associate's degrees. ASAP aims to improve student progress toward a degree and attempts to achieve this via a comprehensive and intensive series of supports. Using propensity score matching, we compared ASAP participants with similar nonparticipants. ASAP participation positively influenced a wide range of academic outcomes, including retention and credit accrual. Most importantly, ASAP students were significantly more likely to earn degrees than comparison students. Three years after enrollment, 55% of ASAP students had earned a degree, while only 26% of comparison students had done so.\nWe also used logistic regression analysis to understand potential influences on the outcomes of ASAP students. Examining a subsample of ASAP students, and comparing those who graduated to those who did not, we found that one significant predictor of graduation was participation in academic advising. Importantly, students who participated in advising at low and high rates did not vary on most demographic or academic variables, indicating that it was advising-not motivation or ability-that drove these results.\nThe findings extend our understanding of ways to promote student success in the community college. First, they provide additional evidence that helping students gain academic momentum can improve long-term outcomes (Adelman, 1999 (Adelman, , 2006 Attewell et al., 2011; Calcagno et al., 2007; Goldrick-Rab, 2007; Swanson, 2008) . The ASAP students in our sample had positive early college experiences, as compared with nonparticipating students. Notably, participants accrued more credits during their 1st year of enrollment. This credit accrual continued, though at a lower rate, over the next few years, culminating in stronger graduation rates for ASAP students. The findings also support the importance of integration (Tinto, 1993 (Tinto, , 1997 , institutional agents (Bensimon, 2007; Rendon, 1994) , and intrusive supports (Karp, 2011; J. E. Rosenbaum et al., 2006) for community college students. ASAP, as a whole, is a supportive, cohort-based program, so its positive influence on student outcomes supports these conceptualizations of student success. But the logistic regression analysis takes this one step further, identifying one specific way of operationalizing institutional agents and intrusive support-mandatory, frequent, one-on-one advising-and correlating such support with student success.\nThe findings also provide empirical support for newer theories of student success in the community college. Recent authors and practitioners (see, for example, ScottClayton, 2011) have theorized that \"structuring\" students' community college experience, by limiting their choices and providing clear curricular pathways, can improve student outcomes. Few empirical studies have supported this contention as of yet, however. ASAP provides structure to students' community college experiences by limiting their choice of major and scheduling options. The positive findings presented here likely stem, in part, from such structure and so represent some of the first empirical support for the \"structure hypothesis\" that is now prevalent in the community college field.\nOne of the key frustrations among community college practitioners and researchers today is that many programs that seem to improve student outcomes at first fall prey to a fade-out effect. Initial gains disappear after subsequent semesters. This is true for learning communities (Scrivener et al., 2008) , enhanced guidance and counseling (Scrivener & Weiss, 2009; Visher, Butcher, & Cerna, 2010) , and student success courses (Weiss, Brock, Sommo, Rudd, & Turner, 2011) .\nThe failure of such programs to result in long-term effects have led to questions about the efficacy of an \"inoculation\" approach, in which it is assumed that early intervention can lead to long-term change in outcomes. The findings presented here support the notion that inoculation is not enough, and that longer-term interventions are likely necessary to meaningfully move the needle of community college graduation rates. ASAP's promising outcomes are the result of a long-term, ongoing and intensive program lasting 3 academic years.\nAnother key finding from this study has to do with the importance of advisement. Much has been made of the poor state of advisement services at the community college (see, for example, Grubb, 2006) . And we have already noted that good advising is seen as a key mechanism for improving student outcomes (Karp, 2011; J. E. Rosenbaum et al., 2006 ; see also Metzner, 1989) . The findings presented here provide additional evidence that advisement can improve student outcomes.\nThe logistic regression findings can be interpreted to indicate that creating new advising structures that allow for individualized advising occurring more than once a semester could improve student outcomes. But it is important to note that the mean advising rate for ASAP students was already high-an average of 16.3 meetings during the 2nd year of enrollment. This is much higher than the level of advising offered to most students on most community college campuses.\nThe findings presented in this article call for a rethinking of how advising is delivered at community colleges. To provide the level of advising services received by ASAP students to all students, let alone the amount of advising received by those to whom the additional benefits found in the logistic regression accrue, would require additional advisors and of course, funds. It also requires shifting the way advising services are provided-from a drop-in, voluntary model to something more frequent, mandatory, and structured. Though the logistical and implementation challenges to doing this are many, the findings presented in this article provide strong evidence that doing so can meaningfully improve student outcomes, even for the most academically vulnerable students.\nThe study presented here has a number of limitations. First, the students included in the 2007 cohort were somewhat unique among community college students. Students began the program without needing any remedial coursework, although 28% required and completed remediation prior to enrolling in ASAP. As such, they are not entirely representative of the broader community college student population. In addition, despite the use of propensity score matching techniques, this study also cannot say for certain that the positive outcomes presented are due to the program rather than preexisting characteristics. The findings may be correlational, rather than causal, though a randomized study of the ASAP initiative is currently in progress.\nDespite these limitations, the findings presented here strongly support the notion that community college students' outcomes can be improved via their participation in an intensive, structured, and supportive program. ASAP students were more successful than similar peers on a range of outcomes. Moreover, one specific program element, advising, is related to graduation rates. This study suggests that helping students by giving them personalized guidance and frequent support over multiple semesters can greatly increase their chances of obtaining a college credential."}]