[{"section_title": "I. Introduction", "text": "In the United States, there has been an increased policy interest and emphasis on assuring food security, particularly among children. The interest in achieving food security was a policy objective that President Barack Obama campaigned on during his 2008 election, which he addressed specifically in a campaign position paper, \"Tackling Domestic Hunger,\" which became the blueprint for his \"Ending Childhood Hunger By 2015\" initiative. This interest has heightened as a result of the Great Recession in 2008 which led to dramatic increases in food insecure households (12.2% to 16.4%), and very low food security (4.0% to 5.8%) (Gunderson, Kreider, and Pepper, 2011, p.285). As of the most recent data, the USDA reported 14.5% of households were food insecure, with 21.6% of children living in food-insecure households (Joyce et al. 2012 p.1). The impact of food insecurity on children's development is well documented. From a developmental perspective, it is believed that food insecurity has cumulative effects at different stages of development beginning in the prenatal period (Bhattacharya, Currie & Haider, 2004;Cook & Frank, 2008;Duncan, Brooks-Gunn & Klebanov, 1994;Pollit, 1994;Morgane, Austin-LaFrance, Bronzino, et al., 1993;Scholl, Johnson, 2000). During infancy, hunger has negative effects during the period of neurodevelopment. Controlled experiments with animals suggest that hunger results in irreversible damage to brain development such as that associated with the insulation of neural fibers (Yaqub 2002). The damage associated with a lack of nutritional intake accumulated during the first 2 years of life include susceptibility to infections, slowed cognitive development, slow growth, susceptibility to chronic diseases, girls are at higher risk of having low-birth weight babies; and other non-health related problems such as reduced school performance, increase school dropouts and reduced productivity during adulthood (Hoddinott, Beherman, Maluccio, Flores & Martorell, 2008). During schooling years, food insecurity is associated with poor school performance and academic achievement (Roustit, Hamelin, Grillo, Martin & Chauvin, 2010;Maluccio et al., 2006;Cook & Frank, 2008). Neurologists and psychologists suggest that the impact of food insecurity on learning can be attributed to two mechanisms. First, there is a direct effect on cerebral functioning, which defines child's cognitive abilities. Second, there is an indirect effect on physical and psychological health that contributes to distraction, absenteeism and low motivational abilities for learning. Thus, the evidence indicates that the effects of nutritional inadequacy persist across childhood but that the causal mechanisms may vary at different period of biological, cognitive and social development. This paper contributes to the prior literature on food insecurity by exploring the effect of nutritional policy on food insecurity in households with children. We examine the change in food security as children age of out Women, Infants and Children program (WIC). . Specifically, we exploit a discontinuity in WIC participation directly related to the age of children. According to federal WIC program eligibility rules, children remain eligible for WIC until their fifth birthday. In other words, children are eligible until the day before they turn 61 months old. At that age, WIC eligibility ends, perhaps because it is presumed that most of the children are starting kindergarten, and transitioning into the school-based free and reduced-price food programs, the National School Lunch Program (NSLP) and the School Breakfast Program (SBP). In the section that follows, we describe the host of current nutritional assistance programs for which low-income households may qualify and previous research on their efficacy with regard to food insecurity. The next section briefly describes the data and the variables used in the analysis."}, {"section_title": "4", "text": "Our empirical strategy is discussed in section IV, while results are discussed in section V, potential manipulation in section VI and specification and robustness checks are discussed in section VII. Our main finding is an increase in household food insecurity for families with children around 61 months of age likely due to causes addressed as part of the lack of WIC nutritional supplements. Our estimates imply that WIC's age ineligibility increase food insecurity by 7-14 percent of the control mean. Finally, the last section discusses limitations, further analysis and policy implications of the results."}, {"section_title": "II. Policy Context", "text": "The federal food and nutritional safety net is currently a patchwork. Program services may be delivered in the form of vouchers, (near) cash supplements, or directly as food. Services may be available to specific members of the household only or to the entire household. In addition to household income eligibility, children's eligibility for a specific program may depend upon their age and the income level of others in their day-care or school. The result of this hodge-podge of food and nutritional programs is that different households with similar income levels and numbers of children, may be receiving substantially different bundles of food assistance. While variation may occur across the entire childhood period, there is a significant transition in the types of food and nutrition programs for which children qualify as children reach age five and become eligible to enter kindergarten. The main federal food and nutrition assistance program that targets children from birth to age five is the Women, Infants and Children program (WIC). The WIC program provides supplemental food assistance, nutrition education and health referrals to low-income pregnant and post-partum women, and to children under age five at nutritional risk. In order for a household to be income eligible, gross net income must be below 185 percent of the federal 5 poverty line for the household size or participate in the Medicaid program. In the fiscal year 2011, 8.9 million individuals per month received WIC benefits, with a little over half of the participant's children older than 1 and younger than 5 years of age (USDA 2012). 1 Several studies have demonstrated WIC participants benefit from participation across a range of outcomes beginning with pregnancy and birth outcomes, improved iron status among preschoolers, lowered prevalence of iron-deficiency anemia among young children and reduced levels of household food insecurity and food insecurity with hunger (Cook, Frank, Levenson et al., 2006;Lee, Mackey-Bilaver & Chin, 2006;Kennedy, Gershoff, Reed & Austin, 1982;Bitler and Currie 2005;Metallinos-Katsaras et al. 2010). According to the U.S. Census Bureau (2011), 4.1 million Americans were five years of age in 2010, with 79 percent of them enrolled in Kindergarten or elementary school. However, only 57 percent of the 4.1 million 5-year-old children attended full-day kindergarten or elementary grade. This is an important issue because WIC eligibility ends at age 5 and only children attending a full-day program may have access to the NSLP. Thus, it is unclear the extent to which the NSLP provides a good substitute for the nutritional benefits available through participation in WIC. Moreover, according to Dahl and Scholz (2011), participation rates among eligible children are only 75 percent for the NSLP. We consider the impact of aging out of WIC on household-level food security status. Participation in food and nutrition programs that increase the supply of food to children may be observed to have an effect not only the food security status of the children participating, but may also increase the food consumed by adults in the household. Qualitative reports suggest that children may be buffered from the reduced food intake by other adults in the households (Polit, London, & Martinez, 2001). Consequently, our analyses will evaluate the effect of WIC's child eligibility age cut-off on the food security status (food insecure, low food security and very low food security) of the household. Specifically, our investigation exploits a discontinuity in children's age. As children reach age 61 months, they lose eligibility for WIC. This federal rule is applied uniformly across all the states in the US. Moreover, children who reach 61 months qualify to attend kindergarten and therefore transition into the formal school system at the next fall and can potentially get access to federal school nutrition programs at that point. We show that WIC participation for children just below the 61 month age cutoff (the treatment group) is observable, while children whose age is just above the cutoff (the control group) do not participate in WIC. These findings come from the Early Childhood Longitudinal Study Birth cohort (ECLS-B), which tracks a national sample of children who were born in 2001."}, {"section_title": "III. Data", "text": "This study uses data from the Early Childhood Longitudinal Study, Birth Cohort (ECLS-B), a study conducted by the National Center for Education Statistics (NCES) to examine the development, health and learning environment of a single cohort of US children who were born in 2001. It utilizes a multi-reporter, multi-method design to gather extensive information about children's home, parenting practices and behavior, as well as educational experiences. The ECLS-B collects data for 10,700 children and was designed to contain a nationally representative sample of ethnically and socio-economically diverse families followed in four waves: 9 months, 24 months, 48 months and at Kindergarten entrance. This last wave of data was collected at two different points in time: 7,000 children attended Kindergarten in 2006 and 3,700 children attended Kindergarten (or went directly to grade 1 without going to Kindergarten) in 2007. Our analysis includes an initial sample of 4,300 children, the ones who attended Kindergarten in 2006 and did not have a twin sibling. This sample is selected because we examine the causal effect of aging out of WIC (absence of the WIC program) and the effect of transitioning into the school system on food insecurity. Thus, ECLS-B wave 4 data provides the perfect sample: children who are around 61 months old and are transitioning into Kindergarten. Moreover, we only use ECLS-B focal children who do not have a twin sibling because a family with twins will be receiving twice as much food as families without twins. It is also important to notice that ECLS-B oversampled certain groups that are relatively rare in the general population; one of those groups was twins. We use two different outcome variables: food insecurity in households with children and very low food security in households with children 2 . More than 99 percent of the eligible sample answered the Food Security battery of questions, which is a well-validated questionnaire developed by the USDA to measure food security over the prior twelve months. We believe that it is possible for the causal effect of aging out of WIC on food insecurity to be present in two outcomes: food insecurity and very low food security in households with children. Eighteen questions are considered in order to rate food security for households. Using validated cut-points, we consider a household to be food secure if 0 to 2 items in the scale were answered affirmatively (this category is often referred to as high and marginal food security). If three or more items were answered affirmatively, we consider a household to be food insecure (USDA considers three different categories: marginally food security, low food security and very low food security). We consider a household to be very low food secure if 13 to 18 items in the scale were answered affirmatively. Our variable of interest is participation in the Special Supplemental Nutrition Program for Women, Infants, and Children (WIC). Thus, only children who were eligible for WIC were included (2,100 observations included). To be eligible, a household must have household income at or below 185% of the poverty level or participate in the Medicaid program. On the basis of household income and household size relative to the income at the 2005 US poverty threshold, we placed children into an income-to-poverty-ratio category of at or below 1.85. At the wave 4 interview, Kindergarten entrance, mothers reported whether their child was a Medicaid recipient or not and the number of months a child has been participating on the Medicaid program. We use covariates that were collected in different waves. At the 9-month interview, mothers were asked to designate the child's race and ethnicity by using the same categories as the ones used in the 2000 US Census. We used these responses to create four mutually exclusive racial/ethnic groups: non-Hispanic white, non-Hispanic black, Hispanic, and other. Also, at the 9-month interview, information about child's gender was collected. Child gender was measured using a dichotomous variable. At the preschool interview, mothers reported whether their children attend or attended in the past to a center care. Center care attendance was measured using a dichotomous variable. At the wave 4 interview, Kindergarten entrance, mothers reported their educational attainment and marital status. Maternal educational attainment was measured using a dichotomous variable that took a value of 1 if the mother's highest educational level was high school diploma and 0 otherwise. Marital status was measured using a dichotomous variable that took a value of 1 if the parents were married and 0 otherwise."}, {"section_title": "IV. Empirical Strategy", "text": "This paper uses longitudinal data to explore dynamics in household food security. Analyses of dynamics in household food security find that economic shocks, such as earnings loss, as well as other household shocks, such as a change in mental health status or household composition, are related to changes in household food security status (Gundersen and Gruber 2001;Rose 1999;Heflin et al. 2007;Bhargava, Jolliffe and Howard 2008;Ribar and Hamrick 2003). However, one possible concern is that economic disadvantage has also been shown to be associated with transitions in program participation (Jacknowitz and Tiehan 2009;Gundersen 2005), suggesting that endogeneity is a serious concern that may hinder the identification of a program treatment effect. We use the discontinuity in nutritional federal program funding at age 61 months to identify impacts by comparing outcomes for children in treatment and control groups \"near\" the age cutoff. Identification comes from the assumption that potential outcomes (household and children food insecurity) are smooth around the cutoff. The essence of our research design is to examine whether discontinuities in WIC participation at the age of child cutoff are mirrored by discontinuities in child food insecurity and household food insecurity. Our analysis is conducted using individual level data, the level at which the ECLS-B study reports information on children and their families. The dependent variable used in our model is FI i , which represents a food insecurity outcome for child i; our variable of interest is WIC, which represents WIC program participation in 2006; and our cut-off variable is Age, that represents child in months in 2006. Let the index (i) be defined over children sorted in ascending order by their age in months, such that i=56 is the youngest child and the age cutoff occurs at age=61 months. Thus, the end of the WIC program and the transition into school nutritional programs is a deterministic function of age of child, where A 61 indicates that the age of child in months is equal to 61. We use the sharp RD to estimate discontinuities in food insecurity at the age cutoff. Our main estimating equation is given by: is an unknown smooth function of age, and  is the impact of WIC participation. The effect that we look at identifying is the one relevant to children near the age cutoff. Thus, we intend to identify a local average treatment effect. Identification of the causal effect of the absence of WIC comes from assuming smoothness in potential outcomes near the age cutoff (Porter, 2003  However, our preferred estimates relax the functional form assumptions and use the nonparametric RD approach of Hahn, Todd and Van der Klaauw (2001). This method uses local linear regressions (Fan & Gijbels, 1996) to estimate the left and right limits of the discontinuity, where the difference between the two is the estimated treatment impact. We estimate this in one step using the triangle kernel weights, which is boundary optimal (Cheng, Fan, and Marron, 1997). Nichols (2007) developed a program in STATA to estimate causal effects using a regression discontinuity design based on the characteristics previously described. We used this program to perform our estimations. As suggested by Imbens and Lemieux's (2008), we also show estimates with the simple rectangular kernel and verify the robustness of the results. Another item to note is that there is not a consensus on the literature about the bandwidth selection. We use graphical inspection comparing the local polynomial smooth with the pattern in a scatter plot. Because different bandwidth choices could produce different estimates, we report three estimates as an informal sensitivity test. Starting with a bandwidth of 12 percentage points on either side of the cutoff, we shrink the interval to 3 percentage points around the cutoff and show that results are not sensitive to the bandwidth choices. Our tables show results for two different scenarios. The first uses the whole sample of children who answered wave 4 questionnaires but not wave 5 questionnaire (kindergarten attendance) and uses 61 months as the cutoff variable; this first scenario does not constrain the sample to WIC eligible children. The second scenario uses 61 months as the cutoff variable and also restricts the sample size to all children who are at or below 185% of the poverty line or participated in Medicaid. We use these restrictions because only children whose families are at or below 185% of the poverty line or are enrolled in Medicaid are eligible to participate in the WIC program."}, {"section_title": "V. Potential Manipulation", "text": "The validity of our regression discontinuity design rests upon the assumption that individuals cannot manipulate the assignment variable. Because the cutoff was based on a predetermined variable (date when the child was born), the usual concerns about strategic behavior with the regression discontinuity design do not seem to be an issue. It is really difficult to imagine that mothers would manipulate the age of their children, because they can be registered into the program since they are pregnant. Thus, states will collect information on age of child based on birth certificates. Manipulating the age of a child seems very unlikely. Another concern is strategic behavior for receiving WIC. It is possible that because women want to continue receiving a WIC benefit, they continue getting pregnant and having more children. To avoid this possibility, we present findings with a sample that only includes ECLS-B focal children who do not have younger siblings. Another potential threat to our identification strategy is that even when children remain eligible for WIC until their fifth birthday, parents might not recertify their children when they are close to turning 5 years old if parents have to recertify frequently and if the recertification process is costly, such as involving excessive paperwork. If these recertification conditions were present, or if states have different rules for recertification, a sharp RD design would not be appropriate, but we would instead use a fuzzy RD design (Imbens & Lemieux, 2008). After looking at the WIC recertification rules for all states, we found that children have to be recertified every six months when they are between 3 and 5 years of age. Moreover, ECLS-B asks parents who used WIC when the focal child was 48 months old but did not use WIC at wave 4 (when the focal child was between 56 and 72 months old) why they no longer used WIC. Only 0.4% answered that benefits were not worth the time and effort for recertification. Thus, recertification does not seem to be a threat to our identification strategy. Our preferred estimates use a nonparametric approach to control for unobserved variables that vary with children's age (Hahn, Todd, and Van der Klaauw, 2001;Ludwig & Miller, 2007). We also show results for more parametric approaches. With both types of specifications, nonparametric and parametric, we present a regression discontinuity design with and without covariates. In principle, covariates are not needed for identification in this type of design; however, they can help reduce sampling variability in the estimator and improve precision. It is possible that individuals in the left and right of the threshold differ in observed characteristics. Accounting for these differences in covariates is important to reduce bias. As with many regression discontinuity studies statistical power is an issue. However, in this specific case it does not seem to be a problem because we have enough observations in the vicinity of the cutoff. The main advantage of using ECLS-B is that it gathers information of a single cohort of children who are followed from birth to kindergarten entrance. This dataset provides us with enough cases even when different constraints are needed to fulfill WIC's eligibility criteria and to overcome potential threats to validity."}, {"section_title": "VI. Results", "text": "We begin by presenting descriptive statistics for children whose ages are below the cutoff point of 61 months and those above the cutoff in order to verify whether the basic assumption of the regression discontinuity design holds in our sample; namely, whether in the absence of the treatment, children near the cutoff point are similar. In other words, we expect the covariates (child, maternal, and family socio-demographic characteristics) to be similar for \"treatment\" (children with ages below the cutoff of 61 months) and \"control\" (children with ages above the cutoff of 61 months) children. The first two columns in Table 1a compare sample means for children below the cutoff point of 61 months of age and those above the cutoff point. The sample uses ECLS-B focal children who do not have a twin sibling. We observe that for the 200 \"treatment\" children with ages below the cutoff of 61 months, WIC participation is 31%, while for the 4,100 \"control\" individuals, WIC participation is 0%. We also note that household food insecurity is 3% higher for the \"control\" individuals in comparison to the \"treatment\" individuals. As expected, the different covariates show similarities between the \"treatment\" and \"control\" group for race/ethnicity, gender, maternal education, parental marital status as well as child's attendance to a center care. Exceptions include the month when the interview took place for different children 3 .. At narrower intervals around the cutoff point, 3%, 6%, and  12% significant differences in food security persist for children below and above the cutoff point; however, most differences in the covariates are statistically insignificant. For the narrowest interval, there is not statistically significant difference between \"treatment\" and \"control\" groups for the month when the interview took place; but an exception occurs for the widest interval 4 . Table 1b also compare sample means for \"treatment\" and \"control\" groups but constraint the sample to WIC eligible children. Table 1b constraints the sample to ECLS-B focal children whose household income is at or below 185% of the poverty level or participate in the Medicaid program. Table 1b shows similar results to the ones found in Table 1a. Four images are displayed in Figure 1. The left image on panel A shows a scatter plot of age in months versus WIC participation. We can observe that children ended their participation in WIC at 60.9 months of age. This means that self-report is consistent with eligibility criterion and participation. The image on the right side of panel A shows a scatter plot of child age in months versus household food insecurity. We can observe that household food insecurity is higher for children who are 61 months or older. These two graphs together indicate that is highly likely that there is a causal effect of aging out of WIC on food insecurity for households with children. Panel B shows similar scatter plots. The image on the left is exactly the same as the one showed in panel A because it depicts the relationship between age of child and WIC participation. The image on the right side shows the association between age of child and household food insecurity with severe hunger. Similar to panel A, we observe that household food insecurity with severe hunger is higher for children who are 61 months or older. However, because the number of \"yes\" for household food insecurity with severe hunger is relatively small, it is possible that the effect, even when positive, is not going to be statistically significant. Results from our visual inspection are confirmed in table 2. We show that difference in household food insecurity around the age 61 months cutoff shown in table 1 is driven in large part by a sharp drop-off in WIC participation at the cutoff itself. The first three columns present results for the first scenario where the cutoff is 61 months of age and the sample is constrained to ECLS-B focal children who do not have a twin sibling. The next three columns show results for the second scenario where the cutoff is 61 months of age and the sample is constrained to ECLS-B focal children who do not have a twin sibling and who live in families at or below 185% of the poverty line or are Medicaid recipients. Table 2 shows local effects of aging out of WIC on household food insecurity using kernel triangle weights. Within each scenario, we report results from nonparametric RD specifications with varying bandwidths. We present the local Wald estimator (local treatment effect). We also account for the possibility that individuals in the left and right of the threshold differ in observed characteristics. In this type of design, however, we expect that children around a vicinity of the threshold (bandwidth) are similar to each other, in other words, we expect that children on the left and right side of the threshold do not differ in observed characteristics, so that this design can actually replicate what might happen in a randomized experiment, and therefore we could be able to establish causality, and find at least a local average effect. We observe that for both scenarios and all bandwidths, the local Wald estimator shows a statistically significant and positive effect. In other words, estimations show that aging out of WIC increases household food insecurity. We can visually observe these estimated discontinuities at age cutoff in household food insecurity for different bandwidths in figure 2. It is useful to remember that scenario 2 constrains the sample to WIC eligible children using both an income eligibility threshold and Medicaid participation. Therefore, the scenario we should use to make inferences is scenario 2. However, we also show results for scenario 1 because the sample size for scenario 2 is relatively small around the vicinity of the cutoff point. The reason why is because round 4 data is collected by the time children are entering into Kindergarten. The youngest child is 56 months and the oldest is 72 months; that means that our sample is skewed to the right around the cutoff point and that less than 15% of the sample is on the left side of the cutoff point. Even when empirical research suggests having at least 100 children on each side of the cutoff point (and our sample size allows us to have that number of children for the most restricted scenario) someone might raise suspicion about having the minimum sample size. The literature also suggests showing different bandwidths. However, following Porter (2003), we found that the optimal bandwidth in our case is 6%. Thus, our findings show that aging out of WIC (considering all scenarios and the optimal bandwidth) increases household food insecurity between 7% and 13%. For scenario 2 (WIC eligible children) our findings show that aging out of WIC increases household food insecurity in 13% when using the optimal bandwidth. Table 3 shows local effects of aging out of WIC on household food insecurity with hunger using kernel triangle weights. Similar to table 2, within each scenario, we report results from nonparametric RD specifications with varying bandwidths. We observe that for both scenarios and all bandwidths, the local Wald estimator is close to zero. In other words, estimations show that aging out of WIC does not have any effect on the more restrictive measure of household food insecurity with hunger. These results suggest that aging out of WIC affects food insecurity but not food insecurity with hunger. It is possible that the short-period of time when a child lacks of a WIC substitute is not enough to cause food insecurity with hunger. Let's remember that the food security battery of questions used in ECLS-B and in most national studies (because it follows the USDA guidelines) suggest that severe food insecurity may exist in a household when a household has affirmative answers for thirteen or more indicators out of a total of eighteen. This method categorizes a household as food insecure with hunger if it has affirmative answers for the questions that ask about frequency, such as whether a child or a household member cut the size of a meal, skip meals, do not eat for a whole day, among others, for more than 3 months."}, {"section_title": "VII. Extensions and robustness checks", "text": "In this section we present the stability of our estimates to alternative specifications. Specifically, we estimate the effects of leaving WIC on a sample limited to oldest siblings, with the Panel Study of Income Dynamics, and by randomly varying the cut-off point. We conclude that our estimated aging out of WIC effect is extremely robust to the usual specification checks performed in RD studies. In table 4, we perform alternative specifications. We first exclude all control variables from the regressions, and find virtually no change in the estimates. This is to be expected, because the values of pre-treatment covariates should not be affected by the estimated jump at the cutoff date in a valid RD design. We next explore what happens when we use a rectangle kernel weight, rather than a triangle kernel weight. The estimated coefficients are slightly smaller, although still statistically significant. We next exclude all children who are not the youngest focal children in the household. There is a concern that if the focal child has younger siblings, the household may continue receiving a WIC benefit through the eligibility of a younger sibling. In these cases, the household may continue to participate in WIC, but would only be eligible to receive benefits at a reduced value. The effect that we are trying to estimate would then only be partial. If present, this would likely attenuate our findings. We also try a specification that excludes focal children with twins and focal children with younger siblings at the same time. Both of these alternative samples yield similar results compared to our baseline estimates. As a further check, we use another dataset, the Panel Study for Income Dynamics (PSID) to get more observations on the left side of age 61 months. Because ECLS-B only interviews children when they enter into kindergarten or the school system, the younger children were not interviewed in 2006 (because they were too young to go to Kindergarten), but in 2007. Thus, these children were not in the vicinity of 61 months in 2007 anymore. For that reason, we do not have as many children below 61 months as we do above 61 months on 2006. The sample size for children between 50 and 72 months old is ¼ of the ECLS-B sample. However, the PSID dataset allows us to have a more balanced sample on both sides of the cutoff. The results remain significant and are substantively larger than those observed the ECLS-B Finally, we run a series of place tests. To do this, we first assign a window around a false date for the end of WIC (e.g. a false cutoff point), and then use a regression discontinuity design to estimate the effect of aging out of WIC. We run 100 placebo tests (10 months estimates), where each estimate increases the false ending date for WIC by .1 month. Placebo windows start after the true ending date of WIC to avoid being influenced by any jump at the true cut-point. Figure 3 depicts the distribution of placebo estimates. We observe that the true aging out of WIC effect (from table 2) is more extreme than almost all of the placebo estimates. This figure indicates that the probability of finding aging out of WIC effects as large as we do simply due to chance are extremely small."}, {"section_title": "VIII. Discussion", "text": "In this paper, we explore the effect of aging out of the WIC program on both food insecurity and food insecurity with hunger. Using data from the ECLS-B and regression discontinuity techniques, we find strong evidence for a substantial effect of losing WIC benefits in food insecurity, but not in food insecurity with hunger. We explore the sensitivity of our result to various bandwidths, population definitions, estimation techniques, window sizes, use of control variables, and datasets. Our findings suggest that the patchwork of federal nutritional assistance programs has at least one hole in it. We estimate that household food insecurity increases by 7-13 percent when children reach month 61 of age. While it is possible that the observed treatment effect of WIC could be due to some other endogenous source of variation unaccounted for in our analysis, the regression discontinuity design is a very strong research design and our analysis indicates that child and household characteristics are similar on both sides of the age cutoff. Given that there is no evidence of other sources of systematic variation except for child's age, it is challenging to find another explanation for the significance of turning age five that would impact food security besides the sudden loss of WIC benefits. While ideally, the NSLP and the NSB programs might seamlessly pick up where WIC leaves off, this is not how the programs work in practice. Children can only begin kindergarten, where they can access the NSLP and NSB programs, at the beginning of the academic school year after which they are age eligible. In practice, the age at which children begin kindergarten varies by both state and gender 5 . Thus, an important policy implication follows from our results: the federal government should extend WIC participation until a child starts attending kindergarten. Additionally, school meals may not be accessible, or only partial accessible, for children that attend part-day kindergarten. This suggests that the value of WIC to food consumption is often not replaced by the NSLP and the NSB programs, at least not immediately for all children. For children in child care settings before the age 5 who were already eating breakfast and lunch away from home and receiving WIC, the NSLP and SBP provide a substitute for the meals consumed away from home. However, the reduction in the family food supply due to the loss of the WIC benefit is a net loss with serious implication for the level of household food security. While the WIC food is supposed to be consumed by the target children, food is fungible and it is easy to imagine how the presence of WIC food could support the food consumption of the entire household. While early childhood is a time in the life course when investments have been noted to have a high rate of return, food security among children among older ages should not be neglected. It appears that the higher incidence of food insecurity among children of older ages may be less an issue of the varying developmental patterns or family functioning over the life course and more the result of poorly designed public policies. Given our findings, future research should explore if the increase in household food insecurity associated with aging out of WIC is only short-term until children begin school and participate in the NSLP and SBPs or if it is more permanent. Additionally, there may be 22 important implications in terms of school readiness of having a spike, even just a short-term spike, in household food insecurity directly before a child enters kindergarten.   Estimates are based on the locally weighted kernel regression method discussed in Porter (2003), calculated using a triangle kernel. *p<.10, ** p<.05, ***p<.01  All these regressions control for child's race/ethnicity, child's gender, number of members in the households, marital status, maternal education, whether school serve meals and time of the interview."}, {"section_title": "Figure 1 -Graphical Inspection", "text": "* p<.1, ** p<.05, *** p<.01."}]