[{"section_title": "Abstract", "text": "Keywords: paleotempestology paleohurricane hurricane tropical cyclone sinkhole storm surge SLOSH Gulf of Mexico Apalachee Bay Holocene A 4500-year record of hurricane-induced storm surges is developed from sediment cores collected from a coastal sinkhole near Apalachee Bay, Florida. Recent deposition of sand layers in the upper sediments of the pond was found to be contemporaneous with significant, historic storm surges at the site modeled using SLOSH and the Best Track, post-1851 A.D. dataset. Using the historic portion of the record for calibration, paleohurricane deposits were identified by sand content and dated using radiocarbon-based age models. Marine-indicative foraminifera, some originating at least 5 km offshore, were present in several modern and ancient storm deposits. The presence and long-term preservation of offshore foraminifera suggest that this site and others like it may yield promising microfossil-based paleohurricane reconstructions in the future. Due to the sub-decadal (~7 years) resolution of the record and the site's high susceptibility to hurricane-generated storm surges, the average, local frequency of recorded events, approximately 3.9 storms per century, is greater than that of previously published paleohurricane records from the region. The high incidence of recorded events permitted a time series of local hurricane frequency during the last five millennia to be constructed. Variability in the frequency of the largest storm layers was found to be greater than what would likely occur by chance alone, with intervals of both anomalously high and low storm frequency identified. However, the rate at which smaller layers were deposited was relatively constant over the last five millennia. This may suggest that significant variability in hurricane frequency has occurred only in the highest magnitude events. The frequency of high magnitude events peaked near 6 storms per century between 2800 and 2300 years ago. High magnitude events were relatively rare with about 0-3 storms per century occurring between 1900 and 1600 years ago and between 400 and 150 years ago. A marked decline in the number of large storm deposits, which began around 600 years ago, has persisted through present with below average frequency over the last 150 years when compared to the preceding five millennia."}, {"section_title": "", "text": "1. Introduction"}, {"section_title": "Review and motivation", "text": "The manner in which tropical cyclone activity and climate interact has critical implications for society and is not well understood. Meteorological records of the number, track and intensity of hurricanes in the Atlantic extend back to the mid-19th century, although debate exists over whether trends in storm observations genuinely reflect secular changes in the underlying population of Atlantic hurricanes or if advances in storm detection and observation prevent the attribution of these trends to changes in storm climate (Goldenberg et al., 2001; Emanuel, 2005; Webster et al., 2005; Anthes et al., 2006; Hoyos et al., 2006; Mann and Emanuel, 2006; Trenberth and Shea, 2006; Chang and Guo, 2007; Holland and Webster, 2007; Kossin et al., 2007; Landsea, 2007; Mann et al., 2007; Elsner et al., 2008; Chen et al., 2009) . Moreover, the brief observational record is inadequate for characterizing natural variability in hurricane activity occurring on longer than multi-decadal timescales.\nIn an effort to extend the hurricane record further into the past, a number of paleohurricane proxies are being developed. These proxies can be categorized into two main types: isotope-based proxies that rely on the detection of tropical cyclone rainfall signatures preserved in corals (Cohen, 2001; Hetzinger et al., 2008) , tree rings (Miller et al., 2006) , and speleothems (Frappier et al., 2007; Nott et al., 2007) , and sediment-based proxies such as cyclone surge-constructed beach ridges (Nott and Hayne, 2001; Nott et al., 2009 ) and overwash deposits preserved in back barrier lagoons (Donnelly, 2005; Donnelly and Woodruff, 2007; Woodruff et al., 2008a,b; Wallace and Anderson, 2010) , coastal lakes (Liu and Fearn, 1993 Lambert et al., 2003 Lambert et al., , 2008 , and marshes (Donnelly et al., 2001a (Donnelly et al., ,b, 2004 Scileppi and Marine Geology 287 (2011) 14-30 Donnelly, 2007; Boldt et al., 2010) . Isotope-based proxies have in some cases provided exceptional, sub-annual resolution; however, such records often span only a relatively short interval of time. While sediment-based proxies have yielded much longer records reaching back several millennia, low sediment accumulation rates and high flooding thresholds at most sites studied have resulted in low resolution records of high magnitude events. For these reasons, paleohurricane frequency in existing sediment records has usually averaged less than one storm per century. Such low probabilities of occurrence make it difficult to differentiate significant changes in storm climate affecting a site from the random, temporal clustering of events that could result merely from the stochastic nature of hurricane landfalls at any particular location.\nIn this study, we develop a 4500-year record of hurricane storm surges impacting Bald Point, Florida. The record, developed from the sedimentary archive preserved in a coastal sinkhole, provides subdecadal resolution and is the first produced from this type of depositional environment. The average event frequency of 3.9 storms per century, greater than that of any published paleohurricane record, permitted the objective identification of intervals with significantly elevated storm frequency as well as abnormally inactive periods in the Northeastern Gulf of Mexico during the last half of the Holocene."}, {"section_title": "Study area", "text": "Apalachee Bay, situated in the Big Bend region of Florida's Gulf Coast, encompasses 400 km 2 of the coastal shelf submerged to an average depth of 3 m (USEPA, 1999) (Fig. 1a,b ). This shallow, concave bay is highly susceptible to extreme storm surges generated by hurricanes that frequent the Gulf of Mexico. Storm tide frequency analysis by a joint probability method suggests that the expected 100-year still water level surge in the bay is about 4.5 m above mean sea level (Ho and Tracey, 1975) . Storm surges in excess of 4 m have been observed in the area (Ludlum, 1963; Case, 1986) , and inundation modeling indicates that surges exceeding 8 m, which would penetrate tens of kilometers inland, can occur under plausible storm conditions (Jelesnianski et al., 1992) . Bald Point, a roughly 40-km 2 peninsula adjoining Ochlokonee Bay to the north and Apalachee Bay to the east and south (Fig. 1b) , is perforated by dozens of sinkholes. The local landscape rests on hundreds of meters of underlying limestone and dolomite, which is overlain by a veneer of clastic sand and clays that, in turn, is covered by a layer of fine quartz sand ten to sixty meters thick (Puri and Vernon, 1964; Sinclair and Stewart, 1985) . The pH of meteoric water is lowered by its contact with the atmosphere and organics in the soil, and the acidity of the resulting groundwater erodes the underlying limestone (Lane, 1986) . The resulting subterranean dissolution causes sinkhole formation either through the gradual, local subsidence of the ground, thereby forming a cover-subsidence sinkhole, or by the sudden, catastrophic failure of an underground cavity, resulting in a cover-collapse sinkhole. The character of the overlying sediments determines the type of sinkhole that forms. On Bald Point, where the overlying clays and sands are thick and cohesive enough to temporarily support the ground surface above a cavity, most sinkholes are of the cover-collapse variety (Sinclair and Stewart, 1985) . Once formed, the sinkholes begin to fill with sediments that preserve valuable paleoenvironmental and climatic records (Watts et al., 1992; Watts and Hansen, 1994; Kindinger et al., 1999; Hodell et al., 2005; Zarikian et al., 2005) .\nSediment cores used to develop this study's paleohurricane record were collected from Mullet Pond (29°55.520′ N, 84°20.275′ W), a nearly circular, 200 m diameter cover-collapse sinkhole located on Bald Point. The pond is 350 m from Apalachee Bay and is separated from the bay by a 3-4 m high (NAVD88) dune ridge 200 m to the east (Fig. 1c) . The local landscape west of the dune ridge has a relatively flat 2 to 3 m (NAVD88) elevation and, owing to the sandy soils that limit runoff during rain events (Puri and Vernon, 1964) , freshwater stream and river systems are absent (Fig. 1c) . A tidal creek running through a small salt marsh to the north intermittently connects Mullet Pond to the open coast (Fig. 1c) where the local mean tidal range is about 0.70 m (NOAA, 2010a). When field work was conducted in January of 2008, the pond had a maximum water depth of 2.3 m and an average surface salinity of 10 psu."}, {"section_title": "Methods", "text": ""}, {"section_title": "Field work", "text": "A portable Edgetech 3100 4-24 kHz sonar was used to map the bathymetry and image the sub-bottom stratigraphy of Mullet Pond, and the resulting data guided the selection of coring locations. Four sediment cores were collected along a transect, with two long (~6 m) cores (hereafter MLT1 and MLT2) retrieved from the deep, central portion of the pond and two short (~2 m) cores collected nearer to the pond's eastern shore (Fig. 1c) . A piston corer was used to capture surface drives in 3 inch polycarbonate barrels, while deeper drives were collected in 3 inch aluminum vibracores. Laboratory analyses focused on the two~6 m cores (MLT1 and MLT2) retrieved from the central portion of the pond in water depths of 2.3 and 2.2 m, respectively. These cores were taken in regions where the sub-bottom stratigraphy indicated the deepest reservoirs of lacustrine sediments (Fig. 2a,b) . Twenty-seven surface sediment samples (top 1 cm) were collected near the pond, dune ridge, beach, near-shore and offshore environments down to water depths of 14 m up to 20 km offshore. Marine samples were collected along three shore-normal depth transects: one in Ochlokonee Bay and two in the Gulf beginning 12 and 16 km west of Mullet Pond (Table 1) . A handheld GPS unit provided the coordinates of coring and surface sample locations, and salinities were measured with an optical diffraction salinity meter."}, {"section_title": "Age control", "text": "To develop age models for MLT1 and MLT2, plant and wood fragments were collected, cleaned, dried and sent to the National Ocean Sciences AMS facility at Woods Hole Oceanographic Institution for radiocarbon dating. Calendar ages (in years before present, where present is 1950 A.D. by convention) and corresponding uncertainties were calculated from 14 C ages and associated analytical errors using the IntCal09 calibration curves in the Calib6 program (Reimer et al., 2009) .\nA more detailed, modern age model was needed to date and attribute recent event deposits in Mullet Pond to historic hurricanes that impacted the area. A Canberra GL2020RS low-energy Germanium gamma well detector measured the activity of 210 Pb and 137 Cs at intervals ranging from 1 to 5 cm in the uppermost 40 cm of MLT1. The dark, laminar reflector that stretches continuously across the basin near the sediment surface corresponds to a sand layer and a peak in inorganic content near 72 cm depth in MLT1 and 64 cm depth in MLT2. Much of the signal was attenuated by gas in the brackish lacustrine portion of the sediments, and the resulting image of the underlying sediments was obscured. Coring locations are shown as dashed lines, and the coarse fraction by dry weight data for MLT1 and MLT2 are shown to the right of the coring locations. Panel (c) shows both the percent inorganic (black) and percent coarse (gray) content by depth in MLT1 and MLT2 in greater detail. Sand, peat and fine-grained (fresh and brackish) units are denoted. The corresponding depths of the prominent reflector in the CHIRP profile are marked by black arrows in both the MLT1 and MLT2 loss on ignition data. The approximate location of the fresh-to-brackish transition in each core (~330 cm in MLT1 and~300 cm in MLT2) is indicated by a black dashed line. Intervals containing shallow (− 1 to − 5 m MSL) marine foraminifera are indicated by open rectangles, and intervals where offshore (− 5 to − 10 m MSL) taxa were detected are indicated by closed (black) rectangles (see Tables 1 and 2 ).\nSupported levels of 210 Pb activity from the in situ decay of 226 Ra were estimated by plotting 210 Pb activity with depth and identifying the nearly constant, baseline activity in the deeper samples. Supported activity was subtracted from the total activity of each sample to find the atmosphere-sourced, or unsupported, 210 Pb activity. A constant flux of 210 Pb from the atmosphere was assumed, and the time elapsed since each sample was at the top of the sediment column was estimated from these activity measurements (Koide et al., 1973; Robbins and Edgington, 1975; Faure, 1986) . The initial rise and subsequent peak in 137 Cs activity were used to identify the sedimentary horizons associated with the advent of (~1954 A.D.) and moratorium on (~1963 A.D.) atmospheric nuclear weapons testing (Pennington et al., 1973) .\nEleven radiocarbon dates provided age control for MLT1 (Table 3 ). All but one of the calibrated ages were chronostratigraphically consistent, and the errant sample at 268-269 cm was discarded because its age was approximately 200 years younger than what would be expected based on the sequence of other calibrated ages. Based on the ten remaining dates, MLT1 had a remarkably constant sedimentation rate of 1.35 mm yr.\n, and a linear fit to the medians of the highest probability 1σ calibrated ranges had an R 2 of 0.998 (Fig. 3a , Supplementary Fig. 1 ). The deepest radiocarbon sample from 569 cm yielded an age of about 4200 cal. yrs. B.P. (Table 3) , and linear extrapolation of the sedimentation rate to the bottom of the core suggested that the MLT1 record spans approximately the last 4500 years. The five radiocarbon dates sampled from MLT2 were all chronostratigraphically consistent (Table 4 were identified at approximately 9.5 and 6.5 cm respectively ( Supplementary Fig. 2b ). Though the long-term, radiocarbon-based sedimentation rate of 1.35 mm yr. shows eleven radiocarbon-based calendar age ranges for terrestrial plant fragments taken from MLT1 versus the depths from which they were collected in the core. Calendar ages and ranges in years before 1950 A.D. were found from 14 C ages and uncertainties using the IntCal09 calibration dataset in the Calib6 program (Reimer et al., 2009 ). See Table 3 for details. One-sigma (black) and two-sigma (gray) age ranges are shown for each date, and a linear fit (black line) to the median of the highest probability one-sigma age ranges reveals a roughly constant sedimentation rate of 1.35 mm yr. 90% by bulk weight. The very recent increase in sedimentation rate indicated by the modern age model of MLT1 may have been due to the uncompacted nature of the uppermost sediments or might have resulted from landscape or water quality changes caused by local human activity during the 20th century. To account for the recent, apparent acceleration of the sedimentation rate, a polynomial age model (Fig. 3b) (Table 3) . This model was used to date historic sand deposits in MLT1. For MLT2, recent sand deposits were approximately dated using the uppermost linear age model based on radiocarbon dating."}, {"section_title": "Sedimentary analysis", "text": "Loss on ignition analysis was performed on the entire length of MLT1 and MLT2 at continuous, 1-cm resolution. Samples were dried at 105°C for 24 h and then combusted at 550°C for 2 h. Before and after each process, samples were weighed to determine the relative contributions of water, organics and inorganics to the mass of the sediment (Dean, 1974) . The remaining inorganic ash was sieved and the sand size particles (N63 μm) were retained, dried and weighed to determine the percent coarse by dry weight in each sample.\nThe presence of offshore foraminifera in coastal pond sediments is a valuable indicator of marine flooding; however, analyzing the microfossil assemblages along the entire lengths of MLT1 and MLT2 (N12 m of sediment) would be prohibitively time consuming. We adopted a limited sampling strategy that would enable us to learn about the deposition and preservation potential of foraminifera in Mullet Pond without expending an unreasonable amount of resources. The uppermost 40 cm of MLT1 was sampled at 1-cm intervals to determine the modern microfossil assemblage at the site and to identify taxa possibly associated with storm deposition during historic hurricanes. The most visually obvious sand layer in each core (~292 cm in MLT1 and~431 cm in MLT2) was also sampled for microfossil content to determine if these apparently \"large\" events were associated with distinctly offshore foraminifera assemblages. Coarse layers deposited in the earliest lacustrine sediments of the pond (between 500 and 540 cm in MLT2, Fig. 2c ) were also sampled to assess the long-term preservation potential of foraminifera at the site and to determine if these oldest events could still be definitively attributed to marine flooding in spite of lower sea levels and greater site-to-sea distances at the time of their deposition. To understand the evolution of the local environment from a fresh to a brackish pond, foraminifera content away from coarse layers was also assessed at approximately 1 m intervals in MLT1 until their first appearance in the stratigraphy was identified. Further sub-sampling refined the absence-presence (fresh-brackish) transition interval. The basal peat and sand sequences in MLT2 were also sampled for microfossil content. Beach, near-shore, and offshore surface sediment samples were also analyzed to understand the contemporary distribution of foraminiferal assemblages and constrain the likely source of microfossils deposited in Mullet Pond.\nStandard methods for foraminiferal sample preparation and analysis were employed (Scott and Medioli, 1980; de Rijk, 1995; de Rijk and Troelstra, 1997; Scott et al., 2001; Horton and Edwards, 2006) . Foraminifera were concentrated from 3-cm 3 bulk sediment samples by washing the material over 500 μm and 32 μm sieves and retaining the particles in this size range. When foraminiferal abundance was sufficient, up to 300 specimens were tallied from the remaining 32 μm to 500 μm fraction, and benthic species were identified using criteria provided by Phleger (1965) , Scott et al. (1991) , Javaux and Scott (2003) , and Sen Gupta (1999)."}, {"section_title": "Spectral analysis", "text": "Thompson's Multi-Taper Method (MTM) was used to find the power spectra of the inorganic and coarse fraction time series from MLT1 and MLT2 (Huybers, 2010) . For MLT2, this analysis was confined to the most recent 3500 years of the time series, which was the portion of the core with the highest and steadiest sedimentation rate similar to that of MLT1 ( Supplementary Fig. 1 ). Appropriate linear fits to the calibrated radiocarbon dates were used to construct the necessary uniform time vectors, and the data were linearly detrended before the MTM was applied. The 95% confidence limits for the power estimations were based on a chi-squared distribution calculated from the equivalent degrees of freedom (Percival and Walden, 1993) . A time-bandwidth product of 3 was used, and 5 discrete prolate spheroidal sequence (dpss) tapers were applied. Peaks significant at the 95 and 99% confidence levels were identified by comparing the computed power spectra to that of a red noise process (Mann and Lees, 1996; Ghil et al., 2002) ."}, {"section_title": "Event detection", "text": "In order to remove the significant, low-frequency variability identified by the spectral analysis, each coarse fraction time series was high-pass filtered so that it contained only variability on frequencies greater than 30 − 1 yrs.\n. This filtering isolated the coarse fraction anomalies associated with short-lived, storm deposition events from the background sediment composition variations driven by environmental changes occurring on longer timescales. A threshold value for event detection was needed to determine what magnitude of coarse fraction anomalies might be attributable to storm-induced surge events. The post-1851 A.D. portion of the record was used to calibrate the storm record by relating recent coarse fraction anomalies to the storm surge events that may have produced them. Due to a lack of a local instrumental surge record, however, it was first necessary to determine which historic hurricanes may have produced significant coastal flooding at the site.\nThe Sea, Lake and Overland Surges from Hurricanes (SLOSH) model was used to identify which historic hurricanes produced the largest still water level storm surges near Mullet Pond. The Atlantic Best-Track Dataset provided storm positions and maximum wind speed estimates at 6-hour intervals going back to 1851 A.D. (Jarvinen et al., 1984; Landsea et al., 2004 Landsea et al., , 2008 NOAA, 2010b) . Rather than maximum wind speed, SLOSH uses the barometric pressure difference between the storm center and the ambient environment (ΔP) as the intensity parameter (Jelesnianski et al., 1992) . This quantity was estimated from the Best-Track maximum wind using an empirical wind-pressure parameterization specific to the Gulf of Mexico (Landsea et al., 2004) . Similarly, each storm's radius of maximum wind (RMW) was estimated using an empirical expression that relates the climatological RMW of Atlantic hurricanes to storm latitude and ΔP (Vickery et al., 2000) .\nBald Point is included in the model domains of three different SLOSH basins. To better assess model uncertainties, flooding events caused by Best Track storms impacting the area were modeled using three different grid domains: the Apalachicola Basin, the Cedar Key Basin, and the Gulf-Wide Extratropical Basin. The Apalachicola basin provides the highest model resolution at Bald Point but neglects the effects of remotely-produced, coastally-trapped Kelvin waves, which are sometimes generated beyond the model domain and can travel into the area of interest. Such waves can contribute significantly to the overall surge along this coastline. Hurricane Dennis in 2005 generated a coastally-trapped wave, and the operational use of the spatiallylimited Apalachicola Basin to forecast the anticipated surge led to a dramatic under-prediction of the coastal flooding in Apalachee Bay (Morey et al., 2006) . The Cedar Key basin includes more of the coastal shelf and, thus, can better simulate trapped coastal waves when they occur; however, this basin has lower spatial resolution at Bald Point. The Gulf-Wide basin includes the whole northern Gulf of Mexico and does the best job of simulating trapped waves, but this basin also has the coarsest resolution and does not permit surges to penetrate inland.\nSurges were modeled in all three basins for all Best-Track storms having maximum sustained winds of at least 100 knots (SS-Category 3) while within a 500 km radius of a point in the northeastern Gulf (27.3°N, 85.6°W) or 34 knots (tropical storm) while within a 200 km radius of Mullet Pond. The uncertainty in each modeled surge was calculated from the spread among the three basins. For cases where the input parameters are perfectly known, SLOSH is estimated to have a 20% analytical error (Jelesnianski et al., 1992) , which was also included in the uncertainty estimates for storm surge at Bald Point. Model topography and surge levels are both referenced to the North American Vertical Datum of 1988 (NAVD88).\nOnce the modern coarse fraction anomalies that corresponded in time to significant historic surges were identified, two calibration strategies using different critical values for event detection were applied. First, a low threshold (hereafter, LT) that classified most historic, positive coarse fraction anomalies as events was used. Then, a more conservative high threshold (hereafter, HT) was applied to the coarse fraction anomalies. The HT identified only values equal to or larger than the largest coarse fraction anomaly in the modern record as an event. In this way, two event chronologies, one for each detection threshold, were constructed from the coarse fraction anomaly time series."}, {"section_title": "Constructing the event frequency time series", "text": "A sliding 157-year window was used to facilitate comparisons between storm frequency in the instrumental record (1851-2007 A.D.) and event frequency in the paleorecord. Moving averages of event frequency were obtained using the average occurrence rate of significant coarse fraction anomalies per year within the sliding 157-year window. A time series of event frequency was produced for both the LT and HT event chronologies. Owing to the stochastic nature of hurricane landfalls, the number of storms impacting a specific site would likely vary from one sampled period to the next even if the statistics of Atlantic hurricanes were stationary through time. Thus, some portion of the variability in local flooding frequency was due to chance only, while the remainder may have resulted from actual changes in storm climate. To construct confidence intervals for the random portion of the variability, the occurrence of an event at the site was assumed to follow a Poisson process with a mean rate assigned by the historic (most recent 157-years) portion of the sediment record. Exact solutions for the 95th and 5th percentile confidence intervals were found (Ulm, 1990) , and intervals of the time series with values of event frequency outside these upper and lower bounds were identified as periods with significantly different event rates than the historic rate. Confidence intervals were calculated based on both historic HT and LT rates in MLT1, and this process was also repeated for a portion of MLT2.\nTwo additional time series of storm frequency were produced to assess the sensitivity of the result to the initial high-pass filtering of the data. In one case, a time series was constructed by applying the sliding window to the raw coarse fraction data without first high-pass filtering the data. In the other case, the raw data were initially filtered to find a time series of coarse fraction excursions by subtracting each coarse fraction measurement from the preceding coarse fraction measurement. The sliding window was then applied to the time series of coarse fraction excursions. In these alternate cases, the records were calibrated either by using the historic raw data or excursions to select low and high thresholds for event detection."}, {"section_title": "Results", "text": ""}, {"section_title": "Description of the sediments in Mullet Pond", "text": "Visual inspection of the cores together with a CHIRP profile revealed three main sedimentary units in Mullet Pond: basal sand, peat, and an overlying unit of dark, fine-grained sediment (Fig. 2a) . Loss on ignition and microfossil analysis located the marine transition in the stratigraphy, which divided the fine-grained sediments into a lower fresh lacustrine unit and an upper brackish lacustrine unit. Much of the detailed stratigraphy was obscured by gas in the brackish lacustrine unit; however, a prominent reflector in the upper portion of the sediments could be traced continuously across the basin (Fig. 2b) . This spatially-uniform reflector corresponded to a sand layer and a peak in inorganic content near 72 cm depth in MLT1 and 64 cm depth in MLT2 (Fig. 2b ,c). Though MLT2 was slightly longer and captured the basal sand and peat sequences, MLT1 was extracted closest to the pond's sediment depot center and captured a longer segment of the fine-grained, lacustrine sediments only (Fig. 2c )."}, {"section_title": "Description of the sediment cores", "text": "All of MLT1 and most of MLT2, with total lengths of 601 and 619 cm respectively, were comprised of dark, fine-grained sediment containing occasional gray clay-rich layers approximately 1-2 cm thick. Visually, the composition of MLT1 appeared fairly uniform throughout, whereas MLT2 contained coarse sand below 600 cm and peat between 550 and 600 cm depth. Loss on ignition analysis revealed that the bulk water content of the dark sediment was near 80% with the highest water content (~90%) in the uppermost 15 to 20 cm of MLT1 (Fig. 2c) . The average dry weight composition of the sediment was about 70% inorganic with about 20% of this being sand and the rest finer silts and clays. Abrupt, transient peaks in coarse fraction suggested that centimeter or smaller scale sand layers were numerous in both cores. These sand fraction peaks were present in the whole of MLT1 and in the upper 530 cm of MLT2."}, {"section_title": "Foraminifera content", "text": "Foraminifera were absent from terrestrial, dune ridge, beach and near-shore samples taken at elevations above −1 m MSL (Table 1) . For samples taken below −1 m MSL, depth (at 5 m intervals) and locationspecific assemblages for Ochlokonee Bay and the Gulf are summarized in Table 1 . Taxa typical of subtidal marsh and brackish pond environments (Tiphotrocha comprimata, Jadammina macrescens, Ammobaculites sp., and Arenoparella mexicana) were present in the core top and in every sample taken above~330 cm in MLT1, which is presumably the horizon associated with sea-level intercepting the pond (Table 2) . Seven intervals in the upper 40 cm of MLT1, all associated with coarse layers, contained marine assemblages typical of water depths of at least −1 to −5 m MSL (currently found 3 to 5 km offshore), and four of these had taxa which currently reside only at depths exceeding −5 m MSL. The very prominent coarse layers near 292 cm in MLT1 and 431 cm in MLT2 contained taxa typical of offshore environments now found at depths and distances of − 5 to − 10 m MSL and 12 to 16 km, respectively. The oldest coarse deposits in the stratigraphy (~504 cm, 510 cm, and 531 cm in MLT2) contained marine assemblages typical of modern depths between −1 and −5 m (Fig. 2c ). Foraminifera were absent from the basal peat and sand units in MLT2."}, {"section_title": "Natural history of Mullet Pond", "text": "Based on the lowermost radiocarbon date in MLT2, the sinkhole that would eventually become Mullet Pond probably formed when a cavity in the underground limestone collapsed at least 7000 to 8000 yrs. B.P. The sand unit at the base of MLT2 (Fig. 2a) is likely the surficial sediment that fell into the original depression during and immediately after the collapse. Based on the depth of the overlying sediments in Mullet Pond, the original depression was up to 8 m deep, assuming no post-collapse subsidence of the bottom. According to the radiocarbon-based age model, the 0.5 m of freshwater peat between 600 and 550 cm depth in MLT2 was deposited from about 7000 through 5800 cal. yrs.B.P. No foraminifera were present in the basal peat, but a peak in sand and inorganic content just above the peat interval at 531 cm depth, dated by the age model to around 5500 yrs. B.P., was found to contain shallow marine foraminifera Ammobaculites dilatus and Ammobaculites exiguus (Tables 1 and 2 ). The presence of these taxa suggested that this earliest coarse fraction layer in Mullet Pond had a marine origin and was likely deposited during a coastal flood. A subsequent increase in baseline sand and inorganic content around the time of this coarse deposit suggested that the site was intercepted by a rising water table and transitioned into a freshwater pond.\nNumerous, ephemeral peaks in coarse and inorganic fraction occasionally accompanied by marine-indicative foraminifera (Ammobaculites dilatus and Ammobaculites exiguus) were detected in sediments deposited after the site became a freshwater pond (Tables 1  and 2 , Fig. 2c ). Rising sea levels (Donnelly and Giosan, 2008) eventually intercepted the pond resulting in a transition to a brackish environment and the development of a salt marsh around the pond perimeter between 2450 and 2320 yrs. B.P. Brackish foraminifera were continuously present in all sediments sampled for microfossil content after this transition ( Table 2 ). The fresh-to-brackish transition was also accompanied by subtle increases in baseline sand and inorganic content in both MLT1 (near 330 cm depth) and MLT2 (near 300 cm depth) (Fig. 2c) .\nGiven the spatial uniformity of the sedimentary units and deposits in Mullet Pond, MLT1 and MLT2 should both have recorded the same environmental changes and short-lived depositional events through time. However, MLT1 yielded a greater temporal resolution owing to its higher and remarkably steady sedimentation rate, thus providing the opportunity to develop an event record with uniform, sub-decadal resolution (~7 years with 1-cm sampling). Only the most recent 3500 years of MLT2 had a similarly high (~8 years with 1-cm sampling) and uniform temporal resolution, so the storm record from MLT2 was derived from that interval only."}, {"section_title": "Spectral properties of MLT1 and MLT2", "text": "The power spectra of the MLT1 inorganic (Fig. 4a ) and coarse fraction (Fig. 4b) , and 34 − 1 yrs. − 1 in the power spectrum of MLT1 inorganics (Fig. 4a) . The coarse fraction power spectrum had peaks significant at the 99% level centered at 20 − 1 and 15 − 1 yrs. − 1 (Fig. 4b) . These higher frequency peaks, close to the Nyquist frequency of 14.8 − 1 yrs.\n, were significant only in the coarse fraction power spectrum, which suggested that shortlived deposition events occurring on timescales near the temporal resolution of the record (~7.4 years) controlled much of the variability in the coarse fraction. High-pass filtering of the coarse fraction raw data to include only variability on frequencies higher than 30 yrs.\n− 1 isolated this event signal from the original time series ( Fig. 5a ; Fig. 6a,b) . Based on the power spectra of the most recent 3500 years of MLT2 ( Supplementary Fig. 3a,b) , coarse fraction anomalies for MLT2 were also found by filtering out frequencies lower than 30 yrs. − 1 (Fig. 5b) .\nThe resulting time series of MLT1 coarse fraction anomalies (Fig. 6b ) displayed a distribution of peaks similar to the raw coarse fraction time series (Fig. 6a) , but with the background variability removed."}, {"section_title": "Historic hurricanes and calibration of the paleorecord", "text": "SLOSH modeling of the 66 Best Track storms that met the intensity and proximity criteria revealed that fifteen hurricane-induced surges of at least 1 m likely occurred at Bald Point between 1851 and 2007 A.D. A total of eight surges exceeding 2 m, within the provided uncertainty, were modeled in the years 1985, 1966, 1941, 1929, 1926, 1894, 1886 and 1852 (Fig. 5c) . The largest modeled surge was associated with Hurricane Elena in 1985, and the median modeled value of 3.2 m is consistent with observations of an approximately 3 m surge in the area during the event (Case, 1986) . The modeled 0.8-1.6 m surge from Hurricane Eloise in 1975 is also consistent with eyewitness observations of a small surge locally (Hebert, 1976) . However, the simulated surge from Hurricane Dennis (2005) differed significantly from observations. The surge from Hurricane Dennis was modeled to be between 0.9 and 1.6 m at Bald Point. However, the model underestimated the actual storm tide from Hurricane Dennis, which was observed to be 2-3 m in western Apalachee Bay (Morey et al., 2006) (Fig. 5c) . The discrepancy between modeled and observed flooding magnitudes likely arose from uncertainties in the SLOSH model input. Simplifying assumptions including the use of parameterizations for the RMW, wind field, and wind-pressure relationships as well as the omission of astronomical tides, wind waves, and wave setup may account for some of the differences between the modeled still water level surges and observed storm tides. Errors in the Best Track storm intensity or position data would also add uncertainty particularly in the earlier years of the dataset. However, the intent was not to precisely hindcast historical storm tides, but rather to objectively sieve through the hundreds of Gulf storms in the Best-Track data for the few historic storms likely represented in the sediment record.\nWhen plotted against the polynomial age model, the largest modern coarse fraction anomalies in MLT1 and MLT2 tended to coincide with significant modeled surges (Fig. 5a,b,c) . Five of the six largest coarse fraction anomalies in MLT1 dated to surge events that were modeled or otherwise known to exceed 2 m, within the provided uncertainty. The smallest of these is likely associated with the 1941 A.D. hurricane, and this value was taken as the low threshold (LT) for storm detection. All coarse fraction anomalies above the LT in the modern record were coincident with modeled surges caused by historic hurricanes impacting the area. When applied to the older portions of the MLT1 record, the LT attributes all values meeting or exceeding the 1941 A.D. coarse fraction anomaly to paleohurricane events. However, not every modern surge-producing event was present in the modern sedimentary record, so the paleohurricane record likely also only documented a fraction of all storms impacting the site. The coarse fraction anomaly associated with Hurricane Elena in 1985 (~3.3) was selected as the more conservative high threshold (HT) for storm detection. The HT would qualify only the largest, modern coarse fraction anomaly, and coincidentally the largest modeled surge, as a significant event. This less sensitive detection method resulted in a greater underestimation of event occurrence; however, using the HT provided a higher degree of certainty that values exceeding the threshold correspond to significant coastal floods in the past and served as a sensitivity analysis of the result to the threshold value used.\nThe MLT2 time series of modern coarse fraction anomalies was very similar to MLT1 (Fig. 5a,b) . Hurricane Dennis was not detected in MLT2; however, and this may be due to inadequate preservation of or failure to capture the sediment-water interface. The sand deposit likely associated with Hurricane Alma was more prominent in the MLT2 sequence, and the Hurricane Elena deposit is the largest modern coarse fraction anomaly in both cores. The congruence of the upper portions of MLT1 and MLT2 suggests that the modern record is reproducible across the pond basin."}, {"section_title": "Event frequency in the modern and paleorecord", "text": "Since 4500 cal. yrs. B.P., 177 events exceeded the LT and 107 events exceeded the HT in MLT1 (Fig. 6b,c) . The resulting average event frequencies were 3.9 events per century and 2.4 events per century for the LT and HT cases, respectively. The corresponding event frequencies in the post-1851 A.D. portion of the sediment record were 3.8 events per century when the LT was applied and 0.6 events per century when the HT was applied. Thus, modern event frequency was similar to the longterm average when events were identified using the LT; however, the long-term average was four times greater than the modern event frequency when the HT was applied. According to the event frequency time series constructed with the HT, the occurrence of events at Mullet Pond must have been significantly more common during parts of the paleorecord than they were in the 19th and 20th centuries.\nWith event frequency remaining within the bounds of the 95% confidence interval (1.7 to 7.5 events per century) throughout the record, the LT-based time series exhibited no significant variability with respect to the historic rate of LT events (Fig. 7a) . Seven intervals in the HT-based time series exhibited event frequencies at or above the upper bound of the confidence interval (about 3.0 events per century): an approximately 300-year interval centered at 3800 cal. yrs. B.P. and a 100-year interval centered near 3550 cal. yrs. B.P. each with about 3.8 events per century, a 100-year interval centered near 3300 cal. yrs. B.P. with about 4.5 events per century, an approximately 500-year period spanning 2800 to 2300 cal. yrs. B.P. with a peak of 5.5 events per century near 2500 cal. yrs. B.P., a 50 to 100-year interval around 1200 cal. yrs. B.P. with 3.8 events per century, an approximately 50-year interval around 900 cal. yrs. B.P. with about 3.2 events per century, and an approximately 100-year interval with about 4.5 events per century around 700 cal. yrs. B.P. Four intervals in the HT-based record had event frequencies below the lower, 5th percentile bound of the confidence interval for the historic rate. These decadal-to-centennial scale intervals, each averaging no more than one HT event every 200 years, were centered near 1800, 1650, 350, and 100 cal. yrs. B.P. (Fig. 7b) . A cumulative plot of HT events with time showed pronounced variability in its slope (event frequency), while the cumulative plot of the LT events was more linear and suggested modest changes in event frequency through time (Fig. 6c) .\nThough age models and temporal resolutions differ between the two cores, the time series of hurricane frequency constructed using the last 3500 years of MLT2 reveals many of the same features present in the MLT1 time series (Supplementary Fig. 4a,b) . The biggest differences are present between 3000 and 3500 yrs. B.P., when the MLT2-based time series suggests hurricane frequency was most elevated. Also, the overall frequency of storms in the MLT2 record is lower, and this can likely be attributed to the core's lower temporal resolution, which would increase the classification of multiple, sequential events as single events. These similar time series were achieved by applying identical procedures to materials taken from two separate coring locations, and these results suggest that the storm record is reasonably reproducible across the Mullet Pond basin."}, {"section_title": "Discussion", "text": ""}, {"section_title": "Coarse fraction anomalies as hurricane deposits", "text": "As the power spectrum of the coarse fraction time series suggests, the most significant variability in sand content occurred on relatively short timescales near the sampling resolution (~7 years increases in the abundance of larger (N63 um) particles in the pond sediments could be caused by short-lived transitions to a higherenergy environment, which would occur during flooding events. The sandy soils, low relief of the carbonate platform, and absence of stream and river networks on the local landscape suggest that terrestrial runoff during rain events is minimal (Puri and Vernon, 1964) ; moreover, Mullet Pond has shallow banks and a small watershed (Fig. 1c) . Furthermore, the water level of the pond is essentially the same as the groundwater level, so freshwater flooding would simply cause the pond to \"fill up\" thereby limiting the lateral transport of terrestrial sediment into the basin. If terrestrial, freshwater flooding events have played a role in depositing sand into Mullet Pond, then this process would likely be most prominent when the collapse feature was young and the relief surrounding its sediment depot center was greatest. The absence of coarse grain deposits in the 1200-year basal peat sequence in MLT2 strongly suggests that terrestrial runoff did not play a role in transporting sand into the pond at the time when the basin would have been configured to be most susceptible to this process. It is therefore unlikely that freshwater flooding would have played a role in any subsequent coarse layer deposition.\nThe oldest sand deposit overlying the peat in MLT2, dated to around 5500 yrs. B.P., contained marine foraminifera (Table 2, Fig. 2c ). Given subsequent rising sea levels and decreasing site-to-sea distances, this oldest deposit serves as a precedent and indicates that Mullet Pond would have been susceptible to inundation from marine flooding events since that time. While the presence of offshore taxa has been considered a sufficient basis for identifying paleohurricane deposits (Collins et al., 1999; Hippensteel and Martin, 1999; Hippensteel and Martin, 2000; Scott et al., 2003; Hippensteel, 2005 Hippensteel, , 2008 , the absence of foraminifera in other sand layers does not rule out a marine origin for deposits (Williams, 2010) . Dune, beach and nearshore surface samples above − 1 m elevation (MSL) were absent of foraminifera, which suggests that coarse deposits containing offshore taxa were likely produced only by relatively more dynamic coastal flooding events (Table 1) .\nThe CHIRP profile of Mullet Pond (Fig. 2b) , though mostly obscured by gas, suggested that the upper sediment stratigraphy is spatially uniform across the basin. The reproducibility of both modern and paleohurricane records from the MLT1 and MLT2 cores supports this (Fig. 5a,b, Supplementary Fig. 4 ). Horizontal continuity of the coarse deposits would indicate they originated when sand suspended by surge and wave action was advected over the dune ridge or through the marsh and then subsequently settled out after the flooding had subsided. Moreover, the general features of the MLT1 record of storm frequency were robust regardless of whether and how the raw coarse fraction data were filtered ( Supplementary Fig. 5 ), which suggests that the vast majority of coarse fraction anomalies are not merely artifacts of how the raw data were treated.\nGiven the relative seismic stability of the region, tsunamis in the Gulf of Mexico seem to be an unlikely cause of the coastal floods. Storm-induced coastal flooding remains the most likely mechanism for the production of the thin, coarse-grained deposits in Mullet Pond. While coastal flooding can occur during non-tropical storms, every significant coarse fraction anomaly in the modern portion of the record was contemporaneous with a historic hurricane either documented or deemed capable via modeling of generating coastal flooding at the site. We therefore conclude that coarse fraction anomalies in the Mullet Pond record provide a reasonable proxy for local tropical cyclone-induced storm surges."}, {"section_title": "Surges and sedimentary signatures of historic hurricanes", "text": "The post-1851 A.D. period covered by the Best Track Dataset was represented by the upper 20 or 25 cm of MLT1, depending on whether the linear or polynomial age model was applied. The polynomial age model, which took into account the recent increase in the sedimentation rate, suggested that nearly every significant coarse fraction anomaly coincided with a significant (at least 2 m), historic surge. Not every historic hurricane with a modeled surge exceeding 2 m was detected in the recent sediment record, but the actual storm tides may have been smaller than the modeled surges in some cases. Moreover, the age model for the last half of the 19th century was based on an interpolation between the upper 137 Cs and 210 Pb constraints and a radiocarbon date at 80 cm (~545 cal. yrs. B.P.). The more tenuous age controls for the 19th century chronology may have prevented the proper attribution of significant coarse fraction anomalies to large, modeled surge events such as the one associated with the 1852 A.D.\nhurricane (Fig. 5c) . While the sediment record may not document every hurricane that affected the area since 1851 A.D., the correspondence of the largest, recent coarse fraction anomalies with the most significant documented hurricane events in the area is encouraging. Although the largest historic hurricane events were represented in the record, some smaller events likely went undetected resulting in an underestimate of the number of storms impacting the site through time. While 66 historic storms met the intensity and proximity criteria for SLOSH modeling and 15 of these were modeled to have surges of at least 1 m at the site, only six modern storm deposits were detected in the modern portion of the sediment record. This translates into a detection rate of approximately 9% of all modeled storms and 40% of storms with 1 + m of modeled surge, respectively. Undercounting may also have occurred as a result of limited sampling resolution. For example, the hurricanes of 1894 and 1896 A.D. occurred in such quick succession that they could not be distinguished as two separate events in MLT1 or MLT2 given the temporal resolution of the sediment records (Fig. 5) . Multiple storms occurred in the years 1985 and 1886 A.D., and these storms would also be lumped together as single events. Undercounting of paleohurricanes likely occurred throughout the record, and more storms were probably missed during periods of greater storm frequency (Woodruff et al., 2008a) . Therefore the actual amplitude and statistical significance of the storm frequency variations through time were likely greater than what was derived from the sediment record.\nShallow Fig. 2c ). While we have not identified written records of historic hurricane strikes near Apalachee Bay between 1797 and 1823 A.D. (Ludlum, 1963) , it is possible that storms impacting this sparsely populated region in the late 18th and early 19th centuries may have gone undocumented. The foraminifera-rich deposit dating to~1780 A.D. is associated with the largest coarse fraction anomaly of the last 500 years in MLT1 (Fig. 6b) . This deposit dates to Solano's Hurricane of 1780 A.D.-one of three devastating hurricanes that occurred during the deadliest Atlantic hurricane season on record. This well documented storm killed thousands at sea in the eastern Gulf of Mexico when it intercepted a fleet of Spanish ships en route to capture the Florida Panhandle from the British (Ludlum, 1963 ). Solano's Hurricane appears to also be documented in an independent, tree ring isotope-based paleohurricane record from southern Georgia (Miller et al., 2006) . As previously noted, the presence of distinctly offshore taxa in a coastal pond serves as a compelling indicator of marine inundation, but foraminifera may not always be present in storm deposits."}, {"section_title": "Site sensitivity to storm surge through time", "text": "Much of the criticism against using the historic Atlantic hurricane record to detect secular trends in tropical cyclone activity is related to the improvement of storm detection and observation through time (Landsea, 2007; Chen et al., 2009) . A similar criticism could be leveled against the paleohurricane record contained in Mullet Pond, which should have experienced increasing susceptibility to storm surges as sea level rose and, therefore, should have become a more complete record of storm activity toward present. Debate exists over the evolution of sea level in the Gulf of Mexico during the Holocene. Some investigators have proposed that Gulf sea level has risen in a generally smooth and continuous fashion through the mid-late Holocene (Otvos, 2001; Törnqvist et al., 2004; Wright et al., 2005; Donnelly and Giosan, 2008; Milliken et al., 2008; Simms et al., 2009 ), while more complex sea level curves for the region have also been suggested highlight periods when HT storm frequency was significantly higher than the historic rate. The lighter gray periods were less active times in the record when HT storm frequency was significantly lower than the historic rate. (Stapor et al., 1991; Tanner, 1992; Morton et al., 2000) . Dating of relic beach ridges along the northern Gulf of Mexico has been offered as evidence for periods of higher than modern sea level (~+2 m) during the mid-Holocene (Morton et al., 2000; Blum et al., 2003 ). However, if sea level had been significantly higher than modern at any time in the last 7000 years, then a near-shore or open marine sequence should be evident from the lithology and microfossil profile of MLT2, which spans the last 8000 years. No such evidence for a significant late Holocene sea level highstand exists in the sedimentary archive of Mullet Pond (Fig. 2c, Table 2 ).\nThe combined effects of continuous sea level rise and shoreline retreat should have colluded to increase the frequency of hurricane inundations through time. However, the record does not provide evidence for such a trend and possesses variability that cannot be explained by steady sea level rise. In fact, sea level along the Gulf Coast of Florida has been placed at 1.2 to 1.5 m below modern levels around 2500 yrs. B.P. (Wright et al., 2005) , when storm frequency peaked in the Mullet Pond record. Moreover, the decline in storm events since 600 cal. yrs. B.P. is inconsistent with subsequently rising sea levels and associated increasing susceptibility to inundation. With the 100-year coastal still water flood level near Bald Point purported to be 4.5 m (Ho and Tracey, 1975) , the surge potential in Apalachee Bay is larger than the proposed 3 m sea level rise that occurred during the entire period spanned by the MLT1 record (Wright et al., 2005; Donnelly and Giosan, 2008) . Today, a 4.5 m surge would submerge most of Bald Point, including the eastern half of the peninsula where Mullet Pond is located. Given the modern bathymetry of Apalachee Bay, the maximum site-to-sea distance 4500 years ago would have been about 3.8 km. A recent examination of the surge deposit from Hurricane Ike in Texas found that suspended littoral and offshore sediments containing foraminifera were transported almost 3 km inland and were then preserved in subaerial environments (Williams, 2010) . These findings suggest that appropriate depositional settings can preserve microfossil-based paleohurricane records stretching back thousands of years. Foram dissolution and bioturbation complicate microfossil-based paleohurricane reconstructions in many settings (Collins et al., 1999; Hippensteel and Martin, 1999; Hippensteel and Martin, 2000; Scott et al., 2003; Hetzinger et al., 2005 Hetzinger et al., , 2008 ; however, lateral continuity of distinct storm layers and prolonged microfossil preservation indicate that these processes play a limited role in Mullet Pond. The presence of calcareous marine foraminifera in a sand layer dating to 5500 cal. yrs. B.P. suggests that the site has been recording surge events for almost six millennia (Table 2 , Fig. 2c ). At modern coastal sites along Apalachee Bay, where the topography is very low-lying and the surge potential is extreme, it is likely that overwash frequency is dominated by the frequency and magnitude of marine flooding events rather than changes in geographic boundary conditions through time.\nWe deduce that the changes in flooding frequency suggested by the sedimentary record in Mullet Pond primarily reflect variability in storm climate rather than changes in site sensitivity."}, {"section_title": "Comparisons with other paleohurricane records", "text": "Given the stochastic nature of hurricane landfalls, changes in the frequency of storms at one particular site may not necessarily reflect larger-scale changes in storm frequency. The discrepancy between site-specific and basin-wide activity may be largest when short time periods are considered. For this reason, any very recent trend in Atlantic-wide hurricane frequency caused by anthropogenic climate change would be nearly impossible to detect in a single sedimentary record. When longer time periods are considered, changes in local hurricane frequency are more likely to reflect larger-scale changes in storm climate (Woodruff et al., 2008a) . Other sediment-based paleohurricane records from the Caribbean, Northeastern U.S., and the northern Gulf of Mexico have documented significant multicentennial to millennial-scale variability in hurricane frequency similar to the centennial to multi-centennial variability identified in the Mullet Pond reconstruction, though the timing and extent of the variability differs somewhat among the records Fearn, 1993, 2000; Scileppi and Donnelly, 2007; Donnelly and Woodruff, 2007) . Fearn (1993, 2000) identified low-frequency variability in the number of visible sand layers deposited by hurricanes impacting Western Lake, Florida. They suggested that long-term shifts in atmospheric circulation directed the majority of hurricanes toward either the Gulf or U.S. East Coast resulting in alternating hyperactive (from 3400 to 1000 cal. yrs. B.P.) and quiescent storm phases (between 5000 and 3400 cal. yrs. B.P. and after 1000 cal. yrs. B.P.) in the Gulf of Mexico. This Bermuda High Hypothesis has found support from studies of the instrumental record that have identified highfrequency variability in the dominant tracks of modern Atlantic hurricanes (Elsner et al., 2000; Elsner, 2003; Holland, 2007; Kossin and Camargo, 2009 ). However, a paleohurricane record based on salt marsh cores from Alder Island, NY exhibited a period and phase of variability similar to that of the Gulf Coast record (Scileppi and Donnelly, 2007) . Hurricane inundation layers were most abundant in the Alder Island marsh between 3200 and 700 cal. yrs. B.P. but were rare between 700 and 300 cal. yrs. B.P. Another record documenting intense hurricane strikes in the Caribbean indicated a similar pattern of activity over the last 5000 years in Vieques, Puerto Rico . The stormiest intervals at Vieques were from 5500 to 3700 cal. yrs. B.P., 2500 to 1000 cal. yrs. B.P. and after 250 cal. yrs. B.P., while the calmest periods occurred from 3700 to 2500 cal. yrs. B.P. and 1000 to 500 cal. yrs. B.P. The authors argued that the local frequency of storms at Vieques was influenced by the low-frequency behaviors of the ENSO and the West African Monsoon-a hypothesis inspired by the instrumental record (Goldenberg and Shapiro, 1996) and supported by paleorecords of these climatic phenomena (Moy et al., 2002; Nguetsop et al., 2004) . In contrast to storm track-driven changes, this variability could drive large-scale, basin-wide variations in storm frequency and possibly intensity. One recent paleohurricane record developed from the sediments of Laguna Madre in South Texas produced no evidence for significant variability in intense, landfalling hurricane frequency during the last five millennia (Wallace and Anderson, 2010) . However, similar to the previously discussed paleohurricane records from the Caribbean and Gulf, overall storm detection rates at the site are lower than one event every 200 years. Such low annual probabilities of occurrence make it difficult to objectively identify or detect meaningful changes in local storm climate through time. Another recent study based on marsh sediments from Mattapoisett, Massachusetts also did not detect large variations in storm frequency over the last two millennia (Boldt et al., 2010) . However, with a probability of occurrence exceeding one storm per century, the marsh had a high sensitivity to overwash relative to many other paleohurricane sites, which suggested that significant variability in the late Holocene tropical cyclone frequency may have been confined to intense hurricanes only. The significant variability in the frequency of HT events compared with the relative constant frequency of LT events in Mullet Pond is consistent with this hypothesis.\nThe Mullet Pond reconstruction shares many features with a 1500-year reconstruction of basin-wide landfalling Atlantic hurricanes, which was based on a compilation of several paleohurricane records including most of those already discussed (Mann et al., 2009) (Fig. 8a,b) . Both the paleorecord compilation and the Mullet Pond record show increasing storm frequency between 1500 and 1000 cal. yrs.B.P. and a prolonged decline in hurricane landfalls beginning after 600 cal.yrs.B.P. The spike in hurricane landfalls that occurs just prior to 600 cal. yrs.B.P. in the Mann et al. (2009) reconstruction is present in the Mullet Pond record but was dated approximately 100 years earlier. This discrepancy may be authentic or merely result from the differences between the Mullet Pond age model and the merged age models and associated uncertainties of the other paleohurricane reconstructions.\nWhile the available Atlantic paleohurricane reconstructions share some similar characteristics, significant differences also exist. Many factors contribute to these differences. The local sedimentary expression of a basin-wide change in overall Atlantic hurricane frequency and/ or intensity could be quite different depending on a host of site-specific and regional factors. Discrepancies in hurricane reconstructions may reflect differences in local storm frequency and intensity distributions, age models, temporal resolutions of the records, flooding thresholds, local sea level rise and associated geomorphological changes. Owing to more frequent inundations and more complete detection of events, the record we present here provides a more detailed history of Holocene hurricane climate than have other records. Mean storm frequencies over the last 2500 years were 0.32 storms per century at Western Lake, 0.52 storms per century at Alder Island, 0.68 storms per century at Vieques, 1.2 storms per century at Mattapoisett, and between 1.8 and 4 storms per century at Mullet Pond depending on whether the HT or LT time series was considered (Fig. 9) . This wide range of local landfall rates likely results both from geographic differences in the number and intensity distribution of hurricanes affecting each region and from the local susceptibility of each site to inundation by storm surge. Regionspecific variability in hurricane frequency and intensity through time may have also contributed to differences among late Holocene paleohurricane records.\nThe Western Lake, Vieques and Alder Island records were developed from sites that are relatively difficult to inundate; therefore, these records likely documented only the largest hurricane-induced surges (Liu and Fearn, 2000; Scileppi and Donnelly, 2007; Woodruff et al., 2008a,b) . As suggested by their much higher paleohurricane frequencies, Mullet Pond and Mattapoisett Marsh are more susceptible to smaller storm surges and can be inundated by a broader range of surge events. Changes in the intensity distribution of hurricanes occurring in concert with changes in storm frequency could cause the frequency of storm deposits in sites with different flooding susceptibilities to diverge. Numerical modeling of late 21st century hurricane climatology has suggested that declines in overall Atlantic hurricane frequency could occur simultaneously with a broadening of the intensity distribution of hurricanes leading to fewer but more intense storms (Emanuel et al., 2008; Gualdi et al., 2008; Knutson et al., 2008; Zhao et al., 2009; Bender et al., 2010) . However, recent warming and increased hurricane frequency in the Atlantic has purportedly been accompanied by a disproportionate increase in the occurrence of intense hurricanes (Emanuel, 2005; Webster et al., 2005; Hoyos et al., 2006; Elsner et al., 2008; Jagger and Elsner, 2008) . When considering the climate system feedbacks likely associated with the atmospheric and upper ocean anomalies generated by tropical cyclones (Hart et al., 2007; Hart, 2011) , it seems likely that significant changes in the frequency of storms would also change their intensity statistics.\nAlthough the magnitude of the coarse fraction anomaly associated with a hurricane is not necessarily an indication of storm intensity, some of the coarsest deposits do contain evidence of extremely energetic events. A few of the most prominent coarse deposits were sampled for microfossils and found to contain marine taxa common to deeper, offshore environments. These taxa, not typical of a coastal pond or salt marsh, included Brizalina spathulata, Ammonia beccarii and radiolarians. For example, deposits dating to 2100 and 3670 cal. yrs. B.P., when sea level was at least a meter lower than modern (Wright et al., 2005) , contained taxa found at modern water depths of at least −5 m in the region (Tables 1 and 2 ). Given the shallow bathymetry of Apalachee Bay, the foraminifera were transported at least 12 km before being deposited into Mullet Pond (Table 1 ). The presence of these taxa suggests large deposits like these were produced by violent events capable of transporting offshore sediment a considerable distance.\nUnderstanding the relationship between storm frequency and intensity distribution during the last few thousand years will require a multi-site approach. A suite of records from closely-spaced sites with different flooding thresholds but the same history of storm strikes is needed to quantify the relative contributions of storm frequency and intensity to variability in hurricane activity. More thorough and detailed microfossil analysis, though very time consuming, could also aid in constraining flooding event intensity for the most intense paleohurricane events by identifying the provenance of the marine sediment in the resulting overwash deposit."}, {"section_title": "Conclusions", "text": "The Mullet Pond record indicates that the most active interval for tropical cyclones in the Northeastern Gulf of Mexico during the late Holocene was 2800 to 2300 cal. yrs. B.P. Large storm deposits were rarely detected between 1900 and 1600 cal. yrs. B.P. and after 400 cal. yrs. B.P. A decline in the number of large storm deposits, which began around 600 years ago, has persisted through present with below average frequency over the last 150 years when compared to the preceding five millennia. However, given the stochastic nature of hurricane landfalls, any trend in basin-wide hurricane frequency during the late 20th century would not be detectable in a single sedimentary record. With an approximately 7-year temporal resolution and a record mean storm frequency of 3.9 events per century, Mullet Pond provides a richer and more detailed archive of storm activity than other existing paleohurricane records. The record presented here provides further evidence for significant variability in the frequency of high magnitude storm events in the Gulf of Mexico during the late Holocene. When all events were considered, however, variations in local storm frequency could be explained entirely by the random clustering of events in time. This finding suggests that variability in flooding frequency at this and other Atlantic and Gulf paleohurricane study sites might have been controlled by changes in the intensity distribution of hurricanes rather than changes in overall storm frequency.\nThe successful development of a high-resolution paleohurricane record from Mullet Pond indicates that coastal sinkholes can serve as valuable archives of past hurricane activity. These depositional basins can have high sedimentation rates that make sub-decadal resolution records possible. As valuable indicators of marine provenance, foraminifera have served as definitive indicators of coastal flooding in back-barrier depositional settings. Good foraminifera preservation together with low bioturbation make Mullet Pond and similar sinkhole environments good targets for future microfossil-based paleohurricane research. The presence of calcareous, marine microfossils as early as 5500 cal. yrs. B.P. serves as evidence that the site has been periodically inundated for over five millennia and proves that prolonged preservation of foraminifera is possible in these environments. On carbonate platforms where sinkholes are often abundant, topography is low and surge penetration is extensive, a very large number of long, high-resolution paleohurricane records likely exist and await discovery. Ongoing efforts to identify and develop paleohurricane records from the geologic register will further clarify how tropical cyclones have interacted with late Holocene climate variability and change.\nSupplementary materials related to this article can be found online at doi:10.1016/j.margeo.2011.07.001."}]