[{"section_title": "INTRODUCTION", "text": "Barrier islands are elongated accumulations of sand separated from the mainland by open bodies of water like lagoons, bays, and estuaries. Fifteen percent of the world's coastlines are comprised of barrier islands and they are the predominate landform on the U.S. East and Gulf Coasts (NOAA Coastal Services Center 2006). Nurtured by sand and shaped by winds and waves, barrier islands are capable of withstanding large storms and actually require natural catastrophes to survive and persist. Barrier islands act as buffers to the mainland, protecting the mainland and estuarine ecosystems from direct assault from the ocean, especially large storms. Barrier islands are critical to our economy, lifestyle and welfare, as homes, businesses, and critical roadways are located on or near barriers. Over the past 30 years, barrier islands have become densely developed. Now, over 50% of the U.S. population (160 million) lives in coastal counties, and coastal county population is increasing by 3,600 people per day (Hoagland 2007). Coastal states generate 85% of all tourist revenues in the United States (Houston 1996). When taking into account the multiplier effect, tourist expenditures may be worth three to five times their initial value (Higgins 1999). When consumers spend more money, the firms who own the goods gain higher profits and the workers receive higher incomes, which stimulates consumer spending once again (Mankiw 2004). The socially and economically valuable investments in capital and infrastructure on barrier islands are threatened by major coastal hazards like hurricanes and sea level rise. Hurricanes impose drastic environmental changes on low-lying barrier islands. High winds damage homes, especially those poorly built or not \"shuttered up\" for protection. The waves pulverize the coast and cause rapid shoreline erosion. The fast, short-lived rise in water level associated with hurricanes, called storm surge, also erodes the shoreline and floods coastal properties. The hurricane of 1938, which made landfall throughout New England, ranks as one of the worst disasters in American history in terms of property damage and fatalities. The hurricane's raging tidal waves collapsed on the shore and effortlessly swept entire beach communities out to sea. The screaming 150 mile per hour winds twisted steel and concrete radio towers into unrecognizable shapes. Hundreds of people clung to rooftops and debris and drifted across the bay to the mainland. A heavy cloud of salt spray lingered above the ground, defoliating and eventually killing thousands of trees as far as five miles inland. Only 26 homes remained on Westhampton Beach, located on Fire Island, New York, a few hours after the storm struck (McCormick et al. 1984). In addition to short term storm events, beach dwellers also face another type of shoreline change hazard -the slow, persistent rise of sea level. Sea level has been rising for thousands of years, but has accelerated in the last 150 years (Donnelly 2006). As human induced global warming is expected to create a significant global mean sea level rise in the 21 st century, the fate of barrier beaches is uncertain (Nicholls 2004). Barrier islands naturally migrate landward as a result of overwash deposition onto the backbarrier from a moderate rising sea level. A moderate rising sea level is actually necessary for barrier islands to persist (Pilkey 2003). However, the construction of hard stabilization structures on barrier beaches, like seawalls, groins, and jetties, blocks the headland source of sediment and limits the ability of barrier islands to migrate. The question remains at what point barrier islands reach a threshold where they will no longer be able to keep up with sea level rise and will drown completely. Today's technology has not lessened the possibility of repeat of the 1938 storm in the future. And despite the certainty of future sea level rise, the popularity and desirability of owning shorefront property remains high. An increasing number of homes on Fire Island are popping up dangerously close to the edge of the sea. Shoreline development is inevitable, as too many people are willing to try to beat the odds that a hurricane of the 1938 is just a one-time happening (McCormick et al. 1984). Sea level rise rates and increased storm activity raise significant concern due to the high economic activity and human habitation in the coastal zone (Nicholls and Lowe 2004). A key piece of information that scientists are missing is the economic criteria and suggestions for optimizing responses to shoreline change hazards, including potential barrier protection. The purpose of my project is to be able to assess the economic impacts of barrier beach drowning. A key piece of information for projecting future impacts of shoreline erosion due to sea level rise or hurricane activity is calculating market values of properties as a function of distance from shoreline. Once market values are extrapolated across the entire barrier island, a flood model that generates storm surge or different sea level rise scenarios for a target area can be used to estimate damages in modern dollars."}, {"section_title": "METHODS", "text": "My goal is to create a market valuation model that estimates market values of properties as a function of distance from shoreline. I hypothesized that market values would be higher the closer they are to the water, as homeowners have to pay an aesthetic premium for having an oceanfront view and beach access. The methods section includes identifying the study area (Fire Island, New York), completing an economic analysis of a sample number of properties on Fire Island, creating a market value extrapolation for properties across the entire barrier island, and running a storm surge model for the target area."}, {"section_title": "Study Area", "text": "Fire Island is a long, narrow, wave-dominated sandy barrier island on the south shore of Long Island, New York (Pendleton et al. 2004). The western and central portion of Fire Island is well-developed while the eastern portion is federally protected land, the Fire Island National Seashore (see Figure 1)."}, {"section_title": "Figure 1. Fire Island, New York", "text": "Fire Island is categorized as having a high wave energy and low tidal range, resulting in a very high coastal vulnerability index (CVI) for the entire length of the island (Pendleton et al. 2004). The CVI provides insight into how much coastal change is expected in a particular area due to future sea level rise. Areas marked by the orange and red colors represent a high to very high potential of coastal change, and thus are areas which are a primary cause for concern (see Figure 2)."}, {"section_title": "Figure 2. Fire Island Coastal Vulnerability Index", "text": ""}, {"section_title": "Economic Analysis", "text": "Economic data for properties on Fire Island was gathered from the Zillow website (www.zillow.com). By typing in an address or \"zooming in\" to an area, you can find properties which list economic data of interest: market value, high and low range market values, and the most recent tax assessed value for individual properties. The Zillow website also provides the year and price of the property when it was last sold, as well as the lot size. See Appendix 1 for more information on how the market value is calculated from this website. Using Zillow, I gathered all the economic criteria for 194 properties at five locations on Fire Island: Saltaire, Atlantique Park, Ocean Beach, Fire Island Pines, and Bayberry Dunes. In order to import the data into a Geographic Information System (GIS), I used Google Earth to find each property's latitude and longitude. Once the data was in a GIS, I could measure each property's distance from the shoreline. The 194 properties for which I found economic data provided me with a good foundation to base my market value extrapolation on across the entire barrier island (see Figure 3) Clearinghouse, did not cover the entire barrier island, therefore, I needed another way to obtain a point feature for every property on the island. Using GIS, a \"fishnet\" grid was created to cover the extent of the entire barrier island. Each cell in the grid was 23 meters by 23 meters, or 0.13 acres, the average lot size on Fire Island. A point feature was placed in the center of each grid cell, which could represent a house. The points were sampled from the distance to the shore, and then the equation was applied to find what their market values would be.  "}, {"section_title": "SLOSH Model", "text": "The last part of the project is to run a SLOSH (Sea, Lake, and Overland Surges "}, {"section_title": "RESULTS", "text": "The result of the market valuation model, based on the equation that describes the relationship between market value and distance to shoreline for the compiled data, is shown in Figure 4  The result of the SLOSH run based on Hurricane Gloria produced a storm surge of 2.5 meters across the entire barrier island. One of the drawbacks of using SLOSH is that the spatial resolution is not ideal. Using another version of the SLOSH model, surge heights are calculated for set locations throughout the region for a number of category 1 -4 hurricanes, varying in forward speed, landfall location and track. The maximum values obtained for all hurricanes of a particular category were then transferred to a 1:24,000 base map (contour interval 10 feet) to delineate surge zones. The surge zones are now shown for the target area with better spatial resolution. Figure 5 shows the surge zones based on the SLOSH model from different category hurricanes for Fire Island and the entire length of Long Island. A Category 1 hurricane would produce a surge zone in the dark green area, and a Category 4 hurricane would flood everything up to and including the red zone (see Figure 5). Figure 6 shows a close-up of Fire Island, and knowing that Hurricane Gloria was a weak Category 3 storm, the storm surge would flood the majority of the barrier island.  Total damages incurred from Hurricane Gloria were estimated at $900 million USD in 1985, or $1.5 billion in 2005 USD. Future research should definitely look at comparing this estimate with my valuations. Calculating economic damages not only considers the value of lost property, but also the expenses involved in protection (West et al. 2001, Yohe et al. 1999 and land appreciation that can be expected on vulnerable properties. These estimates also miss any adaptation that would occur as new information becomes available, or any policies that might be enacted to protect or abandon buildings (Yohe et al. 1996)."}, {"section_title": "MANAGEMENT OPTIONS", "text": "Intense hurricanes and sea level rise leads to inundation and erosion of coastal property and increased risks in flooding. There are two general ways to go about managing coastal areas: either protecting coastal development or retreating. Protecting coastal property typically involves shoreline stabilization options, such as beach nourishment or coastal armoring, which can be conducted in either an uncoordinated or coordinated manner (Parsons and Powell 2001). Retreat involves the abandonment of buildings and property, moving structures further away from the shoreline, or putting buildings up on pilings (Parsons and Powell 2001). Beach erosion problems are unique, as strong feedbacks (in both directions) exist between human activity and the health of barriers. Decision-makers in each community must look at all available options to choose the best management option for their area."}, {"section_title": "Beach Nourishment", "text": "The most modern way of protecting coastal development is called beach nourishment, where sand from an offshore location is dredged and brought onto the eroding beach. Successful beach nourishment projects benefit coastal communities by improving the quality of the beaches, providing protection against storm surge, and increasing property values (Leonard et al. 1990). Depending on the quality of the dredged sand, nourished beaches are sometimes more attractive and are a better quality than non-nourished beaches, therefore attracting visitors and enhancing travel and tourism. Nourishment also widens the beach and protects public and private beaches from dangerous storm surge. Properties existing on a nourished beach increase in value because they are more likely to withstand heightened storm surge and coastal erosion. Beach nourishment projects may also help improve navigation through inlets, or can protect property by moving the inlet all together. However, beach nourishment is extremely costly (averaging around $13/cubic yard) and the design life of beach nourishment projects are only temporary, lasting maybe ten years until another multimillion dollar investment is needed to ensure that the beach doesn't wash away (Bush et al. 1996). Beach nourishment has many adverse effects on the natural environment. If beach nourishment projects are not carefully planned and executed, the nourishment may degrade species' habitats. Once sand is dumped on the beach, it becomes compacted from the heavy machinery running over the beach. The compaction of sand can kill tiny critters that live in the top few inches of sand, like moll crabs and coquina clams. These species form the basis of the food chain for shore birds (Barrett 2004). Even dredging sand of a different grain size poses serious biological threats and can influence the rate at which sand stays on the beach. When beaches are replenished with too fine grained sand, the waves can easily take the new sand back out to sea, which makes the nourishment project ineffective and worthless. Coarser grained sand will last on the beach longer, but sand too coarse may jeopardize sea turtle habitats and the sea turtle's ability to breed. Sea turtles do not nest on barrier islands as far north as Fire Island, however, this is a major concern in warmer climates. Fire Island requires continuous beach nourishment projects to help preserve permanent structures and protect property. The hard stabilization structures were built to protect property, but have now transferred the erosion problem to adjacent properties. Since 1962, Fire Island has received ten nourishment projects costing a total of $15,741,729 in federal, state, and local/private funds. Federal funds (for emergency and navigation purposes) account for $2,037,776 of the total, for two projects. State funds account for $1,323,953 of the total, for one project. Local and private agencies represent the majority of funding for beach nourishment at $7,880,000, for six projects. One project, who's funding is unknown, amounts to $4,500,000, which just took place in 2007 (PSDS 2006)."}, {"section_title": "Coastal Armoring", "text": "Coastal armoring involves the placement of hard stabilization structures, such as jetties, groins, seawalls, and breakwaters on the beach or in the water to slow coastal erosion. However, coastal armoring is now being recognized as having adverse environmental impacts on downdrift beaches (Bush et al. 1996, McCormick et al. 1984. Structures placed on the shore, like groins and sea walls, are not only aesthetically unattractive, but also reduce public access to the beach and interfere with the beach's natural migratory course (Alternative Shoreline Stabilization Devices 2006). Structures placed in the water, like breakwaters, are hazardous to swimmers and boaters and cause unwanted erosion of downdrift beaches. The devices restrict the cross-shore or alongshore transport of sand and therefore, just transfer the erosion problem to adjacent beaches. The cost of coastal armoring ranges from $500/foot for small sandbag projects to $10,000/foot for large stone seawalls."}, {"section_title": "Coordinated Versus Uncoordinated Protection", "text": "Decisions to protect coastal property can be coordinated or uncoordinated. Coordinated decisions involve regional managers or government officials making a collective decision to protect coastal property. For example, managers might decide to nourish the beach (i.e. beach nourishment), or property owners might be mandated by law to either nourish or armor the coast or prohibited by law to either nourish or armor the coast. People assume decisions will be coordinated, but coastal protection is often done in an uncoordinated manner (Yohe et al. 1999). An uncoordinated decision means there is an absence of coherent policy of coordination. The decisions to protect housing may be influenced by the individual property owner's wealth, their own perceptions of risks, or the actions of their neighbors. Property owners need to be educated about the risks of living in naturally eroding areas and decide how they are going to protect their property if it becomes threatened by a major storm or hurricane. Property owners should be aware of their location choice and if they need to setback their house a certain distance from the water for more protection. They should look into viable coastal armoring solutions, the structural design of their house and also purchase insurance (Hoagland 2007)."}, {"section_title": "Retreat", "text": "The third management option is retreat, which is when buildings are picked up and relocated to a safer distance away from the shoreline. The relocation of buildings can mean demolishing or abandoning buildings and rebuilding somewhere else. Abandonment can be an economically viable solution, especially if the building has existed well beyond its design life and there is little value left to it. Relocation helps preserve the beach and buildings and also saves property owners, the community, and taxpayers the costs associated with other shoreline stabilization methods. However, relocation can be politically difficult as well as costly, and the land is ultimately lost (Bush et al. 1996). Retreat has been employed on the coast for the last 150 years and with time, will be accepted more as a preservation method. The costs and benefits of moving structures away from the shoreline should be weighed with the other shoreline stabilization alternatives. A move-back may compare favorably, both aesthetically and economically, to the stabilization alternatives in the long run (Bush et al. 1996). "}, {"section_title": "POLICY", "text": ""}, {"section_title": "Legal Mandates", "text": "Beach erosion is a complex issue and the laws and programs relating to it provide different solutions and possibilities for addressing the problem. The existing management choices for property damage mitigation might work for one area, but not another because so many factors must be considered: the causes of the erosion, the responsible parties, and the possible economic benefits. An optimal policy response level to shoreline change would have to take into consideration the monetary and nonmonetary benefits of beaches and oceans. People who do not live at the beach or get to visit the beach often still gain benefits from the ocean's resources and value the beach for its existence (Hoagland 2007). In response to an intense period of hurricane activity along the Atlantic and Gulf Coasts, the federal government enacted the first major legislation affect beach erosion, the River and Harbor Act of 1962 (NOAA 2007a). This act increased federal aid and participation in the cost of beach erosion and shore protection -50% of the construction costs for publicly owned beaches, and 70% for seashore parks and conservation areas (NOAA 2007a). Section 111 of the River and Harbor Act of 1968 authorizes the construction of projects to prevent or mitigate shoreline damage directly attributable to federal navigation works (NOAA 2007b). Some conservationists and coastal scientists view dredged and jettied navigation channels cause the majority of beach erosion because the beach cannot take its natural course and be in dynamic equilibrium with the forces shaping the shoreline. Federal improvements to navigation channels perpetuate the erosion of adjacent beaches caused by manmade structures, therefore they view Section 111 as inadequate for its purpose. On the other hand, USACE calculates that the damage caused by channel dredging is a small \"shadow zone\" of erosion, typically less than one mile. From an engineering perspective, Section 111 is seen as adequate for its purpose (NOAA 2007b where new construction is charged a rate that reflects the true risk to the structure. The rates are now being adjusted to place the burden on those that choose to take the risk of "}, {"section_title": "POLICY RECOMMENDATIONS", "text": "The following recommendations are applicable to a variety of coastlines and would have a positive long term effect on the future stability and quality of our beaches. The best solution to overcome beach degradation may not necessarily be renourishing beaches. Beaches should be allowed to naturally shift with the currents, and allowing construction on the beach interferes with this process and eventually leads to accelerated erosion (Pilkey 2006). Therefore, the following recommendations are starting points for a new plan that fosters healthy, long-term beaches. 1. Prohibit all funding for hard stabilization. Groins and piers, for example, are long structures that are built perpendicular to the coast. These stabilization structures alter the ocean's dynamic equilibrium, causing more deposition of sand on one side of the barrier than the other side. The side of the structure that accepts the alongshore current is rapidly growing because sand is continuously deposited. The beach on the other side of the groin is blocked from the current, so very little sand is able to be deposited and the result is a shrinking beach. Government agencies need to stop further construction of these structures and stop putting money in to maintain existing structures. 4. When beach nourishment is being funded by state taxpayers, make sure public access and parking are widely available to visitors. Like federally funded beaches, there should be a certain number of walkovers and parking spaces per mile of shore (Rawlins 2005). Many beachgoers are upset with the lack of public access and parking options at the nourished beaches they helped to fund. Many roadside parking spaces are also unavailable because houses are there. Those who pay property taxes on oceanfront lots want their privacy and make it hard for day visitors to find anywhere to park and access the beach. Public beaches need to be easily accessed by the public. 5. Educate the public about coastal morphology, the beach management options and their economic consequences, the risks involved with purchasing oceanfront property and building on the beach. Most people are aware of the fact that beaches move, but choose to ignore the other fact that beaches will soon be gone if nothing is done. People should realize that drastic changes in beaches can occur within their lifetime, in fact, within the next tropical storm or hurricane. Warning the public about the always changing shoreline will probably help more people accept the proposed recommendations and save the beach for future generations to enjoy. Additional research is needed in order to develop more recommendations that would support the best policy of letting the beaches alone. We can conclude that hard stabilization has the worst environmental impacts and should not be used as a way to protect the eroding shoreline. The \"softer\" option of beach nourishment presents a more natural way of protecting development and preserving the shoreline, but still causes more problems in the long run. Therefore, a new beach management plan is necessary to mitigate the effects of coastal erosion and the problem of a rising sea level due to global warming. With strict enforcement of the proposed recommendations and dedication to research and education of the dynamic coastline, America's beaches can be restored and saved for generations to come."}]