[{"section_title": "Introduction", "text": "Sea surface salinity (SSS) is a fundamental variable for ocean circulation and global climate. SSS results from the combined effects of evaporation (E), precipitation (P), land surface runoff, oceanic advection, vertical mixing, and from melting and freezing ice [Yu, 2011;Vinogradova and Ponte, 2013]. As large-scale SSS variations are thought to reflect the net surface freshwater flux (E-P), which is difficult to measure directly, SSS has been considered an indirect \"ocean rain gauge\" [Schmitt, 2008;Terray et al., 2012;Durack et al., 2013]. For instance, under global warming conditions, an intensification of the global hydrological cycle is projected due to the larger water vapor loading of the atmosphere, resulting in enhanced E-P in evaporative regions and reduced E-P in precipitative regions [Held and Soden, 2006]. Global SSS trends since the 1950s showing salinification in saltier regions and freshening in fresher regions provide evidence for such an intensification [Helm et al., 2010;Durack et al., 2012;Skliris et al., 2014]. In the North Atlantic, SSS is of particular importance as it contributes to the density of water masses that take part in the upper branch of the Atlantic Meridional Overturning Circulation (AMOC) [Kuhlbrodt et al., 2007], with well-established impacts on the Northern Hemisphere climate [Paillard and Labeyrie, 1994;Stouffer et al., 2006] and on the ocean's capacity to store heat and carbon [Joos et al., 1999;Gruber et al., 2002]. Salinity variations also contribute to North Atlantic regional sea level change [Steele and Ermold, 2007;Durack et al., 2014] and Atlantic marine biodiversity [Lenoir et al., 2011]. Although the Atlantic is well sampled historically compared to other basins, continuous SSS time series beginning before the 1950s have been limited to small regions, e.g., the northeast subpolar gyre (SPG) [Reverdin, 2010]. This limited length of data has made it difficult to resolve decadal and multidecadal variability. For example, from the 1950s to the late 1990s, a freshening trend was reported in the subpolar North Atlantic [Curry and Mauritzen, 2005;Boyer et al., 2005]. However, subpolar North Atlantic upper ocean salinity increased from the 1990s to the mid-2000s [Holliday et al., 2008], resulting in slightly positive overall trends from 1950 to 2010 [Durack and Wijffels, 2010;Skliris et al., 2014]. In the tropical and subtropical Atlantic, a salinification trend was reported from the 1950s to the late 1990s [Curry et al., 2003;Boyer et al., 2005;Gordon and Giulivi, 2008]. However, the North Atlantic Oscillation (NAO) experienced a positive trend during this period, which may have contributed to this salinification [Curry et al., 2003]. In the tropical Atlantic, salinification was followed by freshening since the mid-1990s [Grodsky et al., 2006;Terray et al., 2012]. In this study, we present an unprecedented gridded SSS compilation spanning 118 years in the Atlantic north of 20°S, from 1896 to 2013. The increased temporal and spatial coverage allows us to resolve the major modes of SSS variability, which are linked to large-scale Atlantic climate variations. We also find long-term subpolar freshening and low-latitude salinification trends that are largely consistent with the expected impacts of global warming."}, {"section_title": "Data and Methods", "text": ""}, {"section_title": "Salinity Data", "text": "The SSS data are compiled from independently validated and bias-corrected in situ data sets from 1896 to 2013. The main data sources are previously described oceanographic research sections, weather ships, and ships-of-opportunity transects [Reverdin et al., 1994;Reverdin, 1996;Reverdin et al., 1997;Alory et al., 2015]. These are complemented by selected and validated upper level data from Nansen bottles and conductivity-temperature-depth casts from the World Ocean Database [Boyer et al., 2013], Prediction and Research Moored Array in the Tropical Atlantic moorings [Bourlès et al., 2008], and Argo float profiles from the Coriolis data set [Gould et al., 2004;Cabanes et al., 2013]. SSS is reported here as Practical Salinity Scale 1978 (PSS-78) [Fofonoff, 1985]. SSS uncertainties, including those related to collection and measurement errors [Yu, 2010;Asher et al., 2014;Anderson and Riser, 2014;Boutin et al., 2014], are discussed in the supporting information. The source data are binned into 32 boxes of length scale 100-1000 km, chosen to be large enough to get some sampling through most of the period, but small enough that low-frequency (decadal) signals are coherent across each box. The boxes cover most of the Atlantic between 20°S and 70°N, excluding regions of large spatial variability which are insufficiently sampled: the Amazon and Orinoco freshwater plumes, the Gulf of Guinea, and north of the Gulf Stream. Monthly climatologies are constructed mainly based on the 1977-2013 reference period updated from Reverdin et al. [2007] ( Figure S1 in the supporting information), for which we can most fully resolve the seasonal cycle over the entire domain. The monthly climatologies are subtracted from individual measurements to obtain individual anomalies. In each gridbox, the individual anomalies are then median-averaged within each season (March-May, June-August, September-November, and December-February), and an error term is estimated (see the supporting information). For each season, an elementary 1-2-1 binomial filter is applied over successive years to reduce noise, and the filtered seasonal anomalies are centered to a 1896-2013 baseline (e.g., Figure 1a for March-May). To produce the yearly (March to February) time series, the 1-2-1 filtered seasonal time series are averaged, inversely weighted by their errors."}, {"section_title": "Climate Data", "text": "We investigate the linkages between SSS and two leading modes of North Atlantic climate variability: the NAO [Hurrell et al., 2003] and the Atlantic Multidecadal Oscillation (AMO) [Kerr, 2000]. For the NAO, we use sea level pressure (SLP) from the NOAA-Cooperative Institute for Research in Environmental Sciences 20th Century Reanalysis, version 2c [Compo et al., 2011]. The NAO is defined as the leading principal component (PC) of winter (December-March) mean SLP from 20°to 80°N, 90°W to 40°E [Hurrell and Deser, 2009]. A 1-2-1 binomial filter is applied to the yearly time series, similar to the SSS data. For the AMO, we use annual mean (March-February, similar to SSS) sea surface temperature (SST) from NOAA Extended Reconstructed Sea Surface Temperature, version 4 [Huang et al., 2015]. The AMO is defined by regressing out global mean SST from the area-averaged North Atlantic SST anomaly (0-70°N, 7.5-75°W) [Gastineau and Frankignoul, 2015]; the SST time series are smoothed using a low-pass filter based on a combination of binomial filters, with a cutoff period of about 12 years [Trenberth et al., 2007]. Additionally, we investigate the Sahel rainfall time series, constructed from the Global Historical Climatology Network Gridded Land Precipitation data set, version 2 [Peterson and Vose, 1997], from 1900 to 2013. The Sahel rainfall index is defined as the area-averaged rainfall anomaly from 10°to 20°N, 20°W to 10°E [Mitchell, 2015]. We also examine global mean surface temperature (GMST) from NASA Goddard Institute for Space Studies Surface Temperature Analysis [Hansen et al., 2010;GISTEMP Team, 2016]. For both indices, we take the annual means from March-February and apply a 1-2-1 binomial filter."}, {"section_title": "Results", "text": ""}, {"section_title": "Regional SSS Variability", "text": "The (1-2-1 filtered) annual mean SSS standard deviation is shown in Figure 1b. To examine the main regions of coherent SSS variability, we apply empirical orthogonal function (EOF) analysis to the area-weighted SSS anomalies. The leading EOF (EOF1) accounts for 29% of the total variance and is well separated from EOF2 according to North et al. [1982] ( Figure S2a). The leading principal component (PC1) is very highly Geophysical Research Letters 10.1002/2017GL072582 correlated with area-averaged SSS from 20°S to 40°N (r = 0.97, p < 0.01), referred to as TATL (Figures S2b and S2d). The TATL spatial pattern ( Figure 1c) is shown by the least squares regression onto the normalized time series, to indicate typical amplitudes. Hereafter, unless noted otherwise, correlation significance is evaluated by using a random-phase bootstrap test to account for serial autocorrelation [Ebisuzaki, 1997], using 12,000 iterations. The TATL pattern corresponds to a dipole structure with positive anomalies from 20°S to 40°N and with negative anomalies over the subpolar North Atlantic. The anomalies are significant (p < 0.05) over most EOF2, which accounts for 16% of the total variance, is heavily localized in a few tropical Atlantic gridboxes, consisting of negative loadings in the large box from 5°to 15°N and positive loadings in the Antilles box ( Figure S2c). As it is not well separated from EOF3 (12% of the total variance) and our focus is on large-scale regional variability, we do not discuss it further here. Next, we focus on the northern North Atlantic. As EOF1 and EOF2 do not significantly project onto this region, we separately apply EOF analysis to the gridboxes north of 45°N. The leading EOF of the northern region (N-EOF1) accounts for 51% of the variance north of 45°N and is well separated from N-EOF2 (21% of the northern variance) [North et al., 1982] ( Figure S3a). N-PC1 is very highly correlated with area-averaged SSS from 45°to 62°N (r = 0.985, p < 0.01), referred to as NATL ( Figures S3b and S3c). The NATL spatial pattern (Figure 1d) features a north-south dipole like TATL, but with the significant positive SSS slopes (p < 0.05) north of 45°N. The NATL time series (Figure 1e, top) features a long-term gradual freshening, punctuated by pronounced freshening events around 1920, and from the late 1960s to the mid-1970s, known as the Great Salinity Anomaly (GSA) [Dickson et al., 1988]. Following a partial recovery around 1980, there were two smaller GSA-type events in the 1980s and 1990s [Belkin et al., 1998;Belkin, 2004]. Figure 1f shows the lagged correlation of linearly detrended NATL and TATL ( Figure S4a). We note that detrending does not change the NATL and TATL centers of action ( Figures S4b and S4c); hereafter, all lagged correlations are for linearly detrended time series. NATL and TATL are significantly anticorrelated (p < 0.05) when NATL leads TATL by about a decade, with the strongest correlation at lag À 12 (p < 0.01). The correlation switches sign when TATL leads NATL, with a maximum when TATL leads by a decade. However, it just barely reaches the (p < 0.05) significance threshold."}, {"section_title": "Relationship With Climate Variability", "text": "Here we examine the relationship of climatic modes and detrended SSS. The NAO and AMO time series are shown in Figure 2a. They are significantly anticorrelated (p < 0.05) when the AMO leads the NAO by a few years ( Figure S5), as noted previously [Peings and Magnusdottir, 2014]. The lagged correlations of the NAO with TATL and NATL are shown in Figure 2c. The NAO and TATL are significantly correlated (p < 0.05) within lag ± 2, most significantly (p < 0.01) at lag À 0. Conversely, the NAO and NATL are not significantly correlated, although the coefficient has a local minimum at lag À 0. Figure 2b shows the spatial projection of SSS onto the NAO at lag À 0. It features a dipole pattern with positive slopes south of 45°N and negative slopes north of 45°N, albeit with limited statistical significance. Within NATL, there are significant negative correlations (p < 0.05) in the eastern SPG: the central eastern SPG (50°-55°N) is significant at lag À 0; the northeast SPG (55°-62°N) is significant at lag À 1 and lag À 2 (not shown), consistent with Reverdin [2010]. The significant correlation of the NAO and TATL presumably reflects the integrated influence of the NAO through wind-forced circulation and air-sea fluxes. The spatial pattern is consistent with surface freshwater fluxes, as the northward shift of storm tracks in positive NAO winters results in increased evaporationprecipitation (E-P) in the subtropics and decreased E-P in the SPG [Hurrell and Deser, 2009;Stendardo et al., 2016]. In the tropics, the influence of the NAO onto SSS may reflect enhanced evaporation due to stronger trades and entrainment of saltier equatorial undercurrent water into the mixed layer [Curry et al., 2003;Mignot and Frankignoul, 2004]. The NAO also drives significant changes in the gyre circulations [Marshall et al., 2001;Visbeck et al., 2003]. Figure 2d illustrates the NATL and TATL lagged correlations with the AMO. The AMO and NATL are significantly correlated (p < 0.05) within lag À 4 to lag + 3, most significantly (p < 0.01) at lag À 1. In contrast, the AMO and TATL are significantly negatively correlated (p < 0.05) when the AMO leads by around a decade. The lag À 0 spatial projection of the AMO onto SSS is shown in Figure 2e. All of the NATL gridboxes feature positive slopes, with the majority showing significant (p < 0.05) correlations. TATL is less consistent spatially, but there are negative slopes in the deep tropics, significantly (p < 0.05) from 5°to 20°N. The significant covariability of NATL and the AMO is consistent with previous findings [Polyakov et al., 2005;Wang et al., 2010;Zhang et al., 2013]. The AMO has not been found to have a strong signature on SPG rainfall [Alexander et al., 2014]; rather, the NATL relationship is indicative of a net increase of the northward transport of saline waters into the SPG "}, {"section_title": "Geophysical Research Letters", "text": "\n10.1002/2017GL072582 Geophysical Research Letters\n10.1002/2017GL072582 Finally, an important question is whether the long-term NATL freshening indicates a century-long weakening of the AMOC, as suggested recently [Rahmstorf et al., 2015]. Further sensitivity studies are needed to assess the potential reduction in deep convection implied by the subpolar SSS decrease."}, {"section_title": "10.1002/2017GL072582", "text": "AMOC in the AMO, as proposed in theoretical and modeling studies, where an AMOC intensification is associated with an increase of warm and saline water into the subpolar region [e.g., Delworth et al., 1993;Vellinga and Wu, 2004;Latif et al., 2004;Knight et al., 2005]. The negative correlation of the AMO and northern tropical SSS suggests a connection with the Atlantic Intertropical Convergence Zone (ITCZ), whose latitudinal displacement-as reflected in Sahel rainfall-is linked to the AMO [Zhang and Delworth, 2006;Ting et al., 2011]. To explore this connection, we examine the Sahel rainfall time series (Figure 2f, top). The lag À 1 spatial projection of SSS onto Sahel rainfall (Figure 2g) features positive slopes in the northeast Atlantic and significant negative slopes in the tropical Atlantic adjacent to the Sahel. The area average of the three strongly negative boxes from 55°to 20°W, 5°t o 20°N (referred to as NTROP) is shown in Figure 2f (bottom). NTROP is significantly negatively correlated (p < 0.05) with Sahel rainfall from lag À 3 to lag + 1, most significantly (p < 0.01) at lag À 2 (Figure 2h). The significant negative relationship may indicate a direct influence of the marine ITCZ on SSS via precipitation fluxes. It may also reflect evaporation or entrainment mechanisms, which were found to be dominant factors for tropical Atlantic SSS over recent decades where satellite ocean precipitation estimates are available [Grodsky et al., 2006].\nThe residual NATL and TATL time series are shown in Figure 3b. Both have significant 1896-2013 trends: 0.036 ± 0.021 PSS-78 per 50 years (TATL) and À0.039 ± 0.014 PSS-78 per 50 years (NATL). The 1896-2013 residual trend pattern (Figure 3d) is very similar to the original trend pattern (Figure 3c) except for two fewer significant gridboxes. Figure 3i compares the residual zonal mean trends from Figure 3d versus the climatology. The 1896-2013 residual Atlantic PA (3.3 ± 2.8% per 50 years) is about 10% smaller than observations. Applying equation 1to GMST yields an 1896-2013 residual trend of 0.40 ± 0.10°C per 50 years; the 1896-2013 residual Atlantic PA scaled to this value is 8.3 ± 7.3 % per°C. For 1970-2013, there is a significant trend in the AMO (0.46 ± 0.21°C per 50 years), though not the NAO (0.13 ± 1.4 normalized units per 50 years). As a result, the prominent regions where the trend signal is captured by the multiple regression are where the AMO fit is strong (Figure 2e). The residual 1970-2013 trend pattern (Figure 3f) shows a reversal of the freshening from 5°to 20°N, 55°to 25°W in Figure 3e, resulting in a more coherent TATL salinification. The 1970-2013 residual TATL trend (0.11 ± 0.069 PSS-78 per 50 years) is thus stronger than the original data. The residual NATL trend has weak freshening (-0.004 ± 0.073 PSS-78 per 50 years). SPG residual gridbox trends show reduced salinification, with some boxes showing freshening. Overall, the residual pattern is more consistent with the 1896-2013 trend. The 1970-2013 residual Atlantic PA of 6.7 ± 4.2% per 50 years (Figure 3j) is significant, unlike the original data. Scaling the residual Atlantic PA to the 1970-2013 residual GMST trend (0.77 ± 0.08°C per 50 years) yields 8.7 ± 5.5 % per°C, which is much larger than the original 1970-2013 scaled PA, and similar to the 1896-2013 Atlantic PA estimate."}, {"section_title": "Long-Term Trends and Pattern Amplification", "text": "We investigate SSS trends over the entire record from 1896 to 2013 and from 1970 to 2013, the recent period of relatively continuous GMST increase [Cahill et al., 2015]. Figure 3a shows the NATL and TATL time series from Figure 1e with the 1896-2013 and 1970-2013 trends. TATL has an 1896-2013 salinification trend of 0.040 ± 0.031 PSS-78 per 50 years (slope ± 95% confidence interval (CI); trend CIs are constructed by resampling the trend residuals using the random-phase bootstrap described earlier). NATL has an 1896-2013 freshening trend of À0.042 ± 0.020 PSS-78 per 50 years. The 1896-2013 spatial trend pattern (Figure 3c) shows coherent signs within the TATL and NATL regions-all NATL boxes show freshening, and all TATL gridboxes show salinification. The most positive trends are from 15°to 20°N, with the maximum salinification from 30°to 55°W (0.091 ± 0.037 PSS-78 per 50 years). The most negative trends are in the western SPG and Labrador Sea, with the maximum freshening within (30°-45°W, 50°-55°N): À0.089 ± 0.017 PSS-78 per 50 years. Durack et al. [2012] characterize the intensification of the mean SSS field by regressing the zonal mean SSS trend onto the zonal mean SSS climatology; they term the slope the pattern amplification (PA) coefficient. Here we area average the 32 gridboxes into nine roughly zonal banded regions (black dashed lines in Figure 3c). The zonally aggregated trends verus climatologies (from Figure 1a) are depicted in Figure 3g, which shows a strong relationship between the trends and climatologies. The 1896-2013 slope, which we term the Atlantic PA, is 3.7 ± 2.9% per 50 years (slope ± 95% CI; Atlantic PA CIs are calculated as 1.96 × Atlantic PA slope standard errors; see the supporting information). Using the 1896-2013 GMST trend of 0.40 ± 0.12°C per 50 years, we can express the Atlantic PA as 9.1 ± 7.7 % per°C (slope ± 95% CI; see the supporting information). For 1970-2013, both NATL (0.082 ± 0.050 PSS-78 per 50 years) and TATL (0.088 ± 0.099 PSS-78 per 50 years) have salinification trends. The spatial trend pattern (Figure 3e) shows strong positive trends in most of the basin, most significantly north of 15°N. There is also freshening from 5°to 20°N. The 1970-2013 Atlantic PA of 2.8 ± 7.5% per 50 years (Figure 3h) is smaller than 1896-2013. Dividing this by the 1970-2013 GMST trend of 0.87 ± 0.07°C per 50 years yields a scaled Atlantic PA of 3.2 ± 8.6 % per°C, substantially smaller than the 1896-2013 value."}, {"section_title": "Multiple Regression", "text": "The long-term trends may be convolved with the AMO and NAO influence described in section 3.2. As a firstorder decomposition, we remove the lag À 0 fits of the AMO and NAO by using a multiple regression framework, similar to Durack and Wijffels [2010]: where ε is the residual SSS, which includes a secular trend plus remaining variability (including AMO and NAO lagged responses). Equation (1) differs from the bivariate regressions in section 3.2 in that the variables are not detrended prior to the analysis. However, the 1896-2013 trends are not significant for either the NAO (0.11 ± 0.35 normalized units per 50 years) or the AMO (À0.016 ± 0.12°C per 50 years)."}, {"section_title": "Discussion", "text": "In this study, we describe the leading variability in a new SSS record from 1896 to 2013. We find that subpolar SSS varies in phase with the AMO, whereas low-latitude SSS lags by about a decade and varies in phase with the NAO. An unresolved question is whether the decadal TATL lag reflects its local response (as the NAO lags the AMO) or a decadal lagged response to the AMO through the ocean circulation. In the latter case, the AMO may influence tropical SSS via the position of the ITCZ; the tropical anomalies could then be advected around the TATL region. In some climate models, this mechanism forms part of a larger feedback that explains AMOC variability: the tropical SSS anomalies eventually propagate northward, reaching the subpolar North Atlantic after several decades and weakening the AMOC [Vellinga and Wu, 2004;Mignot and Frankignoul, 2010]. Although the length of the SSS data set is too limited to clearly distinguish salinity advection from direct atmospheric forcing, the significant negative correlation of northern tropical SSS with Sahel rainfall is consistent with the first part of this feedback and opens questions for further research. We also describe long-term subpolar freshening and low-latitude salinification trends, which project onto the mean SSS climatology. The 1896-2013 trend pattern is robust to removing the linear lag À 0 AMO and NAO fits through multiple regression. For 1970-2013, removing the AMO and NAO fits reverses the northern tropical Atlantic freshening and subpolar salinfication trends, resulting in much more significant Atlantic pattern amplification in the multiple regression residual than in the full data over this period. This Atlantic pattern amplification is consistent with the \"rich-get-richer\" paradigm of hydrological cycle intensification [Held and Soden, 2006] and increased atmospheric moisture transport from the low-latitude Atlantic to the Pacific [Richter and Xie, 2010]. Similar SSS spatial patterns have been shown in the 21st century and idealized simulations with enhanced E-P fluxes [Stott et al., 2008;Terray et al., 2012;Durack et al., 2012]. Advective processes may also be very important for both the TATL salinification and NATL freshening trends. A potential contributor to the TATL salinification is Agulhas leakage, which is projected to have increased since the 1960s due to intensifying Southern Hemisphere westerlies [Biastoch et al., 2015]. For NATL, there is an opposing balance between Arctic freshwater export-including GSA-type events-and northward flowing Atlantic water. Over the past several decades, subpolar Atlantic and Arctic freshwater convergence have increased due to cryosphere melting and surface runoff [Peterson et al., 2006;Yang et al., 2016]. An opposing mechanism for NATL found in some model simulations is that northward advected Atlantic waters are becoming saltier, which would increase NATL salinity [Latif et al., 2000;Pardaens et al., 2008]. The 1896-2013 NATL freshening trend suggests that this latter process has not outweighed the decreased E-P fluxes and Arctic freshwater export, although it could account for the weaker trends in the eastern SPG and Norwegian Sea salinification. One caveat is that SSS does not directly indicate the net freshwater convergence, for which we would need the vertical integral (although the subpolar Atlantic winter mixed layer often extends hundreds of meters)."}]