[{"section_title": "Introduction", "text": "The demographics of the U.S. public school system are constantly evolving. Currently, the student enrollment is nearly 50 million, with ethnic minority students composing 43% of the population. In 2006, 17% of school-age children were living below the poverty level. Ten percent of White students were below the poverty level, while 33% of African American students and 26% of Hispanic students lived below the poverty level. Twenty percent of school-age children spoke a language other than English at home, and almost three-quarters of those students spoke Spanish (Planty et al., 2008). The No Child Left Behind Act (NCLB) of 2001 advocated that all children can learn and that every school must teach (U.S. Department of Education, 2002). Prior to the early 1990s, Stevens (1993) noted that the \"opportunity to learn science cannot be analyzed because science is not tested,\" and \"we teach what is tested\" (p. 33). Science curriculum was reduced during the first six years of NCLB to focus on reading and math (Cavanaugh, 2007), but in 2007 national science testing was finally required. In an increasingly technological world, it is imperative to develop early the minds of scientists, inventors, and engineers who will keep pace with a highly competitive international market. President Obama stated, \"In a global economy … a good education is no longer just a pathway to opportunity-it is a prerequisite. The countries that out-teach us today will out-compete us tomorrow\" (U.S. Department of Education, 2009). Researchers need to track U.S. students' science performance and determine where extra efforts are needed to improve science education for all students. The interactions of gender, ethnicity and socioeconomics have been considered essential components related to science performance research (Baker, 2002;Kahle & Meece, 1994;Krockover & Shepardson, 1995;Lynch, 2000;Rodriguez, 1998;Stevens, 1993); however, they are absent in the National Science Standards (National Research Council, 1996), ignoring their importance and ramifications to science education (Rodriguez, 1997). The disaggregation of data using these variables was not required by the NCLB until 2002(Education Trust, 2003."}, {"section_title": "Theoretical Framework", "text": ""}, {"section_title": "Gender", "text": "Gender has been defined as \"… a social construction, usually based upon the biology of one's body\" (Scantlebury & Baker, 2007, p. 258). Both genders inherited socio-cultural expectations and treatments that should not have had anything to do with their sexual designation (Haslanger, 2000). However, most cultures led females and males into different experiences so that males and females started school with different knowledge, expectations, and self-confidence in learning (Scantlebury, 1994). Researchers confirmed the presence of gender stereotypes in science learning. Gender stereotypes started as early as first grade science. Females had less confidence in their ability to learn science and had higher science test anxiety than males. Even though there were no gender differences with respect to how much students liked physical science, parents and male students perceived that males were and should be more competent in physical science. These views persisted, despite instances in which females outperformed males in science (Andre, Whigham, Hendrickson, & Chambers, 1999;Greenfield, 1996;Kanai & Norman, 1997). Studies conducted through large data sets showed congruent results. The Nation's Report Card: Science 2005 reported that males continued to score higher than females in science, despite improved science scores by both genders (Grigg, Lauko, & Brockway, 2006). Maehr and Steinkamp (1983) investigated gender differences in science learning through metaanalysis. They reviewed articles from 1965 through 1981, which included more than 14 million students from 20 countries. Small but definitive gender differences were found that favored males in science performance. Campbell, Hombo, and Mazzeo (2000) examined the NAEP data from 1969 to 1999 and found that males in the elementary and middle schools outperformed females on science achievement tests. However, a study conducted by Greenfield (1996) indicated this trend was disrupted when females enrolled in more or advanced science classes. In a study of high-achieving African American females in middle and high schools, Pollard (1993) found that they possessed characteristics congruent with successful White students: confidence in abilities, support structures, and enhanced problem solving."}, {"section_title": "Ethnicity", "text": "Tracking students' performance by ethnicities showed differences. In the early 1980s, Rakow (1985) found that Whites outscored other ethnicities at ages 9, 13, and 17. In a rare instance in 1990, Asians had the highest science proficiency in the twelfth grade, but not in grades four or eight (National Science Foundation, 1994). In 2000, despite a five percent increase in the population of students below poverty, fourth grade Hispanic and African American students narrowed the persistent gap with White students (Grigg et al., 2006). Between 1996 and 2005, fourth graders science performance scores, in order of highest to lowest, were White, Asian/Pacific Islander, American Indian, Hispanic, and African American (U.S. Department of Education, 2007). Peng and Hill (1995) explained that children started school with similar attitudes about science, but ethnic minorities grew less and less prepared for science as they proceeded through the upper grades. Lower science performance among ethnic minorities was considered a product of inadequate learning opportunities in the areas of curriculum, instruction, assessment, teacher education, school organization, educational policies and a failure to connect with students' homes and community environments (Lee & Luykx, 2005. There was also an overrepresentation of ethnic minorities in the low track. Students in low track classes were rarely able to escape the hierarchical labels, because they became enmeshed in a subculture of poor performance and failure. In addition, the school staff participated as gatekeepers who were unlikely to change the status quo (Gilbert & Yerrick, 2001). Gutiérrez and Rogoff (2003) warned that ethnic differences should never be used to rationalize limiting individuals from any ethnic/socio-cultural group. Recognizing both the importance and limitations of students' cultures, Solano-Flores and Trumbull (2003) stated, Culture-free tests cannot be constructed because tests are inevitably cultural devices. Therefore, understandings of non-mainstream language and non-mainstream culture must be incorporated as part of the reasoning that guides the entire assessment process. (p. 9) Gaps in science achievement can be reduced by making science more relevant to the socio-cultural lives of students (Seiler, 2001). Lee and Fradd (1998) promoted the idea of instructional congruence, a process to reconcile academic content with students' cultures and languages. By incorporating real world problems and interdisciplinary content in conjunction with community partnerships, a \"connected science\" could be created (Bouillion & Gomez, 2001). Parsons, Foster, Gomillion, and Simpson (2008) "}, {"section_title": "Poverty", "text": "Between 1996 and 2005, significant differences in science achievement were found between students above and below the poverty level (Grigg et al., 2006;O'Sullivan, Lauko, Grigg, Qian, & Zhang, 2003). The impact of ethnicity and poverty on science performance has been linked as early as third grade (Kohlhaas, Lin, & Chu, 2010). Middle school students in the Third International Mathematics and Science Study (TIMSS) were found to have a strong correlation between science performance and poverty across 45 countries (Yang, 2003). Poverty levels correlated with unequal opportunities related to the quality of instruction, school and home resources, and students' language proficiencies (Hewson, Kahle, Scantlebury, & Davies, 2001;Kahlenberg, 1995aKahlenberg, , 1995b. Consequently, this lack of opportunities progressed to more unmotivated students and lower teacher morale (Lynch, 2000). Tobin, Roth, and Zimmermann (2001) believed that \"national standards are a component of hegemony, which maintains achievement gaps between Whites and African Americans\" (p. 961). Although the original intent of standards-based reform (SBR) was to promote equity in education, many of the introduced policies have empowered states and disempowered communities. Schools alone may not be capable of overcoming all the socioeconomic inequalities of our society (McDermott, 2007). Accountability systems widened the gap between high-and low-performing students, because time and money was spent \"teaching to the test.\" Initially, this increased scores yet deprived students of an in-depth curriculum, creating a new form of discrimination against high-poverty students and schools (McNeil, 2000)."}, {"section_title": "Accountability Systems", "text": "Ironically, schooled knowledges and disciplines may, while offering certain freedoms and opportunities, at the same time further draw students into dominant projects of nationalism and capitalist labor formation or bind them even more tightly to systems of class, gender, and race inequality. (Levinson & Holland, 1996, p. 1) Science reform needs to go beyond the key concepts and conformist science practices espoused by the American Association for the Advancement of Science (AAAS), National Science Teachers Association (NSTA), and National Research Council (NRC) and develop alternative pathways for diverse students that are more democratic and inclusive (Eisenhart, Finkel, & Marion, 1996). Rivet and Krajcik (2008) suggested that project-based instruction be contextualized by using students' prior knowledge and personal experiences. Educational systems must incorporate inclusive curricula that adhere to the \"science for all Americans\" philosophy, a science curriculum that allows \"collateral learning\" by using culturally sensitive instruction that crosses cultural borders (Aikenhead & Jegede, 1999)."}, {"section_title": "Disaggregated Data", "text": "Between 1990 and 2004, Scantlebury and Baker (2007) found there were only 46 research articles that used both the terms \"gender\" and \"race\" with \"science.\" Kahle (2004) also noted a lack of research that connected gender, ethnicity, and science. Others recommended that future research in science explore the interactions of gender, SES, and ethnicity (Baker, 2002;Kahle & Meece, 1994;Krockover & Shepardson, 1995;Lynch, 2000;Rodriguez, 1998;Stevens, 1993). \"We must view, race, ethnicity, class, and sociocultural identities in relation to gender\" and \"understand the role of family and community as socializing agents\" (Krockover & Shepardson, 1995, p. 223). The lack of results by groups and subgroups reinforced stereotypes. \"A great deal of information is revealed when data are reported by gender within ethnic groups\" (Rodriguez, 1998, p. 214). Lee and Luykx (2006) recommended using disaggregated data. Disaggregated data has captured \"the interaction of gender and racial/ethnic differences by addressing the issue of whether gender differences vary within racial/ ethnic groups to understand differences in educational achievement and opportunity across racial/ethnic groups\" (Coley, 2001, p. 2). With subgroup-specific information, stakeholders can better identify actions needed to close the gaps (Lynch, 2000). To capture these subgroups, NCLB began requiring disaggregated data during the 2002-2003 school year (Education Trust, 2003)."}, {"section_title": "Purpose", "text": "Literature showed the impacts of the individual factors of gender, ethnicity, and poverty on students' science achievement but failed to examine the interaction of the three variables together. The purpose of this study was to expand research by simultaneously examining gender, ethnicity, and poverty level with fifth graders' science performance. Disaggregating the three variables provides a more coherent expression of subgroups' characteristics on science outcomes that are unachievable when examining a single variable."}, {"section_title": "Method", "text": ""}, {"section_title": "Data File", "text": "To have meaningful results, the data set required adequate sizes in each of the subgroups. Thus, the Early Childhood Longitudinal Study, Kindergarten Class of 1998-99 (ECLS-K) was selected. The ECLS-K was initiated by the U.S. Department of Education, Institute of Education Sciences (IES) in response to a congressional mandate requiring an account of the status of education in the United States. The National Center for Education Statistics (NCES) was entrusted with the data collection, processing, distribution, and reports for this longitudinal project. Approximately 23,000 kindergarten children and parents participated during the first year (1998)(1999) of the project. The fifth grade data were collected during the 2003-2004 school year and were released to the public in 2006 (Tourangeau, Nord, Lê, Pollack, & Atkins-Burnett, 2006)."}, {"section_title": "Description of Samples", "text": "The fifth grade ECLS-K data included students with learning disabilities, which were not of interest in this study and could have skewed the estimates. After removing this group of students, there were 8,741 fifth grade students. Among them, 48% were males and 52% females. The ethnic distribution was 58% White, 19% Hispanic, 11% African American, 7% Asian, and 6% Other. Eighteen percent reported living below the poverty line, while 82% were at or above the poverty line."}, {"section_title": "Weights", "text": "The ECLS-K used a multistage probability sample design to select a nationally representative sample of children attending kindergarten in 1998-99. To maintain sufficient sample size for analysis, small minority groups such as Asian, Alaskan, and Pacific Islanders were oversampled (Tourangeau et al., 2006). To resolve the oversampling issue, sampling weights were used to balance and maintain subpopulation representativeness. NCES considered the dissimilar survey response rates across subpopulations when calculating weights. Different analyses were required for each weighted variable. When determining childlevel characteristics or assessment performance, the NCES advised using the weight variable C6CW0 (Tourangeau et al.). For statistical analyses, SPSS Professional version 16.0 was used, because it had the function of adding weights during analysis. The ECLS-K weight variable was applied during ANOVA analysis using the recommended weight option. Gender. The ECLS-K students' gender data were not collected at fifth grade but were verified through a composite of the parents' and teachers' surveys given in kindergarten, first, and third grades. The genders were coded dichotomously into \"1\" for males and \"2\" for females. Ethnicity. Students' ethnic data were not collected at fifth grade but were verified through a composite of the parents' and teachers' surveys given in kindergarten, first and third grades. There were a total of seven ethnic groups defined by ECLS-K. In this study, the ethnicities were redefined into five groups to obtain larger sample sizes in the minority groups. The groups were: \"1\" White, \"2\" African American, \"3\" Hispanic, \"4\" Asian, and \"5\" other. Poverty. The standards used for determining poverty levels in ECLS-K were consistent with those measures set by the U.S. Census Bureau (2003). A combination of numerical conditions determined fifth graders' poverty rankings. The household's weighted average income, the size of the family unit, and the number of related children under 18 years of age were used to estimate students' poverty levels. The poverty level variable was split into two classes, \"below poverty\" and \"at/above poverty\" (Tourangeau et al., 2006)."}, {"section_title": "Measure of Dependent Variable", "text": "The dependent variable for this study was fifth graders' science performance. The ECLS-K measured science performance through 92 science items that focused on conceptual understanding and scientific investigation frameworks. The content aligned with the 1996 NAEP frameworks and included earth, physical, and life sciences. The ECLS-K reported students' science scores in raw score, t-score, and Item Response Theory (IRT) scale score. This research is one component of a longitudinal research project exploring the achievement levels of science students' as they proceed from elementary through middle school. The science IRT scores (C6R1SSCL) permit the computation of critical estimates of possible gains or losses between grade levels. The variable of C6R1SSCL was used for the students' science scores. The range of achievable values for the fifth grade science IRT scores was between 0 and 92 (Tourangeau et al., 2006)."}, {"section_title": "Statistical Analyses", "text": "A full 3-way analysis of variance (ANOVA) model was designed to test each of the three main effects, three 2-way interaction effects, and one 3-way interaction effect. The three main effects were gender, ethnicity, and poverty. The 2-way interaction terms were gender-ethnicity, gender-poverty, and ethnicity-poverty. The 3-way interaction was genderethnicity-poverty. With two subgroups for gender, five subgroups for ethnicity, and two subgroups for poverty, the 3-way ANOVA had a total of 12 breakdown groups. The ANOVA model estimated each parameter by fixing others as constants; thus, estimates of individual parameters were not under the influences of others in the model. In other words, true effects were obtained. If conducting this analysis through t-test, F-test, or two-way ANOVA, the effects would be overestimated, because effects from the second or third factors were not removed. Thus, with three factors, a 3-way ANOVA approach surpassed methods that could not examine all three factors simultaneously."}, {"section_title": "Results", "text": "The sample size, mean, and standard deviation of fifth grade science IRT scale scores before and after applying weights are displayed in Table 1. Sample sizes distributed more closely between genders, but ethnicity and poverty levels showed large discrepancies. Among the different ethnicities, White was 58% of the whole sample, Hispanic was 19%, African American was 11%, and the other two groups were each under 10%. Between the poverty groups, the below poverty was 18% of the whole sample, while above poverty was 82%. Regardless, the smallest subgroup N count was 491, a large number for ANOVA. The average weighted fifth grade Science IRT scale score was 58, with a standard deviation of 14.39 and a range from 17 to 88. Fifth grade males had a mean score of 59 (SD = 14.33), which was three points higher than females' mean score of 56 (SD = 14.26). Students of at/above poverty had a mean score of 61 (SD = 12.77), while students of below poverty had a mean score of 47 (SD = 14.79), a 14-point gap. White (M = 63, SD = 11.42) students performed the best, Small or uneven sample sizes could have decreased the power of analysis; therefore, it was important to check the power of each statistically significant test. On the other hand, sometimes strong power might result in significant outcomes even when the effect is small. Thus, it is also imperative to evaluate effect size for its practical importance. The degree of freedom, F value, observed power, and effect size are shown in Table 2. As expected, the large sample size resulted in high powers (1.00). The F values were significant at the 0.001 level. This meant that independently and interactively the three variables-gender, ethnicity, and poverty-had statistically significant effects on students' science performance. Investigations of effect size, partial eta squared, showed a range of 0.00 to 0.116. Studies suggested that partial eta squared values below 0.01 is considered small effect size, around 0.06 is medium, and 0.14 is large size (Barnette 2006;Kittler, Menard, & Phillips, 2007). The ethnicity and poverty main effects were within medium and large effect sizes, 0.116 and 0.056, respectively. Gender and interaction effects were small (0.001 to 0.006). A post hoc test was conducted to determine whether the differences among all possible paired-ethnicity groups (White vs. Asian, Asian vs. African American, etc.) were statistically significant at the probability of 0.001. A homogeneity test of variances among ethnicity groups indicated these groups distributed differently; therefore, unequal variance methods were used for post hoc analysis. The results showed that all of the possible paired groups were statistically significant (p < 0.001) (see Table 3). When investigating the interactions of gender and ethnicity, ten (2 x 5) disaggregated subgroups were analyzed. The mean scores of male and female ethnic subgroups had the same order: White, Asian, other, Hispanic, and African American (see Table 4). It was noted that in every ethnic subgroup, males scored higher than females by approximately three to four points. The statistical test on the interaction between gender and ethnicity was statistically significant (p < 0.001 ) (see Table 2). This result indicated that after keeping other effects constant, the interaction between gender and ethnicity showed impact on fifth graders' science performance. When examining the interactions between gender and poverty, four (2 x 2) subgroups were tested. The below poverty group scored lower than the at/above poverty group within male and female groups (see Table 4). Additionally, males outperformed females within each of the poverty levels. The largest difference in mean scores was observed between males at/above poverty (M = 62, SD = 12.51) and females below poverty (M = 45, SD = 14.07). The interaction of gender and poverty was statistically significant in the ANOVA test (p < 0.001) (see Table 2). When testing the ethnicity and poverty, ten (5 x 2) disaggregated subgroups were compared. The average scores of ethnic groups had the same rank order within each poverty level; White, Asian, other, Hispanic, and African American (see Table 4). It was no surprise that at/above poverty students outperformed their ethnic counterparts by 8 to 15 points. The largest mean difference of 20 points was found between White males (M = 65, SD = 11.19) and African American females (M = 45, SD = 13.21). The ANOVA test indicated that the interaction between ethnicity and poverty level was statistically significant (p < 0.001) (see Table 2). The 3-way interaction separated students into 20 disaggregated groups (gender [2] x poverty [2] x ethnicity [5]). White males \"at/above poverty\" (M = 66, SD = 10.76) had the highest mean score and African American females \"below poverty\" (M = 40, SD = 12.76) had the lowest mean score, leaving a 26 point gap (see Table 5 and Figure 1). A significant test of the 3-way interaction supported the effect on fifth graders' science performance (see Table 2)."}, {"section_title": "Discussion", "text": "This study shows males performed better than females, which is consistent with the U.S. Department of Education's (2007) report and Maehr and Steinkamp's (1983) NAEP study. Lynch (2000), Kalenberg (1995a), and Arámbula- Greenfield (1999) suspected a strong correlation between ethnicity and poverty and indicated that poverty was more responsible for student achievement variations. This study confirms that fifth graders' ethnicity and poverty have strong associations with student performance (Grigg et al., 2006;Hewson et al.,  2001; Lee & Luykx, 2005. The impact of the interactions of ethnicity and poverty persists within the 10 subgroups' outcomes. It is interesting that Asian fifth graders have the largest (15 points) difference between at/above poverty and below poverty groups. This result does not support the stereotypical misconception that all Asian students perform well academically. It was not surprising to find that children from at/ above poverty performed better that those from below poverty. However, the difference in the average scores between those two groups is one standard deviation. Study results provide a clear picture of the differential science performance gap between those above and below poverty. The research literature indicates that high-poverty schools provide inadequate learning opportunities (Lee & Luykx, 2007). Unfortunately, the disparate performance results from this investigation might be the product of economic biases such as the quality of the school the students attended. Findings indicate that all three variables contribute significantly to fifth graders' science performance. Differences exist on each main effect. The smallest to the largest mean differences between subgroups are gender (3 points), poverty (14 points), and ethnicity (16 points). Significant consequences compound with the 2-way and 3-way interactions between and among these variables. The gaps in science scores widen. The largest gap is found in the 3-way interaction which reveals a 26 point gap between White males \"at/above poverty\" and African American females \"below poverty. It should be noted that below poverty females are the most vulnerable group. Among the 20 subgroups, the below poverty, ethnic minority females performed similarly, but below their male counterparts. Research findings concur with Scantlebury and Baker's (2007) statement, Many people remain at the margins of science, … research still faces the challenge of considering gender, race, and socioeconomic status within accountability systems that want simpler answers than we can provide. (p. 279)"}, {"section_title": "Future Studies", "text": "The ever evolving demographics of the U.S. require science research to address science for all Americans continuously (Gallagher & Anderson, 1999). It is important to keep track of students' science achievement through disaggregated data for later comparison in longitudinal studies. It is equally important to investigate related causal factors, which are responsible for discrepancies in science performance. Most critical are the school related factors that can be changed, improved, or eliminated. Future studies should focus on the quality of science instruction received by the students. Schools can provide the life experiences necessary for improving academic performance for disadvantaged students (Gustafson, 2002). Disadvantaged students exhibit social-emotional factors that negatively influence achievement scores, but those factors can be dealt with in the schools (Becker & Luthar, 2002). Teachers are essential participants in creating effective alternative instructional approaches that meet the needs of diverse learners. Diverse classroom practices do not always correspond with the National Science Education Standards (NSES) (Fradd & Lee, 1999). The report Before It's Too Late (National Commission on Mathematics and Science Teaching for the 21st Century, 2000) recommended increasing the number of high-quality science teachers by providing an ongoing system of professional development and incentives for improvement. Schools must attract and retain highquality teachers by increasing salaries and incentives and by improving the school work environment. "}, {"section_title": "African American", "text": "Preparation of preservice science teachers should address gender issues including biases in the teacher, the curriculum, classroom practices, and research (Scantlebury, 1994). Preservice teachers need to confront their personal attitudes, beliefs, assumptions, and practices before teaching equitably in culturally diverse schools (Bryan & Atwater, 2002). A case is made for improving the school success of ethnically diverse students through culturally responsive teaching and for preparing teachers in preservice education programs with the knowledge, attitudes, and skills needed to do this. (Gay, 2002, p. 106) "}]