[{"section_title": "Figures", "text": ". Salt pond locations in South San Francisco Bay are grouped into several pond complexes within the Don Edwards San Francisco Bay National Wildlife Refuge (Alviso, Moffet, Newark, Ravenswood) and the Eden Landing Ecological Reserve ..................................................................................................................... 45 Tables   Table 1. Attributes of the 22 ponds modeled for waterbird nest abundance and nest success in South San Francisco Bay from historical nesting data collected in 2005. Model selection results for factors affecting waterbird nest abundance n 22 ponds in South San Francisco Bay from historical nesting data collected in 2005-13 .............................................................................. Table 3. Model selection results for factors affecting waterbird nest success in 20 ponds in South San Francisco Bay from historical nesting data collected in 2005-13 .............................................................................. Table 4. Model selection results for factors affecting waterbird nest abundance on 100 islands in ponds in South San Francisco Bay from historical nesting data collected in 2005-13 ............................................................. Table 5. Model selection results for factors affecting waterbird nest success on 44 islands in ponds, from historic nesting data collected in 2005-13, South San Francisco Bay, California. ..................................................... Table 6. Microhabitat characteristics examined in comparing American avocet and Forster's tern nest sites to paired random sites in South San Francisco Bay, California, 2011 and2012 .......................................................... Table 7. Number of American avocet nests and Forster's tern nests with precise spatial data using real-time kinematic GPS, South San Francisco Bay, California, 2011 and2012 ..................................................................... Table 8. Model selection results for logistic regression mixed models for the probability that an island grid cell was used for nesting by American avocets and Forster's terns, South San Francisco Bay, California, 2011 and2012. ........................................................................................................................................ Table 9. Model selection results for conditional logistic regression models evaluating differences between nest microhabitat and the microhabitat of a random paired site among American avocet and Forster's tern nests, South San Francisco Bay, California, 2011 and 2012. .  Table 17. Parameter estimates a of island variables from the top-ranked models of foraging bird abundance at the pond scale b , South San Francisco Bay,California. ......................................................................................... Table 18. Parameter estimates a of island variables from the top-ranked models of roosting bird abundance at the pond scale b , South San Francisco Bay,California. ......................................................................................... Table 19. The influence of island variables on the foraging abundance of birds in ponds, South San Francisco Bay, California. ......................................................................................................................................... vi Table 20. The influence of island variables on the roosting abundance of birds in ponds, South San Francisco Bay,California. ........................................................................................................................................ Table 21. Top ranking models at the grid scale for the abundance of foraging and roosting birds in the former salt production ponds, South San Francisco Bay,California. ........................................................................ Table 22. Parameter estimates a of island variables from the top-ranked models of foraging bird abundance at the grid scale. . ................................................................................................................................................................ Table 23. Parameter estimates a of island variables from the top-ranked models of roosting bird abundance at the grid scale. . ................................................................................................................................................................ "}, {"section_title": "Conversion Factors and Datums Conversion Factors", "text": ""}, {"section_title": "Datums", "text": "Vertical coordinate information is referenced to the North American Vertical Datum of 1988 (NAVD 88). Horizontal coordinate information is referenced to the North American Datum of 1983 (NAD 83)."}, {"section_title": "Executive Summary", "text": "The South Bay Salt Pond Restoration Project aims to restore 50-90 percent of former salt evaporation ponds into tidal marsh in South San Francisco Bay, California. However, large numbers of waterbirds use these ponds annually as nesting and foraging habitat. Islands within ponds are particularly important habitat for nesting, foraging, and roosting waterbirds. To maintain current waterbird populations, the South Bay Salt Pond Restoration Project plans to create new islands within former salt ponds in South San Francisco Bay. In a series of studies, we investigated pond and individual island attributes that are most beneficial to nesting, foraging, and roosting waterbirds."}, {"section_title": "Nesting Waterbird Use of Islands", "text": "We evaluated waterbird nesting on pond islands at multiple spatial scales. First, at the largest spatial scale, we used historical nesting data  to investigate how attributes of South Bay ponds influenced waterbird nest abundance and nest success among ponds. Pond attributes examined included total pond area, the number of islands within a pond, total island area, the ratio of island area to pond area, and distance to San Francisco Bay. Second, at the intermediate spatial scale, we used historical nesting data  to investigate how attributes of individual islands in ponds influenced waterbird nest abundance and nest success on islands. Island attributes examined included island area, island shape, island distance to San Francisco Bay, and island distance to nearest surrounding pond levee. Third, at the smallest spatial scale, we used highly precise Global Positioning System (GPS) technology to study the topography of nesting islands to investigate within-island attributes selected by nesting waterbirds . At this small scale, we evaluated how elevation, distance to the water's edge, slope, and aspect of island grids, as well as the number and distribution of other nesting birds, influenced waterbird use of island patches for nesting. Fourth, we also used highly precise GPS technology to measure attributes of individual nests (nest microhabitat), and by comparing them to attributes measured at random sites on the same island, we evaluated the environmental cues waterbirds use to select specific nest locations . Nest microhabitat attributes included elevation, distance to the water's edge, slope, aspect, and terrain ruggedness. Results of the nesting studies identified several attributes of ponds, and islands therein, that most benefit nesting waterbirds in South San Francisco Bay. Based on these identified attributes, we suggest the following recipe for pond and island construction and management to improve waterbird nesting habitat: 1. Locate ponds and islands for nesting waterbirds near (<1 km) San Francisco Bay because these islands exhibited greater nest abundance and nest success than those at greater distances. 2. Where possible, construct islands 100-200 m from the nearest surrounding pond levee because such islands exhibited greater nest abundance and nest success than those at closer and further distances. 3. Construct nesting islands to be more linear in shape, rather than rounded. Although there was no difference in nest success between linear and rounded islands, linear islands exhibited as much as eight times more nests than rounded islands after accounting for all other island variables including size. However, although the recently constructed linear islands in Pond SF2 are more linear in shape than the recently constructed round islands in Pond SF2, the linear islands in Pond SF2 are actually much more rounded than the islands that support the greatest nest abundances. Therefore, it is recommended that islands constructed in the future be more linear than those recently constructed in Pond SF2 and Pond A16. Instead, we suggest mimicking the linear shape of islands in Pond A2W and the four historical islands at the southern end of Pond A16. 4. Construct three to five nesting islands in multiple ponds, as opposed to constructing many islands in just a few ponds. 5. Construct islands that are 0.05-0.10 ha in size, and given that birds preferred linear islands, we suggest islands that are approximately 50 m long by 10 m wide (0.05 ha) to 100 m long by 10 m wide (0.10 ha) with an understanding that island erosion may reduce island size over time and constructing islands slightly larger than the ideal size may improve the longevity of nesting islands. In comparison, the recently constructed \"linear\" islands in Pond SF2 and Pond A16 are 70 m long by 25 m wide and likely are too \"rounded\" (too wide) for preferred use by waterbirds. 6. Construct nesting islands with abundant area 0.5-1.5 m above the water surface. American avocet (Recurvirostra americana) preferred habitat was 0.5-1.0 m above the water surface, whereas Forster's terns' (Sterna forsteri) preference increased with elevation up to 1.3 m. This preference combined with the likelihood for erosion over time, indicates that islands be constructed with ample area that is 0.5-1.5 m above the water surface. 7. Construct nesting islands with abundant area within 10 m of the water's edge. The probability of nesting peaked at approximately 7 m from the water's edge for avocet nests, and 2 m from the water's edge for tern nests. Similar to our results at the largest spatial scale, this result indicates that linear islands are more conducive to bird nesting than are rounded islands because, for a given island size, a linear shape allows for more area within 10 m of the water's edge. 8. Construct nesting islands with a mosaic of slopes ranging from flat to moderately steep (21 degrees). Avocets were more likely to nest in steep island grid cells whereas terns preferred flat grid cells. Thus, high topographic relief on islands is suggested, which is often at odds with the final smoothing of islands that is typically done during island construction.\\ 9. Construct nesting islands with abundant area with south-facing slopes. Although avocets showed no preference for aspect of island grid cells, terns preferred to nest on south-facing slopes. To maximize the amount of area on linear islands with south-facing slopes, islands may be oriented west-to-east from end-to-end. 10. Ensure nesting islands contain patches of short vegetation, ranging from 10 to 100 percent cover, as well as areas with little (<10 percent cover) or no cover; tall vegetation is not ideal. Avocets and terns were more likely to nest in microhabitats with vegetation (65 percent of avocet nests, 76 percent of tern nests) than without it, and the most common species of vegetation were pickleweed (Sarcocornia pacifica) and alkali-heath (Frankenia salina). Yet, many avocet nests were in sparsely vegetated areas, suggesting that islands with complete vegetation cover would not be conducive to nesting by avocets."}, {"section_title": "Wintering Waterbird Use of Islands", "text": "To evaluate the influence of islands on roosting and foraging waterbirds during winter, we conducted studies at several spatial scales. First, at the smallest spatial scale of the island, we focused on managed Pond SF2, and the 30 islands created for nesting and roosting birds. We conducted bi-weekly high and low tide bird surveys in the autumn, winter, and spring, and used a geographic information system to determine island spatial characteristics, including shape, size, and perimeter. Survey data were combined with physical pond and island parameters, and used to model total abundance and relative use of islands. Second, at an intermediate spatial scale, we used our historical waterbird dataset  to assess the influence of islands on waterbird use of 250-m by 250-m grid cells within ponds for roosting and foraging. We considered the number of islands and island area within grids, the ratio of island area to grid area, and the distance from the center of the grid to the nearest island. Third, at the largest spatial scale, we used our historical waterbird dataset to assess the abundance and distribution of seven guilds and five species of birds across ponds with and without islands, relative to the number of islands, total island area, and island-area to pond-area ratio. From the results of our island, grid, and pond scale analyses, we documented the importance of islands to wintering waterbirds, and identified island characteristics that influenced wintering waterbird abundance. Based on these characteristics, we make the following conclusions on the influence of islands on wintering waterbird abundance: 1. Waterbird abundance was greater in areas with islands than in areas without islands. In Pond SF2, waterbird densities were greatest on and near islands, and lower in open water, pond bottom, and levee habitats. Among all ponds with islands, abundance of most birds was greater in grid cells with islands than grid cells without islands, and island presence only negatively influenced the abundance of foraging eared grebes (Podiceps nigricollis). 2. Islands provide important roosting habitat at high tide, when mudflat habitats are tidally inundated with water. In Pond SF2, islands were most heavily used by small shorebirds at high tide, particularly in the spring. 3. Island size and shape influences waterbird abundance. In Pond SF2, small shorebirds were more likely to use round islands than linear islands at high tide during spring. During low tide in the winter, dabbling ducks were more likely to use small islands than large islands, and wading birds (herons) and piscivores were more likely to use linear islands than round islands. Gulls were more likely to use large, linear islands than round islands."}, {"section_title": "Introduction", "text": "San Francisco Bay is the largest estuary on the West Coast of North America, but nearly 80 percent of its tidal marshes and 40 percent of its tidal flats have been lost over the past two centuries due to urban development, agriculture, and salt production (Goals Project, 1999). In particular, about 14,000 ha (35,000 acres) of artificial salt evaporation ponds were constructed within the former baylands (Goals Project, 1999). Recently, more than 6,110 ha (15,100 acres) of former salt ponds have been transferred to government ownership, the majority of which are now a part of the U.S. Fish and Wildlife Service Don Edwards San Francisco Bay National Wildlife Refuge (hereafter Don Edwards Refuge). The South Bay Salt Pond (SBSP) Restoration Project is implementing a large-scale plan to convert 50-90 percent of these former salt ponds into tidal and managed marsh habitats within the next 50 years (Goals Project, 1999;Steere and Schaefer, 2001;Siegel and Bachand, 2002;Life Science!, 2003). The San Francisco Bay is a designated site of hemispheric importance to shorebirds and annually supports more than 1 million waterbirds (Page and others, 1999;Morrison, 2001;Stenzel and others, 2002). The bay supports more than 325,000 shorebirds in autumn, 225,000 in winter, and as many as 932,000 during spring migration (Stenzel and others, 2002). Shorebird abundances during peak spring migration have exceeded 200,000 shorebirds in a single salt pond (Stenzel and Page, 1988). Western sandpiper (Calidris mauri) is the most abundant shorebird species, with populations exceeding 100,000 in the autumn and winter, and peaking at more than 500,000 in the spring (Stenzel and others, 2002). San Francisco Bay also is important for diving ducks, supporting 44 percent of the wintering population observed in the Lower Pacific Flyway (Richmond and others, 2014). The Bay is a particularly important area for wintering greater and lesser scaup (Aythya marila and A. affinis) and canvasback (A. valisineria), supporting 60 and 51 percent of their respective Lower Pacific Flyway abundance (Richmond and others, 2014). During migration and over winter, birds rely on a mosaic of inter-and subtidal shoal and pond habitats for foraging and roosting (Brand and others, 2014;Rocha and others, unpublished). Although the restoration of former salt ponds to tidal marsh will increase habitat for many animals, including the endangered California clapper rail (Rallus longirostris obsoletus) and salt marsh harvest mouse (Reithrodontomys raviventris raviventris), it also will reduce the overall pond habitats available for wintering, migratory, and breeding waterbirds. A goal of the SBSP Restoration Project is to maintain current waterbird populations. Towards this goal, the first phase of the SBSP Restoration Project has reconfigured and enhanced two existing ponds (Ponds A16 and SF2) by constructing islands to increase roosting and foraging opportunities and to provide waterbird nesting habitat (Trulio and others, 2007). Former salt ponds provide critical habitat for wintering and breeding waterbirds. For example, radio-marked Forster's terns (Sterna forsteri; hereafter terns) strongly selected ponds, especially low salinity ponds, as foraging habitat during the pre-breeding (Ackerman and others, 2008) and breeding seasons (Bluso-Demers and others, unpublished; Ackerman and others, 2009). Similarly, western sandpipers selected salt ponds and avoided tidal marsh habitats during the winter (Warnock and Takekawa, 1995;Warnock and others, 2002). Thirty-six percent of the Lower Pacific Flyway population of ruddy ducks (Oxyura jamaicensis) use San Francisco Bay and 77 percent of those use the salt ponds in South San Francisco Bay (Richmond and others, 2014). American avocets (Recurvirostra americana; hereafter avocets) and black-necked stilts (Himantopus mexicanus; hereafter stilts) used pond habitats more than any other habitat in the estuary (Ackerman and others, 2007;Hickey and others, 2007). Dry areas of former salt ponds also provide foraging and nesting habitat for the endangered western snowy plover (Charadrius alexandrinus nivosus; Robinson and others, 2007). In addition to ponds providing preferred foraging habitat, islands and levees are used extensively by roosting waterbirds (Goals Project, 1999;Takekawa and others, 2000;Colwell and others, 2003;Conklin and others, 2007). Western sandpipers selected pond levees as roosting sites, especially during high tides, throughout the winter (Warnock and Takekawa, 1995). Additionally, pond islands and levees play a critical role for fledging chicks. For instance, postfledging terns were closer to pond levees than would be predicted by chance, indicating that they foraged near levees and used levees as roosting sites as they departed their natal colony (Ackerman and others, 2009). In addition to providing roosting and foraging habitats, former salt ponds support nesting habitat for locally breeding waterbirds, especially terns and avocets. Approximately 30 percent of the breeding population of Forster's terns on the Pacific Coast nests in the San Francisco Bay (McNicholl and others, 2001;Strong and others, 2004), and the islands within ponds currently provide nesting habitat for 80 percent of those terns (Strong and others, 2004). Thus, the project area currently accounts for about onequarter of the nesting habitat on the Pacific Coast. Similarly, the estuary is the largest breeding area for avocets along the Pacific Coast (Stenzel and others, 2002;Rintoul and others, 2003), and 75 percent of breeding avocets in the South Bay nest on islands within ponds (Ackerman and others, 2013). As the largest tidal wetland restoration project on the West Coast of the United States proceeds, there are several key uncertainties about how to enhance and manage existing ponds to maximize waterbird foraging and nesting opportunities as pond habitats are reduced. Pond islands and levees are expected to continue to support high densities of roosting birds, and the experimental addition of islands to ponds is expected to enhance this effect (Trulio and others, 2007). Herein, we address these key uncertainties to help direct future management actions to maximize waterbird habitat in the remaining ponds."}, {"section_title": "Study Objectives", "text": "Whereas our broad objectives were to quantify the benefits that islands within ponds of South San Francisco Bay provide to waterbirds, our more specific objectives were as follows: 1. Assess how pond and island attributes affect waterbird nest abundance and nest success. 2. Assess how the specific structure (topography and vegetation) of islands influence nest-site selection, nest densities, and reproductive success of avocets and terns. 3. Evaluate factors influencing the variation in numbers of waterbirds roosting and foraging near the newly created islands in Pond SF2. 4. Using pond complex-wide surveys, evaluate whether waterbird diversity and abundance at a broader scale are influenced by island habitat and water depth within ponds."}, {"section_title": "Study Area", "text": "The primary study area was within former salt ponds of the Don Edwards Refuge and Eden Landing Ecological Reserve ( fig. 1). Our evaluation of pond and island attributes on waterbird nest abundance and nest success was conducted on 100 nesting islands in 22 ponds (table 1, fig. 1). Our evaluation of island morphometry and vegetation structure on avocet and tern nest-site selection was conducted on 28 islands within 10 ponds (table 7, fig. 1). Our study to evaluate factors that influence roosting and foraging at the large, or pond, scale included former salt production ponds within the SBSP Restoration Project in South San Francisco Bay, California ( fig. 1). Project ponds were divided into three regional complexes: Eden Landing (managed by the California Department of Fish and Wildlife as part of the Eden Landing Ecological Reserve), Ravenswood, and Alviso (both managed by the U.S. Fish and Wildlife Service as part of the Don Edwards Refuge). Ponds mostly consisted of moderate to deep water ponds managed with water control structures to increase circulation with bay water, and shallow water ponds that collected rainwater during the winter and dried during the summer. Our study to evaluate factors that influence roosting and foraging at the island-scale (intermediate) focused on former salt Pond SF2 in Ravenswood ( fig. 2). Pond SF2 (lat 37°29'N., long 122°07'W.) is a 57-ha impoundment bordered by the municipalities of East Palo Alto and Menlo Park to the west and south, U.S. Highway 84 to the north, and San Francisco Bay to the east. In 2009-10, the U.S. Fish and Wildlife Service created 30 islands ranging in size from 1,439 to 2,363 m 2 . Internal levees were constructed to divide the pond into two experimental units with islands. Unit 1 (23 ha) contained 8 islands and was closest to the Bay, whereas Unit 2 (34 ha) contained 22 islands. Water control structures were placed along the Bay-front levee and weir boxes were installed into internal levees to allow for water level manipulation. All islands had a north facing slope that provided protection from northwest winds, the typical wind direction for the region. One-half of the islands were rounded-falcate-curved shapes with a low island-edge to island-area ratio; whereas the others were linear-long and rectangular with a saw-tooth south edge providing a high island-edge to island-area ratio."}, {"section_title": "Using Historical Nesting Data to Model the Effects of Pond and Island Attributes That Influence Waterbird Nest Abundance and Nest Success", "text": ""}, {"section_title": "Methods", "text": "\n\n"}, {"section_title": "Salt Pond and Island Attributes", "text": "We used historical nesting data to evaluate waterbird nesting across entire ponds (pond scale) and on individual nesting islands (island scale). At the pond scale of analysis, we investigated whether the amount and distribution of island habitat within a pond influenced waterbird nest abundance or nest success by evaluating the effects of the number of islands in a pond, total island area, and the ratio of island area to pond area. We also evaluated the effects of total pond area and pond distance to San Francisco Bay, as these attributes may affect nest abundance and nest success through corresponding differences in food availability and predator densities. Pond areas were calculated using pond polygon shapefiles digitized from 2005 National Agricultural Imagery Program (NAIP) imagery for South San Francisco Bay, in ArcMap™ 10.2 (Environmental Research Systems Institute [ESRI], Redlands, California). Island areas were calculated from island perimeters derived using one of two methods. For 29 islands, we used real-time kinematic Global Positioning System (GPS; Leica ® Smart Rover GPS1200, Leica Geosystems Inc., Atlanta, Georgia) to trace the island perimeter at the water's edge. Universal Transverse Mercator (UTM) coordinates (accuracy: 3.75 cm) were collected at 1-second intervals while the perimeter of each nesting island was traversed and the water's edge marked using the GPS unit. Island perimeters were traced using real-time kinematic GPS in April and May 2011. For the remaining 125 islands in the study ponds, we digitized island perimeter polygon shapefiles from 2011 U.S. Geological Survey (USGS) high-resolution orthoimagery of the San Francisco Bay area (resolution: 0.3 m), in ArcMap 10.2. These data were collected in April 2011, thereby matching the period of data collection of island perimeters using real-time kinematic GPS. Total island area in each pond was calculated by summing the island areas of all islands within a given pond. Pond distance to San Francisco Bay was calculated as the minimum distance from the pond's edge to San Francisco Bay using the Near Geoprocessing Tool in ArcMap10.2. Next, at the island scale of analysis, we evaluated the effects of island area, island shape, island distance to San Francisco Bay, and island distance to nearest surrounding pond levee on waterbird nest abundance and nest success among individual islands. We included the distance to nearest surrounding pond levee as this may influence island accessibility by land-based egg and chick predators, as well as the potential for human disturbance. The area of each island was calculated from the island polygon shapefiles previously described. Island shape was quantified using the residuals of a general linear regression of island perimeter length on island area such that positive residual values denoted more linearly-shaped islands while negative residual values denoted more rounded islands. Unlike simple perimeter-to-area ratios, residuals of the regression allowed for a measure of island shape that was independent of island size. Lastly, we calculated the distance of each island edge to the nearest pond levee and to San Francisco Bay using the Near Geoprocessing Tool in ArcMap10.2."}, {"section_title": "Historical Waterbird Nesting Data for San Francisco Bay", "text": "The USGS Western Ecological Research Center, Dixon Field Station has been studying waterbird breeding ecology in South San Francisco Bay since 2005 and has collected and archived detailed records from more than 15,000 individual waterbird nests into a computer database. The large number of nest records, collected over almost a decade, provided us with a robust dataset for evaluating waterbird nesting preferences and nest success. We compiled historical USGS waterbird nesting data from ponds of the Don Edwards Refuge and Eden Landing Ecological Reserve over the years 2005-13. We included only nests that were located on islands within ponds (levee and marsh nesting birds were removed from the dataset). Furthermore, we only included data from an island when all nests on that island were monitored, thereby providing us with an accurate island-level estimate of nest abundance. Similarly, for the pond scale analysis, we only included data from ponds for which all islands on the pond were monitored, thereby providing us with an accurate nest abundance estimate among all islands within a given pond. We focused our analyses on the three most numerous species-Forster's tern, American avocet, and black-necked stilt."}, {"section_title": "Estimating Annual Average Nest Success for Each Pond and Nesting Island", "text": "Throughout the nesting season (April through August), we visited nesting pond islands weekly to monitor waterbird nesting activity. We uniquely marked each newly initiated nest, and recorded UTM coordinates of each nest (Garmin GPSMAP 76, Garmin International Inc., Olathe, Kansas). At each weekly nest visit, we floated eggs to determine embryo age (Ackerman and Eagles-Smith, 2010), recorded clutch size, determined overall nest fate (hatched, failed, abandoned, or depredated), and determined the fate of each individual egg (hatched, failed-to-hatch, abandoned, or depredated). We estimated daily nest survival rates based on weekly nest visits using logistic exposure models (Shaffer, 2004). A nest was considered to have survived an interval if the clutch was still completely or partially intact, embryo development had progressed, and there were no signs of nest abandonment (such as cold eggs). A nest was considered successful if 1 or more eggs successfully hatched. A nest was considered unsuccessful if it was destroyed or abandoned. Exposure days were calculated as the number of days between nest visits, except when a final nest fate occurred between visits (hatched, depredated, or abandoned). For hatched nests, we calculated exposure days for the final interval based on the expected hatch date (Ackerman and Eagles-Smith, 2010). For depredated nests, we calculated exposure days for the final interval as the mid-point between nest visits. For abandoned nests, we calculated exposure days for the final interval as the difference between the developmental age of the eggs when the nest was abandoned (estimated by egg flotation) and the developmental age of the eggs when the nest was last visited. Daily nest survival estimates were estimated separately for each year, species, pond, and island with nest age as the single covariate in the model. Nest success was calculated as the model averaged product of daily nest survival over the approximate 27 day incubation period (Ackerman and others, 2013)."}, {"section_title": "Statistical Analyses", "text": "For the pond-scale analysis, we used repeated measures linear mixed models (PROC MIXED, SAS/STAT ® software, release 9.4, SAS Institute, Cary, North Carolina) to evaluate the effects of species, year, total pond area, the number of nesting islands within a pond, and total island area on waterbird nest abundance and nest success within ponds. We used apparent nest abundance, or the number of nests observed during weekly colony visits. Often nest abundance studies use adjusted nest abundance estimates that account for nests that failed before they could be found. However, because we visited colonies weekly, and islands represented a finite area that could be searched systematically, we determined that adjustments to apparent nest abundance were unnecessary. In analyzing pond nest abundance in ponds, we included only data from ponds for which all nesting islands were monitored in a given year. Additionally, in analyzing nest success, we only included data from ponds for which 10 or more nests of a given species were monitored in a given year, so as to provide us with a reasonably accurate estimate of nest success. We built a relatively balanced set of candidate models based on all combinations of the class variables species and year, and linear and quadratic terms for total pond area, the number of islands within a pond, total island area, the ratio of island area to pond area, and distance to San Francisco Bay, plus a null model (940 total models). Nest abundance values were not normally distributed so we used a natural log data transformation to meet the assumption of normality. For the island-scale analysis, we again used repeated measures linear mixed models (PROC MIXED, SAS/STAT) to evaluate the effects of island area, island shape, island distance to San Francisco Bay, and island distance to nearest pond levee on waterbird nest abundance and nest success on islands. We included only data from islands for which all nests were monitored, and in analyzing nest success, we only included data from islands for which 10 or more nests of a given species were monitored in a given year. We built a relatively balanced set of candidate models based on all combinations of the class variables species and year, and linear and quadratic terms for island area; island shape (residuals of island perimeter to area regression); island distance to San Francisco Bay; and island distance to nearest pond levee, plus a null model (324 total models). For all island-scale models, we included the pond in which the island was located as a random effect. Nest abundance values were not normally distributed so we used a natural log data transformation to meet the assumption of normality."}, {"section_title": "Model Selection", "text": "For the pond and island scales of analysis, we ranked models using an information-theoretic approach and second-order Akaike Information Criterion (AIC c ; Burnham and Anderson, 2002). The model with the lowest AIC c score was considered to be the most parsimonious, and we used the difference in AIC c values (ΔAIC c ) between the best model and each other model in the candidate set to assign model rank. We considered models with a ΔAIC c score less than or equal to 2.0 to be competitive and calculated the beta parameters of the variables by model-averaging all models in the candidate set. The weight of evidence for each model was determined using Akaike model weights (w i ), defined as the relative likelihood of a model given all models in the candidate set. We used evidence ratios, or the ratio of the Akaike model weight of one model to the Akaike model weight of another model, to assess the relative weight of support between models.\nFor both the island grid and microhabitat scales of analysis, we ranked models using an information-theoretic approach and AIC c (Burnham and Anderson, 2002). The model with the lowest AIC c score was considered to be the most parsimonious, and we used ΔAIC c between the best model and each other model in the candidate set to assign model rank. We considered models with a ΔAIC c score less than or equal to 2.0 to be competitive and calculated the beta parameters of the variables by model-averaging all models in the candidate set. The weight of evidence for each model was determined using w i , defined as the relative likelihood of a model given all of the models in the candidate set. We used evidence ratios to compare the relative weight of support between models. At the microhabitat scale, we further evaluated the effect size for each variable using standardized odds ratios calculated from the model-averaged parameter estimates. Odds ratios for continuous variables were standardized by calculating them at the first and third quartile values of the paired site data (Harrell, 2001). In this way, odds ratios for each variable were scaled relative to the amount of variability of that variable across the study area, thereby allowing for direct comparison of effect size among variables."}, {"section_title": "Results and Discussion", "text": "\n\n\n"}, {"section_title": "Pond Scale Nest Abundance", "text": "We examined historical nest abundance on a total of 22 ponds (table 1). A total of 9,404 avocet, stilt, and tern nests were monitored on islands in these ponds between 2005 and 2013. Not all 22 ponds were used by nesting avocets, stilt, and terns in all years. Moreover, in some years, ponds used for nesting were not monitored for nest abundance. Therefore, for each pond, we included only data from years when one or more island nests were initiated, and all island nests were monitored. The most parsimonious model describing waterbird nest abundance on ponds in South San Francisco Bay included the effects of species and a quadratic term for distance to bay; had an Akaike weight of 0.11; and was 1.08 times more likely than the next best model (table 2) to explain nest abundance. Five other models were competitive (∆AIC c < 2.0), and included the effects of species (all six models), linear terms for the number of islands (two models) and total pond area (one model), and quadratic terms for distance to bay (three models), the ratio of island area to pond area (one model), and the number of islands (one model). However, 95-percent confidence intervals of the model-averaged parameter estimates for the number of islands, total pond area, and the ratio of island area to pond area all overlapped zero, suggesting they had little to no effect on the number of waterbird nests initiated within ponds. To further evaluate the importance of the variables in the best model, we compared evidence ratios between the best model and an identical model but with one of the variables removed. Using evidence ratios, we determined that the best model was 2.98×10 14 times more likely than a similar model but without species, and 2.76 times more likely than a similar model but without distance to Bay. Predictions from model-averaged parameter estimates exhibited a U-shaped pattern, in which nest abundance decreased as a pond's distance to San Francisco Bay increased to approximately 2 km, and thereafter nest abundance increased as distance to the Bay increased, with ponds 4-5 km from the Bay exhibiting the greatest nest abundance ( fig. 3)."}, {"section_title": "Pond Scale Nest Success", "text": "We examined historical nest success using data from 9,119 nests on a total of 20 ponds (table 1). Not all 20 ponds were used by nesting avocets, stilt, and terns in all years. Moreover, in some years, ponds used for nesting were not monitored for nest abundance, or nest abundance in a given year did not meet the 10 nest threshold we imposed for our nest success analysis. Therefore, for each pond, we included only data from years when 10 or more nests were monitored. The most parsimonious model describing waterbird nest success within ponds in South San Francisco Bay included a linear term for the number of islands in a pond and quadratic terms for distance to bay and total pond area; had an Akaike weight of 0.21; and was 1.06 times more likely than the next best model (table 3). Two other models were competitive (∆AIC c < 2.0), one with a quadratic terms for distance to Bay and total island area, and one the same as the best model but without a linear term for number of islands in the pond. Using evidence ratios, we determined that the best model was 3.2×10 4 times more likely than a similar model but without distance to bay; 21 times more likely than a similar model but without total pond area; and only 1.5 times more likely than a similar model but without the number of islands within a pond. Furthermore, 95-percent confidence intervals of the model-averaged parameter estimates for the effect of the number of islands in a pond overlapped zero, suggesting it had little to no effect on waterbird nest success on pond islands. Predictions from modelaveraged parameter estimates showed that nest success was slightly greater on islands in ponds very close (<1 km) to San Francisco Bay ( fig. 4a) and that nest success was greatest in ponds that were 120-170 ha in size (43-46 percent), and lower within smaller (33-37 percent for 20 ha) and larger (26-31 percent for 270 ha) ponds ( fig. 4b)."}, {"section_title": "Island Scale Nest Abundance", "text": "We examined nest abundance on a total of 100 individual islands within 22 ponds (table 1). Not all 100 islands were used for nesting by avocets, terns, or stilts in all years. Moreover, in some years, islands used for nesting were not monitored for nest abundance. Therefore, for each island, we included only data from years when one or more nests were initiated, and all nests were monitored. The most parsimonious model describing waterbird nest abundance on islands in South San Francisco Bay included the effects of species, a linear term for distance to nearest pond levee, and quadratic terms for distance to Bay, and the residual of island perimeter length to island area; had an Akaike weight of 0.48; and was 3.10 times more likely than the next best model (table 4). No other model was competitive (∆AIC c < 2.0). Using evidence ratios, we determined that the best model was 9.99×10 35 times more likely than a similar model but without species, 9.47×10 4 times more likely than a similar model but without the residual of perimeter to area, 614 times more likely than a similar model but without distance to Bay, and 13 times more likely than a similar model but without distance to nearest pond levee. Predictions from model-averaged parameter estimates exhibited a U-shaped pattern, in which waterbird nest abundance decreased as island distance to San Francisco Bay increased from 0 km to about 3 km, after which nest abundance increased slightly as island distance to San Francisco Bay increased to 5 km from the Bay ( fig. 5a). Moreover, nest abundance was greater on more linearlyshaped islands (positive residuals for perimeter to area regression; fig. 5b). Lastly, waterbird nest abundance increased as island distance to surrounding pond levee increased, such that approximately three times as many nests of each species were predicted on islands 300 m from the levee than islands next to the levee ( fig. 5c)."}, {"section_title": "Island Scale Nest Success", "text": "We examined historical nest success using data from 8,156 nests on a total of 44 islands within 19 ponds. The most parsimonious model describing waterbird nest success on islands in South San Francisco Bay included the effects of year, a linear term for distance to nearest levee, and a quadratic term for distance to Bay; had an Akaike weight of 0.31; and was 2.25 times more likely than the next best model (table 5). A model similar to the best model but including island area also was competitive (∆AIC c =1.63). Using evidence ratios, we determined that the best model was 7.64×10 5 times more likely than a similar model but without year, 21 times more likely than a similar model but without distance to Bay, and 16 times more likely than a similar model but without distance to nearest levee. Predictions from model-averaged parameter estimates indicated that waterbird nest success was slightly greater on islands located very close (< 1 km) to San Francisco Bay (40-47 percent), compared to islands 5 km from the Bay (37-40 percent, fig. 6a). In addition, nest success increased slightly from 31-35 percent on islands adjacent to a pond levee to 35-39 percent on islands 130 m from the pond levee, after which nest success decreased as island distance to levee increased ( fig. 6b)."}, {"section_title": "Summary", "text": "Island nesting habitat is extremely important to waterbirds in South San Francisco Bay. Between 2005 and 2013, we monitored 15,066 waterbird nests (6,003 avocet, 1,433 stilt, and 7,630 tern) in South San Francisco Bay. Of these, 73 percent of avocet, 21 percent of stilt, and 96 percent of tern nests were observed on island habitats. Terns were the most numerous island-nesting species (other than California gulls), and accounted for 65 percent (6,134) of the 9,404 nests on islands monitored within the 22 study ponds between 2005 and 2013. Avocets were the second most numerous island-nesting species, and accounted for 32 percent (3,022) of nests on islands. Stilts, in contrast, accounted for only 3 percent (248) of nests on islands, and prefer to nest in more vegetated marshes, particularly New Chicago Marsh which accounts for approximately 63 percent of all stilt nests. Distance to San Francisco Bay was an important predictor of waterbird nest abundance across South San Francisco Bay ponds and on individual islands. At the pond scale of analysis, and at mean values for all other variables, ponds 100 m from San Francisco Bay were predicted to have 12.1 avocet, 2.6 stilt, and 32.7 tern nests per year ( fig. 3). Indeed, several of the largest avocet and tern breeding colonies have occurred within ponds less than 100 m from San Francisco Bay (Ponds A1, A2W, AB1, AB2, E2, N4/N5, N4AB, R1, and SF2; table 1). Predicted pond nest abundance decreased to 8.3 avocet, 1.7 stilt, and 22.3 tern nests per year in ponds located 2 km from the Bay. Similarly, at the island scale of analysis, predicted nest abundance was 13.7 avocet, 4.1 stilt, and 44.1 tern nests per year on islands 100 m from San Francisco Bay, but only 3.9 avocet, 1.2 stilt, and 12.6 tern nests on islands 3.5 km from the Bay ( fig. 5a). Breeding avocets and stilts primarily forage in ponds, tidal marshes, tidal flats, and managed marshes (Ackerman and others, 2007). Thus, nesting close to these preferred foraging habitats may be more attractive, prompting greater nest abundance on near-Bay islands and ponds. Model-predicted nest abundance also was high within ponds farther from San Francisco Bay ( fig. 3), with 25.2 avocet, 5.3 stilt, and 68.0 tern nests predicted in ponds 5 km from the Bay. This result is due mostly to the influence of two ponds, Ponds A16 and A8, both of which are more than 3.7 km from San Francisco Bay and historically have had large numbers of nesting waterbirds. However, both of these ponds have undergone dramatic changes since 2013. In 2013, Pond A16 was enhanced to increase nesting and foraging value for waterbirds. Sixteen new islands were constructed, increasing the total number of nesting islands in Pond A16 from 5 to 20. The initial response by waterbirds has been positive, with 81 avocet nests monitored in 2013, and 68 avocet nests monitored in 2014. However, only a single tern nest (in 2013) has been initiated in Pond A16 in the past two years, which is a drastic reduction from the yearly average of approximately 150 tern nests in Pond A16 during 2005-11. Continued monitoring is necessary to evaluate the waterbird response to the Pond A16 enhancement, and to determine if this pond returns to, or even exceeds, the high waterbird nest abundance totals historically observed. In contrast, Pond A8 has lost almost all of its island nesting habitat. In 2013, the last year of this study, only 3 avocet nests were monitored in Pond A8, down from a yearly average of 173 avocet nests during 2005-11. In 2014, only 8 avocet nests were observed throughout Pond A8. Changing pond water management associated with the opening of the Pond A8 notch, has caused all island habitat in Pond A8 to become inundated with water, thereby removing virtually all waterbird nesting habitat. Given the historical importance of Pond A8, particularly to nesting avocets and terns, future pond enhancements that effectively replace this lost nesting habitat will be critical to maintaining breeding waterbird numbers in South San Francisco Bay. At the island scale of analysis, island shape and island distance to surrounding pond levee also were important in predicting waterbird nest abundance. Waterbird nest abundance was greatest on linearly-shaped islands relative to rounded islands ( fig. 5b). At mean values for all other variables, waterbird nest abundance was predicted to be almost eight times greater on linear islands similar in shape to the southernmost island in Pond A2W (residual of island perimeter to island area = 207.4), than on more rounded islands similar in shape to the round islands in Pond SF2 (residual of island perimeter to island area approximately = -100). The southernmost island in Pond A2W is approximately 140 m long by 6.5 m wide (at its widest point), whereas, the round islands of Pond SF2 have an approximate diameter of 50 m. However, even more highly linearized islands, such as those similar in shape to the middle two historical islands at the south end of Pond A16 (residual of island perimeter to island area approximately = 330-350), although still exhibiting greater nest abundance than rounded islands, showed a decrease in nest abundance relative to islands similar in shape to the southernmost island in Pond A2W. Island 15 (second island from the west at the southern end of Pond A16) is approximately 190 m long by 7 m wide. Linearly shaped islands improved nest abundance relative to rounded islands up to a point at which additional island size did not increase nest abundance. Nest abundance was greater on islands farther from surrounding pond levees ( fig. 5c), such that at mean values for all other variables, predicted waterbird nest abundance on islands 300 m from the nearest surrounding pond levee was almost three times that of islands only 10 m from the nearest surrounding pond levee. In a previous study on nest predation in South San Francisco Bay, 71 percent of identifiable predations of avocet and stilt nests were caused by mammals, including raccoon (Procyon lotor), striped skunk (Mephitis mephitis), and gray fox (Urocyon cinereoargenteus; Herring and others, 2011). Islands farther from pond levees may be more attractive to nesting waterbirds as birds may perceive them to be more effective at limiting access by mammalian predators and disturbance by humans. However, few islands in ponds of South San Francisco Bay are more than 200 m from the nearest surrounding pond levee (only three islands in Pond A7 and seven islands in Pond SF2). Thus, considering nest abundance alone, creating nesting islands at distances of 200 or more meters from levees would be ideal. However, the effect of island proximity to surrounding pond levee on nest success also could be considered (see below). As with waterbird nest abundance, distance to San Francisco Bay was an important predictor of waterbird nest success within South San Francisco Bay ponds and on individual islands. At both the pond and island scales of analysis, model-predicted average nest success decreased with distance away from San Francisco Bay (figs. 4a and 6a). At mean values for all other variables, nest success within ponds 100 m from San Francisco Bay was predicted to be 50 percent for avocets, 51 percent for stilts, and 52 percent for terns. Nest success dropped to 40 percent for avocets, 42 percent for stilts, and 43 percent for terns within ponds 3 km from the Bay, before increasing to 45 percent for avocets, 46 percent for stilts, and 47 percent for terns within ponds 5 km from the Bay. Similarly, at mean values for all other variables, nest success on individual islands 100 m from San Francisco Bay was predicted to be 46 percent for avocets, 44 percent for stilts, and 47 percent for terns. Nest success dropped to 36 percent for avocets, 34 percent for stilts, and 37 percent for terns on individual islands 3 km from the Bay, before increasing to 39 percent for avocets, 37 percent for stilts, and 40 percent for terns on islands 5 km from the Bay. Coupled with our nest abundance results, these nest success results are notable as they may represent adaptive significance, whereby birds select nesting islands that provide greater reproductive success. There are numerous reasons why ponds and islands near the San Francisco Bay may provide waterbirds greater nest success. Nesting locations close to San Francisco Bay are farther from urban centers and therefore may have lower densities of nest predators and disturbance. Human disturbance leading to nest abandonment may be reduced in ponds and islands farther from urban centers. Alternatively, greater nest success in ponds and islands close to San Francisco Bay may be the result of the greater nest abundance we observed in ponds and islands close to San Francisco Bay. If large waterbird colonies are more effective at driving away potential nest predators than small waterbird colonies, the effect of proximity to San Francisco Bay on nest success may instead have more to do with nest abundance and communal colony defense than other ecological factors. Nevertheless, the results of our nest abundance and nest success analyses at both the pond and island scale indicate that creating island nesting habitat close to San Francisco Bay would be most effective at maintaining, and even increasing waterbird nesting populations. Lastly, waterbird nest success increased slightly with distance away from the surrounding pond levee, and was greatest on islands 100-200 m from the surrounding pond levee ( fig. 6b). However, unlike with our island-scale nest abundance analysis, nest success decreased slightly at island distances more than 150 m. Coupled with the results of our nest abundance analyses, these results indicate that creating islands between 100 m and 200 m from pond levees may be most beneficial in increasing waterbird nest abundance and nest success. In conclusion, from our analyses of historical waterbird nesting data, we have identified several attributes of ponds, and islands therein, that most benefit nesting waterbirds in South San Francisco Bay. Based on these identified attributes, we suggest the following practices for pond and island construction and management would likely improve waterbird nesting habitat: 1. Locate ponds and islands for nesting waterbirds near (<1 km) San Francisco Bay. Such ponds and islands exhibited relatively greater nest abundance as well as nest success. Ponds and islands located 4-5 km from San Francisco Bay also exhibited relatively high nest abundance, but nest success was lower than in ponds near San Francisco Bay. 2. Where possible, construct islands 100-200 m from the nearest surrounding pond levee. Although nest abundance increased with increasing island distance from pond levee up to 300 m, nest success on islands was greatest on islands 100-200 m from the levee, and decreased at distances 200-300 m. 3. Construct nesting islands more linear in shape, rather than rounded. Although there was no difference in nest success between linear and rounded islands, linear islands exhibited as much as eight times more nests than rounded islands after controlling for all other island variables including size. However, although the recently constructed \"linear\" islands in Pond SF2 are more linear in shape (mean of the residual of perimeter to area regression for all 15 islands = -33) than the recently constructed round islands in Pond SF2 (mean of the residual of perimeter to area regression for all 15 islands = -108), the linear islands in Pond SF2 and Pond A16 are actually much more rounded than the islands that support the greatest nest abundance (residual of perimeter to area regression = 200). Therefore, it is recommended that islands constructed in the future be more linear than those recently constructed in Pond SF2 and Pond A16. Instead, we suggest mimicking the linear shape of islands in Pond A2W and the four historical islands at the southern end of Pond A16. 4. Construct three to five nesting islands within multiple ponds, as opposed to constructing many islands in just a few ponds. There was no correlation between the number of islands within a pond and either nest abundance or nest success. Given this result, constructing fewer nesting islands (3-5 islands) within each of several ponds may be more advantageous to waterbirds than constructing many nesting islands in a single pond (such as recently created at Pond SF2 [30 islands] and Pond A16 [20 islands]). In certain situations, predators can effectively cancel reproduction across islands within an entire pond, so dispersing nesting islands across several ponds may decrease the potential for massive reproductive failure. As an example, in 2010, California gulls nesting in Pond A6 (prior to the levee breach) severely limited tern reproductive success across all islands in adjacent Pond A7 (Ackerman and others, 2014). In a situation such as this, having 20 nesting islands spread out among several ponds, rather than in a single pond impacted by gulls, likely would lead to greater waterbird productivity. 5. Construct islands that are 0.05-0.10 ha in size. Individual island size had little effect on waterbird nest abundance or nest success. Given this result, and the fact that some of the greatest nest abundances were observed on relatively small islands (0.01-0.05 ha), construction of large and expensive nesting islands is unnecessary for supporting large numbers of nesting avocets, stilts, and terns. However, because island erosion reduces island size over time, constructing islands a little larger than the ideal size may improve the longevity of nesting islands. Given that birds preferred linear islands, we suggest islands that are approximately 50 m long by 10 m wide (0.05 ha) to 100 m long by 10 m wide (0.10 ha). Again, the recently constructed \"linear\" islands in Ponds SF2 and A16 might be too \"rounded\" at their current size (70 m long by 25 m wide).\nIsland topography, vegetation cover, and social interactions all greatly affected nest-site selection by avocets and terns in South San Francisco Bay. Both species avoided nesting at low elevations and near the water's edge. For waterbirds nesting in tidal areas, nests at higher elevations often exhibit greater nest success, because of a lower likelihood of nest flooding (Rounds and others, 2004;Owen and Pierce, 2013). As such, many waterbirds nesting in tidal areas often avoid low elevation, near-water nest sites that are more susceptible to flooding (Burger and Shisler, 1980;Howe and others, 1982;Storey and others, 1988;Lauro and Burger, 1989). Although the islands in this study were within former salt ponds, and not exposed to daily changing tides, wave action from high winds often inundated low-lying island areas, particular those on the windward side of the island, and pond levels can fluctuate at extreme high and low tides depending on the location and size of the water control structures on the ponds. Additionally, fluctuations in managed water levels also flooded nests. Indeed, in some of the managed ponds, flooding accounted for more than 60 percent of avocet nest failures (Ackerman and others, 2013). Thus, avoidance of low-lying, near-water island areas by nesting avocets and terns likely improves the probability of nest survival in South San Francisco Bay. The probability of avocets and terns nesting within a 1-m 2 island grid cells also varied according to slope. However, whereas avocets preferred steeper slopes (peak probability of nesting at 15 degrees), terns preferred flat to shallow slopes of less than 10 degrees (peak probability of nesting at 6 degrees). Previous studies have shown slope to be an important determinant of nest-site selection in terns and shorebirds (Burger, 1988;Burger and Gochfeld, 1990;Whittingham and others, 2002;Anteau and others, 2012), with birds typically selecting flat nest sites. For terns nesting in South San Francisco Bay, nesting in flat island areas may prevent eggs from rolling away when nests are unattended, particularly during high winds. Aspect of island grid cells had little to no effect on nesting probability of avocets and terns, as avocets nested at relatively equal probabilities regardless of the orientation of island grid cells, and terns showed only a modest decrease in nesting probability as island grid cell's orientation became more northern-facing. Conversely, nest microhabitat selection was effected by aspect as both avocets and tern nest sites were more likely to have south-facing slopes than north-facing slopes relative to paired sites, indicating that at the smaller microhabitat scale both species preferred to orient their nests southward. A south-facing nest orientation, coupled with at least a moderate slope, may afford some protection to nests from the often strong northwestern winds that are common to South San Francisco Bay. Lastly, surface ruggedness at the microhabitat scale did not vary between nest sites and paired random sites, indicating that microhabitats at avocet and tern nests were no more smooth or rugged than what was available on the island. The probability of avocet nesting varied between the two years of the study, such that peak nesting probabilities were almost 50 percent lower in 2012 relative to 2011 ( fig. 7). Conversely, tern nesting probabilities were consistent between years ( fig. 8). Indeed, whereas similar numbers of tern nests were initiated among the 24 study islands between years (506 in 2011and 516 in 2012; table 7), only 82 avocet nests were initiated among the 24 islands for which we had island topographic data in 2012 compared to 263 in 2011. Lowered water levels in Pond A17 in 2012, relative to 2011 caused the formation of the Northeast Island in Pond A17, and 45 avocet nests were found on this island in 2012, 22 of which were used in our microhabitat scale analysis. Even after accounting for the 27 avocet nests found in 2011 on islands not monitored in 2012 (Islands 1 and 2 on Pond E2; Northwest Island on Pond AB1), avocet nesting effort on islands for this study was much lower in 2012. In fact, with the exception of Surprise Island 8 on Pond AB2, avocet nesting effort was lower on every island monitored in 2012 compared to 2011 (table 7). At two ponds, management activities likely played a role in reduced avocet numbers in 2012. In 2012, Pond A16 was drained in preparation for the construction of new nesting islands (completed prior to the 2013 breeding season) associated with the South Bay Salt Pond Restoration Project. Lack of suitable nearby foraging habitat and predator access to nesting islands likely made Pond A16 unattractive to nesting avocets and terns in 2012. Thirty islands at Pond SF2 (eight of which were included in this study) were constructed prior to the 2011 breeding season, also as part of the South Bay Salt Pond Restoration Project. After a positive response the first year after island construction (154 nests on 30 islands in 2011), only four avocet nests were found on Pond SF2 islands in 2012. Extensive cracking of island surfaces was evident on Pond SF2 islands in 2011 and 2012, and shorebird chicks that had fallen into these cracks were discovered on a few occasions. If such chick losses were widespread, and if reproductive success was very low in general, avocets may have rejected these islands as nesting habitat in 2012. Among all islands, even islands where the number of tern nests increased or were similar between years, avocet nest numbers were much lower in 2012. Unlike terns, avocets seemed not to move to new island nesting areas as their former nesting habitat changed (such as the loss of Pond A8 and Pond A16, which once hosted as many as 400 avocets annually), and thus population size of avocets has declined substantially in the South San Francisco Bay (J.T. Ackerman, unpub. data). Microhabitats of avocet and tern nests varied in the distribution and extent of vegetation cover. Relative to paired sites, tern nest sites were more likely to have vegetation present in each of the nine (0.33×0.33 m) microhabitat grid cells ( fig. 9). Thus, although terns clearly preferred nest sites surrounded by vegetation, there appeared to be little, if any, preference for vegetation structure at particular locations around the nest. Conversely, avocet nests were only more likely to have vegetation present in the center microhabitat grid cell (the cell where the nest bowl was located) and in cells immediately north and east of the nest bowl ( fig. 9a). Furthermore, the greatest difference in the likelihood of containing vegetation between avocet nest and paired sites occurred in the center cell that contained the nest bowl. Some shorebirds, including avocets, often place their nest near conspicuous objects such as livestock dung piles, rocks, and dirt mounds (Grover and Knopf, 1982;Colwell and Oring, 1990), a behavior that may make the incubating bird less conspicuous to predators, particularly in areas with little vegetation cover (Allen, 1980). Selection for vegetation in the center microhabitat grid cell may reflect avocets' preference for nesting near conspicuous objects, in a relatively sparsely vegetated environment. For avocets and terns, the probability of nesting in an island grid cell increased with the number of bordering grid cells that were used for nesting by terns and with the number of tern nests initiated in the bordering grid cells. Conspecific attraction to nesting sites has been documented in many colonial waterbird species, and has been used to great effect in restoration of seabird breeding colonies (Jones and Kress, 2012), including Forster's terns (Ward and others, 2011). The presence of many conspecifics may signal to individual terns the quality of the breeding patch. Moreover, like many terns, Forster's terns display aggressive predator mobbing behaviors (McNicholl and others, 2001). In San Francisco Bay, California gulls are important predators of Forster's tern chicks, accounting for as much as 54 percent of chick deaths (Ackerman and others, 2014). By nesting among many other terns, individual terns, as well as avocets, may reduce the probability that their eggs or chicks are depredated through greater communal mobbing of predators, as well as predator satiation (Götmark and Andersson, 1984). In conclusion, based on our analyses of nest-site selection at both the island grid and microhabitat scales, we suggest the following practices for pond and island construction and management would likely improve waterbird nesting habitat: 1. Construct nesting islands with abundant area 0.5-1.5 m above the water surface. Avocet preferred habitat was 0.5-1.0 m above the water surface, whereas terns' preference increased with elevation up to 1.3 m. Thus, islands with much of their area at elevations below 0.5 m will be limited in their ability to support large numbers of nesting waterbirds. This preference combined with the likelihood for erosion over time, indicates that islands be constructed with ample area that is 0.5-1.5 m above the water surface. 2. Construct nesting islands with abundant area within 10 m from the water's edge. The probability of nesting peaked at approximately 7 m from the water's edge for avocet nests, and 2 m from the water's edge for tern nests. Given these results, large, rounded islands which have considerable area more than 10 m from the water's edge are less beneficial to nesting avocets and terns. Like our results at the largest spatial scale, this result indicates that linear islands are more conducive to bird nesting than are rounded islands because, for a given island size, a linear shape allows for more area within 10 m of the water's edge. 3. Construct nesting islands with a mosaic of slopes ranging from flat to moderately steep (21 degrees). Avocets were more likely to nest in steep island grid cells whereas terns preferred flat grid cells. Thus, high topographic relief on islands is suggested, which is often at odds with the final smoothing of islands that is typically done during island construction. 4. Construct nesting islands with abundant area with south-facing slopes. Although avocets showed no preference for aspect of island grid cells, terns preferred to nest on south-facing slopes. To maximize the amount of area on linear islands with south-facing slopes, islands may be oriented west-to-east from end-to-end. 5. Ensure nesting islands contain patches of short vegetation, ranging from 10 to 100 percent cover, as well as area with little (<10 percent cover) or no cover, but tall vegetation is not ideal. Both avocets and terns were more likely to nest in microhabitats with vegetation (65 percent of avocet nests, 76 percent of tern nests) than without it. Yet, many avocet nests were in sparsely vegetated areas, suggesting that islands with complete vegetation cover would not be conducive to nesting by avocets.\nPrevious studies have shown that waterbirds, especially shorebirds, use tidal flats for roosting and foraging at low tide when the habitat is exposed, and use alternate roosting and foraging habitats at high tide (Burger and others, 1977;Warnock and Takekawa, 1995;Long and Ralph, 2001;Dias and others, 2006). Similarly, we observed high abundances of waterbirds using Pond SF2 and the islands therein at high tide when the adjacent mudflats were inundated. The lower abundance of birds in the winter and higher abundance of birds in the autumn and spring reflect bay-wide migratory patterns (Page and others, 1999;Franks and others, 2014). Migratory patterns, along with different foraging preferences, may account for changes in seasonal use among islands at high and low tide. Pond SF2 islands were most heavily used during the spring at high tide, predominantly by sandpipers. Sandpipers have a diffuse autumn migration (July-October), whereas their spring migration has a narrower time window and their abundance is more concentrated (Franks and others, 2014). This pattern was not observed at low tide, as sandpipers disperse to tidal mudflats to forage. In contrast, dabbling ducks dominated the islands at low tide. Although dabbling ducks are not typically considered mudflat foragers, they are known to forage in estuary impoundments (Baldwin and Lovvorn, 1994). Because of this difference in foraging locations, dabbling ducks can spend the tidal cycle in the pond, roosting on the islands and foraging within the pond. Use of roost sites can be variable and dynamic with few sites serving as primary roosts and numerous sites used infrequently others, 2007, 2008). Among Pond SF2 islands, Islands 24 and 25 were used as roosting sites more than the other islands. For shorebirds, proximity to foraging areas influences use of roosts (Furness, 1973;Warnock and Takekawa, 1996;Dias and others, 2006;Conklin and others, 2008). The maximum distance (< 1 km) of any island on Pond SF2 to the adjacent mudflat is less than the maximum distance small shorebirds are known to travel between roosts and foraging habitat (Warnock and Takekawa, 1996;Dias and others, 2006), thus all islands within Pond SF2 are likely within range for shorebirds to use them as high tide roosting sites. When small shorebirds were present on the pond, regardless of tide, they were more likely to be observed on round islands. The round islands might provide better protection from the wind, because high winds can cause birds to abandon roost locations (Handel and Gill, Jr., 1992;Burton and others, 1996). Alternatively, these larger islands may support a larger flock, which could be useful for anti-predator behavior in smaller species. Herons and egrets were present more often on linear islands, perhaps because the smaller, scalloped edge areas provide multiple shallow sites for stalking fish. Our study at Pond SF2 found that the waterbirds using newly-created islands for roosting were most influenced by island size and shape. Overall, the islands had higher densities of birds than either the open water or levee areas of Pond SF2, and therefore were considered to increase the number of birds using the pond. Island habitats might become even more important as the SBSP Restoration Project plans to restore 50-90 percent of the managed ponds to tidal marsh, and the availability of roost sites may be reduced in the future. Thus, the islands in Pond SF2 and other remaining managed ponds may become even more important as roosting sites. Overall, from our analysis of the newly constructed islands in Pond SF2, we have identified the following island features that benefit wintering and migratory waterbirds: 1. Small shorebird use of islands at high tide suggests that these islands provided important roosting habitat when tidal mudflats were inundated. Small shorebirds (sandpipers) were more likely to use round islands as opposed to linear islands at high tide during spring. 2. Preferences for island shape and size differed by guild. During the winter, dabbling ducks were more likely to use small islands as opposed to large islands during low tide. Wading birds (herons) and piscivores were more likely to use linear islands as opposed to round islands. Importantly, gulls were more likely to use large, linear islands versus small, round islands.\nOverall, we determined that the presence and area of islands clearly influenced abundances of wintering birds at the pond scale. Abundance of four out of five species and all seven guilds that we studied were associated with island features either during foraging or roosting (see summaries of island effects at the pond scale in tables 19 and 20). In most instances the presence of islands at the pond scale either increased or had no measureable effect on abundances of foraging and roosting birds (tables 19 and 20). Abundance of foraging avocets was positively associated with an increasing number of islands at the pond scale (table 19). Salt ponds and other impoundments are commonly used by wintering avocets (Stenzel and others, 2002;Rintoul and others, 2003;Mellink and Riva, 2005), and within these habitats avocets occur in shallow waters between 8.5 and 17 cm deep (Boettcher and others, 1995;Weber and Haig, 1996). Managed ponds containing several small islands may provide increased foraging opportunities associated with access to a gradient of depths along island edges that are within this preferred range. Managed ponds comprise as much as 60 percent of black-necked stilt core use areas (Ackerman and others, 2007;Hickey and others, 2007;), and we determined that ponds with islands had increased abundances of foraging stilts (tables 19 and 20). For all species and guilds, we found great variation in response to island parameters across study months (tables 19 and 20). These temporal differences may represent change in use of ponds with islands during spring and autumn migration or during more extreme mid-winter tides. Additionally, the amount of shallow or exposed pond bottom can vary by season, rainfall, and management actions within each pond and can cause island habitat to be more important at different times within or across years. We determined that island variables had no measurable influence at the pond scale on the number of roosting American avocets, black-necked stilts, eared grebes, or piscivores. Alternative roosting habitat does exist within the project ponds, and may be important for some of these species or guilds. In addition to islands, waterbirds roost on pond levees, on shallow or exposed pond bottom, and on wooden structures within the pond. Although there is more levee area compared to island area available for roosting waterbirds, we have not determined what levee features support roosting birds and what levee area may be reduced with future restoration actions. Thus, although islands may not currently influence the roosting abundance of some species or guilds, they may become more important in the future as management and restoration actions change the availability of alternative roosting habitat. While pond-scale analyses help identify the role of islands in attracting birds to a pond, gridscale analyses provide the opportunity to evaluate how island features within a pond influence avian abundances. At the grid scale, we determined that the presence of islands increased roosting or foraging abundance for four of five species and five of seven guilds that we evaluated in this study (see summaries of island effects at the grid scale in tables 24 and 25). For eared grebes, a species associated with open water in hyperhaline ponds (Athearn and others, 2010), abundance decreased with increasing island area within a grid. This may be related to an increase in foraging opportunities for these species in the deeper, open-pond areas. Overall, effects of island area and the island-area to pond-area ratio were evident for fewer species at the grid scale than at the pond scale (tables 20, 24, and 25). For foraging avocets, gulls, and medium shorebirds, distance to nearest island had a positive effect such that bird abundance increased in grids closer to islands (tables 24 and 25). For diving ducks, the effect of islands had a slight parabolic shape, with a positive effect on abundance close to islands and a much stronger positive effect at distances equal to or greater than 1,500 m from islands ( fig. 13). These taxa could have been responding to different features associated with islands. For example, islands are often adjacent to borrow ditches where sediment has been removed to form the island. The slight increase in diving ducks observed near islands may be a response to increased foraging opportunities in these deeper water areas close to some islands; however, foraging opportunities away from islands clearly draw larger numbers of ducks. In contrast, avocets and medium shorebirds may be responding to sloping island shores and increased areas of shallow water within their preferred foraging depths (Boettcher and others, 1995), or to the proximity of suitable island roosting areas to their foraging area (, Dias and others, 2006;Rosa and others, 2006; tables 24 and 25). After accounting for variables, including salinity, depth, and area, known to influence the abundance of birds, we determined that island variables influenced the abundance of roosting and foraging birds at both pond and grid scales within SBSP Restoration Project area. Across ponds, the presence of increasing number of islands had a positive influence on the roosting and foraging abundance of most taxa studies. For several species or guilds, such as gulls, fewer large islands were associated with an increasing abundance. Within ponds, distance to island was an important variable, such that grids with islands and grids closer to islands supported a higher abundance of most species or guilds. Therefore, dispersing islands across individual ponds would increase the number of grids closer to islands, and may enhance bird abundance. Across the study ponds, most islands occupied only a small proportion of a pond or grid and our sample size of larger islands and larger island-area to pondor grid-area ratios was limited. Our data set included ponds with a range of between 1 and 22 islands, covering up to 12 percent of the pond, and in most ponds island area occupied < 1 percent of pond area. There is likely an upper limit to the number or area of islands that is beneficial to wintering birds; however, estimating this number would require a larger range of island number and sizes. Our results demonstrated a positive influence of islands on wintering bird abundance and suggested that additional islands may benefit most species or guilds. Overall, from our analysis of historical salt pond bird abundance data, we have identified several island variables that influence the abundance of wintering birds across and within ponds: 1. At the pond scale, we determined that the presence of islands within ponds increased the overall abundance of most bird species within ponds. Therefore, more ponds with islands will likely have an overall positive benefit to bird abundance. The influence of islands varied by species and guild, but presence of islands did not have a negative influence on the abundance of any species or guild. 2. For foraging birds at the pond scale, islands had a positive influence on the abundance of American avocets, eared grebes, Forster's terns, western sandpipers, dabbling ducks, gulls, small and medium shorebirds, and piscivores. Of these species and guilds, island area positively influenced the abundance of gulls, Forster's terns, and piscivores, whereas number of islands positively influenced the abundance of American avocets and black-necked stilts. Islands did not influence the abundance of foraging diving ducks or herons. 3. For roosting birds at the pond scale, islands had a positive influence on the abundance of Forster's terns, western sandpipers, dabbling ducks, diving ducks, gulls, herons, and small and medium shorebirds. For all taxa except small shorebirds, island-area to pond-area ratio had a positive influence on the abundance. Islands did not influence the abundance of roosting American avocets, black-necked stilts, eared grebes, and piscivores. 4. At the grid scale, the abundance of most birds was greater in areas with islands. Once birds selected ponds that contain islands, their abundance within the pond is influenced by the spatial location of islands within the ponds. For most birds, islands had a positive influence on the abundance of birds within ponds, and islands only had a negative influence on the abundance of foraging eared grebes. 5. For foraging birds at the grid scale, islands had a positive influence on the abundance of American avocets, black-necked stilts, Forster's terns, western sandpipers, dabbling ducks, diving ducks, gulls, herons, piscivores, and small and medium shorebirds. The abundance of black-necked stilts and piscivores was positively influenced by island-area to pond-area ratio, whereas the abundance Forster's terns and small shorebirds was positively influenced by island area. 6. Islands that are scattered across the pond rather than clustered together may increase the preferred foraging area of many birds. The abundance of foraging American avocets, gulls, diving ducks, and medium shorebirds was greatest in grids closer to islands, though diving ducks were most abundant farther from islands. The abundance of eared grebes was negatively influenced by island area. 7. For roosting birds at the grid scale, islands had a positive influence on the abundance of American avocets, black-necked stilts, western sandpipers, dabbling ducks, diving ducks, herons, piscivores, and small and medium shorebirds. The abundance of diving ducks was positively influenced by island area whereas the abundance of gulls increased in grids closer to islands. Islands did not influence the abundance of eared grebes and Forster's terns.        and 2012 (open markers) (a) increased with greater elevation, (b) increased with increasing distance to the water's edge up to a peak at approximately 2 meters, decreasing thereafter, (c) decreased as slope increased beyond approximately 10 degrees; (d) was slightly lower for grids with north-facing versus south-facing aspects (values 180-360 degrees were converted to 0-180 degrees for presentation); (e) increased as more bordering grid cells were used by nesting terns (circles) and nesting terns and avocets (squares), and (f) increased as the number of tern (circles), and avocet and tern (squares) nests in bordering cells increased up to a peak of 10 tern nests and 12 avocet and tern nests, decreasing thereafter. Each variable effect relationship with probability of nesting is displayed at the mean values for all other variables.      Sixteen new islands were constructed in winter of 2013 at Pond A16 as enhancement to increase nesting and foraging value for waterbirds, bringing the total number of islands in Pond A16 to 20 (one of the five historical islands was removed). However, incomplete flooding of this pond prevented these islands from fully functioning as islands during the 2013 breeding season. As a result, we omitted 2013 data from Pond A16 from all analyses. 2 Data not used in nest success analyses. 3 Originally two separate ponds, this combined pond was created when the dividing levee was cut to make island habitat. [All models with a cumulative model weight of 90 percent are shown. DistBay: distance to San Francisco Bay. Islands: number of islands within the pond. IslArea:PondArea: the ratio of island area to pond area. PondArea: total area of the pond. IslandArea: total island area of all the islands within a pond] The weight of evidence that the model with the lowest AICc value is better than the current model  The difference in the AIC c values of the current model and the model with the lowest AIC c . d Akaike model weight. The likelihood of the model given the data, relative to other models in the candidate set. e The weight of evidence that the model with the lowest AIC c value is better than the current model. [All models with a cumulative model weight of 90 percent are shown.DistBay: distance to San Francisco Bay. Islands: number of islands within the pond. IslArea:PondArea: the ratio of island area to pond area. PondArea: total area of the pond. IslandArea: total island area of all the islands within a pond] Year + DistBay + IslandArea 13 -10.4 27.7 7.44 0.01 41.32 a The number of parameters in the model including the intercept and variance. b Akaike's Information Criterion corrected for small sample size. c The difference in the AIC c values of the current model and the model with the lowest AIC c . d Akaike model weight. The likelihood of the model given the data, relative to other models in the candidate set. e The weight of evidence that the model with the lowest AIC c value is better than the current model.  Table 7. Number of American avocet nests and Forster's tern nests with precise spatial data using real-time kinematic GPS, South San Francisco Bay, California, 2011 and 2012. [Only islands and the nests therein where the island area is provided were used in the island grid scale analysis. The number of nests in the island grid scale includes all nests initiated on the 24 islands for which we also had island topographic data. The number of nests in the microhabitat scale includes only those nests for which we recorded microhabitat surface topography in addition to the nest bowl location. Abbreviations:      Table 13. The presence or absence of guilds by island shape and size in Pond SF2 (binary logistic regression, df =1), South San Francisco Bay, California. [Bold indicates a significant p-value. 95-percent confidence intervals (95% C.I.) were only calculated when results were significant.     c Island variables followed by month refer to the interaction between the variable and the particular month. Table 19. The influence of island variables on the foraging abundance of birds in ponds, South San Francisco Bay, California."}, {"section_title": "Using GPS Technology to Model Waterbird Nest-Site Selection at Island Patch and Microhabitat Scales", "text": ""}, {"section_title": "Island Topography", "text": "We collected topographic data for the entire surface of 24 nesting islands. At each island, we collected UTM coordinates (accuracy: 3.75 cm) and elevation above sea level data (accuracy: 3.75 cm) using real-time kinematic GPS (Leica Smart Rover GPS1200) at each point along a predefined grid, where points were spaced by 1 m. So as to not disrupt nesting birds, these data were collected in August and September of 2011 (23 islands) and 2012 (1 island), immediately after nests had hatched and chicks had fledged. Using these data, we developed Digital Elevation Models (DEMs) for each island using Inverse Distance Weighted (IDW) interpolation with the Spatial Analyst extension 10.2 for ArcMap 10.2. From these DEMs, we calculated the maximum slope and corresponding aspect of each 1-m 2 island grid cell using the Spatial Analyst extension 10.2 for ArcMap 10.2. We calculated the elevation above the water surface for each 1-m 2 island grid cell on each island by subtracting the water surface elevation of each pond (measured in early May) from the elevation above sea level generated from the DEMs. Additionally, we used real-time kinematic GPS to trace each nesting island's perimeter at the water's edge. UTM coordinates (accuracy: 3.75 cm) and elevation above sea level (accuracy: 3.75 cm) data were collected at one second intervals while the perimeter of each nesting island was traversed and the water's edge marked using the GPS unit. These data were then used to create highly precise polyline shapefiles that identified the location of the water's edge for each nesting island. We measured island perimeters once in 2011 and potential fluctuations in each pond's water depth were monitored using permanent staff gauges within each pond. During the nesting season, water levels in ponds remained relatively static and were similar between 2011 and 2012. In ponds where water levels were different in 2012 than in 2011, we re-traced island perimeters in 2012. Using these island perimeter polylines, we calculated the distance to the water's edge of the centroid of each island grid cell."}, {"section_title": "Nest Microhabitat Topography and Vegetation", "text": "We entered avocet and tern nesting colonies once a week during the nesting season (April-August). Newly initiated nests were marked with a uniquely numbered aluminum tag placed outside the nest bowl, and a 40-cm tall, colored flag placed 2 m north of the nest. During each weekly visit, we recorded clutch size, floated eggs to determine embryo age (Ackerman and Eagles-Smith, 2010), and determined whether each nest was active or inactive (abandoned or depredated). We estimated nest initiation date by subtracting the clutch size plus the average embryo age of eggs in the nest at the initial visit from the date the nest was found. For each nest, we measured or derived a suite of microhabitat characteristics at the nest site and at one paired site (table 6). The location of the paired site was determined at the time of nest discovery and obtained using a randomly generated azimuth (0-359 degrees) and distance (1.0-10.0 m) from the nest site. Once the azimuth and distance for a paired site were generated, a two-person team used a field compass and tape measure to navigate from the nest to the location of the paired site. Paired sites were marked with a uniquely numbered aluminum tag. For each nest, the paired site represented an unused available nest site at the time of nest discovery that was close (≤10 m) to the nest. If a randomly generated azimuth and distance resulted in a paired site to be in unsuitable habitat (for example, open water), we proceeded to the next randomly generated azimuth and distance. We placed a 1-m 2 frame centered on the nest bowl, or paired site tag, such that the sides of the frame each faced the four cardinal directions. We visually estimated percent cover of vegetation and water over the entire 1-m 2 area and, using a ruler, measured the average vegetation height (±0.5 cm) within the 1-m 2 area. The 1-m 2 frame was further divided into nine equal cells (3×3 grid; each cell 0.33×0.33 m) and the dominant cover type and the maximum vegetation height (±0.5 cm) within each cell was recorded. After nesting had concluded, we returned to colony sites and again centered the 1-m 2 frame on each nest and each paired site, with the four sides of the frame again facing the four cardinal directions. We recorded the UTM coordinates (accuracy: 3.75 cm), and elevation above sea level (accuracy: 3.75 cm) of the nest bowl or paired site tag using a real-time kinematic GPS. Additionally, to produce a surface topographic profile around each nest and paired site, we measured elevation at 16 points within the 1-m 2 frame; points were spaced every 0.33 m and corresponded to the intersections of the 3×3 grid. Lastly, we measured elevation at the two highest and two lowest points anywhere within the 1-m 2 frame, with the restriction that only one high and one low point could be in any one of the nine grid cells. Thus, for each nest and paired site we collected 21 data points (one at the nest or paired site tag, 16 at the intersections of the 3×3 grid, and two representing elevation maximums and two representing elevation minimums). Using 20 of these points (excluding the elevation at the nest or paired site tag), we developed DEMs at a resolution of 0.33-m 2 around each nest and paired site using IDW interpolation (Spatial Analyst extension 10.2 for ArcMap 10.2). Because avocets and terns sometimes build up their nests with vegetation and other materials, we decided to omit the elevation taken from the nest bowl when interpolating elevation, as this point would create a high point in the center of the surface topography that did not exist at the time of nest-site selection. For consistency, we also omitted the elevation taken at the paired site tag. From each nest and paired site-specific DEM, we calculated the maximum slope and corresponding aspect (Spatial Analyst extension 10.2 for ArcMap 10.2). We quantified the ruggedness of the topography of each nest and paired site by calculating a vector ruggedness measure (VRM) following Sappington and others (2007), and using the Vector Ruggedness Measure script for ArcGIS (ESRI ArcScripts, http://arcscripts.esri.com). Briefly, VRM is a measure of terrain ruggedness that incorporates heterogeneity of slope and aspect. The primary advantage of VRM is that it allows ruggedness to be calculated more independently of slope than other methods such that steep, rugged areas can be distinguished from areas that are steep but not rugged. The resulting VRM is a unitless value ranging from 0 (flat surface) to 1 (highly rugged surface; see Sappington and others [2007] for more details). We calculated the elevation above the pond's water surface for each nest and paired site by subtracting the water-surface elevation of each pond from the elevation of the nest and paired site above sea level. Lastly, we calculated the distance to water for each nest and paired site using the island perimeter polylines previously described."}, {"section_title": "Statistical Analyses Nest-Site Selection at the Island Grid Scale", "text": "We investigated characteristics affecting nest-site selection by avocets and terns at two spatial scales. First, using the presence or absence of nests among all the 1-m 2 island grid cells on all islands, we developed Resource Selection Probability Functions (RSPFs; Manly and others, 2002) to model the probability that an avocet or tern would nest in an island grid according to island grid topographic features. Using the UTM coordinates from the nest bowls, we assigned each 1-m 2 island grid cell as used or not used by nesting avocets and used or not used by nesting terns, in each of the 2011 and 2012 breeding seasons. We used generalized linear mixed models (PROC GLIMMIX, SAS/STAT ® software, release 9.4, SAS Institute, Cary, North Carolina), with a binomial distribution and logit link function to model the probability that an island grid cell was used for nesting by avocets or terns. We evaluated five fixed effects of interest that described each of the island grid cells: (1) Year, (2) mean elevation above the water surface (Elevation), (3) Slope, (4) Aspect (analyzed using the cosine of aspect in radians), and (5) distance to the water's edge from the grid cell's centroid (DistWater). Additionally, because terns and avocets are colonial and likely influenced by the presence of nearby nesting birds, we included the following additional fixed effects to account for the influence, both in presence and abundance, of nearby nesting birds: (6) number of bordering grid cells (0-8) that were used for nesting by conspecifics (NumberBorderingConspecificCells), (7) number of bordering grid cells (0-8) that were used for nesting by avocets or terns (NumberBorderingOccupiedCells), (8) number of conspecific nests initiated in bordering grid cells (NumberBorderingConspecificNests), and (9) number of avocet and tern nests initiated in bordering grid cells (NumberBorderingNests). Because these final four variables were highly correlated (r 2 = 0.51-0.97), we allowed only one of these variables (numbers 6-9) to be included in any given model. We built a relatively balanced set of candidate models based on all combinations of the class variable year, and linear and quadratic terms of the fixed effects 2-5, plus the null model. We also included nesting island as a random effect in every model. There were 161 combinations of the five fixed effects of interest, plus a null model (162 models), which also were evaluated with quadratic terms of each one of the four fixed effects that accounted for coloniality, resulting in 810 total candidate models. Because avocets and terns did not always nest on the same islands, we conducted separate analyses for each species. At the smaller microhabitat scale, we used conditional logistic regression for matched-pairs data (PROC LOGISTIC, SAS/STAT software) to model vegetation and micro-topographic characteristics affecting nest-site selection by avocets and terns. Individual nests and their corresponding paired site were matched with the strata option. We used a binomial distribution and logit link function to model the probability that a site was a nest rather than a paired site. We evaluated a total of 11 microhabitat variables: (1) vegetation presence (yes or no; VegYN), (2) percent vegetation cover, (%Veg), (3) percent water cover (%Water), (4) average vegetation height (VegHt), (5) Slope, (6) Aspect (analyzed using the cosine of aspect in radians), (7) surface ruggedness (Ruggedness), (8) distance to water (DistWater), (9) elevation above the water surface (Elevation), (10) distance to the nearest active conspecific nest (NearestConspecificNest), and (11) distance to the nearest active avocet or tern nest (NearestNest). Using nest initiation dates and the dates when nests first became inactive (failed or hatched), we developed nest chronologies for each nest and then determined the distance of each nest, at the time of its initiation, to the closest active nest. Because of strong correlations among cover variables VegYN, %Veg, %Water, and VegHt, we allowed only one of these cover variables to be included in any given candidate model. Similarly, because of strong correlation between variables NearestConspecificNest and Nearest Nest, we allowed only one of these two variables to be included in any given candidate model. Allowing for this restriction, we evaluated a relatively balanced set of additive models that incorporated all linear combinations of the 11 predictor variables (479 total models). We next investigated potential differences in the distribution of vegetation around nest sites relative to paired sites. We recorded whether or not vegetation was the dominant cover type (as opposed to bare ground or water) within each cell of the 3×3 microhabitat grid (each cell 0.33 m×0.33 m) at each nest site and paired site. Vegetation was considered the dominant cover type if it covered the most area within a cell relative to other cover types. Separately for each of the nine microhabitat grid cells, we constructed a 2×2 contingency table with the number of nest sites and the number of paired sites where the cell was dominated by vegetation, and the number of nest sites and the number of paired sites where the cell was not dominated by vegetation (that is, dominated by bare ground or water). We used McNemar's test (Zar, 1999) for matched pairs with a χ 2 statistic to test for differences in vegetation cover between nest sites and paired sites in each grid cell. Differences were considered significant at p less than or equal to 0.05."}, {"section_title": "Nest-Site Selection at the Island Grid Scale", "text": "We recorded precise locational data for 1,367 avocet and tern nests on the 24 islands for which we collected island topographic data, including 345 avocet nests (2011: n = 263, 2012: n = 82) and 1,022 tern nests (2011: n = 506, 2012: n = 516). Avocets initiated nests between March 24 and July 19 (mean ±1 standard deviation: May 19 ±27 days, n = 340), whereas terns initiated nests between April 25 and July 22 (mean ±1 standard deviation: June 17 ±14 days, n = 1,001). However, whereas avocets nested in all ponds where terns nested, terns did not nest in all avocet nesting ponds. Considering only ponds where both avocets and terns nested, avocets initiated nests between April 4 and July 19 (mean ±1 standard deviation: May 29 ±22 days, n = 192). Avocets nested on 23 islands in 8 ponds in 2011 and 9 islands in 5 ponds in 2012 (a total of 24 different islands), and terns nested on 10 islands in 5 ponds in 2011 and 8 islands in 4 ponds in 2012 (a total of 11 different islands; table 7). Differences in number of islands and number of nests between years were due to differences in nesting densities and locations of birds, and not by our level of survey effort. Only years in which an island had one or more nests and where we were able to map all nests on an island were included in the analysis. Among avocets, the most parsimonious model describing the probability that an 1-m 2 island grid cell was used for nesting included year, a linear term for slope, and quadratic terms for elevation, distance to water, and the number of conspecific nests initiated in bordering cells; had an Akaike weight of 0.30; and was 2.14 times more likely than the next best model (table 8a). Three other models were competitive (ΔAIC c < 2.0), and each model was similar to the best model but also included either a quadratic term for slope, the number of bordering cells with nesting conspecifics rather than the number of conspecific nests in bordering cells, or aspect. In fact, all models that contained the variables in the best model had a cumulative weight of 0.70. To further evaluate the importance of the variables in the best model, we compared evidence ratios between the best model and an identical model but with one of the variables removed. Using this approach, we estimated that the best model was 2.29×10 8 times more likely than the best model without elevation, 9.48×10 7 times more likely than the best model without year, 1.70×10 5 times more likely than the best model without distance to water, 3,500 times more likely than the best model without the number of conspecific nests initiated in bordering cells, and 27 times more likely than the best model without slope. Island grid cells used by nesting avocets averaged (± standard deviation) 0.62±0.28 m above the water surface, 2.69±2.62 m from the water's edge, had a slope of 4.8±3.0 degrees, were bordered by 0.4±0.7 cells that were used by nesting avocets and 1.5±2.0 cells used by nesting avocets and terns, and had 0.4±0.7 avocet nests and 2.2±3.4 avocet and tern nests initiated in all bordering cells over the nesting season. Model-averaged parameter estimates showed the probability that avocets nested in an island grid cell increased with the grid cell's elevation up to a peak approximately 0.8 m above the water surface, beyond which the probability of nesting in a grid decreased ( fig. 7a). Similarly, the probability that avocets nested in an island grid cell increased with the grid cell's distance to the water's edge up to a peak of approximately 7 m and then decreased thereafter ( fig. 7b). Moreover, the probability that avocets nested in a grid cell increased with slope, such that avocets preferred to nest on more steep terrain, up to a peak of approximately 15 degrees and then decreased slightly thereafter ( fig. 7c). Conversely, there was little effect of the aspect of the island grid cell on avocet nesting probability ( fig.  7d). Finally, the probability that avocets nested in an island grid cell decreased with both the number of bordering cells used by nesting avocets ( fig. 7e) and the total number of avocet nests initiated in bordering cells over the entire nesting season ( fig. 7f). In contrast, the probability that avocets nested in an island grid cell increased with both the number of bordering cells used for nesting by avocets and terns, and the total number of avocet and tern nests initiated in bordering cells over the entire nesting season, up to a peak of approximately 5 bordering cells and 11 bordering nests, and decreased thereafter (figs. 7e and 7f). Among terns, the most parsimonious model describing the probability that an island grid cell was used for nesting included quadratic terms for elevation, distance to water, and the number of bordering grid cells used by nesting terns; had an Akaike weight of 0.09; and was 1.04 times more likely than the next best model which was similar to the best model but included a linear rather than a quadratic term for elevation (table 8b). Nine other models were competitive (ΔAIC c < 2.0), and each was similar to the best model but included the variables year, aspect, slope, and (or) had a linear term for elevation instead of a quadratic term. In fact, models that contained elevation, distance to water, and the number of bordering grid cells used by nesting terns had a cumulative weight of 1.00. Using evidence ratios, the best model was 2.67×10 56 times more likely than the best model without number of bordering grid cells used by nesting terns, 8.85×10 12 times more likely than the best model without distance to water, and 2.14×10 7 times more likely than the best model without elevation. Island grid cells used by nesting terns averaged (± standard deviation) 0.61±0.25 m above the water surface, 0.93±0.73 m from the water's edge, had a slope of 5.5±3.4 degrees, were bordered by 3.6±1.9 cells that were used by nesting terns and 3.7±1.9 cells used by nesting avocets and terns, and had 5.2±3.5 tern nests and 5.7±3.8 avocet and tern nests initiated in all bordering cells. Model-averaged parameter estimates showed that the probability of a tern nesting in an island grid cell increased with elevation ( fig. 8a). The probability of a tern nesting increased with distance to the water's edge up to a peak approximately 2.0 m from the water's edge, and then decreased at greater distances ( fig. 8b). In contrast to avocets, terns were more likely to nest in island grid cells with flat to shallow slopes ( fig. 8c), and were slightly more likely to nest in south-facing than in north-facing grid cells ( fig. 8d). The probability that an island grid cell was used by nesting terns increased as the number of bordering cells used by terns, and bordering cells used by avocets and terns over the entire nesting season, increased ( fig. 8e). The probability that an island grid cell was used by nesting terns also increased as the total number of tern nests, and the total number of avocet and tern nests, initiated in bordering cells over the entire nesting season increased up to a peak of approximately 10 tern nests and 12 avocet and tern nests, and decreased thereafter ( fig. 8f). Interestingly, year played no role in the probability of a tern nesting in an island grid cell, unlike in avocets where year was a major factor influencing nesting probability."}, {"section_title": "Nest-Site Selection at the Microhabitat Scale", "text": "We measured or derived all 11 microhabitat variables at both the nest site and a paired site for 662 nests, including 229 avocet nests (2011: n = 161, 2012: n = 68) and 433 tern nests (2011: n = 202, 2012: n = 231; table 7). The most parsimonious model describing avocet nest microhabitat included the variables vegetation presence, distance to nearest active conspecific nest, and aspect; had an Akaike weight of 0.16; and was 2.26 times more likely than the next best model (table 9a). Two other models were competitive (ΔAIC c < 2.0), and each was the same as the best model but also included either surface ruggedness or distance to water. In fact, models that contained vegetation presence, distance to nearest active conspecific nest, and aspect had a cumulative weight of 0.86. The best model was 6.09×10 11 times more likely than the best model without vegetation presence, 408 times more likely than the best model without distance to nearest active conspecific nest, and 2.9 times more likely than the best model without aspect. Model-averaged parameter estimates showed that the probability that a microhabitat was used for nesting by avocets decreased as the microhabitat distance from an active conspecific nest or active avocet or tern nest increased, increased as the amount of vegetation around the nest increased, increased as the average vegetation height around the nest increased, decreased as aspect changed from a southward to a northward orientation, and was greater when vegetation was present (table 10). Standardized odds ratios (obtained using the values of the first and third quartiles of the paired site data) indicated that distance to nearest conspecific nest had the greatest effect size among variables, followed by distance to nearest nest of either species, vegetation presence or absence, percent vegetation cover, aspect, and average vegetation height. A microhabitat located 3.7 m (first quartile distance for paired sites) from the nearest active avocet nest was 5.9 times more likely to be used for nesting by an avocet than a microhabitat 20.6 m (third quartile distance for paired sites) from the nearest active avocet nest. Additionally, avocet nest sites were 4.1 times more likely to have vegetation present than paired sites, with 65 percent of avocet nest sites having some vegetation compared to only 43 percent of paired sites. Lastly, a microhabitat with a more southern aspect (138 degrees, first quartile aspect for paired sites) was 1.6 times more likely to be used by nesting avocets than a microhabitat with a more northern aspect (53 degrees, third quartile aspect for paired sites). The most parsimonious model describing tern nest microhabitat included the variables, percent vegetation cover, elevation, distance to nearest active conspecific nest, and aspect; had an Akaike weight of 0.20; and was 1.69 times more likely than the next best model (table 9b). Three other models were competitive (ΔAIC c < 2.0), and each was the same as the best model but also included either slope, surface ruggedness, or both. Models that contained percent vegetation cover, elevation, distance to nearest active conspecific nest, and aspect had a cumulative weight of 0.66. The best model was 860 times more likely than the best model without percent vegetation cover, 240 times more likely than the best model without elevation, 23 times more likely than the best model without distance to nearest active conspecific nest, and 6 times more likely than the best model without aspect. Model-averaged parameter estimates showed that the probability that a microhabitat was used for nesting by terns increased with elevation, decreased as a the microhabitat distance from an active tern nest increased, increased as the percent cover of vegetation around the nest increased, decreased as aspect changed from a southward to a northward orientation, and was greater when vegetation was present (table 10). Standardized odds ratios indicated that percent vegetation cover had the greatest effect size among variables, followed by elevation, vegetation presence, aspect, and distance to nearest conspecific nest. A microhabitat with 75 percent vegetation cover (third quartile vegetation cover for paired sites) was 2.6 times more likely to be used for nesting by terns than a microhabitat with 0 percent vegetation cover (first quartile vegetation cover for paired sites). Similarly, microhabitats at an elevation of 0.72 m (third quartile elevation for paired sites) were 2.5 times more likely to be used for nesting by terns than a microhabitat at an elevation of 0.37 m (first quartile elevation for paired sites). Tern nest sites were 1.6 times more likely to have vegetation present than paired sites, with 76 percent of tern nest sites having some vegetation compared to only 67 percent of paired sites. Microhabitats with a more southern aspect (141 degrees, first quartile aspect for paired sites) were 1.4 times more likely to be used by nesting terns than a microhabitat with a more northern aspect (48 degrees, third quartile distance for paired sites). Finally, a microhabitat located 0.6 m (first quartile distance for paired sites) from the nearest active tern nest was 1.3 times more likely to be used for nesting by an avocet than a microhabitat 2.1 m (third quartile distance for paired sites) from the nearest active tern nest. We compared dominant cover type between nest sites and paired random sites in each of the nine (3×3 grid; each cell 0.33×0.33 m) microhabitat grid cells for 316 American avocet and 648 Forster's tern nests. Pickleweed and alkali-heath were the most frequently occurring plant species on nesting islands. Other less common species included slenderleaf iceplant (Mesembryanthemum nodiflorum), brass buttons (Cotula coronopifolia), ripgut brome (Bromus diandrus), and saltgrass (Distichlis spicata). Vegetation was the dominant cover type in the center microhabitat grid cell (the cell where the nest bowl was located) in 30 percent of avocet nests compared to only 21 percent of paired random sites (χ 2 = 27.16, p < 0.0001, fig. 9a). Moreover, significantly more avocet nest sites were dominated by vegetation in cells north (χ 2 = 9.99, p = 0.002) and east (χ 2 = 4.50, p = 0.03) of the center cell that contained the nest bowl ( fig. 9a). Among terns, a significantly greater number of nest sites were dominated by vegetation within each of the nine microhabitat grid cells relative to paired sites (all χ 2 ≥ 15.20, p < 0.0001), with differences in the proportion of nest sites dominated by vegetation relative to paired sites ranging from 6 to 11 percent among the nine microhabitat grid cells ( fig. 9b). For example, vegetation was the dominant cover type in the center microhabitat grid cell (the cell where the nest bowl was located) in 57 percent of tern nests compared to only 47 percent of paired random sites. Furthermore, much like with avocet nests, the proportion of tern nest microhabitat grid cells dominated by vegetation was greatest in cells north, northeast, and east of the center microhabitat cell containing the nest bowl."}, {"section_title": "Factors Influencing Wintering Waterbird Abundance on Created Islands in Pond SF2", "text": "Methods"}, {"section_title": "Island-Scale Surveys", "text": "To evaluate the importance of island features to waterbirds wintering in the SBSP Restoration Project area, we conducted studies at several spatial scales. We focused on one managed pond (Pond SF2) in which 30 islands were created for nesting and roosting birds. We used instantaneous scan sampling (Altmann, 1973) of all birds present on the Ravenswood Pond SF2 weekly from October 1 through May 12 during 2010-2011 and 2011-2012, with 10×40 binoculars and a 60× spotting scope. We used an aerial photograph of the pond that was superimposed by 50×50 m UTM grids to spatially record birds in specific locations. We conducted a diurnal high tide and low tide count within one 24hour period for each weekly survey. High tide counts were conducted within 1.5 hours of the diurnal high tide (ranging from 5.1 to 10.3 ft at the nearest NOAA tide gauge station) and provided a count of the maximum number of birds using the pond while their low tide foraging and roosting sites were flooded. Low tide counts were conducted within 1.5 hours of the diurnal low tide (ranging from -1.8 to 3.6 ft) and provided the minimum number of birds using the pond (Dias and others, 2006). Counts were conducted in all environmental conditions except for high winds (>40 kilometers per hour) or heavy rain. Observers underwent extensive training and did not conduct surveys until their counts consistently matched those of a senior observer. Elevated viewing platforms provided a comprehensive view of the whole study area. We assigned birds to a 50×50 m grid cell and to one of six habitat types: man-made structure, open water, island, shallow water surrounding the island, levee, or exposed pond bottom. All birds were identified to species with the exception of long-billed dowitchers (Limnodromus scolopaceus) and short-billed dowitchers (L. griseus) and greater scaup (Aythya marila) and lesser scaup (A. affinis), because they were difficult to distinguish in the field.\nWe conducted 112 complete surveys during the two field seasons, and observed 67 bird species (table 11). Western sandpiper was the most abundant species, with 89,097 individuals. Bird abundance was lower in the winter than in autumn or spring. At high tide, we observed the highest abundance of birds using the islands in spring; whereas at low tide, we observed higher abundances of bird using islands during autumn and winter ( fig. 10). The majority (82 percent) of bird observations were on the pond surface compared with 14 percent on islands and 4 percent on levees. We observed most birds (81 percent) during high tide counts (n = 56), of which 31,016 (15 percent) birds were on islands, 8,924 (4 percent) birds were on levees, and 171,724 (81 percent) birds were in the water or on the pond bottom. Low tide counts were lower, with 6,094 (12 percent) birds on islands, 1,349 (3 percent) on levees, and 43,826 (88 percent) on pond bottom ( fig. 11). Overall bird densities varied by habitat type and by tide, but followed the same trend as abundance. Island bird density was the highest at 0.57 birds/m 2 during high tide and 0.11 birds/m 2 during low tide. Open water and pond bottom had the next highest density of birds, with 0.33 birds/m 2 during high tide and 0.08 birds/m 2 during low tide. Levees had the lowest density of birds with 0.19 birds/m 2 during high tide and 0.03 birds/m 2 during low tide. Island use was widespread but not evenly distributed among all 30 islands at Pond SF2 and was affected by both season and tide. Total abundance differed significantly among islands (H( 29 ) = 93.5, p < 0.001). There was a similar result when we evaluated high and low tide abundances separately (high tide H( 29 ) = 55.7, p = 0.01; low tide H( 29 ) = 68.6, p < 0.001). At high tide, total abundance for Island 24 was the highest and differed significantly from all other islands except Islands 14, 17, and 25 ( fig. 12). At low tide, no islands had abundances that were statistically different from one another. The relative abundance of some guilds varied across islands (table 12). At low tide, medium shorebirds, dabbling ducks, and gull and tern abundances were significantly different among islands. At high tide, differences among islands were observed with small and medium shorebirds, dabbling ducks, piscivores, and gulls and terns. At low tide, the presence of dabbling ducks (p = 0.01) was most commonly associated with smaller islands, whereas the presence of gulls (p = 0.03) was associated with larger islands (table 13). At high tide, island shape significantly improved the prediction of greater presence of small shorebirds on rounded islands (p = 0.01) and herons (p = 0.02) on linear islands. At low tide, island shape significantly improved the prediction of greater presence of piscivores (p = 0.048). The inclusion of island size significantly improved the prediction of dabbling ducks on smaller islands (p = 0.03). The presence of gulls was better predicted by a model including both size and shape, as gulls more often used linear (p = 0.01) and large (p = 0.01) islands. All random effects tested (mean slope of island, island perimeter, distance to mudflat or island area) did not improve the models' predictions of the abundance of any guilds."}, {"section_title": "Island-Scale Environmental Data", "text": "We conducted an elevation survey of all 30 islands using a Leica VIVA real time kinematic GPS) rover unit capable of collecting survey-grade elevation and x and y position data (UTM) from the Leica Smartnet system (accuracy: ±3 cm x, y, and z; Leica Geosystems Inc., Norcross, Georgia). The unit averaged ±2.5 cm vertical error at a reference benchmark (X 552 1956 Mare Island), which is within the stated error of the unit. All data were collected and reported in meters with horizontal datum UTM North American Datum of 1983 (NAD83) zone 10 and vertical datum North American Vertical Datum of 1988. For each island we created a DEM using Spatial Analyst (ArcGIS ® 9.3.1, ESRI, Redlands, California) at 1-m resolution. We used the Inverse-Distance Weighting method to interpolate the elevation point data within the boundary of each island outline. The island digital elevation models were used with Spatial Analyst tools to calculate the mean slope of each island. This tool determines the slope of each 1-m grid of the elevation model. We averaged all 1-m grid slopes to obtain a mean slope per island. The centerlines of pond levees were digitized using 2005 and 2009 National Agricultural Imagery Program (NAIP) imagery (1-m resolution, UTM NAD83 zone 10). The islands, mudflat edge, highway edge, and power line were digitized from a 2010 aerial image with 11-cm resolution. We calculated distance from the center point of each island to the mudflat edge."}, {"section_title": "Island-Scale Analysis", "text": "To examine temporal trends, we classified surveys into three seasons: autumn (October 1-December 21), winter (December 22-March 19), and spring (March 20-May 30) for each year. Habitats were grouped into three categories: levees, ponds (man-made structures, open water, exposed pond bottom) and islands (island and shallow water adjacent to the islands). Because we focused on nonbreeding birds, any nesting species observed on the pond were noted but not included in analyses. Species were assigned to foraging guilds for analysis, which included: • dabbling ducks-for example, northern shovelers (Anas clypeata) and American wigeons (A. americana); • diving ducks-for example, ruddy ducks (Oxyura jamaicensis); To determine if there were differences in total abundance by island, we used a Kruskal-Wallis non-parametric test followed by Tukey's post hoc tests for island pairwise comparisons. To examine whether relative use by guilds on islands varied, we conducted a multivariate analysis of variance (MANOVA) using relative abundances as the response variables. We used binary logistic regression to examine whether island shape and size had an effect on guild presence or absence. Finally, we used linear mixed models to explore how abundances of guilds varied in relation to island characteristics. We fit the model with island shape (roundedopposed to linear) as a fixed effect and used mean island slope, distance from center of island to edge of mudflat, area, and island perimeter as random effects. All statistical analyses were conducted with SPSS ® , v.20.0 (IBM Corporation, New York). Data are presented as means ±95-percent confidence intervals, unless otherwise noted."}, {"section_title": "Importance of Islands for Wintering Waterbirds Using Managed Ponds", "text": ""}, {"section_title": "Pond and Grid-Scale Waterbird Surveys", "text": "We conducted monthly waterbird surveys of ponds in the Alviso (n = 25), Eden Landing (n = 28), and Ravenswood (n = 10) complexes from October 2002 through April 2013. We surveyed during high tide when nearby mudflats were inundated and shorebird abundances within ponds were likely at their peak (Warnock and others, 2002). Species and abundance were mapped on 250×250 m (6.25-ha) UTM grids to document the spatial distribution of birds within ponds. We used existing landmarks to identify the spatial locations of birds. We counted all species with binoculars and spotting scopes from levee vantage points. We documented whether each bird was foraging or roosting based on behavior at the time of observation. Species were assigned to foraging guilds for analysis (table 15), which included: • dabbling ducks-for example, northern shovelers (Anas clypeata) and American wigeons (A. americana); • diving ducks-for example, ruddy ducks (Oxyura jamaicensis); • piscivores-for example, Forster's terns, double-crested cormorants (Phalacrocorax auritis), and American white pelicans (Pelecanus erythrorhynchos); • gulls-for example, ring-billed gulls (Larus delawarensis); • herons-for example, great egrets (Ardea alba); • medium shorebirds-for example, marbled godwits (Limosa fedoa), willets (Tringa semipalmata), and dowitchers (Limnodromus spp.); and • small shorebirds-for example, western sandpipers and dunlin (C. alpina). In addition we identified five species of interest (American avocet, black-necked stilt, eared grebe, Forster's tern, and western sandpiper), to evaluate individually. Individual species were also included in their respective guild for analysis."}, {"section_title": "Pond and Grid-Scale Environmental Data", "text": "We measured water salinity monthly in each pond using a Hydrolab ® Minisonde (Hydrolab-Hach Company, Loveland, Colorado). Measurements were taken in one to five sampling locations per pond and averaged across all locations per pond each month. When salinity exceeded the range of the minisonde, we measured specific gravity with a hydrometer (Ertco, West Paterson, New Jersey), scaled for the appropriate range and corrected for temperature. In 2003-04, we conducted bathymetric surveys of 35 ponds (Athearn and others, 2010). We used lidar data for 19 ponds for which we lacked bathymetric data (Athearn and others, 2010) and we used a combination of bathymetric and lidar data for two ponds. Bathymetric and lidar elevation data were interpolated using Inverse Distance Weighting in ArcMap 9.1 (Spatial Analyst, ArcGIS 9.1, ESRI, Redlands, California) into a DEM of 25-m resolution. A previous comparison of two ponds found a 0-2 cm difference between the lidar and bathymetric DEMs (Athearn and others, 2010). However, lidar data were not available for regions of the ponds that still contained water, such as borrow ditches or channels. We converted the DEM to a point shapefile, where each point represented an area of 625 m 2 . We overlaid the bird survey grid and assigned elevation points, where a bird survey grid of 62,500 m 2 (6.25 ha) would have 100 elevation points. For each month and survey grid, we used a combination of staff gage readings and bathymetric and lidar elevation surveys to calculate the depth of every elevation point per month. We selected depths of 10 cm or below to represent a dry pond surface because of the error associated with the elevation measurements. We determined the proportion of a grid cell that was dry and therefore available as roosting habitat. We digitized islands within ponds from 2009 NAIP (1-m resolution) aerial imagery and adjusted island outlines using ground-truthed RTK survey points. We defined an island as land that is exposed year-round and is completely surrounded by water. Areas of high elevation that expose when water levels decline were not considered islands in the analysis. Using ArcMap 10.1 (ESRI, Redlands, California) we overlaid pond grids with island outlines and calculated the number of islands that intersected each grid and the proportion of a grid composed of islands. We used the center point of each grid to calculate the distance from each grid to the nearest island within the pond and to the nearest pond levee. Our analysis included 22 ponds with islands and the number of islands per pond ranged from 1 to 22 (table 14). We considered Units 1 and 2 of Pond SF2 as two separate ponds."}, {"section_title": "Pond and Grid-Scale Analysis", "text": "We modeled bird abundance using generalized linear mixed models (GLMM) with a negative binomial distribution. We selected this model type because it had a lower mean square error compared to models based on an over-dispersed Poisson distribution. Our bird abundance data have a large number of zero observations, which the negative binomial distribution is often effective at modeling (Warton, 2005). We separately modeled foraging and roosting abundance of seven guilds and five species of interest: dabbling ducks, diving ducks, gulls, herons, medium shorebirds, piscivores, small shorebirds, American avocets, black-necked stilts, eared grebes, Forster's terns, and western sandpipers. In the first stage of our analysis, we examined the island variables potentially influencing the abundance of birds at the pond scale. We developed a base model with variables known or likely to affect the abundance of birds within ponds, including water depth and salinity, pond distance to the bay and urban areas, time of year (month), pond area, and variation in pond topography (elevation standard deviation). Shorebird use of ponds is restricted by water depth (Dias, 2009), whereas dabbling and diving ducks have preferred foraging depths (Takekawa and others, 2009). Water salinity limits benthic macroinvertebrate (Herbst, 2006;Takekawa and others, 2009) and fish (Marshall and Elliott, 1998) community composition, thereby altering the potential prey resources for birds. High tide roost sites for shorebirds are limited to areas close to their low tide foraging grounds (Warnock and Takekawa, 1996;Dias and others, 2006). Inclusion of these variables in the base model allowed us to focus our analysis on the effect of island variables on bird abundance. In order to determine the effects of island attributes on abundance, we developed a candidate set of models in which the base model was allowed to improve by one or more additional predictor variables, including the presence or absence of islands within the pond, the number of islands within the pond, the total island area within the pond, and the ratio between island area and pond area. We included the number of islands in every model containing island area or area ratio to aid in interpretation of area-related results. Our analysis included 22 ponds with islands and 37 ponds without islands. Ponds A13 and Units 1 and 2 of Pond SF2 were used as pond without islands for data collected prior to island construction. We excluded breached Ponds A6, A19, A20 and A21, and excluded data from Ponds A16, A17, E8AE, E8AW, E8X, and E9 after breaching occurred. We also excluded data from periods of major construction on particular ponds. In the second stage of our analysis, we examined the island variables potentially influencing the abundance of birds at the grid scale. We restricted our analysis to ponds with islands. We developed a base model with variables known or likely to affect the abundance of birds within grids, including water depth and salinity, grid distance to the pond levee, whether the grid is located in the pond interior or perimeter, time of year (month), grid area, percent of the grid with exposed pond bottom, and variation in grid topography. Inclusion of these variables in the base model allowed us to focus our analysis on the effect of island variables on bird abundance within ponds that have islands. Our island variables included the distance between the grid and the nearest island, total island area within the grid, the ratio between island area and grid area, number of islands intersecting the grid, and the presence or absence of islands within the grid. Our base GLMM assumes bird abundance has a log-linear relationship with the base variables and that bird abundance varied categorically by month. We included random effects for pond, grid (grid-scale analysis), and year to account for potential sources of additional dispersion. We fit all models using the glmmADMB package in R statistical software (Fournier and others, 2012;Skaug and others, 2012;R Core Team, 2014;). Because of long processing times (up to 15 minutes per model), we used a simple Linux utility for resource management (SLURM) to process the 52 sets of models in parallel (USGS Core Science Analytics and Synthesis Resource Center in Denver, Colorado). Our candidate model set targeted specific hypotheses about the effects of islands. As a reference for comparison, we included in our model set the base GLMM (as previously defined) without any island-related predictors added to it. To avoid collinear predictors, we did not allow models with any combination of two or more of the variables: island presence indicator, number of islands, and distance to island. Because island area and area ratio are meaningful only when islands are present, and because number of islands is more informative than island presence, we explored complex models involving island area and area ratio only when number of islands also was in the model. We included models containing interaction effects between island variables and month, in order to analyze whether island effects varied by month. We also included models containing interaction effects between number of islands and other island variables. We assembled all combinations of models satisfying the rules of our model set. Each of the pond-scale model sets contained 23 models and each of the grid-scale model sets contained 25 models. We calculated Akaike's Information Criterion (AIC) using a customized package (ModelInference package in R; M.P. Herzog, unpub. data) based on the information-theoretic model selection paradigm (Burnham and Anderson, 2002). We identified the top model as the highest ranked model (lowest AIC) that was more than 2 AIC units less than the base model to calculate the effects of significant variables and their interactions. We evaluated the 95-percent confidence interval of each parameter estimate in the top-ranked model of each species and guild. For those estimates with confidence intervals that overlapped zero, we used type II ANOVA chi-square tests to determine the statistical significance of the variable (Guthery and Brennan 2005; ANOVA function in R package \"car\"; Fox and Weisberg, 2011). For statistically significant island effects interacting with month, we report the direction and magnitude of effect of that island variable for each month. For statistically significant effects not interacting with month, we report the direction and magnitude of that overall island effect."}, {"section_title": "Pond and Grid-Scale", "text": "We conducted 4,056 pond surveys during 10 field seasons between 2002 and 2013 and observed 88 species of waterbirds, of which 20 were incidentals with fewer than 10 observations (table 15). We surveyed as many as 56 ponds per year; however, in any 1 year only a subset of these ponds had a complete set of associated environmental data. Thus, the average number of ponds included in the dataset each year was 38. Western sandpiper was the most abundant species, followed by dunlin; their mean monthly abundances (mean ±SE) peaked in April at 62,516±5,934 and 26,973±3,304 birds, respectively. Ruddy duck was the third most abundant species and the most abundant diving duck. The mean monthly abundance of ruddy duck peaked in January at 26,125±2,061 birds. Northern shoveler was the fourth most abundant species and the most abundant dabbling duck. Their mean monthly abundance peaked in October with 15,944±2,712 birds. We modeled foraging and roosting abundance of seven guilds and five species of interest, for a total of 52 separate analyses (appendix 1)."}, {"section_title": "Pond Scale-Foraging", "text": "For American avocets, the most parsimonious model explaining the foraging abundance contained number of islands and had an w i of 0.36 (table 16). The evidence ratio indicated that the top model was 1.96 times more likely to explain abundance than the next best model (table A1).The parameter estimate was positive and did not overlap zero; ponds with an increasing number of islands supported more foraging American avocets (table 17). For black-necked stilts, we determined that the most parsimonious model explaining foraging abundance was the base model (w i =0.23), suggesting that island parameters had little influence on foraging black-necked stilts (table A2). The most parsimonious model explaining the foraging abundance of diving ducks (w i =0.17), eared grebes (w i =1.00), small (w i =1.00) and medium shorebirds (w i = 0.68), and western sandpipers (w i = 0.76) contained the variable for presence or absence of islands and the interaction of this variable with month (table 16). For diving ducks, the evidence ratio indicated that the top model was 1.31 times more likely to explain the abundance than the next best model (table A3). For eared grebes and small shorebirds, there were no models within 7 ∆AIC of the top model (tables A4 and A5). Medium shorebirds and western sandpipers had evidence ratios that indicated their top models were more than five times more likely to explain abundance than the next best model (tables A6 and A7). For diving ducks, all parameter estimates had 95-percent confidence intervals that overlapped zero and were not significant (p > 0.20); thus, we did not find support for island presence or absence affecting the abundance of diving ducks. For small and medium shorebirds and western sandpipers, increasing bird abundances were associated with the presence of islands within a pond across all months (table 17). The same was true for eared grebes, except in February and April when an increasing abundance was associated with the absence of islands within a pond (table 17). Similarly, the most parsimonious model explaining the foraging abundance of dabbling ducks (w i =0.25) included the variable for presence or absence of islands, but did not have an effect by month (table 16). The evidence ratio indicated that the top model was 1.26 times more likely to explain abundance than the next best model (table A8). The model suggested a higher abundance of foraging dabbling ducks in ponds that contained islands (table 17). The most parsimonious models explaining the abundance of foraging gulls (w i =0.61) and piscivores (w i =0.28) contained number of islands, island area, and the interaction of island area with month (table 16). The evidence ratios suggested that for gulls and piscivores the top models were 1.82 and 1.88 times, respectively, more likely to explain abundance than the next best models (tables A9 and A10). The 95 percent confidence intervals of all parameter estimates overlapped zero, and number of islands was insignificant based on Chi-square tests for both gulls (χ²= 0.65, p = 0.42) and piscivores (χ²= 0.94, p = 0.33). The interaction term was significant in gulls (χ²= 26.03, p = < 0.001) and piscivores (χ²= 23.87, p < 0.001). Parameter estimates for gulls indicate higher abundances were associated with an increasing island area in every month (table 18). In contrast, higher piscivore abundance was associated with a decreasing island area in December and February (table 17). Piscivores were most strongly associated with increasing island area in early (October and November) and late (March and April) winter; however, parameter estimates suggest this guild was more abundant in ponds with lower island area during mid-winter months (December-February). For Forster's terns, the most parsimonious model explaining the foraging abundance contained number of islands, island area, the interaction of island number and area with each other, by month, and as a three-way interaction with month (w i =0.85; table 16). The evidence ratio suggested that the top model was 7.54 times more likely to explain the abundance than the next best model (table A11). Although, the 95-percent confidence interval of each parameter estimate overlapped zero, the three-way interaction estimate was significant (χ²= 69.64, p < 0.001). The abundance of foraging Forster's terns in relation to number of islands and island area, was highly variable by month (table 17). The most parsimonious model explaining the abundance of foraging herons (w i =0.39) contained number of islands and island-area to pond-area ratio (table 16). The evidence ratio indicated that the top model was 1.96 times more likely to explain the abundance than the next best model (table A12). However, the 95-percent confidence intervals for parameter estimates overlapped zero and both variables were insignificant (χ²= 1.79 and 3.21, p = 0.18 and 0.07, respectively). Therefore, we found little support for an island influence on the abundance of foraging herons."}, {"section_title": "Pond Scale-Roosting", "text": "For American avocets, the most parsimonious model explaining roosting abundance contained number of islands, island-area to pond-area ratio, and the interaction of area ratio with month (w i =0.28; table 16). The evidence ratio suggested that the top model was 1.49 times more likely to explain the abundance than the next best model (table A1). However, the 95-percent confidence interval for parameter estimates overlapped zero and no variables were significant (χ²= 1.87, 0.88, and 1.85, p = 0.17, 0.35, and 0.93, respectively). Therefore, we did not find strong support for island variables influencing the abundance of roosting American avocets in ponds. Similarly, the null model for blacknecked stilts (w i =0.23) was within two ΔAIC of the top model (table A2); therefore, we did not find support for island parameters influencing the abundance of roosting black-necked stilts in ponds. The most parsimonious model explaining the roosting abundance of dabbling ducks (w i =0.25), herons (w i =0.58), and medium shorebirds (w i =0.69) contained number of islands, island-area to pondarea ratio, and the interaction of island number with area ratio (table 16). The evidence ratios for dabbling ducks indicated that the top model was 1.49 times more likely to explain the abundance than the next best model (table A8). The evidence ratios for herons and medium shorebirds indicated that the top model was greater than three times more likely to explain the abundance than the next best model (tables A6 and A12). All three of these guilds had negative parameter estimates for the interaction between number of islands and area ratio (table 18), suggesting a tendency to roost in ponds with fewer large islands compared to ponds with more small islands. Similarly, the most parsimonious model explaining the roosting abundance of Forster's terns (w i =0.34) and gulls (w i =0.87) included number of islands, island-area to pond-area ratio, and the interaction of island number with area ratio with the addition of an interaction between island number and month (table 16). The evidence ratio for Forster's terns suggested that the top model was 1.43 times more likely to explain the abundance than the next best model (table A11). The evidence ratio for gulls suggested that the top model was 8.88 times more likely to explain the abundance than the next best model (table A9). For Forster's terns, October and February through March supported an increasing abundance of birds with increasing number of islands (tables 19-20). However, November through January supported an increasing abundance of birds with decreasing number of islands (table 18). For gulls, number of islands and the interaction number of islands by month were not significant (χ² = 0.51 and 7.53, p = 0.47 and 0.27, respectively). For terns and gulls, the interactions between number of islands and area ratio were weakly negative and both suggested a slight tendency to roost in areas of fewer larger islands (table 18). The best ranking model for rafting abundance of diving ducks (w i =0.98) and roosting abundance of western sandpipers (w i =0.90) contained the variable for presence or absence of islands and the interaction of this variable with month (table 16). For diving ducks, no other model was within 7 ∆AIC of the top model (table A3). For western sandpipers, the evidence ratio suggested that the top model for was 19.78 times more likely to explain the abundance than the next best model (table A7). For small shorebirds, the most parsimonious model explaining the roosting abundance contained the variable for presence or absence of islands without a month interaction term (w i =0.77; table 16). The evidence ratio suggested that the top model was 13.54 times more likely to explain the abundance than the next best model (table A5). For diving ducks, western sandpipers, and small shorebirds, a higher roosting or rafting abundance was associated with the presence of islands in ponds (table 18). We found little support for island variables influencing the abundance of roosting piscivores or eared grebes in ponds. Although the top model explaining roosting piscivore abundance (w i =0.19) included number of islands and island-area to pond-area ratio (table 16), the 95-percent confidence intervals overlapped zero and the variables were not significant (χ²= 1.44 and 2.31, p = 0.23 and 0.13, respectively). For eared grebes, the most parsimonious model explaining the roosting abundance was the base model (w i =0.20; tables 16 and A4)."}, {"section_title": "Grid Scale-Foraging", "text": "At the grid scale, we determined the most parsimonious model explaining the foraging abundance of diving ducks (w i =1.00), gulls (w i =0.99), and medium shorebirds (w i =0.39) contained grid distance to island and the interaction of distance by month (table 21). For diving ducks and gulls, no models were within 7 ∆AIC of the top model (tables A13 and A14). Higher abundance was associated with grids closer to islands for all months except October for diving ducks and February for gulls (table  22). For medium shorebirds, the evidence ratio indicated the top model was 1.30 times likely to explain abundance than the next best model (table A15). The 95 percent confidence interval of the interaction parameter estimate overlapped zero and was not significant (χ²= 9.06, p = 0.17); however, a higher abundance of foraging medium shorebirds was associated with grids closer to islands (table 22, fig. 13). Similarly, the most parsimonious model explaining the abundance of American avocets contained grid distance to island without the interaction term (w i =0.65; table 21, fig. 13). The evidence ratio indicated that the top model was 3.09 times more likely to explain abundance than the next best model (table A16). A higher abundance of foraging avocets was associated with grids closer to islands (table 22, fig.  13). For black-necked stilts (w i =0.31) and piscivores (w i =0.23), the most parsimonious model explaining the foraging abundance contained number of islands and island-area to grid-area ratio, as well as the interaction of island number with ratio for stilts and the interaction of island number with month for piscivores (table 21). The evidence ratios indicated that the top models were 1.14 and 1.11 times more likely to explain the abundance of stilts and piscivores, respectively, than the next best models (tables A17 and A18). For black-necked stilts, the 95 percent confidence interval of island-area to grid-area ratio parameter estimate overlapped zero but the variable was significant (χ²= 3.64, p = 0.06). For piscivores, the 95 percent confidence interval of the parameter estimate for the interaction of number of islands with month overlapped zero but the variable was significant (χ²= 34.27, p < 0.001). During all months except October and April, an increasing abundance of piscivores was associated with a decreasing number of islands per grid (table 22). However, an increasing abundance of piscivores was associated with an increasing island-area to grid-area ratio (table 22). The most parsimonious model explaining the foraging abundance of dabbling ducks (w i =0.72) and herons (w i =0.39) contained presence or absence of islands and the interaction of this variable with month (table 21). For dabbling ducks, the evidence ratio indicated that the top model was 6.05 times more likely to explain the abundance than the next best model (table A19). Increased dabbling duck abundance was associated with the presence of islands in grids during all months except March and April (table 22). For herons, the evidence ratio indicated that the top model was 3.65 times more likely to explain the abundance than the next best model (table A22). Increased heron abundance was associated with the presence of islands in grids during all months except February (table 22). For eared grebes, the most parsimonious model explaining the foraging abundance number of islands and island area (w i =0.34; Table 21). The evidence ratio indicated that the top model was 2.68 times likely to explain abundance than the next best model (table A21). The 95-percent confidence interval for number of islands overlapped zero and the variable was not significant (χ²= 2.61, p = 0.10). A decreasing island area supported an increasing abundance of foraging eared grebes (table 22). However, the null model was the third highest ranked and within three ΔAIC of the top model. Therefore, we have weak support for island parameters influencing the foraging abundance of eared grebes at the grid scale. For Forster's terns, the most parsimonious model explaining the foraging abundance contained number of islands, island area, and the interactions of island number with area and island number with month (w i =0.34; Table 21). The evidence ratio indicated that the top model was 2.36 times more likely to explain abundance than the next best model (table A22). The 95-percent confidence intervals for number of islands and the interaction of that variable with month overlapped zero but were significant (χ²= 199.72 and 55.17, respectively, p < 0.001 for both). For all months except October, an increasing abundance was associated with a decreasing number of islands per grid (table 22). The most parsimonious model explaining the foraging abundance of small shorebirds contained number of islands, island area, and the interaction of island number and area with each other and with month (w i =0.38; Table 21). The evidence ratio indicated that the top model was 2.59 times more likely to explain abundance than the next best model (table A23). The most parsimonious model explaining the roosting abundance of western sandpipers included the same variables as well as a three-way interaction between island number, area, and month (w i =0.70; Table 17). The evidence ratio indicated that the top model was 5.53 times more likely to explain abundance than the next best model (table  A24). For small shorebirds, only the interaction of number of islands with month and number of islands with island area were significant (χ²= 17.58 and 6.90, p = 0.01 and 0.01, respectively). December, February, and March supported a higher abundance of small shorebirds in grids with a decreasing number of islands, compared to October, November, January, and April, which supported a higher abundance in grids with an increasing number of islands (table 22). For western sandpipers, number of islands (χ²= 87.07, p < 0.001), island area (χ²= 32.10, p < 0.001), and the interactions of month with number of islands (χ²= 392.60, p < 0.001) and month with island area (χ²= 567.09, p < 0.001) were significant. Across all months except February and March grids with an increasing number of islands supported an increasing abundance (table 22). Across all months there was strong support for increasing island area per grid supporting an increasing abundance of western sandpipers (table 22)."}, {"section_title": "Grid Scale-Roosting", "text": "The most parsimonious model explaining the roosting abundance of American avocets (w i =0.55), piscivores (w i =0.65), herons (w i =0.53), and medium shorebirds (w i =0.93) contained the variable for presence or absence of islands (table 21). For American avocets and herons, the evidence ratio indicated that the top model was 1.3-1.5 times more likely to explain the abundance than the next best model (tables A16 and A20). For piscivores and medium shorebirds, the evidence ratio indicated that the top model was 5.05 and 20.31 times more likely to explain the abundance, respectively, than the next best model (tables A18 and A15). An increasing abundance of birds was associated with the presence of islands in grids (table 23). Similarly, the most parsimonious model explaining the roosting abundance of black-necked stilts (w i =0.63), dabbling ducks (w i =0.98), Forster's terns (w i =0.42), small shorebirds (w i =0.29), and western sandpipers (w i =0.51) contained the variable for presence or absence of islands, as well as the interaction of this variable with month (table 21). For stilts, terns, and western sandpipers, the evidence ratio indicated that the top model was 1.77-3.54 times more likely to explain abundance, respectively, than the next best model (tables A17, A22, and A24). No other model was within 7 ΔAIC of the top model for dabbling ducks (table A19). For small shorebirds, the evidence ratio of 1.01 suggested that the next best model (w i =0.29), including number of islands, island-area-to-pond-area ratio, and interactions, might also explain the abundance (table A23). For Forster's terns, the 95-percent confidence intervals of parameter estimates overlapped zero and therefore we did not find support for island variables affecting abundance at the grid scale. An increasing abundance was supported by the absence of islands for blacknecked stilts in February, for dabbling ducks in April, and for western sandpipers in October, November, and February (table 23). For small shorebirds, an increasing abundance was supported by the presence of islands across all months (table 23). The most parsimonious model explaining the roosting abundance of eared grebes (w i =0.68) and gulls (w i =0.99) contained grid distance to island and the interaction of distance with month (table 21). For eared grebes, the evidence ratio indicated that the top model was 3.95 times more likely to explain abundance than the next best model (table A21). No other model was within seven ΔAIC of the top model for gulls (table A14). For eared grebes, the 95-percent confidence intervals of parameter estimates overlapped zero and the variables were not significant (χ²= 0.97 and 8.51, p = 0.33 and 0.20, respectively); therefore, we did not have support for island variables influencing the abundance of eared grebes. For gulls, an increasing abundance was supported by a decreasing distance to island (table 23). In contrast to all other species, the most parsimonious model explaining the rafting abundance of diving ducks contained number of islands, island area, the interaction of island number and area with each other and with month, and a three-way interaction between number, area, and month (w i =0.68; table 21). The 95-percent confidence intervals for all parameter estimates overlapped zero. Number of islands (χ²= 4.02, p = 0.045), the interaction of island number with month (χ²= 3670.72, p < 0.001), and the interaction of island area with month (χ²= 16932.52, p < 0.001) were significant whereas island area (χ²= 1.96, p = 0.16), the interaction between island number and area (χ²= 0.00, p = 0.97), and a threeway interaction between number, area, and month (χ²= 4.11, p = 0.66) were not significant. The influence of island variables on abundance varied by month (table 23). In most months, fewer large islands were associated with an increasing abundance of rafting diving ducks (table 23)."}, {"section_title": "Species or Guild Presence of islands a", "text": ""}, {"section_title": "Number of islands", "text": "\n[Models are ranked by differences in Akaike's information criterion and only models of ∆AIC less than 7 and the base model are presented]  ), island area, island-area-to-pond-area ratio (AreaRatio), and interactions between these variables and between these variables and month.  a Birds were surveyed across the former salt ponds during October through April of 2002-13. Variables considered included the presence or absence of islands (HasIsland), the number of islands (#Island), island area, island-area-to-pond-area ratio (AreaRatio), and interactions between these variables and between these variables and month.  Birds were surveyed across the former salt ponds during October through April of 2002-13. Variables considered included the presence or absence of islands (HasIsland), the number of islands (#Island), island area, island-area-to-pond-area ratio (AreaRatio), and interactions between these variables and between these variables and month. b Number of estimated parameters in the model. c Second-order Akaike's information criterion. d The difference between the AIC c of the current model and the AIC c of the top model. e Akaike weight -likelihood of the model relative to candidate models. f The weight of evidence that the current model is inferior to the top model. Table A4. The ranking of candidate models at the pond scale for foraging and roosting eared grebes a in the former salt production ponds of South San Francisco Bay, California. Models are ranked by differences in Akaike's information criterion and only models of ∆AIC less than 7 and the base model are presented. a Birds were surveyed across the former salt ponds during October through April of 2002-13. Variables considered included the presence or absence of islands (HasIsland), the number of islands (#Island), island area, island-area-to-pond-area ratio (AreaRatio), and interactions between these variables and between these variables and month. b Number of estimated parameters in the model. c Second-order Akaike's information criterion. d The difference between the AIC c of the current model and the AIC c of the top model. e Akaike weight -likelihood of the model relative to candidate models. f The weight of evidence that the current model is inferior to the top model. Table A5. The ranking of candidate models at the pond scale for foraging and roosting small shorebirds a in the former salt production ponds of South San Francisco Bay, California. Models are ranked by differences in Akaike's information criterion and only models of ∆AIC less than 7 and the base model are presented. included the presence or absence of islands (HasIsland), the number of islands (#Island), island area, island-area-to-pondarea ratio (AreaRatio), and interactions between these variables and between these variables and month. b Number of estimated parameters in the model. c Second-order Akaike's information criterion. d The difference between the AIC c of the current model and the AIC c of the top model. e Akaike weight -likelihood of the model relative to candidate models. f The weight of evidence that the current model is inferior to the top model. Table A6. The ranking of candidate models at the pond scale for foraging and roosting medium shorebirds a in the former salt production ponds of South San Francisco Bay, California. Models are ranked by differences in Akaike's information criterion and only models of ∆AIC less than 7 and the base model are presented. Birds were surveyed across the former salt ponds during October through April of 2002-13. Variables considered included the presence or absence of islands (HasIsland), the number of islands (#Island), island area, island-area-to-pond-area ratio (AreaRatio), and interactions between these variables and between these variables and month. b Number of estimated parameters in the model. c Second-order Akaike's information criterion. d The difference between the AIC c of the current model and the AIC c of the top model. e Akaike weight -likelihood of the model relative to candidate models. f The weight of evidence that the current model is inferior to the top model. Table A7. The ranking of candidate models at the pond scale for foraging and roosting Western sandpipers a in the former salt production ponds of South San Francisco Bay,California. Models are ranked by differences in Akaike's information criterion and only models of ∆AIC less than 7 and the base model are presented.  (HasIsland), the number of islands (#Island), island area, island-area-to-pond-area ratio (AreaRatio), and interactions between these variables and between these variables and month. b Number of estimated parameters in the model. c Second-order Akaike's information criterion. d The difference between the AIC c of the current model and the AIC c of the top model. e Akaike weight -likelihood of the model relative to candidate models. f The weight of evidence that the current model is inferior to the top model. Table A9. The ranking of candidate models at the pond scale for foraging and roosting gullsa in the former salt production ponds of South San Francisco Bay, California. Models are ranked by differences in Akaike's information criterion and only models of ∆AIC less than 7 and the base model are presented. 1.2E+12 a Birds were surveyed across the former salt ponds during October through April of 2002-13. Variables considered included the presence or absence of islands (HasIsland), the number of islands (#Island), island area, island-area-to-pond-area ratio (AreaRatio), and interactions between these variables and between these variables and month. b Number of estimated parameters in the model. c Second-order Akaike's information criterion. d The difference between the AIC c of the current model and the AIC c of the top model. e Akaike weight -likelihood of the model relative to candidate models. f The weight of evidence that the current model is inferior to the top model. Table A10. The ranking of candidate models at the pond scale for foraging and roosting piscivores a in the former salt production ponds of South San Francisco Bay, California. Models are ranked by differences in Akaike's information criterion and only models of ∆AIC less than 7 and the base model are presented. Birds were surveyed across the former salt ponds during October through April of 2002-13. Variables considered included the presence or absence of islands (HasIsland), the number of islands (#Island), island area, island-area-to-pond-area ratio (AreaRatio), and interactions between these variables and between these variables and month.   Birds were surveyed across the former salt ponds during October through April of 2002-13. Variables considered included the presence or absence of islands (HasIsland), the number of islands (#Island), island area, island-area-to-pond-area ratio (AreaRatio), and interactions between these variables and between these variables and month. b Number of estimated parameters in the model. c Second-order Akaike's information criterion. d The difference between the AIC c of the current model and the AIC c of the top model. e Akaike weight -likelihood of the model relative to candidate models. f The weight of evidence that the current model is inferior to the top model. Table A12. The ranking of candidate models at the pond scale for foraging and roosting herons a in the former salt production ponds of South San Francisco Bay, California. Models are ranked by differences in Akaike's information criterion and only models of ∆AIC less than 7 and the base model are presented. 67E+08 a Birds were surveyed across the former salt ponds during October through April of 2002-13. Variables considered included the presence or absence of islands (HasIsland), the number of islands (#Island), island area, island-area-to-pond-area ratio (AreaRatio), and interactions between these variables and between these variables and month. b Number of estimated parameters in the model. c Second-order Akaike's information criterion. d The difference between the AIC c of the current model and the AIC c of the top model. e Akaike weight -likelihood of the model relative to candidate models. f The weight of evidence that the current model is inferior to the top model. Table A13. The ranking of candidate models at the grid scale for foraging and roosting diving ducks a in the former salt production ponds of South San Francisco Bay, California. Models are ranked by differences in Akaike's information criterion and only models of ∆AIC less than 7 and the base model are presented. 0.00 5040618 a Birds were surveyed across the former salt ponds during October through April of 2002-13. Variables considered included the presence or absence of islands (HasIsland), the number of islands (#Island), island area, island-area-to-pond-area ratio (AreaRatio), and interactions between these variables and between these variables and month. b Number of estimated parameters in the model. c Second-order Akaike's information criterion. d The difference between the AIC c of the current model and the AIC c of the top model. e Akaike weight -likelihood of the model relative to candidate models. f The weight of evidence that the current model is inferior to the top model. Table A14. The ranking of candidate models at the grid scale for foraging and roosting gulls a in the former salt production ponds of South San Francisco Bay, California. Models are ranked by differences in Akaike's information criterion and only models of ∆AIC less than 7 and the base model are presented. 16213.25 20.20 0.00 24290.73 a Birds were surveyed across the former salt ponds during October through April of 2002 -2013. Variables considered included the presence or absence of islands (HasIsland), the number of islands (#Island), island area, island-area-to-pondarea ratio (AreaRatio), and interactions between these variables and between these variables and month. b Number of estimated parameters in the model. c Second-order Akaike's information criterion. d The difference between the AIC c of the current model and the AIC c of the top model. e Akaike weight -likelihood of the model relative to candidate models. f The weight of evidence that the current model is inferior to the top model. Table A15. The ranking of candidate models at the grid scale for foraging and roosting medium shorebirds a in the former salt production ponds of South San Francisco Bay, California. Models are ranked by differences in Akaike's information criterion and only models of ∆AIC less than 7 and the base model are presented. 0.00 1784775 a Birds were surveyed across the former salt ponds during October through April of 2002-13. Variables considered included the presence or absence of islands (HasIsland), the number of islands (#Island), island area, island-area-to-pond-area ratio (AreaRatio), and interactions between these variables and between these variables and month. b Number of estimated parameters in the model. c Second-order Akaike's information criterion. d The difference between the AIC c of the current model and the AIC c of the top model. e Akaike weight -likelihood of the model relative to candidate models. f The weight of evidence that the current model is inferior to the top model. Table A17. The ranking of candidate models at the grid scale for foraging and roosting black-necked stilts a in the former salt production ponds of South San Francisco Bay, California. Models are ranked by differences in Akaike's information criterion and only models of ∆AIC less than 7 and the base model are presented. 118.85 a Birds were surveyed across the former salt ponds during October through April of 2002-13. Variables considered included the presence or absence of islands (HasIsland), the number of islands (#Island), island area, island-area-to-pond-area ratio (AreaRatio), distance from the grid to the nearest island (IslandDist), and interactions between these variables and between these variables and month. b Number of estimated parameters in the model. c Second-order Akaike's information criterion. d The difference between the AIC c of the current model and the AIC c of the top model. e Akaike weight -likelihood of the model relative to candidate models. f The weight of evidence that the current model is inferior to the top model. Table A18. The ranking of candidate models at the grid scale for foraging and roosting piscivores a in the former salt production ponds of South San Francisco Bay, California. Models are ranked by differences in Akaike's information criterion and only models of ∆AIC less than 7 and the base model are presented. 11.61 0.00 331.89 a Birds were surveyed across the former salt ponds during October through April of 2002-13. Variables considered included the presence or absence of islands (HasIsland), the number of islands (#Island), island area, island-area-to-pond-area ratio (AreaRatio), distance from the grid to the nearest island (IslandDist), and interactions between these variables and between these variables and month. b Number of estimated parameters in the model. c Second-order Akaike's information criterion. d The difference between the AIC c of the current model and the AIC c of the top model. e Akaike weight -likelihood of the model relative to candidate models. f The weight of evidence that the current model is inferior to the top model. Table A19. The ranking of candidate models at the grid scale for foraging and roosting dabbling ducks a in the former salt production ponds of South San Francisco Bay, California. Models are ranked by differences in Akaike's information criterion and only models of ∆AIC less than 7 and the base model are presented. 12 0.00 5710687.86 a Birds were surveyed across the former salt ponds during October through April of 2002-13. Variables considered included the presence or absence of islands (HasIsland), the number of islands (#Island), island area, island-area-to-pond-area ratio (AreaRatio), distance from the grid to the nearest island (IslandDist), and interactions between these variables and between these variables and month. b Number of estimated parameters in the model. c Second-order Akaike's information criterion. d The difference between the AIC c of the current model and the AIC c of the top model. e Akaike weight -likelihood of the model relative to candidate models. f The weight of evidence that the current model is inferior to the top model. Table A20. The ranking of candidate models at the grid scale for foraging and roosting herons and egrets a in the former salt production ponds of South San Francisco Bay, California. Models are ranked by differences in Akaike's information criterion and only models of ∆AIC less than 7 and the base model are presented. Birds were surveyed across the former salt ponds during October through April of 2002-13. Variables considered included the presence or absence of islands (HasIsland), the number of islands (#Island), island area, island-area-to-pond-area ratio (AreaRatio), distance from the grid to the nearest island (IslandDist), and interactions between these variables and between these variables and month. b Number of estimated parameters in the model. c Second-order Akaike's information criterion. d The difference between the AIC c of the current model and the AIC c of the top model. e Akaike weight -likelihood of the model relative to candidate models. f The weight of evidence that the current model is inferior to the top model. Table A21. The ranking of candidate models at the grid scale for foraging and roosting eared grebes a in the former salt production ponds of South San Francisco Bay, California. Models are ranked by differences in Akaike's information criterion and only models of ∆AIC less than 7 and the base model are presented. 28.59 a Birds were surveyed across the former salt ponds during October through April of 2002-13. Variables considered included the presence or absence of islands (HasIsland), the number of islands (#Island), island area, island-area-to-pond-area ratio (AreaRatio), distance from the grid to the nearest island (IslandDist), and interactions between these variables and between these variables and month. b Number of estimated parameters in the model. c Second-order Akaike's information criterion. d The difference between the AIC c of the current model and the AIC c of the top model. e Akaike weight -likelihood of the model relative to candidate models. f The weight of evidence that the current model is inferior to the top model. Table A22. The ranking of candidate models at the grid scale for foraging and roosting Forster's terns a in the former salt production ponds of South San Francisco Bay, California. Models are ranked by differences in Akaike's information criterion and only models of ∆AIC less than 7 and the base model are presented. 1447.87 a Birds were surveyed across the former salt ponds during October through April of 2002-13. Variables considered included the presence or absence of islands (HasIsland), the number of islands (#Island), island area, island-area-to-pond-area ratio (AreaRatio), distance from the grid to the nearest island (IslandDist), and interactions between these variables and between these variables and month. b Number of estimated parameters in the model. c Second-order Akaike's information criterion. d The difference between the AIC c of the current model and the AIC c of the top model. e Akaike weight -likelihood of the model relative to candidate models. f The weight of evidence that the current model is inferior to the top model. Table A23. The ranking of candidate models at the grid scale for foraging and roosting small shorebirds a in the former salt production ponds of South San Francisco Bay, California. Models are ranked by differences in Akaike's information criterion and only models of ∆AIC less than 7 and the base model are presented. a Birds were surveyed across the former salt ponds during October through April of 2002-13. Variables considered included the presence or absence of islands (HasIsland), the number of islands (#Island), island area, island-area-to-pond-area ratio (AreaRatio), distance from the grid to the nearest island (IslandDist), and interactions between these variables and between these variables and month.  Table A24. The ranking of candidate models at the grid scale for foraging and roosting Western sandpipers a in the former salt production ponds of South San Francisco Bay, California. Models are ranked by differences in Akaike's information criterion and only models of ∆AIC less than 7 and the base model are presented. 11559.25 20.48 0.00 27941 a Birds were surveyed across the former salt ponds during October through April of 2002-13. Variables considered included the presence or absence of islands (HasIsland), the number of islands (#Island), island area, island-area-to-pond-area ratio (AreaRatio), distance from the grid to the nearest island (IslandDist), and interactions between these variables and between these variables and month. b Number of estimated parameters in the model. c Second-order Akaike's information criterion. d The difference between the AIC c of the current model and the AIC c of the top model. e Akaike weight -likelihood of the model relative to candidate models. f The weight of evidence that the current model is inferior to the top model."}, {"section_title": "Island area", "text": "Island-area to pond-area ratio  included the presence or absence of islands (HasIsland), the number of islands (#Island), island area, island-area-to-pondarea ratio, distance from the grid to the nearest island (IslandDist), and interactions between these variables and between these variable and month. b Number of estimated parameters in the model. c Second-order Akaike's information criterion. d Weight of the model relative to candidate models. Full candidate model sets are reported in appendix 1.   Table 24. The influence of island variables on the foraging abundance of birds in grids.   Tables for Pond and Grid Scale Analyses of the Importance of  Islands for Foraging and Roosting Waterbirds   Table A1. The ranking of candidate models at the pond scale for foraging and roosting American avocets in the former salt production ponds of South San Francisco Bay, California."}, {"section_title": "Temporal", "text": ""}, {"section_title": "Species or guild Presence of islands a", "text": ""}]