[{"section_title": "Abstract", "text": "We examined the associations between mitochondrial DNA haplogroups (MT-hgs; mitochondrial haplotype groups defined by a specific combination of single nucleotide polymorphisms labeled as letters running from A -Z) and their interactions with a polygenic risk score composed of nuclear-encoded mitochondrial genes (nMT-PRS) with risk of dementia and age of onset of dementia (AOO). MT-hg K (OR: 2.03 [95% CI: 1.04, 3.97]) and a one SD larger nMT-PRS (OR: 2.2 [95% CI: 1.68, 2.86]) were associated with elevated odds of dementia. Significant antagonistic interactions between the nMT-PRS and MT-hg K (OR: 0.45 [95% CI: 0.22, 0.9]) and T (OR: 0.22 [95% CI: 0.1, 0.49]) were observed. Individual MT-hg were not associated with AOO; however, a significant antagonistic interactions was observed between the nMT-PRS and MT-hg T (HR: 0.62 [95% CI: 0.42, 0.91]) and a synergistic interaction between the nMT-PRS and MT-hg V (HR: 2.28 [95% CI: 1.19, 4.35]). These results suggest that MT-hgs influence dementia risk, and that variants in the nuclear and mitochondrial genome interact to influence the age of onset of dementia.\n• Mitochondrial dysfunction has been proposed to influence dementia risk • MT-hg K and T interacted with a genetic risk score to reduce dementia risk • MT-hg T and V interacted with a genetic risk score to influence dementia age of onset"}, {"section_title": "Introduction", "text": "Alzheimer's disease (AD) is a progressive neurodegenerative disease characterized by cognitive and functional deterioration resulting in a loss of independent living, and ultimately death (Masters et al., 2015) . The neuropathological hallmarks of AD are the abnormal aggregation and accumulation of amyloid-β peptides into extracellular amyloid plaques and hyperphosphorylated tau intracellular neurofibrillary tangles, accompanied by neuroinflammation, gliosis, and neurodegeneration (Masters et al., 2015; Mhatre et al., 2015) .\nAs such, studies on AD pathogenesis and therapeutics have largely focused on the role of Aβ and Tau. However, with several negative trials of drugs targeting Aβ pathways, there has been increasing interest in evaluating the role of other pathological features in AD, such as mitochondrial dysfunction Perez Ortiz and Swerdlow, 2019) .\nMitochondria are vital to cellular function, firstly as the major source of cellular energy through the generation of adenosine triphosphate (ATP) via oxidative phosphorylation, but also through regulation of calcium uptake, apoptosis, and production and sequestration of reactive oxygen species (Gorman et al., 2016) . Each mitochondrion possesses its own 16,569 base pair circular genome (mtDNA) that encodes 37 genes: 13 protein-coding genes, 22 tRNAs, and two ribosomal RNAs (Taanman, 1999) . Genetic variation in the mitochondria is often described by established haplotype groups defined by a specific combination of single nucleotide polymorphisms (SNPs) that represent major branch points in the mitochondrial phylogenetic tree (van Oven and Kayser, 2009 ). Mitochondrial haplogroups are named using capital letters running from A -Z, with further subclades defining using lower case letters and numbers. MThgs H, I, J, K, T, V, W, Z, and U are predominantly found in Europe. The nuclear genome also plays a key role in mitochondrial function as it contains 1,145 genes that encode proteins that influence mitochondrial function (mitonuclear genes) (Calvo et al., 2016) . These Mitonuclear genes encode the majority of the proteins involved in the oxidative phosphorylation system and are also essential for maintaining mtDNA replication, organelle network proliferation and destruction (Chinnery and Hudson, 2013) . A recent systematic review of 43 studies examining the effects of mitonuclear incompatibility across vertebrates and invertebrates found significant effects on health, including gene expression, metabolic traits, anatomical or morphological traits, lifespan and fecundity (Dobler et al., 2018) indicating that incompatibility between nuclear and mitochondrial genes can influence biological function. Furthermore, in six admixed human populations, increasing discordance between nuclear and mtDNA ancestry was associated with reduced mtDNA copy number -a proxy measure for mitochondrial function (Zaidi and Makova, 2019) . Thus mitochondrial function relies on fine-tuned mitonuclear interactions that require the nuclear and mitochondrial genomes to be compatible with one another.\nThe central nervous system is particularly vulnerable to impaired mitochondrial metabolism because of its high-energy demands. Increasing evidence links mitochondrial dysfunction to neurodegenerative diseases such as AD. Support for the role of mitochondria in AD comes from studies observing changes in the rate of metabolism, disruption of fusion and fission, altered concentration of mitochondria in CSF, morphological changes and aggregation of Aβ in the mitochondria (Perez Ortiz and Swerdlow, 2019; Swerdlow, 2018) . Additionally, maternal history of AD confers an increased risk of AD, cognitive aging and elevated biomarkers for AD, which is consistent with the maternal inheritance of mtDNA (Honea et al., 2012; Swerdlow, 2018) .\nDespite this evidence, the role of the mitochondrial genome in AD remains inconclusive, as a recent systematic literature review of 17 studies reported few definitive findings on the association of mitochondrial genetic variation with AD (Ridge and Kauwe, 2018 ). In addition, while candidate gene studies have implicated several mitonuclear genes in AD risk, genomewide association studies (GWAS) have not supported the association of specific mitonuclear genes with AD, with the exception of TOMM40 which is in high linkage disequilibrium with (Chiba-Falek et al., 2018; Kunkle et al., 2019) . To date, no study has investigated whether the genetic variation in mitonuclear genes interacts with the mitochondrial genome to influence AD risk."}, {"section_title": "APOE", "text": "In this study, we investigate the association of mitonuclear interactions in Alzheimer's disease by evaluating the interactions between an AD polygenic risk score that included only variants from mitonuclear genes (nMT-PRS) and mitochondrial haplogroups (MT-hg) on Alzheimer's disease risk and survival."}, {"section_title": "Methods", "text": ""}, {"section_title": "Alzheimer's Disease Neuroimaging Initiative", "text": "Data used in the preparation of this article were obtained from the Alzheimer's Disease Descriptive characteristics of ADNI participants at baseline and last assessment are presented in Table 1 ."}, {"section_title": "Nuclear DNA", "text": "GWAS data for ADNI participants were obtained and processed as previously described (Saykin et al., 2015) . Briefly, genomic DNA extracted from blood were genotyped on Illumina GWAS arrays (ADNI1: 610-Quad; ADNI GO/2 OmniExpress). Genotype data then underwent stringent quality control checks, with variants excluded if the call rate was < 0.95, MAF was < 1% or were not in Hardy-Weinberg equilibrium (p < 1 x 10-6) and samples excluded if call rate was < 0.95, discordant sex was reported, cryptic relatedness, non-European ancestry or outlying heterozygosity. To empirically determine ancestry, the samples were projected onto principal components from known ancestral populations in the 1000 Genomes Project, with samples determined to be European population outliers if they were ± 6 SD away from the EUR population mean on the first 10 principal components (1000 Genomes Project Consortium et al., 2015 . Within-ancestry principal components were created using the --PCA function in PLINK (Purcell et al., 2007) to correct for residual population stratification within the European population subset. SNPs that were not directly assayed were imputed using the Haplotype Reference Consortium (McCarthy et al., 2016) , with imputed variants excluded due to poor imputation quality (INFO < 0.3) or low MAF (< 1%)."}, {"section_title": "Mitochondrial DNA", "text": "138 mtDNA variants were available for 757 samples from ADNI1 who were genotyped on the Illumina 610-Quad array. Additional mitochondrial genetic variants were made available via imputation of the mitochondrial genome, as previously described (McInerney et al., 2019) , using a custom reference panel of mitochondrial genome sequences and the chromosome X imputation protocol in IMPUTE2 (Howie et al., 2009 ). An additional 809 samples with mitochondrial variants were made available via whole genome sequencing .\nMT-hg were assigned to the genotyped/imputed dataset (SNPs with an info score > 0.4) using\nHaplogrep2 (Weissensteiner et al., 2016) , while in the whole genome sequenced dataset MT-hg were assigned using Phy-Mer (Navarro-Gomez et al., 2015) . We previously validated the imputation of mitochondrial variants in ADNI using 258 participants for whom WGS and genotyping data were available (McInerney et al., 2019)."}, {"section_title": "Polygenic Risk scores", "text": "The software package PRSice was used to construct an AD PRS for nuclear encoded mitochondrial polygenic risk scores (nMT-PRS) (Euesden et al., 2015) . To generate a mitonuclear AD PRS, SNPs from stage 1 of the International Genomics of Alzheimer's Project (IGAP) (Lambert et al., 2013) were annotated to known protein-coding genes (±50kb) using MAGMA (de Leeuw et al., 2015) and those SNPs that were assigned to any of 1,158 mitonuclear genes were extracted (Calvo et al., 2016) . A p-value threshold of 0.5 was used for inclusion of SNPs into the nMT-PRS as this threshold has been previously shown to have the most significant association with case/control diagnosis . To obtain independent loci, LD clumping was performed by excluding SNPs that had an r2 > 0.1 with another variant with smaller p-value association within a 250kb window. SNPs were weighted by their effect sizes in IGAP. A total of 19,630 SNPs were included in the nMT-PRS (supplementary table 1)."}, {"section_title": "Statistical Analysis", "text": "Cross-sectional analysis: The effect of the MT-hgs on baseline risk of dementia was assessed using binomial multivariate logistic regression models with MT-hg H used as the reference group and adjusting for age, APOE status, sex, and the first two principal components (Model 1). To evaluate interactions between the MT-hgs and nMT-PRS, an interaction term was included in the model (Model 2). As logistic regression tests for interactions on a multiplicative scale (that the combined effect is larger or smaller than the product of the individual effects), we used the relative excess risk due to interaction (RERI) to test for departures from additivity (that the combined effect is greater or smaller than the sum of the individual effects).The RERI can be interpreted as the risk that is additional to the risk that is expected on the basis of the addition of the OR of the variables. In the absence of an interaction effect, the RERI is equal to 0. As MCI is an unstable diagnosis with individuals either converting to dementia, remaining stable or reverting back to normal cognition (Canevelli et al., 2016) , participants with MCI (n = 634) were excluded from the analysis.\nSurvival analysis: In the survival analysis, age was used as the time to event scale. For subjects who were cognitively normal or suffering from MCI at baseline, AD age at onset was used. For participants with AD at baseline, the reported best estimate of onset of AD-dementia symptoms by the subject (or informant) was used (Osorio et al., 2015) . All analysis was performed in the R 3.5.2 statistical computing environment. As this is an exploratory study, we have not corrected for multiple testing as this can result in a high risk of type 2 errors (Bender and Lange, 2001) . As associations for 8 haplogroups and the nMT-PRS were tested, a significant p-value after Bonferroni correction would be p < 0.0056 (0.05/9) for main effects models (model 1) and p < 0.0029 (0.05/17) for the interaction models (model 2)."}, {"section_title": "Results", "text": ""}, {"section_title": "Association of mitonuclear interactions with Alzheimer's risk", "text": "Binomial logistic regression was used to evaluate the main effects of the MT-hgs and nMT-PRS and their interaction on the likelihood of participants having AD (Table 2 ). In the main effects model ( and -3.56 (95% CI: -5.54, -1.57) respectively, indicating that the nMT-PRS and MT-hg K and T acted antagonistically in relation to AD risk, such that the relative risk of AD was 2.8 and 3.56 times lower than expected from the addition of the separate effects of the nMT-PRS and MT-hg."}, {"section_title": "Association of mitonuclear interactions with Alzheimer's age of onset", "text": "A Cox-proportional hazard model was used to evaluate the main effects of the MT-hgs and nMT-PRS and their interaction on Alzheimer's age of onset (AOO) ( "}, {"section_title": "Sensitivity analysis", "text": "The "}, {"section_title": "Discussion", "text": "In this study, we investigated whether mitonuclear interactions influence Alzheimer's risk and survival by evaluating the interactive effects of MT-hgs and a polygenic risk score composed of mitonuclear genes (nMT-PRS) on baseline risk of AD and age of onset of dementia (AOO). We observed that nMT-PRS was associated with an increased risk of AD and an earlier AOO, even after adjusting for a PRS composed of SNPs from the rest of the genome. Additionally, we observed that MT-hg K was associated with an increased baseline risk of Alzheimer's disease and in the interactive model, modified the risk associated with the nMT-PRS in an antagonistic manner, such that the combined effect of the nMT-PGS and MT-hg K was smaller than expected given their additive effects. In effect they are less harmful together then they are on their own, though the potential underlying mechanisms of this compensatory effect are complex (Lehner, 2011) . MT-hg T was also observed to modify the risk associated with the nMT-PRS in an antagonistic manner for both baseline risk of AD and AOO. Finally, we observed that MT-hg V was associated with an increased risk of AD beyond that expected in the additive model with the nMT-PRS.\nThese results suggest that epistasis between nuclear and mitochondrial genomes, in which one gene's effect is dependent on the presence of another gene or set of genes, influences the risk of Alzheimer's disease. While to date, no previous study to our knowledge has investigated the interaction between mitonuclear genes and the mitochondrial genome in the context of AD, several studies have investigated associations between mitochondrial genetic variation and APOE. In APOE ε4 carriers MT-hg K and U were observed to have neutralizing effect (Carrieri et al., 2001; Maruszak et al., 2011) on AD risk. Conversely, SNP mt7028C, a defining SNP for MT-hg H, and MT-hg H5a had acted synergistically with APOE ε4 to increased risk of AD (Coto et al., 2011; Maruszak et al., 2011) . Finally, SNP mt4336C which defines MT-hg H5a was associated with an increased risk of AD only in APOE ε4 carriers (Edland et al., 2002) . Outside of Alzheimer's disease, mitonuclear interactions have also been implicated in altering the penetrance of primary pathological mutations underlying mitochondrial disease or modifying the pathogenic phenotype of other diseases, such as non-syndromic sensorineural deafness (Kokotas et al., 2007; Morrow and Camus, 2017) . The results of this study, in addition to the prevalence of mitonuclear epistasis in other diseases, suggests that the inconclusive results of mitochondrial genetic variation in AD may not only be due to small sample sizes, limited genetic data collection and inadequate approaches to association analysis (Ridge and Kauwe, 2018) , but could also be attributed to the modifying effects of nuclear-encoded mitochondrial genes. As such, future studies investigating the association of mtDNA with AD should consider evaluating the modifying effect of nDNA.\nThe MT-hg association analysis is in agreement with two previous studies conducted in ADNI.\nLakatos et al (Lakatos et al., 2010) investigated the association of four MT-hg clusters (HV, JT, UK, and IWX) with AD in 358 participants and found that the UK MT-hg cluster was associated with an increased risk of AD. Ridge et al (Ridge et al., 2013) utilized a TreeScanning approach to assess the relationship of mitochondrial genetic variation with structural MRI and cognitive biomarkers and found SNPs defining either MT-hg K1A1B or K1A1B2A1 and MT-hg U5B1 or U5B1B2 were associated with reduced temporal pole thickness, which is considered evidence of increased risk for AD. However, within the context of the wider literature, MT-hg U, K, and T have been associated with conflicting reports, with different studies reporting either protective, risk, or non-significant effects (Ridge and Kauwe, 2018) . In cybrid cells lines, MT-hg T in comparison to MT-hg H, has a higher capability to cope with oxidative stress (Mueller et al., 2012) , while cybrids continain MT-hg K express higher levels of APOE (Thaker et al., 2016) .\nAlzheimer's disease polygenic risk scores have been widely used to evaluate whether genetic liability for AD is associated with AD endophenotypes and in the prediction of disease status (Chasioti et al., 2019; Ibanez et al., 2019) . These PRS, however, have generally been applied to variants across the entire genome. Using biological knowledge to incorporate variants located in genes that are part of specific pathways in the calculation of PRS, instead of considering the entire genome, allows for the construction of pathway specific PRS (Darst et al., 2017; Ibanez et al., 2019) . In contrast to univariate analysis which is often underpowered due to the small effect sizes of individual SNPs, the joint analysis of the combined effect of all SNPs within a pathway may have a larger combined effect size and greater statistical power to detect an association.\nPathway based analysis may also be more power predictor for understanding our specific biomarkers may contribute to disease pathogenesis. Furthermore, as a large proportion of the heritability of Alzheimer's disease is explained by variants that lie below the genome-wide significant threshold, the inclusion of subthreshold variants allows the PRS to encompass more of the causal variance . To date, there has been a limited application of pathway-specific PRS in AD, with only one study evaluating the association of PRSs for the immune, Aβ clearance, and cholesterol pathways with AD-related biomarkers (Darst et al., 2017; Ibanez et al., 2019) . However, these PRSs were poor predictors of cognition, amyloid PET deposition, and CSF Aβ, tau, and P-tau levels, potentially due to only including genomewide significant loci (Darst et al., 2017) . In the present study, we show that a pathway-specific PRS composed of SNPs located within nuclear-encoded mitochondrial genes is associated with both risk of AD and an earlier AAO, suggesting that mitochondrial function moderates AD pathogenesis. Our findings are supported by another recent study that built a molecular network using modules of coexpressed genes and identified three modules enriched for gene ontology categories related to mitochondria. These modules were associated with histopathological βamyloid burden, cognitive decline and clinical diagnosis of AD (Mostafavi et al., 2018) .\nInterestingly, a pathway analysis conducted by IGAP tested for overrepresentation of genes containing significantly associated SNPs within a series of functional gene sets found no evidence of enrichment in mitochondrial pathways . This analysis, however, only examined mitochondrial pathways that contained a subset of the mitochondrial related genes relevant to that gene set, while our study examined the aggregate effect of all nuclear encoded genes related to mitochondrial function.\nThe results of this study should be interpreted in conjunction with some study limitations. First, ADNI has a relatively small sample size, which can contribute to unreliable findings as a result of (a) a low probability of finding true effects, (b) a lower probability that an observed effect that is statistically significant reflects a true effect, or (c) an extracted estimate of the magnitude of an effect when a true effect is discovered (Button et al., 2013) . Additionally, as this is an exploratory study, the findings of this study need to be replicated in a larger cohort. Second, when constructing PRS, sample overlap between the base dataset (i.e., IGAP), and the target datasets (i.e., ADNI) can result in inflation of the association between the PRS and trait tested in the target dataset (Choi et al., 2018) . However, it should be noted that IGAP consists of 54,162 participants, with ADNI only contributing 441 samples to IGAP, or 0.81% of IGAPs total sample size. Additionally, the samples included in the IGAP analysis are a subset of those included in this analysis. As such, the sample overlap between the base and target datasets is unlikely to substantially bias the results of this study. Third, the subjects in this study were of European ancestry and European MT-hg, and thus the results presented may not be generalizable to other racial/ethnic populations. In particular, in admixed populations that have a greater discordance between nuclear and mitochondrial ancestry, it could be expected that mitonuclear interactions may contribute to even more phenotypic variation in disease (Zaidi and Makova, 2019) . The primary strength of this paper was evaluating the effect of MT-hgs in the context of a participant's nuclear polygenic risk for late onset Alzheimer's Disease (LOAD). Secondly, by imputing mtDNA variants we were able to more accurately assign MT-hgs to individuals who were included in a previous ADNI study (Lakatos et al., 2010) . Finally, we utilized both crosssectional and longitudinal data to evaluate the baseline risk of LOAD and AOO.\nIn conclusion, this is the first study to investigate the interactive effects of a LOAD polygenic risk score composed of mitonuclear genes and mitochondrial haplogroups on Alzheimer's risk and survival. We found that nMT-PRS was associated with increased risk of AD and an earlier age of onset. MT-hg T was observed to attenuate the effect of the nMT-PRS on the risk of AD and AOO, while MT-hg K and V were observed to attenuate the effect of the nMT-PRS on baseline risk and strengthen the effect of the nMT-PRS on AOO respectively. The results from this study need to be replicated in independent cohorts to validate our findings. These findings suggest that interactions between the nuclear and mitochondrial genomes may influence AD pathogenesis. "}, {"section_title": "Tables", "text": ""}]