[{"section_title": "Introduction", "text": "The most frequently studied candidate gene for Neuroticism, depression, anxiety-related traits and disorders is the serotonin transporter (5-HTT) (Lesch et al., 1996;Alaerts et al., 2008;Frodl et al., 2008;Tadic et al., 2008;Zaboli et al., 2008;Xu et al., 2008). The gene SLC6A4 encodes the 5-HTT, a membrane protein that transports serotonin from synaptic spaces into presynaptic neurons. 5-HTT is the main target of the most widely used class of psychiatric drugs, the selective serotonin reuptake inhibitors (SSRIs). The SLC6A4 gene is on chromosome 17q11.1-q12. A functional insertion/deletion polymorphism is present in the regulatory region of the gene, and is referred as the 5-hydroxytryptamine-linked polymorphic region (5-HTTLPR). The short (S) allele (44-bp deletion) was found to be transcribed less efficiently than the long (L) allele, which results in a decreased 5-HTT expression and serotonin uptake in lymphoblasts (Lesch et al., 1996). In a sample of 505 individuals, Lesch et al. (1996) found that the NEO-PI-R Neuroticism was significantly associated with the 5-HTTLPR: individuals with the SS or SL genotypes had higher scores on Neuroticism than individuals with the LL genotype. Lesch et al. estimated that the polymorphism accounted for 3% to 4% of total variation and 7% to 9% of inherited variance of anxiety-related personality traits. Although the mechanism of action of the SSRIs are complex and do not simply fit hypotheses such as the \"serotonin depletion\" for depression (Lacasse and Leo 2005), the association between the less active S allele and Neuroticism remains counterintuitive (Lesch et al., 1996;Arbelle et al., 2003; but see Ansorge et al., 2004). Given that the SSRI therapeutic action is through blocking reuptake of serotonin, one would expect the less efficient S allele (which presumably reuptakes less serotonin) to be associated with lower Neuroticism. Furthermore, the original report was replicated in a number of later studies (Sen et al., 2004b;Ricketts et al., 1998;Greenberg et al., 2000;Murakami et al., 1999), but others failed to find an association using general population (Herbst et al., 2000;Jorm et al., 1998;Ball et al., 1997;Ebstein et al., 1997;Willis-Owen et al., 2005;Munafo et al., 2008b;Middeldorp et al., 2007) or clinical samples (Mazzanti et al., 1998;Gelernter et al., 1998), and some found an association in the opposite direction (Brummett et al., 2003;Van Gestel et al., 2002;Arbelle et al., 2003;Jorm et al., 2000). Inconsistent findings have been attributed to the use of admixed populations, but the true impact of population stratification in the field of molecular psychiatry is questionable (Hutchison et al., 2004;Gardner et al., 2008). Several meta-analyses have summarized the results (Sen et al., 2004a;Schinka et al., 2004;Munafo et al., 2008b), and found no association when considering the entire set of studies. However, the choice of personality scale used was a significant moderating variable: In studies that used the Neuroticism scale of the NEO-PI-R, a small (d ∼ 0.2) but statistically significant effect was found. No effect was found when personality was assessed using the Harm Avoidance scale of the TCI or the Neuroticism scale of the EPQ. Another meta-analyses (Munafo et al., 2005a) reported a moderating effect in the opposite direction, but this might be due to coding errors (Munafo et al., 2005b). The results of meta-analyses should be considered with caution because of the uncontrolled differences among studies, publication biases, unknown moderating variables, and other confounding factors. As argued by Munafo et al., \"Meta-analyses are therefore by no means perfect [...]. Very large, well-designed primary studies remain the most reliable way of obtaining reproducible results\" (2005b). To date, the only large studies (∼4,000 subjects) wellpowered to detect small genetic effect did not support the hypothesis that the 5-HTTLPR is associated with Neuroticism, as measured with the EPQ (Willis-Owen et al., 2005), or Harm Avoidance (Munafo et al., 2008b). However, it is possible that when the phenotype is assessed with the NEO-PI-R an association between the 5-HTTLPR and Neuroticism could be found. To address this hypothesis, we examined in a large sample (∼4,000 subjects) whether personality traits assessed with the NEO-PI-R are associated with the 5-HTTLPR and other variants in the serotonin transporter gene. This sample is part of the SardiNIA project (Pilia et al., 2006), a multidisciplinary study that assessed multiple traits and performed a genome-wide association scan in a homogeneous sample from a founder population. Furthermore, we tested the association of the 5-HTTLPR and other variants in a sample from the Baltimore Longitudinal Study of Aging (BLSA). In the BLSA, most subjects have been assessed with the NEO-PI-R at multiple visits. Longitudinal studies have shown that the use of multiple measures yields larger estimates of heritability compared to studies based on single report (Riemann et al., 1997;Kendler et al., 1993). Aggregating data across multiple occasions should produce more robust results, less dependent on state-specific effects. Although the BLSA sample with 5-HTTLPR genotype is relatively small, the sample size of 548 individuals has a power higher than .80, at significance level p = .01 two-tailed, to detect the differences on Neuroticism reported in recent meta-analyses (d ∼ .2) (Sen et al., 2004a;Schinka et al., 2004;Munafo et al., 2008b). In addition to the 5-HTTLPR, in both samples we examine a number of single nucleotide polymorphisms (SNPs) that map in the SLC6A4 gene region for association with the Neuroticism related traits. These SNPs have not been routinely examined in previous studies and most are not in linkage disequilibrium with the 5-HTTLPR, thus providing independent association tests of other 5-HTT gene regions with Neuroticism-related traits (Strug et al., 2008)."}, {"section_title": "Method Sample description: SardiNIA", "text": "We recruited 6,148 individuals, about 62% of the population aged 14 to 102 years, from a cluster of four towns in the Lanusei Valley (Pilia et al., 2006). The cohort includes ∼700 connected pedigree and over 30,000 relative pairs. Subjects are native-born, and at least 95% are known to have all grandparents born in the same province (Pilia et al., 2006). Valid personality data were obtained from 5,669 subjects at their first assessment, of whom 3,913 were successfully genotyped for the 5-HTTLPR, and 3,972 were part of the genome-wide association (GWA) scan. Genotyped individuals did not differ on Neuroticism or its facets from those who were not genotyped. The sample includes 57% women with age range from 14 to 90 (Mean = 42.5, SD = 16.7), and 43% men with age range 14-94 (Mean = 42.8, SD = 17.2). More demographic information on the sample has been reported elsewhere (Costa et al., 2007;Pilia et al., 2006). The project was approved by institutional review boards in Italy and the USA."}, {"section_title": "Sample description: BLSA", "text": "We genotyped the 5-HTTLPR of 548 community-dwelling volunteers enrolled in the BLSA. This sample includes 51% women; age at first visit ranged from 20 to 87 (M = 52.9, SD = 12.5); and the ethnic composition was 86% White non-Hispanic, 11% African American, and 3% other. Nine SNPs that map within or close to the SLC6A4 gene were genotyped as part of a GWA scan in a sample of 1,182 BLSA participants with personality data. This sample includes 48% women; age at first visit ranged from 20 to 93 (M = 57.3, SD = 15.5); and the ethnic composition was 71% White non-Hispanic, 23% African American, and 6% other. Personality traits were assessed from 1989 to 2008, for a total of 4,807 assessments. The number of NEO-PI-R assessments ranged from 1 to 13 times (Median = 3). Although personality traits are generally stable over time (Terracciano et al., 2005;, to provide more robust estimates we used the average across all available assessment points in the association analyses. The project was approved by the local institutional review board. The hypothesized association between anxiety-related personality traits and the 5-HTTLPR was previously tested with the TCI for 425 participants of the current sample (Herbst et al., 2000). In addition to the augmented sample size, the current study uses the NEO-PI-R. The TCI has less desirable psychometric proprieties (Ball et al., 1999;Herbst et al., 2000) and metaanalyses (Sen et al., 2004a;Schinka et al., 2004;Munafo et al., 2008b) suggested that the choice of measurement scale is the most potent moderator of the 5-HTTLPR-anxiety relationship."}, {"section_title": "Personality assessment", "text": "Personality traits were assessed using the English (Costa and McCrae 1992) and Italian versions (Terracciano 2003) of the NEO-PI-R, which measures 30 facets, six for each of the five major dimensions of personality (Costa and McCrae 1992). For example, the facets Anxiety, Angry Hostility, Depression, Self-Consciousness, Impulsiveness, and Vulnerability are definers of the Neuroticism factor. The 240 items are answered on a five-point Likert scale, from strongly disagree to strongly agree, and scales are roughly balanced to control for the effect of acquiescence. Scores followed a normal distribution and were standardized using combined gender American norms (Costa and McCrae 1992). The NEO-PI-R has a robust factor structure that has been replicated in Italy (Terracciano 2003) and in more than 50 cultures . Stability coefficients for the five factors are in the range of 0.80 over intervals of 10 years . In the Sardinian sample, the NEO-PI-R showed good psychometric properties, with internal consistency reliabilities for the five factors ranging from 0.80 to 0.87, and a factor structure that replicated the American normative structure at the phenotypic and the genetic level (Pilia et al., 2006;Costa et al., 2007;Yamagata et al., 2006)."}, {"section_title": "Genotyping: 5-HTTLPR", "text": "DNA was extracted from whole blood by standard techniques. In the SardiNIA sample the 5-HTTLPR genotypes were determined using the MegaBACE 1000 fluorescence-based genotyping methodology. Genotypes were scored using MegaBACE Genetic Profiler Software v1.5 (Amersham Biosciences). PEDSTATS was used for additional quality control, and four individuals were excluded from the analyses for Mendelian incompatibilities. Allele frequencies were 49% for the s allele and 51% for the l allele, and the genotype frequencies were in Hardy-Weinberg equilibrium (p > 0.05). In the BLSA, 5-HTT genotypes were determined by polymerase chain reaction (PCR) amplification with reaction mix and cycling conditions as described by Lesch and colleagues (1996). The PCR products were separated by electrophoresis in a 2% agarose gel and visualized by ultraviolet light after ethidium bromide staining. Allele frequencies were 42% for the s allele and 58% for the l allele, and the genotype frequencies were in Hardy-Weinberg equilibrium (p > 0.05)."}, {"section_title": "Genotyping: SNPs", "text": "In both samples we examined additional variants that map in the 5-HTT gene region. For the SardiNIA sample, five SNPs intronic to SLC6A4 and three in the adjacent region were considered (see Figure 1). These SNPs were assessed as part of a full genome scan that used Affimetrix 10K and 550K platforms. Additional information about the GWA scan has been provided elsewhere (Terracciano et al., 2008;Sanna et al., 2008). In the BLSA sample, seven SNPs intronic to SLC6A4 and two in the adjacent region were considered (see Figure 1). These SNPs were assessed as part of a full genome scan that used the Illumina HumanHap 550 platform. These SNPs passed standard quality control criteria (data completeness, Hardy-Weinberg equilibrium, Mendelian incompatibilities) and had minor allele frequency >5% (Terracciano et al., 2008)."}, {"section_title": "Statistical analyses", "text": "Genetic association analyses were performed using different methods. We contrasted the three 5-HTTLPR genotype groups using analyses of variance (SPSS 13.0). As in previous studies, we also contrasted the LL with the combined SS and SL genotypes (Lesch et al., 1996). To take advantage of the family relatedness in the SardiNIA sample, association analyses were also performed using the program MERLIN (Chen and Abecasis 2007). The association tests implemented in MERLIN use a standard variance component model to account for a background polygenic component when analyzing the evidence for association in a sample of related individuals. The analyses included sex and age as covariates. We used MERLIN for the association analyses of the SNPs in the 5-HTT gene region. In the SardiNIA sample, we used genomic control method to adjust our test statistics for population structure and cryptic relatedness among sampled individuals (Devlin and Roeder 1999). We checked the genomic control value for our genome-wide association analyses (Devlin and Roeder 1999), and carried out principal component analysis of genome-wide SNP data in a subset of unrelated individuals (Price et al., 2006). Neither analysis suggested evidence for population substructure or genetic outliers in the SardiNIA sample. To account for the multiethnic composition of the BLSA sample, we included in the MERLIN analyses an ethnicity variable as covariate, which classified individuals in African, Asian, and European descent, or missing for those with other/unknown ethnicity. Analyses were also repeated using as covariates eigenvalues derived from the full GWA dataset (Price et al., 2006), and within the larger subsample of European-American."}, {"section_title": "Results", "text": ""}, {"section_title": "SardiNIA", "text": "Analysis of variance controlling for age and sex found no mean level differences between the 5-HTTLPR genotypes groups (SS, SL, LL) on Neuroticism or any of the six Neuroticism facets (Table 1). No evidence of association was found when the analyses were conducted grouping individuals with one or two S allele (ps > .05). Analyses that did not control for age and sex produced the same results, and analyses within gender indicate no association in either the men or women subsamples (see Figure 2). Furthermore, in this sample of related individuals, we performed association test that take advantage of the family relatedness (MERLIN) (Chen and Abecasis 2007), but again we found no effect of the 5-HTTLPR on Neuroticism or its facets (last column of Table 1). We examined eight SNPs that map within or near the 5-HTT gene (SLC6A4). Table 2 presents the association results of Neuroticism and its facets with each of the eight SNPs. None of the SNPs reached statistical significance for Neuroticism or any of the six facets."}, {"section_title": "BLSA", "text": "Analysis of variance controlling for age and sex found significant mean level differences on Neuroticism, Anxiety, Depression, and Vulnerability between the 5-HTTLPR genotype groups in the BLSA sample (see Table 3). Post hoc test indicate that the heterozygous (SL) group scored lower than the LL on Neuroticism and its facets, but there were no differences between the two homozygous groups. Analyses that grouped the SS and SL groups found that individuals with those genotypes scored lower on Neuroticism related traits, an effect opposite to those of previous studies (Lesch et al., 1996). The results were essentially the same when the analyses included an ethnicity variable or the GWA derived eigenvalues as covariates to correct for population stratification (Price et al., 2006), or when the analyses were limited to the European-American sample. Analyses within gender found the SL group scoring lower on Neuroticism traits in both men and women, a finding inconsistent with previous studies (Lesch et al., 1996). We examined nine SNPs that map within or near the 5-HTT gene (SLC6A4). Table 4 presents the association results of Neuroticism and its facets with each of the nine SNPs. As shown on Table 4, there are some associations for two SNPs (rs8071667 and rs140700) with Neuroticism and some facets, but none of these effects remained significant after Bonferroni correction for multiple tests. The results were essentially the same when the analyses included as covariates the eigenvalues derived from principal components analysis to correct for population stratification (Price et al., 2006). None of these weak effects in the full BLSA sample (Table  4) was confirmed when the association analyses were limited to the European-American BLSA subgroup (n = 844)."}, {"section_title": "Discussion", "text": "We examined whether variants in the serotonin transporter are associated with Neuroticismrelated traits in a large sample from a homogeneous population and in a longitudinal study. Using multiple analytic methods we found no association of the S allele of the 5-HTTLPR with higher scores on anxiety, depression, or other Neuroticism facets. This finding is consistent with two previous large scale studies (Willis-Owen et al., 2005;Munafo et al., 2008b) that adopted different measure of Neuroticism, namely the EPQ and TCI. However, meta-analytic studies have suggested that the personality instrument used could be an influential moderator. Meta-analyses indicate that the 5-HTTLPR had an effect on Neuroticism only when the trait was assessed with the NEO-PI-R. Using the NEO-PI-R in a large homogeneous sample and in a longitudinal study, our results undermine the meta-analytic finding, and reject any substantial effect of the 5-HTTLPR on Neuroticism-related traits regardless of which questionnaire was used. Furthermore, we found no evidence of association between other SNPs within or near the 5-HTT gene and measures of Neuroticism. These SNPs are not linked to the 5-HTTLPR but are part of haplotype blocks in the gene region. The null results from our two samples suggest that the common variants we examined are unlikely to be related to Neuroticism traits. It should be noted that the SNPs we genotyped did not fully cover the SLC6A4 gene region. For example, we did not genotype the A/G variant within the 5-HTTLPR repeat region (Lg), which may influence gene expression, but is unrelated to Neuroticism (Wachleski et al., 2008;Gunthert et al., 2007). From the first report of a main effect of the 5-HTTLPR on anxiety-related traits, a large number of studies have explored the association of this variant in clinical samples, in neuroimaging studies, and in gene-gene and gene-environment interaction studies. Most of these studies are based on small samples, and the results from this literature are generally mixed (Munafo et al., 2008a). Considering the results of the current and two other large scale studies (Willis-Owen et al., 2005;Munafo et al., 2008b) that reject a main effect of the 5-HTTLPR on Neuroticismrelated phenotypes, even greater caution is required in interpreting the results of studies with small sample sizes that examined complex phenotypes (e.g., amygdala reactivity or response to SSRIs) or complex interactions. Serotonin transporter gene polymorphisms and LD pattern. Note: The SLC6A4 gene is represented by horizontal line with the location of exons marked with vertical ticks. The 5-HTTLPR polymorphism is shown in red. SNPs in green were genotyped in the SardiNIA sample using Affymetrix platform. SNPs in blue were genotyped in the BLSA sample using Illumina platform. Genomic positions of SNPs are according to the NCBI Build 36.3 human genome assembly. Bottom panel presents patterns of linkage disequilibrium (r2) for the serotonin transporter gene locus in the Hap Map CEPH population (www.hapmap.org). Mean Neuroticism score for the 5-HTTLPR genotypes in men and women. Note: 5-HTTLPR = 5-hydroxytryptamine-linked polymorphic region. Mean Neuroticism scores are adjusted for age differences. NEO-PI-R Neuroticism scores in 5HTTLPR genotypes groups from the SardiNIA sample Note. Mean personality scores for the genotypes are adjusted for age and sex differences. Standard errors are reported in parentheses. The measure of effect size d, is computed as the difference in mean personality traits between genotype groups (SS and SL vs. LL) divided by the standard deviation. None of the effect was significant (p < .05)."}, {"section_title": "Table 2", "text": "Association of Neuroticism traits with SNPs in the 5-HTT gene (SLC6A4) region in the Sardinia sample  Comparisons of NEO-PI-R scores in 5HTTLPR genotypes groups from the BLSA sample  Association of Neuroticism traits with SNPs in the 5-HTT gene (SLC6A4) region in the BLSA sample "}]