[{"section_title": "Abstract", "text": "dependent insulinotropic polypeptide (GIP) is a gastrointestinal hormone that has a potent stimulatory effect on insulin release under conditions of normal glucose tolerance. However, its insulinotropic effect is reduced or even absent entirely in type 2 diabetic patients. In this study, we addressed the role of glucose concentration in the diabetic range of Ն11 mM, i.e., hyperglycemia per se, as a cause of the lack of response to GIP. Culturing rat and human pancreatic islets in Ն11 mM glucose for up to 24 h resulted in prevention of GIP-mediated intracellular cAMP increase compared with culturing in 5 mM glucose. Western blot analysis revealed a selective 67 Ϯ 2% (rat) and 60 Ϯ 8% (human) decrease of GIP-R expression in islets exposed to Ն11 mM glucose compared with 5 mM glucose (P Ͻ 0.001). We further immunoprecipitated GIP-R from islets and found that GIP-R was targeted for ubiquitination in a glucose-and time-dependent manner. Downregulation of GIP-R was rescued by treating isolated islets with proteasomal inhibitors lactacystin and MG-132, and the islets were once again capable of increasing intracellular cAMP levels in response to GIP. These results suggest that the GIP-R is ubiquitated, resulting in downregulation of the actions of GIP. pancreatic islet; cyclic adenosine monophosphate; insulin; multivesicular body; glucose-dependent insulinotropic polypeptide GLUCOSE-DEPENDENT INSULINOTROPIC POLYPEPTIDE (GIP) is an insulinotropic hormone released from duodenum and jejunum into the plasma during a meal. Early studies showed its capacity to increase insulin secretion and subsequent effect on glucose metabolism (11, 21, 38) . Interference in the binding of GIP to its receptor (GIP-R) results in impairment of insulin secretion and variable degrees of glucose intolerance. This has been well demonstrated in animal studies (27, 37, 51) . GIP-R antagonists caused a marked decrease of insulin secretion with a defective early-phase insulin secretion in response to glucose (27, 51) . Although the GIP-R-null mice have pancreatic islets capable of producing an appropriate insulin response to glucose, they exhibited significant glucose intolerance when subjected to an oral glucose tolerance test (37).\nIn type 2 diabetes there is a functional impairment of the insulinotropic effect of GIP (40, 41). A possible relationship to the etiology of type 2 diabetes and obesity was investigated in studies performed in rodents and humans (3, 30, 35) . High-fat diet in ob/ob mice resulted in an increase in both plasma GIP concentrations and the number of GIP-secreting cells in the upper jejunum (3). Increased levels of peptides are seen mostly as a potential explanation for desensitization of receptors. Conversely, studies have reported plasma GIP levels to be increased (9), decreased (45), or just right (8) in diabetic patients. One reason for the diversity of responses may be that plasma GIP levels released in response to nutrients are also a function of the number of years that diabetes has been present. Obesity-linked glucose intolerance results in decreased expression of the GIP-R in Vancouver diabetic fatty Zucker rats, but the upstream mechanism is still unknown (30). A study performed in first-degree relatives of patients with type 2 diabetes described a reduced insulinotropic activity in response to infused GIP, which led those authors to suggest a possible inherited condition for the blunted response to GIP (35). Nevertheless, the impaired response that was seen in the relatives applied to only one-half of this group of subjects, and the effect of hyperglycemia could not be discarded, since the groups were not stratified according to their glucose levels in a glucose tolerance test. A follow-up study by the same investigators showed that the reduced effect of GIP on insulin release in euglycemic relatives of type 2 diabetic patients could not actually be demonstrated (36).\nMore recent studies concluded that hyperglycemia or a related metabolic condition altered the physiological response to GIP. Decreased expression of the GIP-R mRNA and insulinotropic response were observed in lean Zucker rats following hyperglycemic clamp studies (31), and a diminished response to GIP was demonstrated in diabetic patients whose diabetes was caused by diverse etiologies (52). These newest findings point to a metabolic cause, interfering with GIP-R signaling, rather than a primary GIP-R cause.\nThe GIP-R is a glycoprotein present in the pancreatic ␤-cell membrane (2, 32) that, upon binding to GIP, activates adenylyl cyclase and increases intracellular cAMP (19, 32) . The rise in cAMP in the presence of glucose is followed by an augmented extracellular calcium influx that ultimately results in potentiation of glucose-induced insulin secretion (29). Inhibition of the GIP-induced cAMP increase blocks the potentiation of glucose-stimulated insulin secretion by GIP (27). therefore, increased cAMP formation is necessary for GIP's insulinotropic effects."}, {"section_title": "GLUCOSE-DEPENDENT INSULINOTROPIC POLYPEPTIDE (GIP)", "text": "is an insulinotropic hormone released from duodenum and jejunum into the plasma during a meal. Early studies showed its capacity to increase insulin secretion and subsequent effect on glucose metabolism (11, 21, 38) . Interference in the binding of GIP to its receptor (GIP-R) results in impairment of insulin secretion and variable degrees of glucose intolerance. This has been well demonstrated in animal studies (27, 37, 51) . GIP-R antagonists caused a marked decrease of insulin secretion with a defective early-phase insulin secretion in response to glucose (27, 51) . Although the GIP-R-null mice have pancreatic islets capable of producing an appropriate insulin response to glucose, they exhibited significant glucose intolerance when subjected to an oral glucose tolerance test (37) .\nIn type 2 diabetes there is a functional impairment of the insulinotropic effect of GIP (40, 41) . A possible relationship to the etiology of type 2 diabetes and obesity was investigated in studies performed in rodents and humans (3, 30, 35) . High-fat diet in ob/ob mice resulted in an increase in both plasma GIP concentrations and the number of GIP-secreting cells in the upper jejunum (3) . Increased levels of peptides are seen mostly as a potential explanation for desensitization of receptors. Conversely, studies have reported plasma GIP levels to be increased (9) , decreased (45) , or just right (8) in diabetic patients. One reason for the diversity of responses may be that plasma GIP levels released in response to nutrients are also a function of the number of years that diabetes has been present. Obesity-linked glucose intolerance results in decreased expression of the GIP-R in Vancouver diabetic fatty Zucker rats, but the upstream mechanism is still unknown (30) . A study performed in first-degree relatives of patients with type 2 diabetes described a reduced insulinotropic activity in response to infused GIP, which led those authors to suggest a possible inherited condition for the blunted response to GIP (35) . Nevertheless, the impaired response that was seen in the relatives applied to only one-half of this group of subjects, and the effect of hyperglycemia could not be discarded, since the groups were not stratified according to their glucose levels in a glucose tolerance test. A follow-up study by the same investigators showed that the reduced effect of GIP on insulin release in euglycemic relatives of type 2 diabetic patients could not actually be demonstrated (36) .\nMore recent studies concluded that hyperglycemia or a related metabolic condition altered the physiological response to GIP. Decreased expression of the GIP-R mRNA and insulinotropic response were observed in lean Zucker rats following hyperglycemic clamp studies (31) , and a diminished response to GIP was demonstrated in diabetic patients whose diabetes was caused by diverse etiologies (52) . These newest findings point to a metabolic cause, interfering with GIP-R signaling, rather than a primary GIP-R cause.\nThe GIP-R is a glycoprotein present in the pancreatic ␤-cell membrane (2, 32) that, upon binding to GIP, activates adenylyl cyclase and increases intracellular cAMP (19, 32) . The rise in cAMP in the presence of glucose is followed by an augmented extracellular calcium influx that ultimately results in potentiation of glucose-induced insulin secretion (29) . Inhibition of the GIP-induced cAMP increase blocks the potentiation of glucose-stimulated insulin secretion by GIP (27) . therefore, increased cAMP formation is necessary for GIP's insulinotropic effects.\nRegulation of transmembrane proteins, such as tyrosine kinase receptors, G protein-coupled receptors, sodium chan-nels, and others, is widely executed by the multivesicular body (MVB) sorting pathway (12, 15, 48) . This pathway uses ubiquitination as its major signal and is responsible for the control of important cellular processes. It works as a regulatory apparatus that ensures proper cell signaling and ultimately proper cell function (22) . In this study, we addressed the impact of high glucose levels in cultured islets on GIP-mediated cAMP production and total GIP-R protein levels. We show that there is a decreased response to GIP stimulation and reduced expression of GIP-R in islets exposed to high glucose that can be prevented with proteasomal inhibitors."}, {"section_title": "MATERIALS AND METHODS", "text": ""}, {"section_title": "Materials.", "text": "Bovine serum albumin (BSA), 2-deoxy-D-glucose, and collagenase (XI) were from Sigma (St. Louis, MO). 3-Isobutyl-1-methylxanthine (IBMX), MG-132, and lactacystin were from Calbiochem (San Diego, CA). Exendin-4 (EX-4) as well as porcine and human GIP were from Bachem (King of Prussia, PA). Forskolin was from Calbiochem, anti-ubiquitin antibody was from Santa Cruz Biotechnology, (Santa Cruz, CA), and anti-␤-actin antibody was from Sigma. Anti-GIP-R antibody (27) was from Dr. Joel F. Habener (Boston, MA), and anti-GLP-1-R antibody (53) was from Dr. Bernard Thorens (Lausanne, Switzerland). RPMI 1640 medium (RPMI) was from Cellgro (Herndon, VA). Regular and enhanced chemiluminescence (ECL) detection systems were from Amersham Biosciences (Piscataway, NJ). SDS-polyacrylamide precast gels, DNase I, and TRIzol were from Invitrogen (Carlsbad CA). Real-time RT-PCR Kit was from Applied Biosystems (Foster City, CA). Cyclic AMP Correlate-EIA kit was from Assay Designs (Ann Arbor, MI). Rodent and human insulin ELISA assay kits were from Crystal Chem (Downers Grove, IL) and Alpco Diagnostics (Windham, NH), respectively. Protein assay reagent was from Bio-Rad (Hercules, CA). Glucose levels were measured by Analyzer 2 (Beckman Instruments, Fullerton, CA).\nAnimals. Male Sprague-Dawley rats (4 wk old) were from Harlan (Indianapolis, IN). All animal experiments were carried out on approved protocols and in accordance with the Animal Care and Use Committee of the National Institute on Aging, National Institutes of Health.\nIsolation and culture of rat pancreatic islets. Rats were anesthetized with isoflurane, and islets of Langerhans were isolated as described (44) . Hand-picked islets (100 islets per tube) were cultured for 1 h and 20 -24 h in RPMI containing 5, 11, or 22 mM glucose in 1.5-ml Eppendorf tubes. Glucose concentration was measured and adjusted if necessary.\nHuman pancreatic islets. Human pancreatic islets were provided by the Islet Cell Resource Center (2-3 days postisolation). They were hand-picked upon arrival, and some were immediately used while other islets, 100 per aliquot, were hand-picked into 1.5-ml Eppendorf tubes containing RPMI at various glucose concentrations and then cultured for 24 h. We received four separate isolations (2 female, 2 male).\nIntracellular cAMP and insulin release assay. Islets (100 per 1.5-ml Eppendorf tube) were cultured in 5, 11, or 22 mM glucose in 0.3 ml of RPMI for 1 or 20 -24 h. Then GIP (10 nM) or vehicle together with the IBMX (100 M) were added for another 30 min. GIP at 10 nM was used because preliminary experiments had revealed that this was the EC 75 for inducing insulin secretion from islets cultured in 11 mM glucose. Intracellular cAMP was extracted with 0.3 ml of 0.1 N HCl. Where indicated, MG-132 (10 or 50 M), lactacystin (10 or 30 M), or vehicle was added 2 h before the exposure to glucose concentrations. In all experiments, the supernatant was collected and saved at Ϫ20°C for insulin levels, and the cell extracts were saved for total cAMP assay. One set of human islets was first cultured in RPMI supplemented with 5, 11, or 22 mM glucose for 24 h. Then, from each glucose condition, five islets were manually pipetted into new tubes containing fresh RPMI with 5, 11, or 22 mM glucose for 1 h. One-half of the islets were then treated with GIP for another 30 min. The medium was assayed for insulin levels. Insulin release was normalized to one islet. Intracellular cAMP was extracted and assayed.\nRat islet GIP-R and GLP-1R mRNA expression. Rat islets (100 -400) were cultured in RPMI containing 5, 11, or 22 mM glucose for 1 h and 20 h. Total RNA was extracted from treated rat islets using TRIzol reagent according to the manufacturer's instruction. The purity of the RNA was estimated by measuring the 260-to 280-nm absorption ratio with a spectrophotometer. The RNA preparation was treated with DNase I at 37°C for 30 min to remove possible contaminating genomic DNA. DNase was then denatured by heating according to the instructions. Real-time quantitative PCR (qPCR) was performed using a real-time RT-PCR Kit in 96-well plates. Gene expression of 18S ribosomal RNA was used as an internal control. Each plate included reactions for standard curves and quantitation for a control. PCR reactions were performed for 40 cycles on an ABI 7700 Sequence Analyzer (Applied Biosystems) using a SYBR Green Master Mix according to the manufacturer's instructions. Standard curves were generated on each plate with each type of PCR reaction using a four-point standard dilution of islet cDNA as a template. Quantitative analysis was performed using the SDS 2.0 software (Applied Biosystems). Fluorescence was measured during the annealing/extension steps and used to calculate a cycle threshold (C T), i.e., the point at which the reaction is in the exponential phase and is detectable by the hardware. The minimum CT required for detection was converted into an absolute cDNA amount by extrapolating the CT values onto the four-point standard curve. The level of the relative expression of each gene was calculated by dividing the absolute amount of cDNA for that gene by the amount of ribosomal RNA expression. Primer pairs used were as follows (sense and antisense, respectively): GIP-R: 5Ј-AGATCCGC-CGTCTGCGTCTCA-3Ј, 3Ј-GCAGTAACTTTCCAAGACCTCATC-5; GLP-1R: 5Ј-AGTAGTGTGCTCCAAGGGCAT-3Ј, 3Ј-AAGAAAGT-GCGTACCCCACCG-5Ј;18S ribosomal RNA: 5Ј-ATGCTCTTAGCT-GAGTGTCCCG-3Ј, 3Ј-ATTCCTAGCTGCG GTATCCAGG-5Ј. The results were normalized to 18S rRNA levels."}, {"section_title": "Western blot and immunoprecipitation of GIP-R or GLP-1R.", "text": "Rat or human islets were cultured in RPMI containing 5, 11, or 22 mM glucose for up to 24 h and lysed for Western blot or immunoprecipitation analysis of GIP-R and GLP-1R (44) . Some islets were first cultured in 5 mM glucose with MG-132, lactacystin, or vehicle for 2 h. Then the incubation continued for a total of 20 -24 h with various glucose concentrations. For Western blot analysis, islet lysates were separated by 8% Tris-SDS-PAGE and transferred to polyvinylidene difluoride (PVDF) membranes (Invitrogen). The PVDF membrane was blocked for 1 h using 5% nonfat milk in TBS-T (Tris buffer ϩ 1% Tween) buffer and blotted with the primary antibodies to GIP-R (1:100), GLP-1 R (1:100), or ␤-actin (1:1,000) overnight at 4°C. Horseradish peroxidase-linked secondary antibodies (1:5,000) were added for 1 h, and then ECL reagents were used for detection. Quantitation of the images was performed with ImageQuant v. 1.2 (Molecular Dynamics). For immunoprecipitation experiments, equal numbers of rat islets (260) and human islets (400) were exposed to to 5, 11, or 22 mM glucose for 4, 8, 16, or 24 h; then the islets were lysed in 200 l of ice-cold immunoprecipitation assay buffer, containing 50 mM Tris⅐HCL, pH 8.0, 150 mM NaCl; 1% (vol/vol) NP-40, 0.5% (wt/vol) SDS; 5 g/ml leupeptin, and 0.1 mM PMSF and supplemented with a protease inhibitor cocktail. These islets were usually lysed for 30 min on ice and then centrifuged at 14,000 rpm for 15 min to remove cell debris. The cell lysates were immunoprecipitated at 4°C overnight with rabbit anti-GIP-R antibody (1:100) or rabbit anti-GLP-1R antibody (1:100) plus 50 l of washed slurry agaroselinked protein G beads. Parallel control immunoprecipitations were carried out with normal rabbit IgG in all our experiments. The complexes were recovered by centrifugation at 4°C and washed twice with ice-cold lysis buffer and twice with ice-cold wash buffer. Bound antigen was eluted by boiling the beads in 1ϫ SDS-PAGE sample buffer for 10 min. The complexes were resolved by SDS-PAGE, transferred to PVDF membrane, and examined by Western blot using anti-ubiquitin monoclonal antibody (1:100).\nStatistical analyses. Results are expressed as means Ϯ SE. Data from multiple groups were analyzed using one-way ANOVA; Data from two groups were compared with an unpaired t-test. P Ͻ 0.05 was considered statistically significant."}, {"section_title": "RESULTS", "text": "Intracellular cAMP formation and insulin secretion in rat islets. We first examined whether glucose concentration impacts rat islet intracellular cAMP levels and insulin secretion over short (1 h ) and long (20 -24 h) periods of culture. GIP (10 nM) induced cAMP formation and insulin secretion in a glucose-dependent manner in freshly isolated islets ( Fig. 1 A and B) . Even in 5 mM glucose, GIP increased cAMP formation approximately twofold (from 4.17 Ϯ 0.33 to 8.69 Ϯ 1.78 fmol/islet, P Ͻ 0.05), whereas in 11 and 22 mM glucose, there was a therefold increase in response to GIP [5.13 Ϯ 0.09 (11 mM glucose alone) vs. 15.38 Ϯ 1.90 (11 mM glucose ϩ GIP), 6.23 Ϯ 0.89 (22 mM glucose) vs. 17.36 Ϯ 1.30 (22 mM glucose ϩ GIP) fmol/islet]. Although there was a tendency for increasing the glucose alone to increase cAMP levels, this was not statistically significant in three separate islet experiments (Fig. 1A) . Glucose increased insulin secretion in a concentration-dependent manner, and addition of GIP to each glucose concentration further increased insulin secretion ϳ1.6-fold above that achieved with glucose alone (Fig. 1B) .\nWhen rat islets were cultured in Ն11 mM glucose for 20 -24 h, there was no cAMP increase in response to GIP (Fig. 1C) . Additionally, insulin secretion in response to both glucose and GIP was blunted (Fig. 1D) . Only in islets maintained in 5 mM glucose was there a significant increase in cAMP formation (P Ͻ 0.05) and insulin secretion (P Ͻ 0.01) in response to GIP."}, {"section_title": "Intracellular cAMP formation and insulin secretion in human islets.", "text": "We next examined the impact of increasing glucose concentrations on human islets to see whether responses were similar to thiose of rat islets. GIP induced cAMP formation and insulin secretion in a glucose-dependent manner in human islets 2-3 days postisolation that had been maintained in 5 mM glucose (Fig. 2, A and B) . In 5 mM glucose, GIP increased cAMP formation approximately fourfold (from 2.53 Ϯ 0.77 to 10.71 Ϯ 1.7 fmol/islet, P Ͻ 0.01), and in islets in 11 and 22 mM glucose for just 1 h, intracellular cAMP levels were increased three-and fourfold, respectively (5.72 Ϯ 0.55 vs. 18.35 Ϯ 2.43 and 5.01 Ϯ 1.00 vs. 20.59 Ϯ 1.44 fmol/islet) by GIP. When human islets were cultured in Ն11 mM glucose for 24 h, there was no cAMP increase in response to GIP (Fig. 2C) . As islets appeared responsive to glucose and GIP only when cultured in 5 mM glucose, in one set of islets we sought to further investigate the veracity of this finding (Fig. 2, D and E) . Islets were cultured in 5, 11, or 22 mM glucose for 24 h. Then, five islets from each culture condition were individually handpicked and placed into new Eppendorf tubes. They were then subjected to increased glucose concentration for 1 h with or without GIP for the last 30 min. Only islets cultured for 24 h in 5 mM glucose showed increased cAMP formation (P Ͻ 0.05) and insulin secretion (P Ͻ 0.05) in response to GIP and glucose (Fig. 2, D and E) .\nTo ascertain whether Ն11 mM glucose for 24 h had a global effect on adenylyl cyclase activity, we treated human islets with forskolin (10 M), an adenylyl cyclase activator. Regardless of the glucose concentration or the time islets were in the presence of glucose (1 h, Fig. 3A or 24 h, Fig. 3B ), cAMP levels increased in response to forskolin. GLP-1R activation, similar to GIP-R activation, induces insulin secretion in a cAMP-dependent manner. Islets cultured in Ն11 mM glucose for 24 h still responded to the GLP-1R agonist EX-4, in that it induced a clear increase in cAMP levels (Fig. 3C ) and insulin secretion (data not shown). To eliminate any osmotic effects of glucose, human islets were cultured for 24 h in 5 mM glucose or 5 mM glucose plus 15 mM 2-deoxy-D-glucose and then stimulated with 10 nM GIP. Intracellular cAMP increases were similar with both sugars (data not shown). We also cultured human islets in 5 mM glucose in the presence or absence of 10 nM GIP for 24 h. We then manually pipetted the islets into fresh RPMI with 5 mM glucose and stimulated one-half of them with GIP (10 nM). cAMP levels still significantly increased in response to fresh GIP (data not shown).\nmRNA expression of GIP and GLP-1R. The mRNA expression levels of GIP and GLP-1R in isolated rat islets were assessed. Similar expression was found whether the islets were cultured for 20 h in 5 or 11 mM glucose (Fig. 4A) , thus indicating that the transcription of the GIP-R gene was not compromised by exposure to high glucose. The modest increased GIP-R mRNA that we observed with 11 mM glucose was not statistically significant (n ϭ 5). The relative mRNA expression of the GIP-R was quantified as 1.45 Ϯ 0.65 for 5 mM glucose and 2.89 Ϯ 1.47 for 11 mM glucose and that of the GLP-1R was 3.43 Ϯ 1.33 and 5.42 Ϯ 1.97 for 5 and 11 mM glucose, respectively (Fig. 4B) .\nGIP-R protein expression in rat and human pancreatic islets. By Western blotting, GIP-R protein expression was decreased 67 Ϯ 2% in rat islets that were cultured in 11 mM glucose compared with culturing in 5 mM glucose for 20 -24 h (Fig. 5, A, B , and E, P Ͻ 0.01), but the intensity of the GLP-1R protein expression was the same with both glucose concentrations (Fig. 5, C, D, and F) .\nA similar phenomenon was found in human islets. GIP-R protein expression was significantly reduced (60 Ϯ 8%) in human islets that were exposed to Ն11 mM glucose for 24 h Fig. 2 . cAMP formation and insulin secretion in human islets. Human islets were incubated in glucose, as labeled, for 1 h on arrival (A and B) or for a further 24 h (C, D, and E). GIP (10 nM) or vehicle was then added for a further 30 min. Intracellular cAMP levels (A, C, and D) and insulin secretion (B and E) were then measured. Intracellular cAMP levels (D) and insulin secretion (E) in human islets that were cultured in glucose for 24 h (top-labeled glucose concentrations), and then 5 islets from each group were individually hand-picked and subjected to glucose (bottom-labeled glucose concentrations), GIP, or vehicle for 1 h. Results are expressed as means Ϯ SE (results shown in A, B, and C are from 3 independent islet preparations; results shown in D and E are from a single islet preparation). *P Ͻ 0.05 and **P Ͻ 0.01 GIP vs. corresponding vehicle group; #P Ͻ 0.05 and ##P Ͻ 0.01 vs. 5 mM glucose ϩ GIP treatment group;^^P Ͻ 0.01 vs. 5 mM glucose ϩ vehicle group. compared with those exposed to 5 mM glucose for 24 h (Fig. 6 , A and C, P Ͻ 0.01), but GLP-1R expression was not altered under the same conditions (Fig. 6, B and D) ."}, {"section_title": "Mechanisms of GIP-R downregulation.", "text": "To test the hypothesis that GIP-R was being continuously degraded when islets were exposed to high glucose for a prolonged period, we investigated whether GIP-R in rat and in human islets were being ubiquitinated. We found that glucose at Ն11 mM caused GIP-R ubiquitination as early as 4 h in rat islets (2.5-fold increase compared with 5 mM glucose; Fig. 7A : 173,570 Ϯ 3,226 vs. 429,796 Ϯ 5,768, 5 vs.11 mM glucose). After rat islets were exposed to Ն11 mM glucose for 8 h, the ubiquitintargeted GIP-R level was increased about sevenfold compared with that in 5 mM glucose (Fig. 7A , P Ͻ 0.001: 72,531 Ϯ 3,195 vs. 520,427 Ϯ 5,773 arbitrary units, 5 vs. 11 mM glucose). 11 mM glucose increased Ub-GIP-R 2.7-fold at 16 h (191,185 Ϯ 3,701 vs.518,133 Ϯ 17,547 arbitrary units, 5mM glucose vs.11 mM glucose). Even cultured in 5 mM glucose, some GIP-R ubiquitinization in freshly isolated rat islets was observed by 16 h (Fig. 7B) . In Fig. 7C , 11 mM glucose increased rat islet Ub-GIP-R threefold at 24 h (226,832 Ϯ 30,804 vs. 714,081 Ϯ 107,461 arbitrary units, 5 vs. 11 mM glucose). In parallel experiments of rat islets isolated at the same time, we compared GIP-R and GLP-1R ubiquitination (Fig. 7, C and D) : GLP-1 R in rat islets was not ubiquitinated after 24 h in high glucose (n ϭ 3-5 separate islet preparations).\nGIP-R ubiquitination level in human islets was also increased after culturing in Ն11 mM glucose for 24 h. There was threefold (11 mM glucose, 24 h) and fivefold (22 mM glucose, 24 h) more ubiquitinated GIP-R compared with 5 mM glucose, respectively ( Fig. 7E, P Fig. 7F ; n ϭ 3 separate islet preparations).\nWe next treated rat islets with the reversible proteasomal inhibitor MG-132 or with the irreversible proteasome inhibitor lactacystin. Optimal concentrations for both compounds were first determined. Both inhibitors were added to islets that were maintained for 2 h in 5 mM glucose before the addition of more glucose to reach a final concentration Ն11 mM glucose in some of these islets. MG-132 (10 and 50 M) and lactacystin (10 and 30 M) rescued the glucose-mediated reduction in GIP-R expression (Fig. 8A) . GIP-R immunoprecipitates from rat islets that were cultured in 5 or 11 mM glucose for 20 h, and with the proteasome inhibitor MG-132, showed similar amounts of GIP-R ubiquitination (Fig. 8B) . No ubiquitin signal was observed when control immunoprecipitations were carried out with normal rabbit IgG (data not shown). Most importantly, isolated rat islets cultured in 11 mM glucose with the proteasome inhibitor MG-132 (10 M) for 24 h still possessed the ability to significantly increase cAMP levels in response to GIP (Fig. 8C , P Ͻ 0.05 vs. vehicle control)."}, {"section_title": "DISCUSSION", "text": "Here, we show that GIP-induced cAMP production is significantly decreased in islets cultured in glucose levels in the diabetic range of '11 mM glucose for 20 -24 h. The reduction in GIP-R protein expression in islets cultured in this manner seems specific for the GIP-R. In islets cultured for 24 h in Ն11 mM glucose, cAMP could still be generated in response to forskolin and EX-4. Therefore, the defect in GIP signaling was not due to a global effect of high glucose on adenylyl cyclase activity. These results are also in agreement with previous in vivo observations, which show that type 2 diabetes is accompanied by defective insulinotropic response to GIP but not to GLP-1 (41) . It has often been postulated that GIP itself induces homologous desensitization of the GIP receptor, but depending on the study, plasma levels of GIP in type 2 diabetes have been reported to be increased (9) , not changed (8) and decreased (45) . We checked plasma levels of GIP in response to oral glucose in newly diagnosed diabetic patients in the Baltimore Longitudinal Study of Aging and found that plasma levels of GIP were similar to those in nondiabetic subjects (49) . So we concluded that it is hyperglycemia and/or its metabolic consequences, and not elevated GIP plasma levels, that lead to the well-described unresponsivity of ␤-cells to exogenous GIP. This is also in line with what has been shown in diabetic fatty Zucker rats, in which plasma levels of GIP were reported to be similar to leels in lean animals but the GIP-R expression and GIP-induced cAMP responsivity of islets were, respectively, greatly diminished and absent (30) . The same authors also subsequently reported that perfused pancreata from lean rats rendered hyperglycemic at 25 mM plasma glucose levels for 6 h prior to exposure to GIP (25 pM) also did not have an insulinotropic response and had reduced GIP-R expression (31).\nXu et al. (54) recently showed also that hyperglycemia per se impacted incretin receptor expression by using two models of hyperglycemia: 90% pancreatectomy as well as glucose challenge in rats (96 h) and rat islets (48 h). They found that isolated islets exposed to Ն10 mM glucose for 48 h had reduced mRNA levels of GLP-1R but increased GIP-R mRNA levels. They did not, unfortunately, study protein levels of the receptors under the same conditions. We found similar results to theirs as regards GIP-R mRNA levels: a tendency toward increased GIP-R expression with Ն11 mM glucose that did not quite reach statistical significance. However, our treatment schedule was for 24 h, and therefore most likely there would have been significant differences with a longer incubation time. Their contrary results to ours as regards GLP-1R expression may also be a time-of-exposure issue.\nOur data indicate for the first time that GIP-R is ubiquitinated and that this likely leads to degradation of the targeted GIP-R. Even in 5 mM glucose the GIP-R seems susceptible to ubiquitination over time. However, with glucose levels in the D) . Results are expressed as means Ϯ SE (n ϭ 7 separate islet preparations, ***P Ͻ 0.001). Fig. 6 . Western blot analysis of GIP-R and GLP-1R protein expression in human islets. GIP-R (A) and GLP-1 R (B) protein expression in whole cell lysates of human islets that were cultured in glucose, as labeled, for 24 h. Protein expression levels of GIP-R (C) and GLP-1 R (D) were normalized to ␤-actin. Results are expressed as means Ϯ SE (n ϭ 3 separate islet preparations, **P Ͻ 0.01).\ndiabetic range the degree of ubiquitination is increased and the speed of ubiquitination is accelerated. Therefore, we propose that GIP-R is regulated, at least partially, by the MVB-sorting pathway in islets, that it is degraded and not recycled following prolonged exposure of islets to glucose in the diabetic range, and that this explains the profound decrease in GIP-R levels seen after several hours of exposure to elevated glucose levels. The facts that the cAMP response was restored and GIP-R protein expression was preserved by the presence of proteasome inhibitors MG-132 and lactacystin (4, 26, 28) in islets exposed to high glucose support this assertion. Ubiquitination targets membrane proteins for degradation, and it is the foremost signal in the MVB sorting pathway, a conserved system that is present from yeast (15) to mammals (12) and plays a major role in many basic cellular functions (22) . Polyubiquitinated proteins that have specific sequences or trans-acting components for targeting are usually degraded (6) . The downregulation of transmembrane proteins such as tyrosine kinase and G protein-coupled receptors has been proposed to occur by endosomal or lysosome-mediated degradation (22, 28, 47) . Proteasomal inhibitors (e.g., MG-132 and lactacystin) act at the level of these structures, thus preventing degradation of ubiquitinated proteins that are ferried from the plasma membrane. Consequently, these compounds also prevent deubiquitination of the formerly targeted proteins, resulting in their accumulation inside the cell and depletion of free ubiquitin molecules or chains (14, 24) . The G protein-coupled receptors regulating mechanisms (5, 20) were described in muscarinic M 1 , M 3 , and M 5 receptors (25), as well as in the receptors for GnRH (42) . The MVB-sorting pathway is a complex system with a large number of different signals and components. Even though several aspects of this sorting pathway have been identified, there are still important questions related to upstream and downstream ubiquitination pathways that remain unsolved.\nThe synthesis of GIP receptors is not likely to be altered by high glucose, as mRNA levels were not decreased when assessed by quantitative PCR. This contrasts with the results of a previous study showing that hyperglycemia and its metabolic consequences caused a reduction in GIP-R mRNA and protein levels in lean Zucker rats (31) . The disparity with our findings might be explained by some genetic susceptibility of the Zucker strain or the use of a different control gene. Herein, 18S rRNA was selected as a control because its measurement seems to be very accurate according to recent publications that evaluated real-time RT-PCR techniques (1) .\nOur data introduce a new concept to downregulation of receptors on ␤-cells; the metabolic state results in GIP-R ubiquitination in a ligand-independent manner. In general, ubiquitin is covalently bound to target proteins by linkage between the carboxy glycine of ubiquitin and usually the ε-amino group of lysine in the target protein (39) . In some proteins, polyubiquitination may occur at the amino-terminal residue (7) . There are three lysines in the intracellular portion of the rat GIP receptor, of which Lys 250 is the most likely to be ubiquitinated. Preceeding this lysine is a potential serine phosphorylation motif, 246 Arg-Arg-Ser-Glu 249 , that may be either a cAMP-dependent protein kinase A (PKA) or PKC motif. This motif shows a highly significant serine phosphorylation prediction, using the neural network phosphorylation predictor NetPhos 2.0 (Technical University of Denmark). Despite this sequence's difference to the canonical PKA phosphorylation motif, i.e., Arg/Lys-Arg/Lys-X-Ser/Thr, similar Arg/Lys-Arg/ Lys-Ser/Thr motifs in the proteins RFX-5 and Wee-1 have been shown, using mass spectrometry, to be direct PKA phosphorylation sites (17) . We propose that PKA activity (and also PKC activity, as it has been shown to be elevated in many tissues, i.e., kidney, in the diabetic state) is slightly increased in the presence of elevated glucose, as glucose itself causes a slight increase in intracellular cAMP levels. cAMP-mediated activation of PKA may then lead to a subsequent phosphorylation of the receptor. Although GIP treatment alone (in 5 mM glucose for 24 h) did not result in increased ubiquitination of the GIP-R, it is possible that glucose-mediated ubiquination would have been accelerated by GIP itself in high glucose; this remains to be tested when we receive more human islets. Ubiquitination of several receptors has been shown to be highly dependent on their stoichiometric Ser/Thr phosphorylation (16, 33) . Mutagenic removal of these Ser/Thr phosphorylation sites resulted in an inability of the agonist stimulation to induce ubiquitination and eventual internalization (33) . These early studies of receptor ubiquitination indicated that, despite the coincidence of agonist-induced internalization and ubiquitination, the ubiquitination of the receptor was not involved in the sequestration process itself but was subsequently required for targeting of the internalized receptor to proteolytic lysosomes (50) . More recent data have implicated a role of ␤-arrestins in the receptor ubiquitination process. Hence, Shenoy et al. (46) demonstrated that ubiquitination of the ␤ 2 -adrenergic receptor could be mediated by its interaction with a multiprotein complex including ␤-arrestin and the E3-ubiquitin ligase mdm2. In this scenario, agonist stimulation results in receptor phosphorylation by PKA and G proteincoupled receptor kinases, causing the subsequent uncoupling from G s ␣ and the binding of a ␤-arrestin-mdm2 complex. The receptor and also the arrestin subsequently become ubiquitinated, thus facilitating a rapid downregulation of the receptor.\nIt is of interest for our experimental paradigm that elevated intracellular cAMP levels have also been shown to actually potentiate the expression of ␤-arrestin in multiple cell types (18) . ␤-Arrestin molecules have previously been shown by Gurevich et al. (13) to possess the capacity to interact stably with phosphorylated receptors. In addition, recent evidence has specifically demonstrated that PKA-mediated phosphorylation may be sufficient to induce ␤-arrestin association with G protein-coupled receptors (23) . This phosphorylation-dependent association of ␤-arrestin with the GIP-R may thereby facilitate a mechanism by which mdm2 could induce ubiquitination of the GIP-R in response to high glucose levels. Also, as stated previously, it is considered that ubiquitination may not be of specific importance for receptor sequestration but controls subcellular trafficking. This aspect of receptor posttranslational modification then allows the possibility that there may still be GIP receptors present at the plasma membrane surface in type 2 diabetic patients; these receptors consequently may be tonically associated with ␤-arrestin and therefore unable to induce G s ␣ activation in response to GIP. GLP-1R localizes in lipid rafts and interacts with caveolin-1. This interaction is necessary for GLP-1R's normal functions. However, considering recent growing evidence of non-G protein-mediated receptor signaling (34) , it is possible that the extant GIP-R are still functional and activate transduction pathways other than G s ␣. Reinforcing this, data have been generated that indicate that PKA phosphorylation of the intracellular loops of G protein-coupled receptors can deleteriously affect their affinity for G s ␣ and even elevate their affinity for G i ␣ (10, 43) . Under these proposed scenarios, GIP-R agonists, unlike GLP-1R agonists, are unlikely to ever be useful in increasing insulin secretion in type 2 diabetes.\nIn summary, we have shown that there is a glucosedependent downregulation of the GIP-R in vitro that could explain the defective response to GIP that is seen during GIP infusions in diabetic patients. It is probable that hyperglycemia triggers the association of GIP-R and ubiquitin ligase complexes and stimulates several cellular responses whose aims are to maintain cell homeostasis and to adapt to this new metabolic demand. Therefore, similar changes might occur in other cells that are sensitive to hyperglycemia, and they might be relevant for the pathogenesis of certain complications in diabetes. Fig. 8 . Effect of proteasomal inhibitors in rat islets. A: rat islets were cultured in glucose, as labeled, without or with MG-132 or lactacystin for 2 h followed by 20 h incubation in 11 mM glucose. Whole cell lysates were probed with anti-GIP-R antibody, and ␤-actin was used as loading control. Representative blot is shown (n ϭ 3 separate islet preparations). B: MG-132 (10 M) was added to islets cultured for 6 h followed by 20-h incubation in glucose concentrations as labeled. GIP-R immunoprecipitates were reblotted with ubiquitin antibody. Representative blot is shown (n ϭ 3 separate islet preparations). C: cAMP formation in rat islets that were cultured in 11 mM glucose with or without MG-132 (10 M) for 2 h followed by 24-h incubation in 11 mM glucose. GIP (10 nM) or vehicle was then added to the cultures for 30 min. Results are expressed as means Ϯ SE (n ϭ 3 separate islet preparations, *P Ͻ 0.05)."}]