[{"section_title": "", "text": "Our role as a provider of innovative data products was substantially enhanced in 2008 with the move of the Longitudinal Employer-Household Dynamics (LEHD) program to CES. Through the unique federal-state Local Employment Dynamics partnership, LEHD maintains a nearly universal quarterly national job frame (quarterly observations of workers linked to employers) based on state administrative records linked to census, survey, and other administrative data housed at the Census Bureau. From this, LEHD produces several public-use products including the Quarterly Workforce Indicators (QWI) and OnTheMap, which is described in more detail in Chapter 2 of this report. This past year also saw the introduction of the Business Dynamics Statistics (BDS), a public-use product developed from CES's confi dential Longitudinal Business Database. Chapter 3 contains more information on the rich information about life cycle dynamics of U.S. businesses contained in the BDS. The existence of these popular products owes much to perhaps the most crucial function CES plays within the U.S. federal statistical system-providing secure and authorized researcher access to confi dential statistical microdata. Results obtained by researchers working at CES and the Census Bureau's RDCs, some dating as far back as the 1980s, inspired and informed the development of the QWI, OnTheMap, BDS, and other products. In fact, much of the current research on enhancing and developing these and other new products is carried out in the RDCs. The RDCs are operated as joint partnerships between the Census Bureau and leading research institutions. Through the RDCs, researchers with approved projects can access the Census Bureau's rich data infrastructure. The RDCs are a cost-eff ective way for the Census Bureau to leverage internal resources. Using RDCs significantly enhances its analytical and methodological capabilities by accessing external expertise. An excellent example of the benefi ts of accessing external expertise is given in Chapter 4 of this report. Chapter 4 describes methods to improve income distribution statistics generated from the Current Population Survey. Additional examples of the research conducted through the RDC network are given in this and previous CES Annual Reports and on our Web site <www.ces.census.gov>. Our RDC partners benefi t through their ability to provide their faculty and students with an unparalleled resource for applied social science research. More and more, we see RDCs used to attract talented faculty to universities with access to a RDC. I am pleased to report that the RDC network will soon be adding two nodes. First, we will be establishing a new RDC at the University of Minnesota. Second, the RDC at the University of California at Berkeley will open a branch lab at Stanford University. Branch RDCs are a new development. They are satellites of existing RDCs and share resources with the primary RDC. Branches are to be located near a signifi cant number of users and potential users that face signifi cant costs in commuting to the existing RDC, but close enough to the existing RDC to permit sharing resources, such as faculty advisors and RDC administrators. Branch RDCs are one way that the Census Bureau and its RDC partners strive to expand authorized access while keeping costs low. Finally, I want to thank all those who contributed to this report. First and foremost, I want to thank B.K. Atrostic and Cheryl Grim, who compiled and edited nearly all the material in the report. I thank also the many other contributors, from both within and outside the Census Bureau, listed in the acknowledgments section of the inside cover page. The challenges facing our nation require high-quality information about its economy and people. A key Census Bureau objective is: \"Meet the needs of policymakers, businesses, nonprofi t organizations, and the public for current measures of the U.S. population, economy, and governments\" (U.S. Census Bureau, 2007). The Center for Economic Studies (CES) supports this objective by producing fundamental research and innovative data products."}, {"section_title": "CES creates new research results", "text": "and data by developing and applying cutting-edge techniques to existing data. Using existing data is cost-eff ective because it leverages the significant investments already made by the Census Bureau, other agencies whose data we use, and respondents. INTRODUCTION"}, {"section_title": "B.K. Atrostic, Center for Economic Studies", "text": "Text Box 1-1."}, {"section_title": "WHAT IS A RESEARCH DATA CENTER (RDC)?", "text": "RDCs are Census Bureau facilities staff ed by a Census Bureau employee that meet all physical and computer security requirements for access to confi dential data. At RDCs, researchers from academia, federal agencies, and other institutions with approved projects receive restricted access to Census Bureau data fi les that are not publicly available. Th e Center for Economic Studies (CES) judges each proposal against fi ve standards: • Potential benefi ts to the Census Bureau. • Scientifi c merit. • Clear need for restricted data. • Feasibility with data available in the RDC system. • No disclosure risk. Proposals meeting these standards are reviewed by the Census Bureau's Offi ce of Analysis and Executive Support. Proposals approved by the Census Bureau may also require approval by the federal agency sponsoring the survey or supplying the administrative data. Researchers must become Special Sworn Status (SSS) employees of the Census Bureau. Like career Census Bureau employees, SSS employees are sworn for life to protect the confi dentiality of the data they access. Failing to protect confi dentiality subjects them to signifi cant fi nancial and legal penalties. The RDC system and the CES proposal process are described in detail on the CES Web site <www.ces.census.gov>. Selected confi dential data from the Agency for Healthcare Research and Quality (AHRQ) and the National Center for Health Statistics (NCHS) can be accessed in the RDCs. Proposals must meet the requirements of AHRQ (AHRQ, 2009) or NCHS (NCHS, 2009). made public without state-ofthe-art disclosure avoidance techniques created through partnering with RDC researchers. The BDS build on the results of years of CES and RDC research. Current research and development of OnTheMap, the BDS, and other new products is carried out at CES and in the RDCs. Data underpin all CES products and research results. This report emphasizes new CES public-use data products and improvements in the quantity and quality of data available to researchers at CES and the RDCs. Our new data products and growing research program are recognized within and outside the Census Bureau and by organizations around the world."}, {"section_title": "NEWS LEHD Joins CES", "text": "In March 2008, the LEHD program joined CES, which comes almost a decade after LEHD was fi rst established in late 1998. LEHD brings with it expertise in an extensive array of business and household data and in state-of-the-art disclosure protection techniques. We welcome the talent of LEHD's research and production staff s and look forward to working with our new colleagues. The move adds LEHD's innovative data products to the CES portfolio. LEHD produces them through its relationship with the Local Employment Dynamics (LED) partnership. The LED partnership expanded in 2008 to include 50 of a potential 53 state partners (the District of Columbia, Puerto Rico, and the Virgin islands are eligible partners). We are working with LEHD and its state partners to improve and grow this important program."}, {"section_title": "Wide Recognition for CES and RDC Research", "text": "CES and RDC research was published in major journals, including the American Economic Review, the Journal of Political Economy, and Economic Perspectives. Our research also appeared in fi eld journals in a range of disciplines, such as the Journal of Agricultural Economics, the Journal of Ethnic and Migration Studies, Labour Economics, and the Journal of Urban Economics. CES researchers presented new fi ndings on private equity fi nancing at a major venue, the 2008 World Economic Forum at Davos, Switzerland, and at several conferences during the course of 2008. New research based on the same data was presented at the 2009 World Economic Forum."}, {"section_title": "Awards and Recognition for LEHD Public-Use Data Products", "text": "Two LEHD public-use data products received awards and recognition. Older Worker Profi le. The Older Worker Profi le series covers the employment history and characteristics of older workers and their employers, while preserving the confi dentiality of the underlying responses. Cited as \"an innovative use of a unique new data source,\" the series will be included in the Recognition of Excellence in Aging Research Committee report (U.S. Senate, 2009). OnTheMap. OnTheMap was cited in the 2008 Economic Report of the President as an example of the Census Bureau's eff orts to improve the usefulness of the data it collects while protecting the confi dentiality of respondent information (see Text Box 1-2). OnTheMap was 1 of 4 featured papers on U.S. statistical innovations at a United Nations seminar, \"Innovations in Offi cial Statistics,\" held in February 2009. Text Box 1-2."}, {"section_title": "RECOGNITION FOR ONTHEMAP", "text": "\"Government agencies strive to improve the usefulness of their data products by providing greater detail while protecting the confi dentiality of respondents … The Census Bureau creates synthetic data to obscure the underlying demographic data used in its 'On the Map' feature. This feature creates maps showing commuting patterns and workforce data-where people live and work by age, earnings, and industry-for geographic areas selected by the user.\" Source: Economic Report of the President (Executive Offi ce of the President, 2008)."}, {"section_title": "Bronze Medal for New Disclosure Avoidance Module", "text": "Central to assuring the confi dentiality of respondent information is the clearance of statistical output; a process known as disclosure avoidance review."}, {"section_title": "CES Disclosure Offi cer Arnold", "text": "Reznek, Lead RDC Administrator Lynn Riggs, and Special Assistant for Systems Support Bill Yates developed a new Disclosure Avoidance Review Tracking System (DARTS) module for the CES proposal management system. DARTS is a Web-based module providing an effi cient way to assign and track clearance requests from RDC researchers. The three DARTS developers received the Census Bureau Bronze Medal, the highest honor the Census Bureau can award. DARTS was cited for resulting in more eff ective and effi cient management systems. It reduces administrative burden for RDC researchers and CES project administrators while providing transparency and accountability."}, {"section_title": "Mentorship Program", "text": "Developing an intellectual network of researchers trained in using Census Bureau data improves our research and data products. Many graduate students who worked as research assistants on RDC projects have themselves become RDC researchers after beginning their professional careers. In 2008, CES instituted a formal mentorship program to assist graduate students actively engaged in dissertation research in economics or a related fi eld at an RDC. CES assigns staff economists as mentors. Participants receive additional mentoring through invitations to visit CES, where they can meet CES researchers and present research. Two Ph.D. students are participating in the new program. More information is available at the CES Web site <www.ces.census .gov>."}, {"section_title": "Strengthened Partnership for Research Using Household Data", "text": "To better support projects using household data, CES devoted signifi cant resources over the last few years to improving documentation. Dr. John Iceland, then of the University of Maryland, developed documentation for the March supplement to the Current Population Survey (CPS) (now the Annual Social and Economic Supplement [ASEC]) and the Survey of Income and Program Participation (SIPP). In 2008, RDC researchers received improved and consistent documentation for the 1967-2005 CPS fi les and the 1984-1990 SIPP fi les. Recognizing the benefi ts of RDC research to its programs, the Decennial Directorate of the Census Bureau committed to funding a CES staff position supporting projects using household data. Dr. Todd Gardner joined the CES Data Staff in 2008. Dr. Gardner, a historian, was previously with the Population Division of the Census Bureau. Dr. Gardner was responsible for bringing to fruition a longrunning project to make more internal historical decennial microdata fi les available to RDC researchers. The project is described in Chapter 5. CES appreciates the support of the Decennial Directorate and welcomes Dr. Gardner."}, {"section_title": "Strong and Growing Research Program", "text": "The CES research program is strong and growing. A few years ago, then-Chief Dan Weinberg noted that the RDC network was underutilized (Weinberg, 2006). For example, only 19 new projects began in 2005. Weinberg identifi ed potential reasons why. He also laid out steps CES was taking to increase the number of research projects with potential to both create \"state-of-theart, groundbreaking, publishable, high quality academic research\" and yield benefi ts to the Census Bureau. Those steps are bearing fruit. In 2008, over 40 new projects started, bringing the total number of active projects to more than 100. The number of active researchers grew to more than 400. Research increasingly spans multiple RDCs and involves both CES and RDC researchers. The RDCs at CES headquarters (in Suitland, Maryland), Chicago, Michigan, and Triangle are near capacity. More projects yield more products. More than 40 CES Discussion Papers were issued in 2008, a strong increase over the 33 papers issued in 2007. See Appendix 3. Researchers at CES and the RDCs published more than 40 professional papers in 2008, keeping pace with recent years. CES and RDC publications and working papers are listed in Appendix 1."}, {"section_title": "CES researchers helped organize and participated in a major international conference in 2008. Lucia Foster and Shawn Klimek of CES served on the Scientifi c", "text": "Committee that selected participants to the eighth Conference on the Analysis of (micro) Economic Data (CAED). CAEDs bring together U.S. and international researchers who conduct similar research using enterprise microdata. The May 2008 CAED was held in Budapest, Hungary. Ron Jarmin participated in the opening plenary session. CES researchers presented 11 papers, often jointly with RDC researchers."}, {"section_title": "Ron Jarmin and Shawn Klimek serve on the Executive and", "text": "Text Box 1-3."}, {"section_title": "CES PARTNERS", "text": "The Center for Economic Studies (CES) relies on networks of supporters and partners within and outside the Census Bureau. Our primary partners are listed below. All of our partners make vital contributions and we thank all of them. Census Bureau business and household program areas. CES and the Research Data Centers (RDCs) receive ongoing help from many areas of the Census Bureau producing business and household data. That help takes many forms, including: • Microdata- • Additions and expansions of data available to RDC researchers in 2008 are listed in Appendix 4. • Census Bureau business and household datasets that are part of the LEHD data infrastructure. • Expert knowledge of the collection and processing methodologies underlying the microdata. • Reviews of RDC research proposals, particularly for household data. RDC partners. CES currently operates nine RDCs around the country in partnership with a growing roster of prominent research universities and nonprofi t research organizations. Our RDC partners are recognized in Appendix 5. LEHD partners. The LEHD program produces its public-use data products through its LED partners. Partners as of October 2008 are acknowledged in Appendix 6. Other Census Bureau partners. Colleagues in the Economic Directorate's Administrative Staff who provide administrative support to CES are recognized in Appendix 7. CES also benefi ts from colleagues in several other Census Bureau divisions who support our computing infrastructures. Conference Planning Committees for upcoming CAED conferences planned for: • Tokyo, October 2-4, 2009. • San Francisco, fall 2010. • Germany, spring 2012. More information on past and future CAED conferences is available at the CAED Web site <www.ces.census.gov/index .php/caed/caedhome>."}, {"section_title": "PARTNERS AND SUPPORTERS", "text": "CES relies on the support of Census Bureau and external partners. Our formal partners are recognized in Text Box 1-3."}, {"section_title": "REPORT OVERVIEW", "text": "This year's report focuses on data-new data for use by CES researchers and new publicuse products they developed. Creating the new data and products required strong and long-standing partnerships with other parts of the Census Bureau, RDC researchers, and academic institutions. Two new public-use data products-OnTheMap and the BDShelp meet needs for current measures of the nation's economy and people. These products are described in Chapters 2 and 3. Data from the LEHD program are a major addition to the stock of data available to RDC researchers. Those data, from the same complex data infrastructure underpinning the new OnTheMap product, are described in Appendix 4. RDC research improved income measures in the public-use CPS. Users now have income measures with distributions closer to offi cial measures produced from the internal fi le. That research is presented in Chapter 4. We doubled the decennial census data available. Data for 1970 and 1980 were added to the data for 1990 and 2000 already available. The new data and their improved documentation are described in Chapter 5. All of the Census Bureau data series added or expanded in 2008 are listed in Appendix 4. CES has identifi ed sources for decennial census data for years before 1960 and for manufacturing data that could go as far back as 1820. Chapters 5 and 6 describe these data and the steps needed to make them usable by researchers. CES does not have the resources needed to recover and develop these data. Researchers interested in partnering with CES should contact the CES Assistant Division Chief for Research, Lucia Foster, at <Lucia.S.Foster@census.gov>. Chapter 2."}, {"section_title": "ONTHEMAP: AN INNOVATIVE MAPPING AND REPORTING TOOL", "text": ""}, {"section_title": "Matthew Graham, Center for Economic Studies", "text": "As government economic policy and private business planning increase in importance, key questions about the workforce are reiterated at local, regional, and national levels: • Where are the jobs? • How far do workers live from their jobs? • What industries are employing an area's workers? • How are these factors changing over time? OnTheMap, a free, publicly accessible Web application from the U.S. Census Bureau, can answer those questions directly. It provides information on jobs and workers in the United States at an unprecedented level of geographical detail. OnTheMap makes use of administrative records, censuses, and surveys to produce a vast longitudinal dataset of jobs and workers in the United States. The data system that supports OnTheMap uses cutting-edge synthetic data and noise infusion techniques to preserve analytical validity while protecting confi dentiality. Users of OnTheMap do not need any special knowledge of statistical or mapping software. Results are presented in easy-to-read maps and reports, for user needs (See Text Box 2-1). OnTheMap was developed through the Local Employment Dynamics (LED) Partnership between the Census Bureau and its state partners. This federalstate partnership creates a new, modern, collaborative, and costeff ective statistical system."}, {"section_title": "21ST CENTURY STATISTICAL NEEDS", "text": "Understanding the dynamics of our nation's economy and society requires 21st century statistical tools. Key features of the new tools are: • Flexible geographies. Current data in OnTheMap can be separated into two types: • Characteristic data-age, earnings, and the industry sector of workers. • Geographic data-the spatial relationship between residence and employment locations. Diff erent statistics on jobs and the workforce are available based upon whether a job is in the private sector and whether it is a worker's primary job. (Only the job with the highest earnings is considered to be a worker's primary job.) OnTheMap can perform analyses for specifi c segments of the workforce. The specifi c segments are: • Age-30 or younger; 31-54; and 55 or older. • Earnings-$1,200 per month or less; $1,201-$3,400 per month; and $3,401 per month or more. • Industry-goods producing; trade, transportation, and utilities; and all other services. Analyses can focus on areas of residence, areas of employment, or a combination of the two (i.e., those workers living in one town and employed in another). OnTheMap produces maps and concise summary reports. The maps show concentrations of employment or residences as well as spatial relationships between home and work (i.e., In what areas do those employed downtown live?). The reports present socioeconomic information on selected workers or summarize their distribution by geographic category (cities, counties, ZIP codes, etc.). Text Box 2-1."}, {"section_title": "ONTHEMAP VERSION 3", "text": "• Up-to-date information. • Easy interactive access and visualization. • Strict protection of respondent confi dentiality. These requirements are core design elements of LED's data system and of OnTheMap."}, {"section_title": "Flexible Geography", "text": "Statistics are often reported by standard geographic boundaries such as states and counties. However, standard geography may not conform to users' specifi c needs. Nor are all members of a geography set the same size. For example, the largest county in the United States is Los Angeles County, CA, with over 9 million people while the smallest is Loving County, TX, with fewer than 100 people. A 21st century data system needs data that can be aggregated to any desired geographic boundaries. OnTheMap's data are made available at the census block level, of which there are more than 8 million in the United States. Almost any analysis area can be built by aggregating the necessary census blocks in OnTheMap."}, {"section_title": "Up-to-Date Data", "text": "Each year the entire data series is updated with new annual data and any corrections or improvements in data or methodology. This means that users of OnTheMap are viewing the most current version of the data."}, {"section_title": "Easy Interactive Access and Visualization", "text": "Large and complex datasets can be diffi cult to access for users without specialized computer systems or knowledge. OnTheMap delivers a dataset with hundreds of millions of records through a simple, visual interface. Interacting with the map interface requires just a few clicks of a mouse. And only four basic steps produce an analysis. OnTheMap allows users to browse data, develop unique queries, customize data visualization, and interact with the data with fl exibility. OnTheMap also provides data in several forms that ease interpretation. Reports list detailed summary statistics, and map overlays show spatial distributions of jobs. The mapping patterns allow users to identify spatial clustering and other patterns that are not immediately obvious from tables of numbers."}, {"section_title": "Confi dentiality Protection", "text": "Whatever the potential use of a dataset, the data cannot be released without protecting respondents' confi dentiality according to federal and state laws. A long history of concerns about disclosure (Duncan et al., 1993;and U.S. Offi ce of Management and Budget, 2006) partly explain the relative lack of dynamic, detailed depictions of demographic or business statistics in maps. The actual data from the new LED system cannot be loaded directly into public-use applications like OnTheMap without adequate confi dentiality protection. To make OnTheMap possible, the Census Bureau develops and implements state-of-the-art disclosure avoidance methods. Synthetic data is one of those methods. OnTheMap is the fi rst partially synthetic data product publicly released by the Census Bureau. Wu and Abowd (2007) explain the synthetic data protection techniques applied to OnTheMap."}, {"section_title": "INNOVATIVE MAPPING FOR THE PUBLIC", "text": "OnTheMap provides a number of innovative features: • Customizable mapping interface. • Many standard geographies and user-customizable selection tools. • Characteristic maps and reports on selected jobs (by age, earnings, and industry sector). • Maps and reports that show spatial relations between home and work."}, {"section_title": "Customizable Map Interface", "text": "Users of OnTheMap can zoom and pan the map to focus on any local or regional area. In addition, the application makes available numerous reference layers which users can display and hide along with associated labels. These include political boundaries, roads, community colleges, and career centers. The basic map tools let users focus their analyses only on those areas of interest to them."}, {"section_title": "Standard and Custom Areas of Analysis", "text": "OnTheMap provides a number of standard geographic boundaries that can be used to aggregate the workforce data. Boundaries include cities/towns, counties, legislative districts, metropolitan/micropolitan areas, postal ZIP codes, workforce investment areas, census tracts, and tribal lands. In addition to the standard geographic boundaries, OnTheMap off ers a number of \"freehand\" selection tools. These tools let users interactively specify custom groupings of census blocks, such as business districts, hurricane and tornado paths, transportation corridors, and site location rings."}, {"section_title": "Characteristic Maps and Reports", "text": "OnTheMap's ability to report and map characteristic data of the workforce allows for the identifi cation of clusters of employment or residences. The selected workforce can be grouped by age (three categories), earnings (three categories), and industry (20 North American Industry Classifi cation System [NAICS] sectors or three industry classes). These simple tools quickly answer questions such as: • Where is the employment within Los Angeles County? • "}, {"section_title": "Sharing Costs and Expertise", "text": "The partnership model makes LED a very cost-eff ective data system because collection and processing costs are shared among the partners. The states collect much of the data through existing systems (the unemployment insurance system and the Quarterly Census of Employment and Wages) and format it for the LED data system. The Census Bureau built and maintains the national data infrastructure, performs the data integration, and releases workforce statistics back to the states and to the public. Through the partnership, local expertise is available from the states for accurate interpretation of the statistics and for quality assurance for the raw administrative data. The Census Bureau provides national expertise in cuttingedge confi dentiality protection models and data integration methods. A shed analysis of the same area shows in which areas these workers live. The Labor Shed Map (Figure 2-2), shows that most workers live within the hurricane path boundary, but some live beyond it in the Baton Rouge, Lake Charles, and New Orleans areas. The companion shed report (not shown) shows that over 11.6 percent of these workers live within the city of Lafayette. In comparison, only a combined 1.3 percent live in either Mississippi or Texas. With only a few mouse clicks, an immense amount of economic and spatial data is available. Text Box 2-3.  These work-home linkages are known as \"sheds.\" 1 Taking advantage of the shed maps and reports expands analyses beyond the selection area and lets users answer questions such as:"}, {"section_title": "A WORKING EXAMPLE OF ONTHEMAP", "text": "• How many workers live in St. Paul and work in Minneapolis? 1 The OnTheMap application has two kinds of sheds-a commute shed shows where workers who live within a selected area are employed. A labor shed shows in which areas workers who are employed within a selected area live. • Which county outside of Denver contributes the most workers to the city? • What share of St. Louis' workers do not live in Missouri? Both maps and reports can be saved by the user to be included in papers, presentations, or further analyses. Chapter 3. "}, {"section_title": "HIGHLIGHTS FROM THE BUSINESS DYNAMICS STATISTICS", "text": ""}, {"section_title": "INNOVATIVE AND ACCESSIBLE", "text": "The richness of the BDS derives from its source, the confi dential Longitudinal Business Database (LBD which once lay unused, and make it available to data users. The BDS represent important progress over existing products with which it shares many characteristics such as the Bureau of Labor Statistics' Business Employment Dynamics (BED) and the Census Bureau's Statistics on U.S. Businesses (SUSB). The new elements in the BDS provide data users with unprecedented information on the life cycle of U.S. businesses. Text Boxes 3.1-3.3 provide some examples of the types of analyses possible with the BDS but examples represent only a small fraction of the possible uses of these new data. The examples in the text boxes show how the BDS can be used to track entrepreneurial activity across states, measure the employment impact of startups, and examine business dynamics by fi rm age."}, {"section_title": "LBD DATA PRODUCTS", "text": "The release of the BDS is part of an eff ort to make relevant information from the confi dential LBD accessible to a wide range of users. Other eff orts currently underway include creating a synthetic public-use microdata fi le based on the LBD. The BDS will be updated annually. Expansion to cover new areas will occur as time and resources permit. Analysts and policymakers want to understand entrepreneurial activity and the process of job creation, especially at the subnational level. Entrepreneurial activity is generally seen as crucial for innovation and growth. Currently, few reliable data sources permit comparisons of entrepreneurial activity across time and space. One possible measure of entrepreneurial activity is the fraction of private sector, nonagricultural employment accounted for by young fi rms.   "}, {"section_title": "Fraction of Employment Accounted for by Young Firms by State: 2000-2005 Average", "text": "Text Box 3-1.   "}, {"section_title": "ENTREPRENEURIAL ACTIVITY ACROSS STATES", "text": ""}, {"section_title": "Percent of Jobs Accounted for by New Firms", "text": ""}, {"section_title": "JOBS CREATED FROM BUSINESS STARTUPS IN THE UNITED STATES", "text": "What is the role of young entrepreneurial fi rms in job creation? Until now, researchers lacked comprehensive data broken out by fi rm age necessary for understanding this fundamental dynamic in our economy. Figure 3-3 shows the relationship between fi rm age and two measures of business dynamics: net employment growth and job destruction. The net employment growth rate-employment change at continuing (surviving) establishments and employment growth from opening new establishments-is shown in the blue bars. The job destruction rate is employment change from establishments that do not survive (known as \"exits\"). Omitted from the chart are establishments of new startup fi rms that, by defi nition, have an employment growth rate equal to 200 and no job destruction."}, {"section_title": "Young Firms Grow Faster Conditional on Survival but Also Have Relatively High Exit Rates", "text": "The fi gure shows that establishments of young fi rms have higher employment growth rates, if they survive, than those of older fi rms. For example, establishments belonging to very young fi rms (age 1) have a net employment growth rate of about 15 percent conditional on survival, whereas those belonging to older fi rms (aged 29 and over) have a net employment growth rate of about 4 percent conditional on survival. However, young fi rms experience much more employment loss due to establishment exit-nearly 20 percent at very young fi rms-than do older fi rms."}, {"section_title": "\"Up or Out\"", "text": "The pattern for young fi rms is thus one of \"up or out\" with very rapid net growth for survivors off set by a very high exit rate. This complex pattern highlights the importance of developing richer measures of business dynamics such as those in the BDS. Text Box 3-3."}, {"section_title": "HIGH GROWTH AND FAILURE OF YOUNG FIRMS", "text": "The March Current Population Survey (CPS) is the primary data source used by public policy researchers and administrators to investigate trends in U.S. income and its distribution. For confi dentiality reasons, the U.S. Census Bureau topcodes each of the 24 sources of income (11 income sources prior to 1988) in the public-use CPS. However, this topcoding-the suppression of income values above some level in the public-use CPS data for confi dentiality reasonshas not been consistent over time. Below we discuss a new set of papers that off er a solution to this problem using a series of created values, which, when used together with the public-use CPS data, will closely approximate income and inequality levels and their trends based on the internal CPS."}, {"section_title": "THE PROBLEM", "text": "Unsystematic topcoding in the public-use CPS data inconsistently restricts the ability of researchers to fully capture income and its distribution over time. Thus, researchers using scalar inequality measures such as the Gini coeffi cient with the public-use CPS will unsystematically understate both levels and trends in income inequality. In Figure 4-1, we compare the Gini coeffi cients using the topcoded public-use March CPS data with those obtained using the internal CPS data. The Public-Unadjusted series is the Gini calculated from the public-use March CPS data exactly as it is provided by the Census Bureau with no adjustments made for topcoding. Similarly, the Internal-Unadjusted series is the Gini calculated from the internal March CPS data with no adjustments made to the data. Prior to 1995, the Census Bureau reported topcoded incomes as equal to the topcode threshold, which reduced the observed income of all topcoded individuals. Using the topcode threshold led to a substantial understatement in the level of inequality and distorted the trends in inequality. Starting in 1995, the Census Bureau began providing cell means-the mean of all topcoded values for each income source-which, as can be seen in Figure 4-1, allows researchers using the Public-Unadjusted CPS data to closely match results from the internal CPS data after 1995. Unfortunately, researchers interested in longer-term income trends have largely ignored this valuable information because cell means were not available for prior years. Instead, many researchers have simply recoded topcoded incomes as equal to the topcode threshold or have opted to use relatively simple measures of inequality, such as the 90/10 ratio, to attempt to avoid topcoding problems. However, Burkhauser, Feng, and Jenkins (2009) show that even researchers using inequality measures, such as the 90/10 ratio, run the risk of understating income inequality. This is because even individuals whose total household size-adjusted income is relatively modest and hence below the 90th percentile may have one or more topcoded sources of household income. Here we discuss how newly available information that we created about the means and variances of top incomes from the internal CPS data can be used in conjunction with publicuse CPS data to largely remedy the problems resulting from inconsistent topcoding. Using the extended cell mean series from Larrimore et al. (2008) and the variances of topcoded incomes from Burkhauser, Feng, and Larrimore (2008), it is now possible to better capture the top part of the income distribution with public-use CPS data and closely replicate results found using the internal CPS data used by the Census Bureau for producing their offi cial inequality statistics (U.S. Census Bureau, various years). Chapter 4."}, {"section_title": "BETTER ESTIMATES OF INCOME AND ITS DISTRIBUTION IN THE PUBLIC-USE MARCH CURRENT POPULATION SURVEY 1", "text": "Richard V. Burkhauser 2 and Jeff Larrimore, Cornell University 1 Support for this research from the National Science Foundation (award nos. SES-0427889, SES-0322902, and SES-0339191) and the National Institute for Disability and Rehabilitation Research (H133B040013 and H133B031111) are cordially acknowledged. 2 Burkhauser completed this paper while he was the R. I. Downing Fellow in Social Economics in the Faculty of Economics and Commerce, University of Melbourne."}, {"section_title": "USING CELL MEANS AND VARIANCES TO OBTAIN BETTER ESTIMATES OF TOP INCOMES", "text": "Despite the ability of cell means to closely replicate the results from internal CPS data, the lack of cell means prior to 1995 has dissuaded researchers from using them when looking at long-term trends using publicuse CPS data. Thus, in Larrimore et al. 2008we accessed internal CPS data and used it to calculate and distribute a cell mean series to the public going back to 1975. We also show that using this series will greatly improve the ability of researchers using only the public-use CPS to capture the top part of the income distribution. A cell mean more accurately captures the level of unobserved income for a given source of income in the public-use CPS data but does not provide information about its distribution. Therefore, in Burkhauser, Feng, and Larrimore (2008), we also calculate and distribute to the research community the variances of topcoded incomes for each source of income in the internal CPS. By using information on both mean and variance, it is possible to impute diff erent total household income values for each topcoded individual in the public-use CPS data. While doing so, in general, will not match an individual's actual income, it will allow the resulting distribution of income to more accurately match the distribution found in the internal CPS. Below we report how we have used both our cell mean and variance series to better estimate income and its distribution using public-use CPS data. Burkhauser et al. (2008) analyze levels and trends in inequality, using Gini coeffi cients between 1975 and 2004 derived from the internal CPS, and compare them with estimates from several series derived from the publicuse CPS. The series and their sources (internal or public-use data) are described in Table 4-1.  1998 1996 1994 1992 1990 1988 1986 1984 1982 1980 1978 1976 1975 Figure 4-2, taken from Burkhauser et al. (2008), shows that those who simply use the unadjusted public-use CPS (Public-Unadjusted) will fi nd income inequality jumps dramatically between 1994 and 1995; i.e., the Gini value increases from 0.395 to 0.422, a single year change far greater than in any prior or subsequent year. An increase in the topcode threshold as well as the use of Census Bureau derived cell mean values for all values above the topcode threshold caused this jump. Using the unadjusted internal CPS (Internal-Unadjusted), we fi nd no such increase between 1994 and 1995. Rather, what is happening is that prior to 1995, the Public-Unadjusted CPS Gini values substantially understate income inequality because they fail to fully account for income values above the topcodes. Once the Census Bureau provided the mean value of all these topcoded values, the now more precise Public-Unadjusted CPS Gini values match the higher Internal-Unadjusted Gini values. Failure to account for this change in methodology will grossly overstate U.S. inequality increases before and after 1994-1995."}, {"section_title": "CREATING MORE CONSISTENT MEASURES OF TRENDS IN HOUSEHOLD INCOME INEQUALITY", "text": "Simply ignoring Census Bureau mean values after 1994, as can be seen in the Public-NoMean Gini series, will not solve this problem. This series still inconsistently topcodes high values, and it underestimates inequality after 1994, as can be seen by the way its Gini values fall further and further below the Internal-Unadjusted Gini values. In contrast, when we use the public-use CPS together with our extended mean series (Public-Mean) in Figure 4-2, we come much closer to matching the Internal-Unadjusted Gini values in every year. However, the internal CPS data is itself censored, albeit to a substantially smaller extent than the public-use CPS. Hence, it too has time-inconsistencies, especially in 1992-1993, as"}, {"section_title": "Acronym", "text": ""}, {"section_title": "Source Method for Addressing Censoring Issues", "text": "Internal-Unadjusted Internal Uses internal data as provided in Census Bureau fi les, without any adjustments. Internal-Adjusted Internal Topcoded observations replaced by imputations derived from multiple imputation models fi tted to internal data; inequality estimates derived using multiple imputation combination methods."}, {"section_title": "Public-Unadjusted", "text": "Public-use Uses public-use data as provided in Census Bureau fi les; includes Census Bureau cell mean imputations for topcoded observations from 1995 onwards. Public-CellMean Public-use Uses public-use data as provided in Census Bureau fi les; includes cell mean imputations for topcoded observations for all years. Public-NoMean Public-use Uses public-use data as provided in Census Bureau fi les, except that no cell mean imputations used for any year (topcoded values used \"as is\")."}, {"section_title": "Public-Variance", "text": "Public-use Uses public-use data as provided in Census Bureau fi les; topcoded observations are replaced by imputations derived from a Stoppa imputation model fi tted to the mean and variance of topcoded incomes from the internal data. Sources: Burkhauser et al. (2008) and Burkhauser, Feng, and Larrimore (2008). "}, {"section_title": "Defi nitions for Income Distribution Series by Source and Censoring Method", "text": "can be seen by the jump in the Internal-Unadjusted Gini values between these years. To both control for inconsistent censoring and capture the missing part of the internal CPS data, we use a multiple imputation approach in which, for each year, outof-sample values for topcoded observations in the internal CPS are imputed based on lower insample values that we do have. Unsurprisingly, as can also be seen in Figure 4-2, we fi nd that compared to estimates derived from our multiple imputation approach (Internal-Adjusted), all the other series understate the level of inequality in all years. However, just as was the case for our Public-Mean series and the Internal-Unadjusted series it replicated, the Internal-Adjusted series reveals the same trendsan increase in inequality over the entire period 1975-2004 but with a rate of increase noticeably lower after 1993 compared to before 1993. In each series, average inequality increases much more prior to 1992 than after 1993. In addition, in each series, the jump in 1992-1993 is far higher than in any other period. This is consistent with the argument that a change in the measurement of inequality rather than a real change in inequality is its cause. To further test our Internal-Adjusted series, we compared our results to those derived by Piketty and Saez (2003) using Internal Revenue Service (IRS) administrative fi les. We did so by comparing our estimates of the share of income held by the wealthiest 10 percent of the population to that found by Piketty and Saez (2003). As can be seen in Figure 4-3, we fi nd that these two estimates of the income share held by the top 90th-95th percentiles and the 95th-99th percentiles have remarkably similar levels and trends, especially given that our income units diff er as we are observing household income while they are observing the adjusted gross income of tax units. It is only in the share of income held by the richest 1   1998 1996 1994 1992 1990 1988 1986 1984 1982 1980 1978 1976 1975 Public-Unadjusted"}, {"section_title": "Public-NoMean", "text": "Public-CellMean percent where our levels and trends diff er. Piketty and Saez (2003) not only fi nd that a larger share of income is held by this group but that the growth in their share has been greater over time. Diff erences in the measures of income we use explain diff erences in levels. However, it is unclear whether the diff erences in trends are due to an increasing inability of even the internal CPS to capture the very top part of the income distribution or to behavioral changes in the way individual tax units report their adjusted gross income in response to tax law changes in the data analyzed by Piketty and Saez (2003)."}, {"section_title": "CREATING MORE CONSISTENT MEASURES OF TRENDS IN CROSS-GROUP INEQUALITY", "text": "While more sophisticated topcode correction methods can improve the accuracy of sizeadjusted household income inequality calculations, as shown above, this is just one area where these newly available data and methods can improve calculations using public-use CPS data. Burkhauser and Larrimore (2008 and forthcoming) demonstrate that not correcting for topcoding in the public-use CPS can also distort the size of the earnings gap across subsets of the population. This includes the gap in mean labor earnings between individuals by sex, race, education level, and disability statuses. Researchers using the public-use CPS data without our cell mean series will understate the mean labor earnings of each of these population groups. However, because there are more males than females with topcoded earnings, even consistent topcoding will suppress a larger percentage of male earnings, thus understating the male-female earnings gap. Similarly, White, highly educated, and nondisabled individuals are topcoded at higher rates than Black, less-educated, and disabled individuals, respectively, resulting in an understatement of the race, education, and disability earnings gaps by those using the public-use CPS.  1998 1996 1994 1992 1990 1988 1986 1984 1982 1980 1978 1976 1975 IRS 90-95th share As was the case in our income inequality comparisons above, using cell means largely corrects for these topcoding-based problems in the public-use CPS. When we use the publicuse CPS together with our cell means, the earnings gaps we fi nd within sex, race, education, and disability groups are nearly identical to those we fi nd using the internal CPS."}, {"section_title": "INCORPORATING THE VARIANCES OF TOPCODED INCOMES", "text": "Using cell means with the public-use CPS allows researchers to more closely replicate results using the internal CPS. Moreover, researchers interested in more closely depicting the upper tail of the income distribution using the internal CPS can now do so by using the variances of topcoded incomes along with cell means. Burkhauser, Feng, and Larrimore (2008), using variance information from the internal CPS, move beyond imputing the same value for all topcoded individuals. They use a multiple imputation approach to create a distribution for the public-use CPS with the same mean and variance of topcoded incomes found in the internal CPS. Figure 4-4, taken from Burkhauser, Feng, and Larrimore (2008), compares the log-variance of the income distribution using the public-use CPS without cell means (Public-NoMean) with cell means (Public-Mean) and with cell means and variances of topcoded incomes (Public-Variance) to the log-variance of incomes using the internal CPS data (Internal-Unadjusted). Since the Public-NoMean compresses the distribution by assigning all topcoded individuals' income equal to the topcode threshold, it is not surprising that this series understates the log-variance seen in the internal data. Using the Public-Mean series results in log-variance of income increases since it more accurately captures the level of topcoded income. However, it still understates the log-variance seen in the Internal-Unadjusted series. This is the case since it incorrectly assumes that all topcoded individuals have the same level of income, thus reducing the income variance. It is only when we impute topcoded  1999 1997 1995 1993 1991 1989 1987 1985 1983 1981 1979 1977 1975 Public-NoMean Internal-Unadjusted Public-Variance Public-CellMean incomes using both the cell mean and variance of topcoded incomes in the Public-Variance series that the log-variance of income from the public-use CPS closely matches the Internal-Unadjusted series."}, {"section_title": "CONCLUSION", "text": "The CPS is the primary data source used by public policy researchers and administrators to investigate trends in income and its distribution. However, failure to control for inconsistent topcoding in the public-use CPS will lead researchers to understate the levels of U.S. average income and income inequality as well as distort their trends over time. The series of papers discussed here, based on our ability to access internal CPS data, estimate and distribute the mean and variance of topcoded income values for each income source in these data. Researchers using our cell mean and variance values together with the public-use CPS data can now closely approximate income and inequality levels and their trends based on the internal CPS. It is still important to consider internal censoring when using these data, especially when observing trends across 1992-1993. However, without making out-of-sample predictions about incomes censored in the internal data, these are the best estimates available. Moreover, they will be nearly as accurate as the offi cial Census Bureau statistics that are published each year based on the internal CPS (U.S. Census Bureau, various years). The 1990 decennial census data fi les also were updated. Record layouts and variable names are now consistent with the 1970 and 1980 fi les, and some minor problems with the previous version are corrected. The complete-count fi les include basic demographic and housing information for all individuals and households at the time of enumeration. The sample fi les contain fewer records than the complete count fi les (1 in 5 households received the long form in 1970, while the sample density for the subsequent census years is 1 in 6), but are much richer in terms of the content of the data."}, {"section_title": "Consistent Over Time", "text": "Many of the questions on the census have been asked for decades, yielding comparable data over a broad span of time. For example, in all of the available decennial censuses, respondents were asked where they resided 5 years before the date of the census. The information on prior residence lets researchers analyze the mobility of the population over several decades."}, {"section_title": "More Observations", "text": "Public use microdata sample (PUMS) fi les contain only a fraction of the cases available in the internal sample fi le (and none from households that received only the short form). Even the largest PUMS fi les contain only about a third of the cases available for the long-form fi les. The larger sample sizes available in the internal fi les are sometimes necessary for studying small groups in the United States. Chapter 5."}, {"section_title": "EXPANDED AND ENHANCED DECENNIAL CENSUS DATA FOR RESEARCH", "text": "Todd Gardner, Center for Economic Studies Figure 5-1."}, {"section_title": "Census Badge", "text": "Photo Credit: U.S. Census Bureau, Public Information Offi ce (PIO)."}, {"section_title": "More Detail", "text": "The internal long-form variables have more detail than the corresponding variables in the PUMS fi les. For example, data items with dollar values are topcoded and rare categories are combined with other values in the PUMS fi les. Original values are generally available on the internal fi les, and while some variables are topcoded in the internal data, the threshold topcode values are generally much higher than in PUMS data. The detail of the internal longform fi les allows for matching at detailed levels of geography between long-form data and other Census Bureau products. For example, Enrico Moretti (2004) makes a block-level match between the location of workers in the decennial census and the location of their employment in the Census of Manufactures. The match uses block-level information on the individual's place of work and industry in the decennial census."}, {"section_title": "Detailed Geography", "text": "Detailed geography is one of the greatest research advantages to using the internal decennial census microdata fi les. To protect respondent confi dentiality, PUMS fi les restrict geographic detail. Internal decennial census microdata fi les, by contrast, have detailed political and statistical geography for census tracts, block groups, and blocks, as well as all places and unincorporated subcounty units. Such detailed geography means that individual-and householdlevel data can be aggregated to geographic units that are consistent over time. For example, a city may annex territory. Using internal data, researchers can construct boundaries in each year that are consistent with the original or the expanded city. Detailed geography also allows the user to aggregate geography into nonstandard geographic classifi cations, such as school districts. However, researchers must obtain the necessary geographic specifi cations for the classifi cations they need."}, {"section_title": "New Classifi cations", "text": "An internal project is underway to take advantage of the geographic detail in the internal microdata fi les to develop useful geographic classifi cations. The new classifi cations identify clusters of census tracts with high population densities and high employment densities would be available to researchers. The current Census Bureau standard defi ning urban areas distinguishes only between urban and rural territory. Urban areas currently are defi ned at the census block level, with core areas that have population densities of 1,000 people per square mile and surrounding areas that have an overall population density of at least 500 people per square mile. Urban areas are not homogeneous, however, as population and employment densities vary widely among these areas. The current measures do not capture this variation. This map shows that highdensity areas often extend well past the political boundaries of large cities, and that these cities often contain substantial areas of low population density."}, {"section_title": "DETAILED DOCUMENTATION", "text": "New detailed documentation fi les in a variety of formats make it easier to use the decennial census microdata fi les. Text Box 5-1 describes the documentation fi les that CES has assembled. Some documentation is available to the public through the ICPSR Text Box 5-1."}, {"section_title": "DOCUMENTATION ON DECENNIAL FILES", "text": "Available to the public: • ICPSR documentation. • SAS zero obs fi les. Available in the RDCs: • Web-based documentation for all variables. • SAS code with variable labels and value labels for all valid values. • Codebooks. Web site <www.icpsr.umich.edu /cocoon/ICPSR/STUDY/21820 .xml>. Researchers with approved projects now can access additional documentation in the RDCs. Another publicly available resource is sets of SAS fi les that replicate the fi le structure of the internal data fi les but contain no data. Because they contain zero observations, they are called \"zero obs\" for short. Zero obs fi les for the 1970, 1980, 1990, and 2000 decennial census fi les are available to the public through the Cornell VirtualRDC <www.vrdc.cornell.edu>. 1 1 The VirtualRDC lets researchers learn how to work within the constraints of the actual RDCs before starting to work at one of the physical locations, thus reducing set-up time. The VirtualRDC also provides access to synthetic data over the Internet."}, {"section_title": "EXPANDED RESEARCH OPPORTUNITIES", "text": "Many RDC research projects have used the 1990 and 2000 decennial census microdata fi les. The availability of additional years of decennial census microdata could provide additional historical perspective.  included data from the 1990 and 2000 decennial censuses. These projects are listed in Appendix 2. The research includes such topics as marriage and economic opportunity, income and poverty, migrant fl ows, the social contexts of the children of immigrants, locational attainment and residential segregation, and neighborhood economic transitions."}, {"section_title": "PROJECT HISTORY", "text": "Preparing the historical decennial census fi les for release in the RDCs required the foresight and commitment of many individuals and institutions. Al Nucci, formerly of CES, was instrumental in identifying these fi les on the Census Bureau's original Unisys computer systems and urging that they be preserved. Nucci also began the task of moving the data from the Unisys and transforming them into formats that can be used on modern computers. John Murphy and Eugene Raschlich of the Data Access and Dissemination Systems Offi ce (DADSO) also did a considerable amount of work in this eff ort. Partnerships with MPRC, particularly Seth Sanders, contributed enormously to the task, and ICPSR contributed resources to create the new documentation for these fi les. The Population Division of the Census Bureau contributed signifi cant staff time to this project. Also, the retrieval and conversion of the data fi les and the creation of the zero obs fi les and other documentation could not have been accomplished without the assistance of Marie Pees of the Population Division."}, {"section_title": "ONGOING PROJECTS", "text": ""}, {"section_title": "Restore 1960 Data", "text": "The internal electronic version of the 1960 decennial census sample microdata fi le is nearly complete, but over the years, some data have been lost. A project to restore the 1960 sample data is currently underway. The 1960 census enumeration manuscripts from aff ected areas are being scanned and digitized to restore the missing geographic, household, and person records to this valuable dataset. The restoration of the 1960 sample fi le is being done in association with MPC and the National Archives and Records Administration under a grant from the National Institutes of Health. MPC is also submitting a proposal to scan and digitize the 1960 decennial census complete-count data, as the electronic data fi le was not preserved after the 1960 census was tabulated."}, {"section_title": "Harmonization", "text": "Also underway is a project to harmonize all of the internal decennial census microdata. What makes the historical census fi les so valuable is the potential for carrying out analyses that span a long period. Unfortunately, variables from one census year may have a diff erent set of valid values from another census year. Also, even if the sets of valid values match perfectly, variables from diff erent censuses may have been coded diff erently. To overcome such compatibility problems, the data must be harmonized. That is, the data must be made as compatible as possible over time with respect to coding systems, formats, and documentation."}, {"section_title": "Recovering Additional Historical Data", "text": "As the Unisys computer is being phased out of use at the Census Bureau, we are making eff orts to recover any useful data that have not yet been transferred to current platforms. These data may be lost if we do not act quickly. Transforming these historical fi les into usable data products requires substantial resources beyond what is currently available at CES. In recent months, we have been able to recover the internal versions of the 1940 and 1950 PUMS fi les. These fi les contain detailed geographic information and the original alphanumeric string entries. More processing is required to make the fi les a usable research resource. We need help from the research community to complete these recovery and transformation eff orts. 1 These linked data were the fi rst data CES made available to approved researchers in the early 1980s. See  for a history of CES. Stored data fi les and survey forms on microfi lm could be used to extend this longitudinal series back in time-by decades and perhaps by over a century. Extending the manufacturing microdata series would provide opportunities to study the evolution and behavior of plants and industries over longer time periods and more business cycles, including the Great Depression and the expansions and recessions of the immediate post-World War II period. CES and the research community recognize the value of adding earlier years to the existing longitudinal series of establishment-level manufacturing data. 2 We need help from the research community to recover these historical data. The recovery will require substantial resources beyond those currently available at CES. Without quick action, these data may be lost."}, {"section_title": "DATA FILES STORED BY THE U.S. CENSUS BUREAU", "text": "CES has learned that vintage data fi les for select surveys are stored on the Census Bureau's Unisys system, an outdated and rapidly depreciating data storage system scheduled to be decommissioned in the near future. Data fi les for the 1955, 1956, and 1965-1971 2 For example, recommendations from the April 19-20, 2007, meeting of the Census Advisory Committees of Professional Associations include a statement that the committee would be \"very interested\" in recovered data from the 1958 CM and the 1954-58 ASMs. A Census Bureau employee uses a card punch to transcribe data from a 1935 Business Census questionnaire to punch cards for mechanical sorting and tabulation. The use of punch cards to tabulate census data began following the 1890 census and continued into the 1960s when computers and magnetic computer tape fully replaced punch cards. ASMs have recently been recovered from the Unisys. Eff orts are now underway to recover additional fi les that may contain historical business microdata. 3 One example is the microdata from a groundbreaking joint Census/National Science Foundation project to match the Survey of Industrial Research and Development, CMs, and other fi rm level information from 1957 to 1977 (Griliches, 1986). 3 This is in conjunction with eff orts to obtain additional historical demographic microdata (see Chapter 5 of this report). Recovering data fi les from the Unisys system is not a trivial exercise because many of the fi les are stored in an old, proprietary Census Bureau format that requires detailed knowledge to download and then convert them to ASCII format. Once recovered, the data fi les need to be turned into research datasets. Record layouts need to be determined, and the data need to be checked for missing records and variables. Much of this work has been done for the recently recovered early ASM data (Ladner, 2008). We found certain industries are missing from the 1955 and 1956 ASM fi les, but data for these industries could potentially be fi lled in using the information in the 1954-1958 ASM microfi lm discussed in the next section. Additional research is also required to create longitudinal links between records in these early fi les and the longitudinal CM and ASM data currently available at CES and the Research Data Centers (RDCs). 4"}, {"section_title": "SURVEY FORMS ON MICROFILM", "text": "CES has in its possession microfi lm with images of completed survey forms from the 1958 CM and the 1954-58 ASMs. Since microfi lm is vulnerable to deterioration, scanning and electronically storing the microfi lm is a 4 Despite somewhat unreliable plant identifi cation numbers in the 1950s (Kallek 1975), recent preliminary matching exercises indicate it is possible to match at least some of the plants by plant identifi cation number. Remaining plants could potentially be matched using detailed geographic information available from the 1954-58 ASM microfi lm. Excerpt from the 1954-1958 ASM form, which was \"shuttled\" back and forth between the Census Bureau and the surveyed businesses through these years. necessary fi rst step to ensure this information is preserved. Further, to be useful for research, the scanned microfi lm needs to be indexed by key variables (e.g., industry, state). Scanning and indexing alone would produce a useful resource, particularly for researchers who focus on a small set of industries and are willing to key in data from the form images. For confi dentiality reasons, data must be keyed at a secure Census Bureau facility, such as an RDC. The full set of microfi lm would need to be keyed at the Census Bureau's National Processing Center in Jeff ersonville, Indiana. In addition to the data on microfi lm held at CES, the National Archives and Records Administration (NARA) maintains microfi lm copies of completed CM survey forms from 1947 to potentially as far back as 1820 (see NARA, 1964;and NARA, 2008). 5 It may also be possible to retrieve some early nonmanufacturing microdata from the Census of Business (NARA, 1964;Nucci, 1998;and NARA, 2008). Creating research data from the microfi lm maintained by NARA fi rst requires locating the microfi lm at NARA, assessing its condition, repairing and treating it (if necessary), and obtaining a copy. Then, essentially, the same process of scanning, indexing, and keying is required to create electronic research-ready data. The value of the microfi lm at NARA is demonstrated by its use in previous studies of specifi c industries. Bresnahan and Raff 5 Completed survey forms do not appear to be available for all CM years in that span. (1991) created a panel dataset using CM microdata from 1929-35 to study intraindustry heterogeneity in the auto industry during the Great Depression. Using CM microdata from the same years, Bertin, Bresnahan, and Raff (1996) study the blast furnace industry."}, {"section_title": "NEXT STEPS", "text": "CES wants to extend the longitudinal establishment-level manufacturing data back further in time. However, substantial resources beyond those currently available at CES are required. The vulnerabilities of both the microfi lm and the Unisys system call for quick action. Researchers interested in partnering with CES to recover and develop these data should contact the CES Assistant Division Chief for Research, Lucia Foster at <Lucia.S.Foster@census.gov>. collection. This project investigates measurement issues related to electronic commerce and produces estimates of the eff ects of e-commerce on productivity. The project will also examine the impact of computer networks on business processes and on various elements of the supply chain. The study will examine the types of enterprises that use Electronic Commerce Technology (ECT), examine how ECT aff ects e-supply chain and transforms production, determine if and how the use of ECT results in value addition (or creation), and determine the adequacy of the measures used by the U.S. Census Bureau."}, {"section_title": "Appendix 1. CENTER FOR ECONOMIC STUDIES (CES) STAFF AND RESEARCH DATA CENTER (RDC) PUBLICATIONS AND WORKING PAPERS", "text": "The research will generate estimates of the eff ect of e-commerce on productivity in manufacturing plants. The investigation will determine whether plants that invested in e-commerce technology received returns in the form of added productivity gains. The researchers' investigation using Census Bureau data can lead to a detailed examination of whether the data are consistent with one of these hypotheses and identify sources of potential e-commerce measurement problems. They will investigate in an e-commerce framework the applicability and robustness of traditional production function estimation, issues related to incorporation of knowledge, manufacturing processes, and quality improvement into the production function, and issues related to industry type and geographic concentration of industries."}, {"section_title": "IMPORTS AND PRODUCTIVITY IN U.S. MANUFACTURING James Harrigan-Federal Reserve Bank of New York Victor Shlychkov-Columbia University", "text": "The measurement of foreign trade fl ows-imports and exports-is an important component of the information the Census Bureau collects on the overall U.S. economy. The research will bring data from these two programs together to provide more extensive characterization of foreign trade activity in U.S. manufacturing fi rms and variation in fi rm productivity. The project will prepare estimates of the relationship between productivity and how fi rms organize production with a particular focus on the role of trade and foreign sourcing in the supply chain. This project will also produce estimates of the relationship between exports, imports, and growth in productivity and fi rm size. The project will contain analyses that serve to assess the quality of data collected on the supply chain in the 2002 Economic Census. The project will address whether productivity level determines the organizational form of the fi rm and whether importing leads to productivity growth in U.S. manufacturing or if higher productivity leads to imports. By estimating models of productivity growth that take the impact of both import and export behavior into account, this research will provide new, enhanced estimates of the relationship between exports, imports, and productivity and how such relationships might vary with fi rm characteristics and industry. Estimates will also be produced of the relationship between fi rm growth (employment and revenues), imports, and exports. Accurate estimation of such relationships is an important tool to be used in the consideration of how trade liberalization will impact businesses and the economy. The results will also provide empirical evidence regarding the hypothesis that imports play a relatively insignifi cant role in productivity growth."}, {"section_title": "CAUSES AND CONSEQUENCES OF NEIGHBORHOOD ECONOMIC TRANSITIONS Ingrid Gould Ellen-New York University Keren Mertens-New York University Katherine O'Regan-New York University", "text": "This project aims at improving understanding of neighborhood economic change by studying household residential choices and examining the circumstances under which households are willing to make moves into neighborhoods with incomes lower than their own. It will study whether and how these households diff er from households making other types of residential choices and whether certain aspects of neighborhoods or their residents make such pioneering moves more attractive. The project will also investigate household exit decisions and examine whether mobility rates are higher in economically gaining neighborhoods. We will consider renters and low-income renters separately. The research will study other changes taking place in neighborhoods experiencing gains in income-such as whether housing costs increase and whether there are compensating changes in quality of the neighborhood, like increased satisfaction with neighborhood safety, schools, local transit, and availability of local businesses. The research will compare mobility rates and the prevalence of certain types of household turnover across different types of neighborhoods. A series of regression analyses will model pioneering moves, household exit, and various measures of household satisfaction by using the national and fi ve metropolitan area versions of the American Housing Survey.     tion (1995-2000) and/or very diverse types of migration fl ows and experiences. The primary purpose of the project was to collect detailed data on what migrant fl ows look like and to examine the demographic and other characteristics and experiences associated with diff erent types of fl ows. Data include the socioeconomic background of migrants and their education, migration, work, and health histories. These data will be used to address the importance of social networks for international migration, occupational attainment, and residence (including internal migration and changes in household composition). These analyses will identify the limitations of and gaps in existing data that are currently used for intercensal demographic estimates by providing the fi rst systematic evaluation of migration questions since they were introduced. Second, they will provide a basis for proposing revisions to survey content, which can improve those estimates, and, in general, improve the quality of census survey data on the foreign born. Third, the results will address issues regarding the economic, political, and social impact of migrants on American society."}, {"section_title": "EMPLOYMENT AND TANF OUTCOMES FOR LOW-INCOME FAMILIES RECEIVING CHILD CARE SUBSIDIES IN ILLINOIS, MARYLAND, AND MINNESOTA: PHASES II AND III", "text": ""}, {"section_title": "MEASURING INCOME AND POVERTY FROM A MULTIYEAR PERSPECTIVE", "text": ""}, {"section_title": "MIGRANT LIFE HISTORY PROJECT ANALYSIS AND REPORT", "text": ""}, {"section_title": "THE SOCIAL CONTEXTS OF THE CHILDREN OF IMMIGRANTS IN THE U.S.", "text": ""}, {"section_title": "Richard Alba-University at Albany, SUNY", "text": "This project examines the social contexts in which children of immigrant parents are being reared in the United States and identifi es the metropolitan, neighborhood, family/household, and parental characteristics associated with these contexts. Theoretically, it is guided by the conceptualization in the literature of three distinct patterns of incorporation: conventional assimilation, downward assimilation (or racialized incorporation), and the pluralist alternative. Since no one of these patterns is adequate for a full understanding of the incorporation of contemporary immigrant groups, the major goal is to identify more precisely the circumstances under which each pattern comes into play. The project addresses in particular the factors that lead the children of immigrants to grow up in socially advantaged or disadvantaged households and neighborhoods. Since limited economic resources and residence in poverty-stricken neighborhoods have implications for access to health care and exposure to health risks, the fi ndings will provide improved understanding of important determinants of health outcomes. Multilevel models of household and neighborhood outcomes will be estimated for 36 diff erent immigrant groups, as well as for the children in native families of all the major race groups and Hispanics. These models will include parental, household, and metropolitan characteristics as independent variables and will allow the examination of eff ects specifi c to kinds of metropolitan regions through interactions between metropolitan-level variables and lower-level ones."}, {"section_title": "THE IMPACT OF SPIN-OUT GENERATION ON PARENT AND PROGENY FIRMS Rajshree Agarwal-University of Illinois at Urbana-Champaign Benjamin A. Campbell-The Ohio State University April Franco-University of Iowa", "text": "Spin-outs are distinct entrepreneurial ventures where founding team members are ex-employees of an incumbent fi rm. In many industries, spin-outs (progeny fi rms) compete directly with the incumbents (parent fi rms) and are an important source of innovation and growth. Previous research has emphasized the benefi cial performance implications of the knowledge diff usion from the parent to the progeny and have found that the inherited knowledge provides spinout fi rms both superior capabilities and performance vis-à-vis other entrants. However, little is known about the competitive eff ects of these knowledge fl ows on the subsequent capabilities and performance of parent fi rms. This project will investigate the processes that generate fi rm births and deaths in general but also those that generate spin-off births in particular. The research will identify new fi rms, spin-off fi rms, and the parents of these new spin-off fi rms in the legal services industry. It will analyze the characteristics of these new fi rms as well as the parents of spin-off fi rms. This process is especially interesting in the services sector where barriers to entry are generally low and fi rm birth and death rates are very high. As a result of this high turnover, it has traditionally been diffi cult to accurately measure new fi rm generation, the characteristics of new fi rms, and the performance of new fi rms in the services sector. However, with a custom Longitudinal Employer-Household Dynamics (LEHD) extract in conjunction with the external Martindale-Hubbell directory, this project will be able to accurately portray characteristics of new and dying fi rms as well as to estimate birth and death rates in this sector. Moreover, this project will develop and test new methodologies of spin-off generation and knowledge as well as examine the quality of the LEHD data in comparison to the Martindale-Hubbell data."}, {"section_title": "THE IMPORTANCE OF OBJECTIVE HEALTH MEASURES IN PREDICTING EXIT FROM THE LABOR FORCE VIA EARLY OA, DI, AND SSI PROGRAMS: THE CASE OF FATNESS", "text": "Richard V. Burkhauser-Cornell University John C. Cawley-Cornall University Maximilian D. Schmeiser-Cornell University Theoretical models argue that poor health will contribute to early exit from the labor market and the decision to take early social security retirement benefi ts (Old-Age or OA), Social Security Disability Insurance (SSDI), or Supplemental Security Income-adult disability (SSI) benefi ts. However, most estimates of the importance of health on the decision to take such benefi ts have been forced to rely on subjective measures of health, such as self-rated work limitations or self-rated health. Using a special data extract from the National Center for Health Statistics, this project contributes to the empirical literature by using a more objective measure of health, fatness, to predict application for and receipt of such benefi ts. The research will also determine which of several measures of fatness-body mass index, total body fat, percent body fat, waist circumference, and waist-to-hip ratio is the best predictor of participation in OA, SSDI, or SSI. project proposes to develop a model of missing data by applying methods of multiple imputation to improve imputations for nonresponse in these data. The research will measure improvement in data quality by analyzing how both aggregate and plant-level productivity, as well as other measures, are diff erent with multiply imputed data versus the methods currently in use by the Census Bureau. This research project employs data that will enable a better understanding of the impact a region's economic composition has on its economic performance, the impact of diff erences in the geographic profi le of regions on this relationship, and the impact of the cluster composition and performance of neighboring regions on a region's economic performance. Previous work on the relationship between cluster composition and the economic performance of regions and their clusters has revealed data limitations, in particular the signifi cant level of data suppression of industrylevel data in smaller, largely rural regions. Using the economic census and the Longitudinal Business Database, this project will investigate the ability of a cluster concept of colocated industries (those linked through their supply chain and other agglomeration forces) to provide an opportunity to publish regional aggregations with less need for disclosure suppressions. The project will further investigate the defi nitions of clusters and their development over time. The research will generate estimates of the economic performance of a region and its clusters. It aims at a more sophisticated understanding of linkages across clusters within a region and of linkages between regions, and to develop typologies of regional economies by cluster profi les and other dimensions."}, {"section_title": "MULTIPLE IMPUTATION AND ESTIMATING AGGREGATE PRODUCTIVITY GROWTH IN MANUFACTURING", "text": ""}, {"section_title": "PROSPERITY AND THE CLUSTER COMPOSITION OF REGIONS: LINKAGES BETWEEN RURAL AND URBAN AREAS", "text": ""}, {"section_title": "INTERFIRM JOB MOBILITY, LOCAL LABOR MARKETS, AND ORGANIZATIONAL DYNAMICS IN RETAIL Troy Blanchard-Louisiana State University Michael Irwin-Duquesne University Charles Tolbert-Baylor University", "text": "American public opinion refl ects a growing concern about employment stability and a weakening of the bond between employer and employee. Less stability means more frequent interfi rm job changes that can result in interruptions in company benefi ts (especially health insurance), decreases or stagnation in wages, and involuntary entry into contingent or temporary employment relations. This project examines interfi rm mobility by introducing locality into an analysis of the retail industry. Job mobility is best gauged with measures of the dynamic characteristics of fi rms as they function in their local context. At the organizational level, workers in locally oriented retail business establishments exhibit diff erent mobility patterns than their counterparts employed in non-locally oriented fi rms. This research seeks to analyze the infl uence of local organizational and labor market dynamics on interfi rm mobility of workers, examine the mobility of workers in locally oriented and non-locally oriented fi rms with special attention to times of economic expansion and recession, and explore the direction of interfi rm mobility in terms of earnings stability, appreciation, or depreciation over time."}, {"section_title": "MARRIAGE AND ECONOMIC OPPORTUNITY IN THE UNITED STATES", "text": "Catherine Fitch-University of Minnesota"}, {"section_title": "J. Michael Oakes-University of Minnesota Steven Ruggles-University of Minnesota", "text": "This research will assess the impact of changes in male and female economic opportunity on marriage formation in the United States since 1960. The working hypothesis is that rising female opportunity discouraged marriage, but that eff ect diminished over time; after 1970 the decline in the supply of young men with good jobs was the key factor behind late marriage. Previous eff orts to address these questions were stymied by inadequate geographic precision in available public-use microdata and by insuffi cient sample sizes, especially for racial minorities. The decennial long-form census microdata present an opportunity to deepen understanding of this extraordinary demographic transition. sample members and contrast these measures to those obtained from public-use data. Preliminary estimates suggest that measurement error in income and assets in the public-use SIPP is substantial among the low-resource elderly. Moreover, this measurement error translates directly into errors in estimates of the size of the SSI-eligible population and the rate at which eligible individuals enroll in SSI. The potential benefi ts of this study are to increase awareness of the quality of SIPP data, increase understanding of the sources of measurement errors in fi nancial resources, and prepare estimates of the characteristics of the population that are likely to be more accurate than those obtained from previous research using public-use data."}, {"section_title": "MEASUREMENT ERROR IN EXPECTED AND ACTUAL SSI BENEFITS: CAUSES AND CONSEQUENCES", "text": ""}, {"section_title": "THE EFFECTS OF VIETNAM DRAFT LOTTERY STATUS ON LATER LIFE OUTCOMES", "text": "Dalton Conley-New York University Jennifer Heerwig-New York University The goal of our proposed project is to examine important economic, family, health, and residential outcomes in the Vietnam-era service cohort through an instrumental variable estimation. By using this statistical technique, we hope to provide the Census Bureau with estimates of the eff ect of military service on the veteran population purged of selection bias. These estimates will demonstrate how Vietnam-era males, chosen randomly through the draft lottery, compare with the nonservice population on variables such as income, wealth accumulation, marital stability, and residential mobility. The analysis will provide important information about the later life characteristics of the male Vietnam-era population while highlighting the needs of aging Vietnam veterans. Until recently, progress in developing dynamic empirical models of entry, exit, and fi rm investment and growth has been slowed by methodological diffi culties and a lack of coordination between research teams. Now that theoretical research has provided a number of alternative estimation approaches, coordinated access to longitudinal microdata on fi rms or plants for a wide range of industries is needed to make progress on estimating the underlying structural parameters across a variety of business sectors and geographic markets."}, {"section_title": "AN EMPIRICAL STUDY OF ENTRY AND EXIT WITH MULTIPLE FIRM TYPES", "text": "The relationship between the size and the competitiveness of markets is an area of longstanding interest in industrial organization. Recent empirical studies have used the relationship between the size of a geographic market, often measured as market population, and both the number of fi rms in the market and the average sales of the fi rms to indirectly draw inferences about the degree of competition in the market. A second line of inquiry has relied on dynamic models that make predictions about how impediments to new fi rm entry, such as the magnitude of sunk entry costs, aff ect patterns of fi rm turnover in order to infer the extent of competitive pressure from potential entrants. This project will apply a class of dynamic models to Census Bureau microdata for a range of industries and geographic markets. The goal is to estimate underlying variables and parameters of interest (e.g., average profi ts in a market and the parameters describing the distribution of sunk entry costs and scrap values) in fully dynamic models with imperfectly competitive markets. "}, {"section_title": "THE REAL COSTS OF CREDIT ACCESS: EVIDENCE FROM THE PAYDAY LENDING MARKET", "text": ""}, {"section_title": "POLLUTION ABATEMENT EXPENDITURES AND OUTCOMES: INTERNAL AND EXTERNAL DETERMINANTS Wayne B. Gray-Clark University Ronald J. Shadbegian-U.S. Environmental Protection Agency", "text": "This project seeks to improve the understanding and the quality of the plant-level data on environmental spending collected in the Census Bureau's Pollution Abatement Costs and Expenditures (PACE) survey. The project combines PACE data with other Census Bureau datasets and with external data to model the impact of pollution abatement spending on economic factors, such as the plant's production costs and productivity, as well as its pollution emissions. The research will test accuracy of reported abatement expenditures by modeling their impact on total factor productivity levels, which should decrease productivity on a one-for-one basis if abatement activities contribute nothing to production. It also models the plant's production function, testing whether the productivity of specifi c types of inputs are more seriously aff ected by pollution abatement activities. Analyses include tests for differences across plants in abatement costs and in their impact on productivity, based on plant size, age, and other observed characteristics. The project will also model the impact of reported abatement costs on a variety of business decisions, including shifts in economic activity and investment, providing an indirect test for the reality of abatement costs. The project will benefi t the Census Bureau in several ways. The PACE survey has been recently resumed after an extended hiatus, so information about its data quality and comparisons to data from earlier versions of the survey are valuable. Our models of the impact of reported PACE spending on productivity and emissions test their validity in two ways: are they costs, and do they abate pollution? Our external datasets provide information on production technology and material use that will be used to assess the quality of comparable Census Bureau-collected information. Finally, the external datasets (particularly the Environmental Protection Agency's Facility Registry System) provide carefully maintained name-address, latitude-longitude, and plant ownership data that will provide information about the quality of the comparable Census Bureau information and how quickly that information is updated."}, {"section_title": "SEMIPARAMETRIC ESTIMATION OF ADVERSE SELECTION AND MORAL HAZARD IN EMPLOYER-SPONSORED HEALTH INSURANCE Matthew S. Rutledge-University of Michigan", "text": "The estimation of the eff ects that adverse selection, ineffi cient provision of insurance to certain risk types, and moral hazard (the overconsumption of medical care by insured patients who do not face the true cost) has on the health insurance market has been of great interest to economists in recent years. Key elements of the estimation of these information asymmetries are the menu of insurance plans available to the consumer, the degree to which consumers have to share in the cost of their medical care (i.e., the coinsurance schedule), and the relative health of the consumer, which is usually unknown to the insurer due to legal limitations on experience rating. Most attempts to estimate adverse selection and moral hazard, however, lack data that explicitly provide these key elements, and researchers are forced to make additional assumptions and ancillary estimations that add uncertainty to their results. This project uses data that provide the menu of plans off ered by employers to their employees, including explicit coinsurance schedules for each plan, which are then linked to data on employees' medical expenditure and health conditions. These data have been collected from the employers of respondents to the Medical Expenditure Panel Survey (MEPS) between 1996 and 1999."}, {"section_title": "MICROFOUNDATIONS OF AGGREGATE LABOR DEMAND FOR SKILL", "text": "Lawrence Katz-Harvard University Joshua W. Mitchell-Harvard University This project uses the Quarterly Workforce Indicators (QWI) and human capital fi les to better understand how workforce and production aggregation choices aff ect estimates of labor demand for skill and infl uence our understanding of recent changes in wage inequality. Decompositions of changes over time in employment and wage shares of skill and demographic groups, formal modeling and estimation of labor demand parameters, and correlations between demand and indicators of technology, capital, and trade from public-use datasets will be performed. These estimates will be generated at distinct levels of aggregated producer data: establishment, detailed industry, industry group, and economywide. The results will be used to reconcile microeconomic and macroeconomic trends in the wage structure and help evaluate competing explanations for the evolution of wage inequality. Linking these datasets greatly increases their analytic value by allowing questions about decisions made at the enterprise level-such as where to locate production to serve foreign customers-to be examined using the establishment-level data best suited to answering them. This project will build on previous projects that have linked Census data with BEA enterprise data. These previous linking projects have provided benefi ts to the Census Bureau, and this project will expand on these benefi ts. For example, it will enable the Census Bureau to improve its sample frames, verify and improve the accuracy of data reported on its surveys, and improve the industry classifi cations of enterprises and establishments. In addition, it will greatly increase the utility of the Census Bureau datasets for examining the impact that globalization-in the form of direct investment and trade in services-is having on the U.S. economy."}, {"section_title": "TRADE, GLOBALIZATION, AND THE ENTERPRISE-ESTABLISHMENT RELATIONSHIPS OF MULTINATIONAL COMPANIES", "text": ""}, {"section_title": "FIRM PERFORMANCE EFFECTS OF BROAD-BASED EMPLOYEE STOCK OWNERSHIP E. Han Kim-University of Michigan Paige Ouimet-University of North Carolina", "text": "This project examines whether broad-based equity-based incentives are eff ective at aligning incentives and the potential costs associated with providing these incentives. If employee ownership provides appropriate incentives, worker productivity should be higher and employee turnover should be lower. However, employee ownership also gives employees voting rights, which can be used to extract employee benefi ts at the expense of other stakeholders in the fi rm. For example, workers with voting rights may be more successful at obtaining abovemarket wages or in delaying or preventing layoff s or plant closures. Examining the eff ects of employee ownership on fi rm and establishment performance measures-such as productivity and wages-which in turn aff ect fi rm value, will provide important insights into the benefi ts and limitations of equity-based compensation."}, {"section_title": "RESETTLEMENT AND WELL-BEING OF NEW ORLEANS RESIDENTS AFTER HURRICANE KATRINA William Frey-University of Michigan Michael Rendall-RAND Corporation Narayan Sastry-University of Michigan", "text": "This project employs data from the Census Bureau's American Community Survey (ACS) to examine the current location and well-being of residents of New Orleans in the year after Hurricane Katrina struck the city. The aims of this project are to describe the return or resettlement in the year following Hurricane Katrina of people who resided in New Orleans before the storm and to examine the well-being of the pre-Katrina New Orleans population in the year after the hurricane, compared to a matched population from the prior year. The ACS data provide a unique opportunity to examine the geographic dispersion of New Orleans residents throughout the United States in the aftermath of Hurricane Katrina and to assess several important dimensions of well-being. This project addresses a number of unanswered research questions about the eff ects of Hurricane Katrina on the New Orleans' population. It also explores the strengths and weaknesses of the ACS data for examining the eff ects of Hurricane Katrina and for future studies of the eff ects of large-scale natural and man-made disasters. The researchers will evaluate the suitability of propensity-score reweighting techniques for studying these topics using the ACS by, for example, examining which population groups are underrepresented and overrepresented between the two ACS cross-sections.  (CES) study over many more years of data to examine the recent phenomenon of private equity buyouts using the QFR data. The researchers will directly compare the LBO of the 1980s with present-era private equity deals. This will improve the Census Bureau's understanding of fi rm structure and ownership change, as well as the impact of these on fi rm performance. This project will also increase the Census Bureau's knowledge base regarding the fi nancial and operational performance of private equity buyouts in the United States from 1990 to 2007 and, hence, improve the Census Bureau's understanding of fi rm structure and ownership change. The main question to be answered is how do present-era private equity buyouts perform fi nancially and operationally. Moreover, this project will determine whether the shortterm (1 year) and the longerterm performance (3 years) of private equity buyouts increases, decreases, or remains unchanged for the sample of buyout fi rms, relative to their industry peers. It will also determine whether the sources of improvements were purely fi nancial (debt) or operational in nature. This can lead to serious implications with regards to fi rm and national competitiveness. This study will also address the question of how similar today's private buyouts are vis-à-vis the 1980s LBO. As the recent problems in subprime lending have shown, problems in one debt class can have large repercussions on the economy as a whole."}, {"section_title": "TAXES AND THE STRATEGIC TIMING OF CHILDBIRTH", "text": "James Sallee-University of Michigan who had low draft numbers (and therefore higher probability of service) and those who had high draft numbers (and therefore lower probability of service). Due to the random nature of the lottery, these two groups are virtually identical on average, and estimates of causality are therefore unbiased by the prior diff erences in the groups.  1960, 1970, 1980, 1990, and 2000 decennial censuses. This eff ort is part of the National Historical Census Files Project (NHCFP), the ultimate goal of which is to construct a time series of easy-touse historical decennial census fi les and make these fi les available to researchers within the Census Bureau and to qualifi ed researchers through the Census "}, {"section_title": "THE DEMAND FOR MULTIPLE PRIVATE INSURANCE POLICIES WITH PREMIUM SUBSIDY AND CHANGES IN MEDICAL CARE DEMAND", "text": ""}, {"section_title": "AGGLOMERATION EFFECTS: THE ROLE OF SELECTION Jason Faberman-Federal Reserve Bank of Philadelphia Matthew Freedman-Cornell University", "text": "This research investigates the extent to which fi rm learning and selection account for observed geographic agglomeration eff ects. A vast literature documents positive relationships between the wages and productivity of fi rms and various measures of agglomeration, eff ects that persist even after controlling for a broad array of worker, fi rm, and other local area characteristics. In many cases, researchers attribute the positive observed eff ects of spatial agglomeration on diff erent outcome variables as evidence of agglomeration economies, suggesting that there may be knowledge spillovers or externalities associated with the geographic clustering of economic activity. This project explores the role of selection in explaining observed agglomeration eff ects using the Census Bureau's Longitudinal Business Database (LBD). The LBD provides detailed geographic classifi cations that permit construction of measures of agglomeration at fi ne geographic levels. This research will shed light on the sources of observed agglomeration eff ects, the drivers behind diff erential rates of fi rm turnover and economic growth across geographic areas, and the potential ramifi cations of policies aimed at encouraging or discouraging clustered business activity. This work will also yield a number of benefi ts to the Census Bureau by identifying shortcomings of existing data and methodologies, as well by improving the quality and utility of the data through longitudinal editing and the preparation of new population estimates."}, {"section_title": "THE EFFECT OF HEALTH CARE COSTS ON THE GROWTH AND SURVIVAL OF SMALL BUSINESS Adela Luque-The Urban Institute", "text": "Whether or not small businesses off er health insurance to their employees is a critical factor in the health care coverage of many Americans, yet little is known about the relationship between health care costs and business growth. The project links data from the annual Medical Expenditure Panel Survey-Insurance Component (MEPS-IC) data fi les to each other as well as to the Longitudinal Business Database (LBD). The study would use MEPS-IC data from 1996 to the present, longitudinally linked using the LBD, to examine the relationship between off ering health insurance and fi rm outcomes. The primary emphasis is on the eff ect of insurance off ering on fi rm performance, rather than the eff ects of fi rm performance on the decision to off er insurance. The project uses diff erences over time for establishments that are observed more than once to estimate these eff ects, using instrumental variables to deal with endogeneity. The project also will develop a methodology for estimating nonresponse to the MEPS-IC. This project will reclassify the estimates of research and development (R&D) performance in the Survey of Industrial Research and Development (SIRD) from fi rm-based industries to establishment-based industries using a consistent industry classification (NAICS) for the entire time series of the SIRD. The research will convey benefi ts to the Census Bureau along three dimensions by producing estimates of R&D using establishment-based industry codes; by conducting data quality assessments of the SIRD data, which exploit the longitudinal nature of the data; and by analyzing fi rmestablishment relationships. The Census Bureau is currently in the process of a major redesign of the SIRD, so the insights gained from this project will be particularly timely in contributing to the improvement of the future versions of the SIRD. The project will make an important contribution to the Census Bureau's eff orts to classify economic information on an establishment basis by identifying the establishments within each fi rm that are most likely to perform the fi rm's R&D. Identifying these establishments within each fi rm will also substantially improve the Census Bureau's eff orts to accurately measure economic activity within states because many R&D-performing companies have establishments in more than one state. neighborhoods. The second portion of the analysis explores the relationship between metropolitan context and locational attainment. Metropolitan-level residential segregation indexes by race and ethnicity will be developed, and the relationship between metropolitan characteristics (segregation and ecological factors) and locational attainment will be examined."}, {"section_title": "THE ROLE OF INDUSTRY CLASSIFICATION AND FIRM STRUCTURE IN THE ESTIMATION OF RESEARCH AND DEVELOPMENT EXPENDITURES", "text": ""}, {"section_title": "COMMUNITY-LEVEL INFLUENCES ON YOUNG MEN'S SEXUAL AND REPRODUCTIVE HEALTH BEHAVIORS: 1988 TO 2002", "text": ""}, {"section_title": "RENEWABLE ELECTRIC POWER GENERATION", "text": "Allan Collard-Wexler-New York University Joan Farre-Mensa-New York University The goal of this project is to understand the decision to build renewable electric power generators and how policy could encourage the build out of wind turbines over the next 20 years. Datasets to be used include the Longitudinal Business Database and the Census of Transportation, Communication, and Utilities. Measures to reduce emissions, such as the introduction of a Carbon Tax or subsidies for wind power, can only be evaluated using a model of how utilities decide to build and maintain wind turbines or solar generators and when they will choose to shut down coal fi red plants. Wind power is increasingly seen as an alternative to coal, oil, and gas generators for producing electricity. For instance, Denmark now produces 19 percent of its electricity using wind power, while in the United States wind power accounts for 1.1 percent of total electric power. This project will describe generators of wind power and other renewable power sources in the United States over the last 20 years. Second, it will construct and estimate dynamic models of entry and investment that will be used to simulate the eff ect of policies, such as tax subsidies, that would lower the cost of building new wind power generators in the future."}, {"section_title": "FEMALE LABOR FORCE PARTICIPATION AND ADULT HEALTH Melinda Morrill-North Carolina State University", "text": "This project investigates the impact of married women's labor force participation on own and husband's health. It focuses on measures of body weight, high blood pressure, physical activity levels, and self-reported levels of stress. The opportunity cost of a woman working is substantially lowered when her youngest child becomes eligible for public school, leading to an increase in maternal labor supply at that time. This study uses state-level and year-specifi c variation in kindergarten eligibility laws to precisely measure the youngest child's eligibility for kindergarten. Information on state of residence is only available on the restricted-use version of the National Health Interview Survey. Preliminary results fi nd that female employment has a positive impact on body mass index (BMI) for married men with less than a high school education. This fi nding is consistent with men facing an increase in the cost of home cooking with a positive impact on body weight. Women face an off setting rise in the level of physical activity, and households whose husbands have higher income can aff ord less calorie-intensive prepared food. The magnitude of these fi ndings is larger than found elsewhere in the literature. The results also show that for married men with higher levels of education, female demand shocks produce an increase in the levels of physical activity. This last element, plus the positive impact of female demand shocks on BMI and obesity rate, suggests that the channel through which female labor force participation raises a man's weight must be through a higher consumption of calories, which is consistent with a lower consumption of fruit and vegetables that are associated with female demand shocks for this group."}, {"section_title": "SCHOOL ENTRY LAWS AND ADHD DIAGNOSIS Melinda Morrill-North Carolina State University", "text": "Attention-defi cit/hyperactivity disorder (ADHD) is a neurobehavioral disorder of childhood that is diffi cult to diagnose and has no known cause. There is some concern that diagnoses for ADHD are not for underlying behavioral problems but rather represent age-appropriate diff erences in behavior. This project seeks to determine whether a child that is \"young for their grade\" and is hence relatively immature, is more likely to have been diagnosed with ADHD. The research exploits the sharp discontinuity in school enrollment generated by kindergarten eligibility laws, which are determined at the state-level. Children born just before the cutoff s will, on average, be young for their age; while children born just after the cutoff must, on average, wait a year to enter school and therefore will be the oldest children in their class. ADHD is an underlying neurological problem where incidence rates should not change dramatically from one birth date to the next. If diagnosis rates do shift appreciably based on small changes in birth dates, then the diagnosis is not based on underlying conditions but rather behavior relative to peers in class. This project uses data from the National Center for Health Statistics from 1985 through 2004 to demonstrate the relationship between eligibility date and grade for age. These data are used to test whether children born just prior to the kindergarten eligibility cut-off date have higher rates of ADHD diagnosis than children born just after those dates."}, {"section_title": "THE RELATIONSHIP BETWEEN MEDICAL EXPENDITURE AND QUALITY OF LIFE FOR GENERAL POPULATION IN UNITED STATES", "text": "Meiying Han-Stony Brook University This project seeks to add to the existing health literature by studying how medical expenditure is associated with quality of life for the general population in the United States. It employs a two-stage least squares analysis, which uses peoples' exposure to local health service intensity, including number of health service professions, facilities, and local population characteristics. The research also examines a reduced form method to determine how regional resources that increase medical expenditure aff ected their quality of life. This study uses data from individual interviews collected from the Medical Expenditure Panel Survey regarding general health status and medical expenditure variables. "}, {"section_title": "Annual Survey of Manufactures", "text": "The Annual Survey of Manufactures provides statistics on employment, payroll, workers' hours, payroll supplements, cost of materials, value added by manufacturing, capital expenditures, inventories, and energy consumption. It also provides estimates of value of shipments for over 1,800 classes of manufactured products."}, {"section_title": "2003-2006", "text": "\nQuarterly Financial Report The Quarterly Financial Report collects information on the fi nancial results and position of U.S. corporations."}, {"section_title": "Auxiliary Establishment Survey", "text": "The Auxiliary Establishment Survey (AUX) covers auxiliary establishments of multiestablishsment fi rms, reporting separately. The primary function of auxiliary units is to manage, administer, service, or support the activities of the other establishments of the company. Information on the auxiliary unit, the owning company, and the type of management or support service function provided is collected. The AUX is sometimes referred to as the Company Auxiliary Establishments. The Center for Economic Studies (CES) still maintains AUX after it was discontinued in 1997. The 2002 AUX is constructed from 2002 Economic Census data."}, {"section_title": "2002", "text": "\nForeign Trade Transaction Import Data Foreign Trade Transaction Import Data contain information on U.S. imports of merchandise compiled primarily from automated data submitted through the U.S. Customs' Automated Commercial System. The data are also compiled from import entry summary forms, warehouse withdrawal forms, and Foreign Trade Zone documents required by law to be fi led with the U.S. Customs and Border Protection. Data on imports of electricity and natural gas from Canada are obtained from Canadian sources. The Medical Expenditure Panel-Insurance Component collects data on health insurance plans obtained through employers. Data collected include the number and type of insurance plans off ered, benefi ts associated with these plans, premiums, contributions by employers and employees, eligibility requirements, and employer characteristics."}, {"section_title": "Business Expenses Survey", "text": "The Business Expenses Survey, formerly known as the Assets and Expenditures Survey, supplements basic economic statistics produced by the economic census for wholesale trade, retail trade, and service industries with estimates of operating expenses. Data collected on operating expenses include payroll and fringe benefi ts, contract labor costs, taxes and license fees, depreciation and amortization charges, software and other computer expenses, offi ce supplies, repair and maintenance expenses, lease and rental payments, utilities, advertising, accounting, and legal services."}, {"section_title": "1992-2008", "text": "(fi rst quarter only for 2008)"}, {"section_title": "Survey of Industrial Research and Development", "text": "The Survey of Industrial Research and Development (SIRD) is the primary source of information on research and development (R&D) performed by industry within the United States. The survey is a nationally representative sample of all for-profi t companies, publicly or privately held and with fi ve or more employees that performed R&D within the United States. The SIRD collects detailed information on the cost of R&D performed and the employment of scientists and engineers."}, {"section_title": "2001-2005", "text": ""}, {"section_title": "Survey of Business Owners", "text": "The Survey of Business (SBO) includes data from all nonfarm businesses fi ling tax forms as individual proprietorships, partnerships, or any type of corporation and with receipts of $1,000 or more. The SBO covers both fi rms with paid employees and fi rms with no paid employees. The SBO is conducted on a company or fi rm basis rather than an establishment basis. "}, {"section_title": "2005, 2006", "text": ""}, {"section_title": "Data product Description", "text": "New or updated years\nNew or updated years"}, {"section_title": "Survey of Plant Capacity Utilization", "text": "The Survey of Plant Capacity Utilization (PCU) provides current data on the rates of capacity utilization in U.S. manufacturing plants. Data collected are for the fourth quarter and include number of days and hours worked, estimated value of production at full production capability, and estimated value of production achievable under national emergency conditions. Additional items include reasons why the plant may operate at less than full production, reasons why the estimate of full production capability changed from the prior year, and how quickly the plant could reach full production and national emergency levels of production. The PCU was discontinued after 2006. The Quarterly Survey of Plant Capacity Utilization replaces the PCU beginning in 2007.  1970,1980,1990 Decennial Census Short Form"}, {"section_title": "1975-2006", "text": "The decennial census short form questionnaire includes population and housing questions. The questions on the short form are also asked on the long form, along with additional questions. 1970,1980,1990 "}, {"section_title": "Survey of Income and Program Participation Panels", "text": "The Survey of Income and Program Participation collects information on source and amount of income, labor force information, program participation and eligibility data, and general demographic characteristics to measure the eff ectiveness of existing federal, state, and local programs; to estimate future costs and coverage for government programs, such as food stamps; and to provide improved statistics on the distribution of income in the country."}, {"section_title": "2001", "text": "Table A-4.3. LONGITUDINAL EMPLOYER-HOUSEHOLD DYNAMICS (LEHD) DATA 2"}, {"section_title": "Business Register Bridge", "text": "The Business Register Bridge (BRB) is a link fi le between LEHD employer microdata and Business Register (BR) fi rm and establishment microdata. Since the concepts of \"fi rm\" and \"establishment\" diff er between the LEHD employer microdata and the BR, the BRB provides a crosswalk at various levels of business-unit aggregation. The most detailed crosswalk is at the level of Employer Identifi cation Number (EIN)-State-four-digit Standard Industry Classifi cation (SIC) industry-county. The bridge includes the full list of establishments in the LEHD data and in the BR that are associated with the business units (e.g., EIN-four-digit SIC-State-County) in the crosswalk and measures of activity (e.g., employment, sales)."}, {"section_title": "1990-2001", "text": ""}, {"section_title": "Employer Characteristics File", "text": "The Employer Characteristics File (ECF) consolidates most fi rm-level information (size, location, industry, etc.) into two easily accessible fi les. The fi rm-level fi le has one record for every year and quarter in which a fi rm is present in either the covered Employment and Wages (ES-202) program data or the unemployment insurance system (UI) wage records. Firms are identifi ed by the LEHD State Employer Identifi cation Number (SEIN). The data in the fi rm-level fi le is aggregated from the core establishment-level fi le, where establishments are identifi ed by reporting unit number within SEIN, called SEINUNIT."}, {"section_title": "1990-2004", "text": "\n(Years covered vary by state)\n"}, {"section_title": "Employment History File", "text": "The Employment History File (EHF) provides a full time series of earnings at all within-state jobs for all quarters covered by the LEHD system and provided by the state. It also provides activity calendars at a job, fi rm, and subfi rm reporting unit level. It can be linked to other Census Bureau fi les through the Protected Identity Key (PIK) and the LEHD SEIN."}, {"section_title": "1985-2004", "text": "\n"}, {"section_title": "Geocoded Address List", "text": "The Geocoded Address List (GAL) is a dataset containing unique commercial and residential addresses in a state geocoded to the census block and latitude/longitude coordinates. It consists of the GAL and a crosswalk for each processed fi le-year. The GAL contains each unique address, a GAL identifi er, its geocodes, a fl ag for each fi leyear in which it appears, data quality indicators, and data processing information. The GAL Crosswalk contains the GAL identifi er."}, {"section_title": "Individual", "text": ""}, {"section_title": "Characteristics File", "text": "The Individual Characteristics File (ICF) for each state contains one record for every person who is ever employed in that state over the time period spanned by the state's unemployment insurance records. It consolidates information from multiple input sources on gender, age, citizenship, point-in-time residence, and education. Information on gender, education, and age is imputed ten times when missing."}, {"section_title": "Quarterly Workforce Indicator", "text": "The Quarterly Workforce Indicators (QWI) establishment fi le contains quarterly measures of workforce composition and worker turnover at the establishment level for selected states. The LEHD establishment-level measures are created from longitudinally integrated person and establishment-level data. Establishment-level measures include: (i) Worker and Job Flows-accessions, separations, job creation, job destruction by age and gender of workforce; (ii) Worker composition by gender and age; (iii) Worker compensation for stocks and fl ows by gender and age; (iv) Dynamic worker compensation summary statistics for stocks and fl ows by gender and age. The LEHD-QWI may be used in combination with the LEHD BRB to match to other Census Bureau micro business databases and can be matched by fi rm-establishment identifi ers to other LEHD infrastructure fi les."}, {"section_title": "1990-2004 (Years covered vary by state)", "text": "Unit-to-Worker The unemployment insurance records underlying the LEHD infrastructure fi les provide neither establishment identifi ers (except for Minnesota) nor industry or geographic detail of the establishmentonly a fi rm identifi er. Between 60 and 70 percent of state-level employment is in single-unit employers (employers with only one establishment) for which a link through the fi rm identifi er is suffi cient to provide such detail. For the remaining 30 to 40 percent of employment, such links have to be imputed. The Unit-to-Worker Impute (U2W) fi le contains ten imputed establishments for each employee of a multiunit employer. The fi le can be linked to other Census Bureau datasets through the PIK and the LEHD SEIN-SEINUNIT."}]