[{"section_title": "", "text": "There were changes in the classification of fields between 1985-91 and 1992-93. See the Technical Notes for information on the field classifications used. Because racial/ethnic data were collected by broad fields of study only, the definition of science and engineering used by the National Science Foundation (NSF) for this report must include fields normally not included. There is one instance where this difference has a large impactthe broad field of \"Social Sciences.\" The U.S. Department of Education includes the field of history in this broad category, so when it collects the racial/ethnic data, this field is included. Before 1985, the broad category of \"Engineering\" included engineering technologies. This report is different from earlier reports in that it excludes engineering technologies so that trend data by race/ ethnicity are more consistent with the definition of science and engineering used in other NSF reports. If the reader is interested in earlier data for science fields (that are consistent from 1977 to 1993), please request Science and Engineering Degrees, by Race/Ethnicity of Recipients: 1977-91, NSF 94-306. SECTION A."}, {"section_title": "DATA HIGHLIGHTS TRENDS IN BACHELOR'S DEGREES AWARDED TO RACIAL/ETHNIC MINORITIES IN SCIENCE AND ENGINEERING", "text": "The number of bachelor's degrees in science and engineering (S&E) fields awarded to underrepresented minority students showed robust growth in the early 1990s, after a period of relatively slow growth from 1985to 1990. From 1990to 1994, the number of baccalaureate recipients with degrees in S&E increased Underrepresented minorities, total"}, {"section_title": "INTRODUCTION", "text": "This report is based on final data from several Federal surveys. Two of them are the U.S. Department of Education's Survey of Degrees and Other Formal Awards Conferred, and the Completions Survey conducted annually by the National Center for Education Statistics (NCES) as part of the Higher Education General Information Survey (HEGIS), later renamed the Integrated Postsecondary Education Data System (IPEDS). The third is the Survey of Earned Doctorates, conducted annually for the National Science Foundation (NSF) and four other Federal agencies by the National Research Council. Each source is described in more detail in the following sections. Data from the Survey of Degrees and Other Formal Awards Conferred and from the Completions Survey were used to report the number of bachelor's and master's degrees. The data on doctoral degrees in this report were derived from the Survey of Earned Doctorates, which surveyed all individuals earning research doctorates, rather than from the Completions Survey, which surveyed the institutions awarding the doctorates. The Earned Doctorate data were preferred because the data provided by individuals are more specific with respect to the field of specialization and are less likely to contain errors in data reporting and data entry than are the data provided by institutions. Furthermore, doctorate data provide 100 percent coverage for data by field and sex of individual recipients, whereas institutional data are subject to imputation for nonresponse. For a comparison of reporting on doctoral degrees in the Completions Survey and the Survey of Earned Doctorates, see National Science Foundation, Science and Engineering Doctorates: 1960-91, NSF 93-301, Detailed Statistical Tables (Washington, DC, 1993). In this report the racial and ethnic categories among U.S. citizens who were degree recipients during the 1987-94 period are charted and tabulated. It is recognized that the concept of race/ethnicity is as much a socially constructed characteristic as a biological one. Scholars such as Farley and Allen have noted that \"the sociological reality of race is more important than its 7 biological reality. Race exerts a profound influence over the lives of people in this society.\"' The following five racial/ethnic categories are required in Federal Government surveys of institutions: Black, non-Hispanic American Indian or Alaskan Native Asian or Pacific Islander Hispanic White, non-Hispanic Persons who are U.S. citizens or foreign citizens admitted for permanent residence are classified into the above categories. The ethnic category of Hispanic took precedence over the racial categories in the data collection. In addition, nonresident aliens, i.e., those admitted to the United States for temporary residence, are separately identified as a sixth category in the survey. The nonresident aliens are not to be reported in the aforementioned racial/ethnic groups. The definitions for the racial/ethnic categories used in the survey are as follows: Nonresident alienA person who is not a citizen or national of the United States and who is in this country on a temporary basis and does not have the right to remain indefinitely. Resident aliens who are not citizens of the United States and who have been lawfully admitted for permanent residence (and who hold alien registration receipt cards Form 1-551/155) are to be reported in the appropriate racial/ethnic categories along with U.S. citizens. Black, non-HispanicA person having origins in any of the black racial groups of Africa (except those of Hispanic origin). American Indian or Alaskan NativeA person having origins in any of the original peoples of North America and who maintains cultural identification through tribal affiliation or community recognition. Some institutions provided only the total number of completions, by award level and by sex; others provided the number of completions by award level, sex, and field but did not provide racial/ethnic data. Imputations for the years 1987 through 1994 were computer generated. Imputations were developed for institutions that did not provide complete racial/ethnic data. Some of these institutions had reported total degrees awarded but not racial/ethnic data, and others had reported totals that were larger or smaller than the sum of the racial/ethnic components. In the first case, wherein institutions did not report any racial/ethnic data by field, NCES imputed data on the basis of an earlier response for each institution, if available. The following table indicates the percentage of imputed data in 1994, by award level and racial/ethnic category."}, {"section_title": "Race/ethnicity", "text": "Bachelor's Master's White In the second case, wherein racial/ethnic data were reported but did not add to the total degree recipients, NCES used to distribute the difference among the racial/ethnic groups for that institution. Note: This report, however, does not do that; unknowns are shown in the table. In examining data on degrees awarded to minorities, it must be noted that 1 to 5 percent of all S&E degrees awarded in 1987-94 were awarded to individuals whose race/ethnicity was unknown. This unknown category could affect trends and observable changes in the number and share of awards received by minority students, particularly if there are shifts from year to year in the number of degree recipients with unknown race/ethnicity. As tables 1-3 indicate, the share of degrees awarded to individuals whose race/ ethnicity was unknown varied somewhat by degree level. This National Science Foundation report differs from those published by NCES in that data for the U.S. Territories are included, whereas NCES excludes them from most of its published reports."}, {"section_title": "DOCTORAL DEGREE DATA", "text": "In the Survey of Earned Doctorates, information is collected during the period of July 1 of one year to June 30 of the next from all persons who have fulfilled the requirements for a research doctorate. The survey is funded jointly by NSF and four other agencies: the U.S. Department of Education, the National Institutes of Health, the National Endowment for the Humanities, Historical Changes in the Higher Education General Information Survey (HEGIS)/ Integrated Postsecondary Education Data System (IPEDS) Classification Systemcontinued Fields of study collected in HEGIS/IPEDS, 1985-91 Fields of study from the IPEDS, 1992-94 Fields of study from the Survey of Earned Doctorates classification   First-professional degrees awarded in non-health fields, by race/ethnicity and sex of recipient: 1987-94 Racial/ethnic categories are as designated on the survey form. These categories include U.S. citizens and foreign citizens on permanent visas (i.e., resident aliens who have been admitted for permanent residency)."}, {"section_title": "2", "text": "Nonresident aliens include foreign citizens on temporary visas only. No racial/ethnic data are collected for this group.\nNonresident aliens include foreign citizens on temporary visas only. No racial/ethnic data are collected for this group.\nNonresident aliens include foreign citizens on temporary visas only.\nNonresident aliens include foreign citizens on temporary visas only.\nNonresident aliens include foreign citizens on temporary visas only.\nNonresident aliens include foreign citizens on temporary visas only.\nNonresident aliens include foreign citizens on temporary visas only."}, {"section_title": "NOTES:", "text": "Details may not sum to totals due to rounding. Data on race/ethnicity were collected biennially from 1977 through 1989 and annually thereafter. Data on race/ethnicity of degree recipients are collected on broad fields of study only; therefore, these data could not be adjusted to the exact field taxonomies used by NSF. SOURCES: Tabulations by National Science Foundation/SRS; data from National Center for Education Statistics;and IPEDS Completions Surveys, 1987-94  Racial/ethnic categories are as designated on the survey form. These categories include U.S. citizens and foreign citizens on permanent visas (i.e., resident aliens who have been admitted for permanent residency).\nDetails may not sum to totals due to rounding. Data on race/ethnicity were collected biennially from 1977 through 1989 and annually thereafter. Data on race/ethnicity of degree recipients are collected on broad fields of study only; therefore, these data could not be adjusted to the exact field taxonomies used by NSF.  4.0 5.4 5.9 6.9 10.4\nData on race/ethnicity were collected biennially from 1977 through 1989 and annually thereafter. Data on race/ethnicity of degree recipients are collected on broad fields of study only; therefore, these data could not be adjusted to the exact field taxonomies used by NSF. Racial/ethnic categories are as designated on the survey form. These categories include U.S. citizens and foreign citizens on permanent visas (i.e., resident aliens who have been admitted for permanent residency).     In this report, \"Physical science\" includes earth, atmospheric, and ocean sciences, as well as physics, astronomy, and chemistry.\nData on race/ethnicity were collected biennially from 1977 through 1989 and annually thereafter. Data on race/ethnicity of degree recipients are collected on broad fields of study only; therefore, these data could not be adjusted to the exact field taxonomies used by NSF. Racial/ethnic categories are as designated on the survey form. These categories include U.S. citizens and foreign citizens on permanent visas (i.e.. resident aliens who have been admitted for permanent residency).\nData on race/ethnicity were collected biennially from 1977 through 1989 and annually thereafter. Data on race/ethnicity of degree recipients are collected on broad fields of study only; therefore, these data could not be adjusted to the exact field taxonomies used by NSF. Racial/ethnic categories are as designated on the survey form. These categories include U.S. citizens and foreign citizens on permanent visas (i.e., resident aliens who have been admitted for permanent residency).     In this report, \"Physical science\" includes earth, atmospheric, and ocean sciences, as well as physics, astronomy, and chemistry.\nData on race/ethnicity were collected biennially from 1977 through 1989 and annually thereafter. Data on race/ethnicity of degree recipients are collected on broad fields of study only; therefore, these data could not be adjusted to the exact field taxonomies used by NSF. Racial/ethnic categories are as designated on the survey form. These categories include U.S. citizens and foreign citizens on permanent visas (i.e., resident aliens who have been admitted for permanent residency).     In this report, \"Physical science\" includes earth, atmospheric, and ocean sciences, as well as physics, astronomy, and chemistry.\nData on race/ethnicity were collected biennially from 1977 through 1989 and annually thereafter. Data on race/ethnicity of degree recipients are collected on broad fields of study only; therefore, these data could not be adjusted to the exact field taxonomies used by NSF. Racial/ethnic categories are as designated on the survey form. These categories include U.S. citizens and foreign citizens on permanent visas (i.e., resident aliens who have been admitted for permanent residency).     In this report, \"Physical science\" includes earth, atmospheric, and ocean sciences, as well as physics, astronomy, and chemistry.\nData on race/ethnicity were collected biennially from 1977 through 1989 and annually thereafter. Data on race/ethnicity of degree recipients are collected on broad fields of study only; therefore, these data could not be adjusted to the exact field taxonomies used by NSF. Racial/ethnic categories are as designated on the survey form. These categories include U.S. citizens and foreign citizens on permanent visas (i.e., resident aliens who have been admitted for permanent residency).   1987 1989 1990 1991 1992 1993 1994 Total , all black recipients   Total science and engineering  7,886  7,685  7,830  8,448  9,375  10,099  10,806   Engineering  1,606  1,397  1,416  1,484  1,614  1, In this report, \"Physical science\" includes earth, atmospheric, and ocean sciences, as well as physics, astronomy, and chemistry. 2 Non-S&E refers to non-science and non-engineering.\nData on race/ethnicity were collected biennially from 1977 through 1989 and annually thereafter. Data on race/ethnicity of degree recipients are collected on broad fields of study only; therefore, these data could not be adjusted to the exact field taxonomies used by NSF. Racial/ethnic categories are as designated on the survey form. These categories include U.S. citizens and foreign citizens on permanent visas (i.e., resident aliens who have been admitted for permanent residency).   1987 1989 1990 1991 1992 1993 1994 Total, all black recipients In this report, \"Physical science\" includes earth, atmospheric, and ocean sciences, as well as physics, astronomy, and chemistry. 2 Non-S&E refers to non-science and non-engineering.\nData on race/ethnicity were collected biennially from 1977 through 1989 and annually thereafter. Data on race/ethnicity of degree recipients are collected on broad fields of study only; therefore, these data could not be adjusted to the exact field taxonomies used by NSF. Racial/ethnic categories are as designated on the survey form. These categories include U.S. citizens and foreign citizens on permanent visas (i.e., resident aliens who have been admitted for permanent residency).   1987 1989 1990 1991 1992 1993 1994 Total, all black recipients In this report, \"Physical science\" includes earth, atmospheric, and ocean sciences, as well as physics, astronomy, and chemistry. 2 Non-S&E refers to non-science and non-engineering.\nData on race/ethnicity were collected biennially from 1977 through 1989 and annually thereafter. Data on race/ethnicity of degree recipients are collected on broad fields of study only; therefore, these data could not be adjusted to the exact field taxonomies used by NSF. Racial/ethnic categories are as designated on the survey form. These categories include U.S. citizens and foreign citizens on permanent visas (i.e., resident aliens who have been admitted for permanent residency).   1987 1989 1990 1991 1992 1993 1994 Total, all black recipients In this report, \"Physical science\" includes earth, atmospheric, and ocean sciences, as well as physics, astronomy, and chemistry. 2 Non-S&E refers to non-science and non-engineering.\nData on race/ethnicity were collected biennially from 1977 through 1989 and annually thereafter. Data on race/ethnicity of degree recipients are collected on broad fields of study only; therefore, these data could not be adjusted to the exact field taxonomies used by NSF. Racial/ethnic categories are as designated on the survey form. These categories include U.S. citizens and foreign citizens on permanent visas (i.e., resident aliens who have been admitted for permanent residency).   1987 1989 1990 1991 1992 1993 1994 Total, all black recipients In this report, \"Physical science\" includes earth, atmospheric, and ocean sciences, as well as physics, astronomy, and chemistry. 2 Non-S&E refers to non-science and non-engineering.\nData on race/ethnicity were collected biennially from 1977 through 1989 and annually thereafter. Data on race/ethnicity of degree recipients are collected on broad fields of study only; therefore, these data could not be adjusted to the exact field taxonomies used by NSF. Racial/ethnic categories are as designated on the survey form. These categories include U.S. citizens and foreign citizens on permanent visas (i.e., resident aliens who have been admitted for permanent residency).   1987 1989 1990 1991 1992 1993 1994 Total, all black recipients Physical sciencel  In this report, \"Physical science\" includes earth, atmospheric, and ocean sciences, as well as physics, astronomy, and chemistry.  1987 1989 1990 1991 1992 1993 1994 Total, all black recipients   In this report, \"Physical science\" includes earth, atmospheric, and ocean sciences, as well as physics, astronomy, and chemistry.   1987 1989 1990 1991 1992 1993 1994 Total, all black recipients   In this report, \"Physical science\" includes earth, atmospheric, and ocean sciences, as well as/physics, astronomy, and chemistry.   1987 1989 1990 1991 1992 1993 1994 Total, all Hispanic recipients In this report, \"Physical science\" includes earth, atmospheric, and ocean sciences, as well as physics, astronomy, and chemistry. 2 Non-S&E refers to non-science and non-engineering.\nData on race/ethnicity were collected biennially from 1977 through 1989 and annually thereafter. Data on race/ethnicity of degree recipients are collected on broad fields of study only; therefore, these data could not be adjusted to the exact field taxonomies used by NSF. Racial/ethnic categories are as designated on the survey form. These categories include U.S. citizens and foreign citizens on permanent visas (i.e., resident aliens who have been admitted for permanent residency).   1987 1989 1990 1991 1992 1993 1994 Total, all Hispanic recipients In this report, \"Physical science\" includes earth, atmospheric, and ocean sciences, as well as physics, astronomy, and chemistry. 2 Non-S&E refers to non-science and non-engineering.\nData on race/ethnicity were collected biennially from 1977 through 1989 and annually thereafter. Data on race/ethnicity of degree recipients are collected on broad fields of study only; therefore, these data could not be adjusted to the exact field taxonomies used by NSF. Racial/ethnic categories are as designated on the survey form. These categories include U.S. citizens and foreign citizens on permanent visas (i.e., resident aliens who have been admitted for permanent residency).   1987 1989 1990 1991 1992 1993 1994 Total, al Hispanic recipients In this report, \"Physical science\" includes earth, atmospheric, and ocean sciences, as well as physics, astronomy, and chemistry. 2 Non-S&E refers to non-science and non-engineering.\nData on race/ethnicity were collected biennially from 1977 through 1989 and annually thereafter. Data on race/ethnicity of degree recipients are collected on broad fields of study only; therefore, these data could not be adjusted to the exact field taxonomies used by NSF. Racial/ethnic categories are as designated on the survey form. These categories include U.S. citizens and foreign citizens on permanent visas (i.e., resident aliens who have been admitted for permanent residency).   1987 1989 1990 1991 1992 1993 1994 Total, al Hispanic recipients In this report, \"Physical science\" includes earth, atmospheric, and ocean sciences, as well as physics, astronomy, and chemistry. 2 Non-S&E refers to non-science and non-engineering.\nData on race/ethnicity were collected biennially from 1977 through 1989 and annually thereafter. Data on race/ethnicity of degree recipients are collected on broad fields of study only; therefore, these data could not be adjusted to the exact field taxonomies used by NSF. Racial/ethnic categories are as designated on the survey form. These categories include U.S. citizens and foreign citizens on permanent visas (i.e., resident aliens who have been admitted for permanent residency).   1987 1989 1990 1991 1992 1993 1994 Total, al Hispanic recipients In this report, \"Physical science\" includes earth, atmospheric, and ocean sciences, as well as physics, astronomy, and chemistry. 2 Non-S&E refers to non-science and non-engineering.\nData on race/ethnicity were collected biennially from 1977 through 1989 and annually thereafter. Data on race/ethnicity of degree recipients are collected on broad fields of study only; therefore, these data could not be adjusted to the exact field taxonomies used by NSF. Racial/ethnic categories are as designated on the survey form. These categories include U.S. citizens and foreign citizens on permanent visas (i.e., resident aliens who have been admitted for permanent residency).   1987 1989 1990 1991 1992 1993 1994 Total, all Hispanic recipients In this report, \"Physical science\" includes earth, atmospheric, and ocean sciences, as well as physics, astronomy, and chemistry. 2 Non-S&E refers to non-science and non-engineering.\nData on race/ethnicity were collected biennially from 1977 through 1989 and annually thereafter. Data on race/ethnicity of degree recipients are collected on broad fields of study only; therefore, these data could not be adjusted to the exact field taxonomies used by NSF. Racial/ethnic categories are as designated on the survey form. These categories include U.S. citizens and foreign citizens on permanent visas (i.e., resident aliens who have been admitted for permanent residency).    In this report, \"Physical science\" includes earth, atmospheric, and ocean sciences, as well as physics, astronomy, and chemistry.  1987 1989 1990 1991 1992 1993 1994 Total, all Hispanic recipients   In this report, \"Physical science\" includes earth, atmospheric, and ocean sciences, as well as physics, astronomy, and chemistry.   1987 1989 1990 1991 1992 1993 1994 Total, al Hispanic recipients   In this report, \"Physical science\" includes earth, atmospheric, and ocean sciences, as well as physics, astronomy, and chemistry. Non-S&E refers to non-science and non-engineering. SOURCE: National Science Foundation/SRS, Survey of Earned Doctorates Racial/ethnic categories are as designated on the survey form. These categories include U.S. citizens and foreign citizens on permanent visas (i.e., resident aliens who have been admitted for permanent residency).\nData on race/ethnicity were collected biennially from 1977 through 1989 and annually thereafter. Data on race/ethnicity of degree recipients are collected on broad fields of study only; therefore, these data could not be adjusted to the exact field taxonomies used by NSF. Engineering technologies are a summary of instructional programs that prepare individuals to support and assist engineering and related professionals or to independently provide such services. Programs stress specialized, practical knowledge related to the mathematical, scientific, or technical aspects of engineering and related sciences. SOURCES: Tabulations by National Science Foundation/SRS; data from National Center for Education Statistics;and IPEDS Completions Surveys, 1987-94 BEST COPY AVAILABLE  Racial/ethnic categories are as designated on the survey form. These categories include U.S. citizens and foreign citizens on permanent visas (i.e., resident aliens who have been admitted for permanent residency).\nData on race/ethnicity were collected biennially from 1977 through 1989 and annually thereafter. Data on race/ethnicity of degree recipients are collected on broad fields of study only; therefore, these data could not be adjusted to the exact field taxonomies used by NSF. Engineering technologies are a summary of instructional programs that prepare individuals to support and assist engineering and related professionals or to independently provide such services. Programs stress specialized, practical knowledge related to the mathematical, scientific, or technical aspects of engineering and related sciences. SOURCES: Tabulations by National Science Foundation/SRS; data from National Center for Education Statistics;and IPEDS Completions Surveys, 1987-94  Racial/ethnic categories are as designated on the survey form. These categories include U.S. citizens and foreign citizens on permanent visas (i.e., resident aliens who have been admitted for permanent residency).\nFirst-professional degrees are defined as those that require at least 6 years of college work for completion and 2 years of preprofessional training. Non-health fields include: Law, Divinity/Ministry, and Rabbinical and Talmudic Studies. SOURCES: Tabulations by National Science Foundation/SRS; data from National Center for Education Statistics;and IPEDS Completions Surveys, 1987-94 "}, {"section_title": "SOURCES: Tabulations by National", "text": "Underrepresented minorities, total 5.5 5.4 5.4 5.7 5.7 5.9 5.9 Black, non-Hispanics      BEST COPY AVAILABLE  In this report, \"Physical science\" includes earth, atmospheric, and ocean sciences, as well as physics, astronomy, and chemistry.\n2 Non-S&E refers to non-science and non-engineering. 3 Racial/ethnic categories are as designated on the survey form. These categories include U.S. citizens and foreign citizens on permanent visas (i.e., resident aliens who have been admitted for permanent residency).\n2 Non-S&E refers to non-science and non-engineering.\n2 Non-S&E refers to non-science and non-engineering. 3 Racial/ethnic categories are as designated on the survey form. These categories include U.S. citizens and foreign citizens on permanent visas (i.e., resident aliens who have been admitted for permanent residency).\n2 Non-S&E refers to non-science and non-engineering."}, {"section_title": "BEST COPY AVAiLABLE", "text": "2 Non-S&E refers to non-science and non-engineering. 3 Racial/ethnic categories are as designated on the survey form. These categories include U.S. citizens and foreign citizens on permanent visas (i.e., resident aliens who have been admitted for permanent residency)."}, {"section_title": "4", "text": "Nonresident aliens include foreign citizens on temporary visas only. No racial/ethnic data are collected for this group.\nNonresident aliens include foreign citizens on temporary visas only. No racial/ethnic data are collected for this group.\nNonresident aliens include foreign citizens on temporary visas only. No racial/ethnic data are collected for this group.\nNonresident aliens include foreign citizens on temporary visas only. No racial/ethnic data are collected for this group.\nNonresident aliens include foreign citizens on temporary visas only. No racial/ethnic data are collected for this group."}, {"section_title": "SOURCES:", "text": "Tabulations by National Science Foundation/SRS; data from National Center for Education Statistics: and IPEDS Completions Surveys, 1987-94 BEST COPY AVAILABLE See explanatory information and SOURCES at end of table. 5.   In this report, \"Physical science\" includes earth, atmospheric, and ocean sciences, as well as physics, astronomy, and chemistry. 2 Non-S&E refers to non-science and non-engineering. 3 Racial/ethnic categories are as designated on the survey form. These categories include U.S. citizens and foreign citizens on permanent visas (i.e., resident aliens who have been admitted for permanent residency)."}, {"section_title": "3", "text": "Racial/ethnic categories are as designated on the survey form. These categories include U.S. citizens and foreign citizens on permanent visas (i.e., resident aliens who have been admitted for permanent residency).\nRacial/ethnic categories are as designated on the survey form. These categories include U.S. citizens and foreign citizens on permanent visas (i.e., resident aliens who have been admitted for permanent residency).  BEST COPY AVAILABLE    In this report, \"Physical science\" includes earth, atmospheric, and ocean sciences, as well as physics, astronomy, and chemistry. 2 Non-S&E refers to non-science and non-engineering.\nRacial/ethnic categories are as designated on the survey form. These categories include U.S. citizens and foreign citizens on permanent visas (i.e., resident aliens who have been admitted for permanent residency).  BEST COPY AVAILABLE   788. In this report, \"Physical science\" includes earth, atmospheric, and ocean sciences, as well as physics, astronomy, and chemistry. Non-S&E refers to non-science and non-engineering. Racial/ethnic categories are as designated on the survey form. These categories include U.S. citizens and foreign citizens on permanent visas (i.e., resident aliens who have been admitted for permanent residency). Nonresident aliens include foreign citizens on temporary visas only. SOURCE: National Science Foundation/SRS, Survey of Earned Doctorates  1987 1989 1990 1991 1992 1993 1994 Total, all black recipients In this report, \"Physical science\" includes earth, atmospheric, and ocean sciences, as well as physics, astronomy, and chemistry. 2 Non-S&E refers to non-science and non-engineering."}, {"section_title": "NOTE:", "text": "Data on race/ethnicity were collected biennially from 1977 through 1989 and annually thereafter. Data on race/ethnicity of degree recipients are collected on broad fields of study only; therefore, these data could not be adjusted to the exact field taxonomies used by NSF. SOURCES: Tabulations by National Science Foundation/SRS; data from National Center for Education Statistics;and IPEDS Completions Surveys, 1987-94 BEST COPY AVAILABLE 103 Racial/ethnic categories are as designated on the survey form. These categories include U.S. citizens and foreign citizens on permanent visas (i.e., resident aliens who have been admitted for permanent residency).\nData on race/ethnicity were collected biennially from 1977 through 1989 and annually thereafter. Data on race/ethnicity of degree recipients are collected on broad fields of study only; therefore, these data could not be adjusted to the exact field taxonomies used by NSF.  Racial/ethnic categories are as designated on the survey form. These categories include U.S. citizens and foreign citizens on permanent visas (i.e., resident aliens who have been admitted for permanent residency).  Racial/ethnic categories are as designated on the survey form. These categories include U.S. citizens and foreign citizens on permanent visas (i.e., resident aliens who have been admitted for permanent residency). 2 Nonresident aliens include foreign citizens on temporary visas only.\nFirst-professional degrees are defined as those that require at least 6 years of college work for completion and 2 years of preprofessional training.   Racial/ethnic categories are as designated on the survey form. These categories include U.S. citizens and foreign citizens on permanent visas (i.e., resident aliens who have been admitted for permanent residency)."}]