[{"section_title": "Abstract", "text": "Objective: The APOE4 allele is the strongest genetic risk factor for sporadic Alzheimer disease (AD). Case-control studies suggest the APOE4 link to AD is stronger in women. We examined the APOE4-by-sex interaction in conversion risk (from healthy aging to mild cognitive impairment (MCI)=AD or from MCI to AD) and cerebrospinal fluid (CSF) biomarker levels. Methods: Cox proportional hazards analysis was used to compute hazard ratios (HRs) for an APOE-by-sex interaction on conversion in controls (n 5 5,496) and MCI patients (n 5 2,588). The interaction was also tested in CSF biomarker levels of 980 subjects from the Alzheimer's Disease Neuroimaging Initiative. Results: Among controls, male and female carriers were more likely to convert to MCI=AD, but the effect was stronger in women (HR 5 1.81 for women; HR 5 1.27 for men; interaction: p 5 0.011). The interaction remained significant in a predefined subanalysis restricted to APOE3=3 and APOE3=4 genotypes. Among MCI patients, both male and female APOE4 carriers were more likely to convert to AD (HR 5 2.16 for women; HR 5 1.64 for men); the interaction was not significant (p 5 0.14). In the subanalysis restricted to APOE3=3 and APOE3=4 genotypes, the interaction was significant (p 5 0.02; HR 5 2.17 for women; HR 5 1.51 for men). The APOE4-by-sex interaction on biomarker levels was significant for MCI patients for total tau and the tau-to-Ab ratio (p 5 0.009 and p 5 0.02, respectively; more AD-like in women). Interpretation: APOE4 confers greater AD risk in women. Biomarker results suggest that increased APOE-related risk in women may be associated with tau pathology. These findings have important clinical implications and suggest novel research approaches into AD pathogenesis.\nANN NEUROL 2014;00:000-000 A lzheimer disease (AD) is an increasingly prevalent, fatal neurodegenerative disease that has proven resistant thus far to all attempts to prevent it, forestall it, or slow its progression. The e4 allele of the apolipoprotein E gene (APOE4) is a potent genetic risk factor for sporadic and late onset familial AD.\n1 The e3 allele (APOE3) is the most common APOE polymorphism in the general population and considered risk-neutral, whereas the e2 allele (APOE2) is the least common and is thought to reduce AD risk. Although estimates vary across studies and ethnic backgrounds, the APOE4 allele is typically present in >50% of AD patients but is found only in about 15% of healthy older controls. 2 Basic science research has suggested several roles that the e4 isoform of apolipoprotein E (ApoE4) may play in augmenting the development of AD. Cell culture and animal models have identified potential pathogenic mechanisms related to b-amyloid (Ab) clearance, tau hyperphosphorylation, and synaptic function, among others.\nIn human studies, some but not all imaging biomarker studies have shown early AD-like findings in healthy older APOE4 carriers. [4] [5] [6] Cerebrospinal fluid (CSF) biomarker studies are more consistent and tend to show reduced (more AD-like) Ab levels, but normal tau levels, in healthy older APOE4 carriers. Longitudinal studies of clinical decline from mild cognitive impairment (MCI) to AD are mixed, with some but not all suggesting that the APOE4 allele increases the risk of conversion from MCI to AD. 7 The data on clinical\nView this article online at wileyonlinelibrary.com."}, {"section_title": "for the Alzheimer's Disease Neuroimaging Initiative Investigators", "text": "Objective: The APOE4 allele is the strongest genetic risk factor for sporadic Alzheimer disease (AD). Case-control studies suggest the APOE4 link to AD is stronger in women. We examined the APOE4-by-sex interaction in conversion risk (from healthy aging to mild cognitive impairment (MCI)=AD or from MCI to AD) and cerebrospinal fluid (CSF) biomarker levels. Methods: Cox proportional hazards analysis was used to compute hazard ratios (HRs) for an APOE-by-sex interaction on conversion in controls (n 5 5,496) and MCI patients (n 5 2,588). The interaction was also tested in CSF biomarker levels of 980 subjects from the Alzheimer's Disease Neuroimaging Initiative. Results: Among controls, male and female carriers were more likely to convert to MCI=AD, but the effect was stronger in women (HR 5 1.81 for women; HR 5 1.27 for men; interaction: p 5 0.011). The interaction remained significant in a predefined subanalysis restricted to APOE3=3 and APOE3=4 genotypes. Among MCI patients, both male and female APOE4 carriers were more likely to convert to AD (HR 5 2.16 for women; HR 5 1.64 for men); the interaction was not significant (p 5 0.14). In the subanalysis restricted to APOE3=3 and APOE3=4 genotypes, the interaction was significant (p 5 0.02; HR 5 2.17 for women; HR 5 1.51 for men). The APOE4-by-sex interaction on biomarker levels was significant for MCI patients for total tau and the tau-to-Ab ratio (p 5 0.009 and p 5 0.02, respectively; more AD-like in women). Interpretation: APOE4 confers greater AD risk in women. Biomarker results suggest that increased APOE-related risk in women may be associated with tau pathology. These findings have important clinical implications and suggest novel research approaches into AD pathogenesis.\nANN NEUROL 2014;00:000-000 A lzheimer disease (AD) is an increasingly prevalent, fatal neurodegenerative disease that has proven resistant thus far to all attempts to prevent it, forestall it, or slow its progression. The e4 allele of the apolipoprotein E gene (APOE4) is a potent genetic risk factor for sporadic and late onset familial AD. 1 The e3 allele (APOE3) is the most common APOE polymorphism in the general population and considered risk-neutral, whereas the e2 allele (APOE2) is the least common and is thought to reduce AD risk. Although estimates vary across studies and ethnic backgrounds, the APOE4 allele is typically present in >50% of AD patients but is found only in about 15% of healthy older controls. 2 Basic science research has suggested several roles that the e4 isoform of apolipoprotein E (ApoE4) may play in augmenting the development of AD. Cell culture and animal models have identified potential pathogenic mechanisms related to b-amyloid (Ab) clearance, tau hyperphosphorylation, and synaptic function, among others. 3 In human studies, some but not all imaging biomarker studies have shown early AD-like findings in healthy older APOE4 carriers. [4] [5] [6] Cerebrospinal fluid (CSF) biomarker studies are more consistent and tend to show reduced (more AD-like) Ab levels, but normal tau levels, in healthy older APOE4 carriers. Longitudinal studies of clinical decline from mild cognitive impairment (MCI) to AD are mixed, with some but not all suggesting that the APOE4 allele increases the risk of conversion from MCI to AD. 7 The data on clinical conversion from healthy aging to MCI or AD are similarly mixed. To date, there have been 6 longitudinal studies examining the role of APOE4 in the risk of converting from healthy aging to MCI or AD. [8] [9] [10] [11] [12] [13] Of these studies, 4 found a significant effect of APOE4 and 2 did not, even when combining APOE4 heterozygotes and homozygotes. Thus, although the link between APOE4 and AD is strong, many expected effects, like increasing the risk of conversion from healthy aging to MCI or from MCI to AD, have not been widely replicable.\nA critical and commonly overlooked feature of the APOE4 link to AD is that several case-control studies suggest it is far more pronounced in women. Shortly after the initial linkage studies, a prominent interaction between APOE and sex was reported. 14 The first large meta-analysis of APOE4 studies confirmed the interaction and found that the effect was most prominent among subjects with 1 copy of the APOE4 allele and 1 copy of the risk-neutral APOE3 allele. Women with 1 APOE4 allele had up to a 4-fold increased risk when compared to women homozygous for the APOE3 allele. By contrast, men with 1 APOE4 allele had little to no increase in risk. 15 This finding has been replicated and yet is rarely considered in clinical AD research, where male and female APOE4 carriers are generally viewed as having equal risk. 16, 17 Although case-control studies of AD support an interaction between APOE4 and sex, such studies are less conclusive than prospective cohort studies, particularly in diseases like AD with a long preclinical phase. 18, 19 The interaction between APOE4 and sex has not been established either in prospective cohorts of healthy older controls converting to MCI or AD or in prospective cohorts of MCI patients converting to AD. Most prospective studies examining the main effect of APOE4 on incident MCI or AD have included sex as a covariate, but not explicitly tested for an APOE4-by-sex interaction. To our knowledge, only 1 prospective study has examined the effect of this interaction on clinical conversion, in this case from healthy aging to AD. Beydoun and colleagues reported a main effect of APOE4 but no significant interaction with sex. 8 As acknowledged by the authors, this study, with 113 incident cases of all-cause dementia, may not have been adequately powered to detect a sex interaction.\nIn the current study, we hypothesized that the APOE-by-sex interaction would be evident in the risk of converting from healthy aging to MCI=AD and from MCI to AD and specifically that a single APOE4 allele would confer greater risk of conversion in women than in men. To test this, we took advantage of a large, multisite, longitudinal aging and dementia database available through the National Alzheimer's Coordinating Center (NACC). In addition, to explore potential biochemical changes underlying these hypothesized effects, we also examined the APOE-by-sex interaction in CSF data from healthy older controls and MCI patients available in a second, multisite aging and dementia data set, the Alzheimer's Disease Neuroimaging Initiative (ADNI). In this case, we hypothesized that a single copy of the APOE4 allele would result in more AD-like changes in women than in men (ie, lower Ab levels, higher tau levels, higher phosphorylated-tau levels, and higher tau-to-Ab ratio)."}, {"section_title": "Subjects and Methods", "text": ""}, {"section_title": "Assessing Conversion Risk in the NACC Data Set", "text": "The NACC curates data collected at 34 past and present AD centers across the United States. For this study, we used data from 11,654 nondemented subjects collected in the longitudinal Uniform Data Set, [20] [21] [22] We restricted our analysis to subjects who were rated as healthy control (HC) or MCI at their initial assessment at study entry, who had an APOE genotype available, and who had a minimum of 1 follow-up visit at 12 months or later. These filter criteria led to a cohort of 8,084 subjects (HC: n 5 5,496; MCI: n 5 2,588; Table 1 ).\nThe clinical conversion risk was modeled using a Cox proportional hazards model. We performed the Cox regression analysis in 2 subgroups of the cohort: (1) HC only and (2) MCI only. For controls, clinical conversion was defined as the first detection of MCI or AD (using primary diagnoses of possible or probable AD based on the National Institute of Neurological and Communicative Diseases and Stroke-Alzheimer's Disease and Related Disorders Association criteria 23 ) , and the Cox model was used to model the hazard of developing MCI or AD among controls, whichever occurred first. For MCI subjects, conversion was defined as the first detection of AD (using primary diagnoses of possible or probable AD), and the Cox model was used to model the hazard of developing AD among MCI subjects. Any additional outcomes (such as reversions from MCI to HC or development of non-AD dementia) were treated as nonconversions. The subject age at the visit where clinical progression was detected served as the time of event; subjects who had not progressed at their last recorded visit were right-censored. In addition, to account for the period prior to inclusion in the cohort, a left-truncated design was used. Furthermore, we corrected the dependence between truncation and failure time (detected using Tsai's test 24 ) by estimating timedependent effects of the age at study entry in the Cox regression. This method is a generalization of the one proposed by Gail et al. 25 More precisely, we included age as a covariate in the Cox regression model and allowed the coefficient of age to be different within follow-up periods starting before and after 29 [28] [29] [30] 29 [28] [29] [30] 29 [28] [29] [30] 29 [28] [29] [30] 29 [28] [29] [30] 29 [28] [29] [30] 29 [28] [29] [30] 0.68 [12] [13] [14] [15] [16] [17] [18] 16 [12] [13] [14] [15] [16] 16 [12] [13] [14] [15] [16] [17] [18] 16 [12] [13] [14] [15] [16] [17] [18] 16 [12] [13] [14] [15] [16] [17] [18] 16 [12] [13] [14] [15] [16] [17] [18] 16 [14] [15] [16] [17] [18] 0.84 28 [26] [27] [28] [29] 28 [28] [29] 28 [26] [27] [28] [29] 28 [26] [27] [28] [29] 28 [26] [27] [28] [29] 28 [26] [27] [28] [29] 27 [25] [26] [27] [28] [29] 0.31"}, {"section_title": "0.19", "text": "Columns show total subjects, subjects in each genotype, the p-value for the variable being different between e2/e3 and e3 homozygotes, and the p-value for the characteristic being different between e3\nhomozygotes and e3/e4 heterozygotes. P-values were computed using a logistic regression. Age refers to age at entry into the cohort. Number of visits refers to the number of visits recorded in the data- the median age of the study sample (73.0 for controls and 74.5 for MCI; see Table 1 ). The data were analyzed across sexes with covariates for APOE2 carrier status, APOE4 carrier status, APOE2 homozygosity, APOE4 homozygosity, sex, APOE2-bysex interaction, and APOE4-by-sex interaction. Due to the small sample size (see Table 1 ), APOE2 homozygosity was not modeled in MCI subjects. Furthermore, the model was adjusted for years of education and Mini-Mental State Examination score at study entry, and stratified by race and Hispanic origin by grouping all non-Hispanic white subjects in one group and everyone else in a second group. In addition to the full regression model including the APOE2-by-sex and APOE4-by-sex variables, we assessed the risk of clinical conversion attributable to carrying the APOE2 or APOE4 allele for each sex separately in sex-stratified models. Hazard ratios (HRs) along with their 95% confidence intervals (CIs) are reported. To visualize conversion rates with left-truncated and right-censored data, we used the Breslow method to estimate the survival function of the conversion time for subjects entering the study at age 55 years. Given our hypothesis, based on the Farrer et al metaanalysis, 15 that the APOE4-by-sex interaction would be strongest in e3=e4 heterozygotes versus e3 homozygotes, we also performed the Cox regression on a restricted subset of individuals having either the e3 homozygote (e3=e3) or the e3=e4 heterozygote genotype."}, {"section_title": "Effects on Spinal Fluid Biomarkers in the ADNI Database", "text": "We studied whether sex modulates the APOE4 carrier effect on the most commonly used CSF biomarkers of AD. This analysis used data from the ADNI database (www.loni.usc.edu=ADNI; date accessed: November 4, 2013). See Weiner et al 26 for an overview of the ADNI cohort. It should be noted that some ADNI subjects are likely also included in the NACC data set, although it is not currently possible to identify which subjects are in both data sets."}, {"section_title": "CSF Biomarkers", "text": "In ADNI, a particular emphasis was placed on 4 established CSF biomarkers: Ab, total tau, phosphorylated tau 181p (p-tau), and the ratio of total tau to Ab. Biomarkers were assessed at study entry and at follow-up visits for a subset of subjects (see Shaw et al 5 for details on biomarker acquisition).\nCSF biomarkers were available for n 5 1,094 subjects at study entry. Again, the analysis was restricted to the HC (n 5 272) and MCI (n 5 618) subgroups. Table 2 lists sample sizes for each genotype and clinical category along with population demographics.\nThe APOE4-by-sex interaction on CSF biomarker levels at study entry was examined separately in HC and MCI subjects using an analysis of covariance (ANCOVA) adjusting for APOE2 and APOE4 carrier status, APOE4 homozygosity, APOE2-by-sex interaction, sex, age, age-squared, years of education, and ADNI study phase (ANDI1 or ADNIGO/ADNI2). Due to the small sample sizes (see Table 2 ), APOE2 homozygosity was modeled neither in the HC nor in the MCI analyses. P-values for the 8 tests (ie, 4 CSF biomarkers for each HC and MCI) for an APOE4-by-sex interaction were corrected for multiple testing using the Holm-Bonferroni method. In an effort to examine potential Ab-independent effects of APOE4, we report the total tau and p-tau analyses before and after adjusting for Ab levels.\nAgain, given our hypothesis of a stronger APOE4-by-sex interaction in e3=e4 heterozygotes versus e3 homozygotes, we performed the ANCOVA on a restricted subset of individuals having either the e3 homozygote (e3=e3) or the e3=e4 heterozygote.\nThe APOE4-by-sex interaction showed only a nominally significant effect (p 5 0.02, p cor 5 0.12) for CSF Ab levels in healthy controls (more AD-like in men; Fig  5A) ; there was no evidence for an interaction by sex on the other 3 biomarkers among controls (Table 4) . Among MCI subjects, we detected a significant APOE4-by-sex interaction on CSF tau levels (p cor 5 0.009) and on the tau-Ab-ratio (p cor 5 0.02) as well as a nominally significant effect on CSF p-tau (p 5 0.025, p cor 5 0.13) with a more AD-like pattern in female APOE4 carriers (see Fig 5C, D) . Results for tau and p-tau remained qualitatively unchanged after adjusting for Ab (see Table 4 ). The restricted analysis on e3 homozygous and e3=e4 heterozygous subjects confirmed the same APOE4-by-sex interactions (data not shown)."}, {"section_title": "Results", "text": ""}, {"section_title": "Clinical Conversion Risks", "text": "During the observation period, 959 healthy subjects (17.5%) converted to MCI or AD. The APOE4-by-sex interaction is significant (p 5 0.011) and driven by an increased APOE4 effect on conversion in women. Among healthy older men, there is a marginally significant increase in conversion risk for APOE4 carriers compared to noncarriers (HR 5 1.27, 95% CI 5 1.01-1.59, p 5 0.045). Among healthy older women, APOE4 carriers show a highly significant 1.8-fold increase in risk (95% CI 5 1.5-2.16, p 5 2.5e-10). The survival function plot (Fig 1) shows that noncarrier females are the group with the least risk in progressing from healthy control to MCI or AD (median conversion age (MCA) 5 80.9 years, 95% CI 5 79.7-83.0). APOE4 carriers, regardless of sex, show the highest risk for clinical progression (MCA 5 68.7, 95% CI 5 67.6-70.7 and MCA 5 71.6, 95% CI 5 69.7-72.9 for males and females, respectively), whereas noncarrier males are at intermediate risk (MCA 5 74.5, 95% CI 5 70.2-77.6).\nAmong MCI subjects, the APOE4 effect was significant in men and women, and the interaction was not significant (p 5 0.14; Table 3 ). Male APOE4 carriers show an HR of 1.64 (95% CI 5 1.33-2.02, p 5 3.8e-6), whereas female APOE4 carriers exhibit an HR of 2.16 (95% CI 5 1.74-2.69, p 5 2.9e-12; Fig 2) .\nThe APOE2-by-sex interaction is significant only in healthy controls (p 5 0.045). Here, men carrying the APOE2 allele show a nonsignificant decrease in risk (HR 5 0.74, 95% CI 5 0.53-1.01, p 5 0.06), whereas female APOE2 carriers exhibit a nonsignificant increase in risk (HR 5 1.12, 95% CI 5 0.90-1.40, p 5 0.32).\nRestriction of the analysis to e3=e3 and e3=e4 subjects confirms the APOE4-by-sex interaction in healthy controls (p 5 0.02; Fig 3) and reveals a significant APOE4-by-sex interaction among MCI subjects (p 5 0.02; Fig 4) . Among controls, a single copy of the APOE4 allele significantly increases the conversion risk in women (HR 5 1.8, 95% CI 5 1.48-2.19, p 5 3.5e-9) The main figure shows the survival function plot for conversions from healthy control (HC) to either mild cognitive impairment (MCI) or possible=probable Alzheimer disease (AD) for subjects entering the study at age 55 years based on left-truncated and right-censored data. In contrast to the Cox regression, no stratification or covariate adjustment was applied. The inset depicts the hazard ratio for converting from HC to MCI or AD computed separately for each sex using a Cox regression model (significant effects at *p £ 0.05 and ***p < 0.001). Blue and red refer to males and females, respectively. The APOE4 carrier status increases the risk of clinical decline in both women and men with mild cognitive impairment (MCI). The main figure shows the survival function plot for conversions from MCI to possible=probable Alzheimer disease (AD) for subjects entering the study at age 55 years based on left-truncated and right-censored data. In contrast to the Cox regression, no stratification or covariate adjustment was applied. The inset depicts the hazard ratio for converting from MCI to AD computed separately for each sex using a Cox regression model (***significant effect at p < 0.001). Blue and red refer to males and females, respectively."}, {"section_title": "Discussion", "text": "We have demonstrated, in a large, longitudinal sample, that the risk of clinical conversion conferred by the APOE4 allele is significantly greater in women than in men. The interaction was present in the conversion from healthy aging to MCI=AD and in the conversion from MCI to AD. Among healthy controls, the interaction was detectable both in the full analysis (including all genotypes) and in the predefined subanalysis restricted to the 2 most common genotypes (e3 homozygotes vs e3=e4 heterozygotes, accounting for 82% of controls). In this sample, healthy older male APOE4 carriers were at a marginally significant increased risk of converting to MCI or AD when compared with men who did not carry the APOE4 allele. By contrast, healthy older female APOE4 carriers were almost twice as likely to develop MCI or AD when compared to female noncarriers. In the subanalysis, the APOE4 effect remained significant in women but was no longer significant in men. Among all MCI subjects, APOE4 carriers of both sexes had an increased risk of conversion to AD. In the subanalysis (e3 homozygotes vs e3=e4 heterozygotes, accounting for 81% of MCI subjects), the APOE4 effect was significant in men and women but was significantly stronger in women (APOE4-by-sex interaction: p 5 0.02). These prospective findings on clinical conversion support earlier case-control analyses demonstrating that women with a single APOE4 allele were at increased risk of developing AD compared to women who were homozygous for the APOE3 allele, whereas men with a single APOE4 allele were not at increased risk when compared to men who were APOE3 homozygotes. [15] [16] [17] Although the APOE2 for subjects with either the e3=e3 or the e3=e4 genotype entering the study at age 55 years based on left-truncated and rightcensored data. In contrast to the Cox regression, no stratification or covariate adjustment was applied. The inset depicts the hazard ratio for converting from HC to MCI or AD computed separately for each sex using a Cox regression model (***significant effect at p < 0.001). Blue and red refer to males and females, respectively. FIGURE 4: A single APOE4 allele increases the risk of clinical decline in women with mild cognitive impairment (MCI) more than in men. The main figure shows the survival function plot for conversions from MCI to possible=probable Alzheimer disease (AD) for subjects with either the e3=e3 or the e3=e4 genotype entering the study at age 55 years based on left-truncated and right-censored data. In contrast to the Cox regression, no stratification or covariate adjustment was applied. The inset depicts the hazard ratio for converting from MCI to AD computed separately for each sex using a Cox regression model (***significant effect at p < 0.001). Blue and red refer to males and females, respectively.\nfindings should be considered preliminary, owing to the smaller sample sizes, here too we detected a significant interaction with sex in which the APOE2 allele trended toward being protective in male, but not female, controls. The CSF biomarker results reported here suggest that the increased risk of AD in female APOE4 carriers occurs downstream of Ab pathology. Ab pathology is believed to occur early during disease pathogenesis, before the appearance of tau-related changes reflective of neuronal injury. The effect of carrying an APOE4 allele on lowering Ab levels was quite pronounced in both healthy older men and women. Total tau and p-tau levels showed a main effect of APOE4 but did not show any APOE-by-sex interactions in the healthy older controls. Among MCI patients, however, APOE4 increased total tau levels significantly more in women than in men, even after controlling for Ab levels. Similarly, among MCI patients, APOE4 increased the ratio of total tau to Ab significantly more in women than in men, despite similar Ab levels. Although p-tau levels showed a nominally significant trend in the same direction (more AD-like in female APOE4 carriers), this did not survive Holm-Bonferonni correction for multiple comparisons.\nOne possible explanation for the increased effect of APOE4 on the tau biomarker in women is that amyloid changes occur earlier in women than in men. This possibility is less likely given that our analyses adjusted for linear and quadratic effects of age on amyloid, but subsequent longitudinal studies can assess whether there is an earlier start to amyloid pathology in women with the APOE4 allele. An alternative explanation is that for an equivalent amount and duration of amyloid pathology, the APOE4 allele results in more tau-related pathology in women compared to men. APOE4 may initially change Ab processing in a manner that is roughly equivalent for both sexes but then triggers a more robust acceleration of tau pathology in women. This explanation also appears unlikely, because even after adjusting for the effect of amyloid on tau, the APOE-by-sex interaction is still significant. An Ab-independent effect of APOE on CSF tau has also previously been shown by Cruchaga et al, where polymorphisms in the APOE locus were strongly associated with CSF tau levels even after an adjustment for Ab levels. Two caveats should be considered when interpreting these results. First, our results may generalize imperfectly, as neither the NACC nor the ADNI data are population-based. For example, a recruitment bias could account for the unexpected finding that the risk of conversion from healthy aging to MCI or AD is less for female than male APOE3 homozygotes. This novel finding, although not predicted by our a priori hypothesis, is nonetheless worth pursuing in a population-based study. Second, the Cox model assumes that dropout and censoring are unrelated to conversion. Impaired subjects may have been more likely to drop out, and there may have been differential effects by sex."}, {"section_title": "27", "text": "Despite compelling evidence from a large metaanalysis of case-controls studies, the field of AD research has largely overlooked this potent interaction between APOE and sex. 15 This may have been due in part to the lack of any previous, prospective cohort studies supporting this interaction effect on clinical conversion. 8 It seems likely that a number of inconsistent findings related to APOE, some of which are outlined in the introduction, are a result of investigators overlooking the APOE-by-sex interaction.\nWe hope that the current findings will alert the field to this interaction and the important clinical and scientific implications it carries. From a clinical perspective, these results require careful reexamination of how we should interpret the finding of a single APOE4 allele in men. This bears importantly on encounters with individual patients in terms of diagnostics, prognostics, and genetic counseling. In regard to clinical trials, appreciating the APOE-by-sex interaction should allow for more refined genotype stratification when, for example, estimating conversion risk in preventative trials. 28 Furthermore, several drug trials have suggested that efficacy and side effect profiles may differ between APOE4 carriers and noncarriers, although these studies have not assessed the sex interaction. 29 From a scientific standpoint, these findings should motivate investigations into the potential mechanisms of the APOE-by-sex interaction. Explicitly modeling this interaction, both in human studies and in animal model studies, as is now only FIGURE 5: Sex modifies the APOE4 effect on cerebrospinal fluid (CSF) biomarker levels. CSF biomarker levels in healthy control (HC) and mild cognitive impairment (MCI) subjects are shown with 95% confidence intervals. Depicted CSF biomarker levels were adjusted for age, age-squared, years of education, Mini-Mental State Examination score, and Alzheimer's Disease Neuroimaging Initiative study phase. Blue squares and red circles correspond to men and women, respectively. Dashed lines highlight the change in CSF levels between e3 homozygotes and e4 heterozygotes. P-values for the APOE by sex effect were computed using an analysis of covariance. *p < 0.05 (corrected for multiple comparisons), **p < 0.01 (corrected). A-D correspond to b-amyloid, total tau, tau-to-Ab-ratio, and p-tau, respectively.\noccasionally done, has the potential to yield new insights into the strongest genetic risk factor for late onset AD."}, {"section_title": "30-32", "text": ""}, {"section_title": "Acknowledgment", "text": "This study was supported by the JNA Foundation and by NIH National Institute of Neurologic Disorders and Stroke grant NS073498 (M.D.G. principal investigator). The NACC database is funded by National Institute on Aging grant U01 AG016976. Data collection and sharing for this project was funded by the ADNI (NIH grant U01 AG024904). ADNI data are disseminated by the Laboratory for Neuroimaging at the University of Southern California, Los Angeles. Cerebrospinal data used in the preparation of this article were obtained from the ADNI database (www.loni.usc.edu-ADNI). As such, ADNI investigators contributed to the design and implementation of ADNI and=or provided data but did not participate in the analysis or writing of this report. A complete listing of ADNI investigators can be found at http:==adni.loni.usc.edu=wp-content=uploads=how_to_ apply=ADNI_Acknowledgement_List.pdf "}]