[{"section_title": "Abstract", "text": "Prediction of disease progress is of great importance to Alzheimer disease (AD) researchers and clinicians. Previous attempts at constructing predictive models have been hindered by undersampling, and restriction to linear associations among variables, among other problems. To address these problems, we propose a novel Bayesian data-mining method called Bayesian Outcome Prediction with Ensemble Learning (BOPEL). BOPEL uses a Bayesian-network representation with boosting, to allow the detection of nonlinear multivariate associations, and incorporates resamplingbased feature selection to prevent over-fitting caused by undersampling. We demonstrate the use of this approach in predicting conversion to AD in individuals with mild cognitive impairment (MCI), based on structural magnetic-resonance and magnetic-resonance-spectroscopy data. This study includes 26 subjects with amnestic MCI: the converter group (n = 8) met MCI criteria at baseline, but converted to AD within five years, whereas the non-converter group (n = 18) met MCI criteria at baseline and at follow-up. We found that BOPEL accurately differentiates MCI converters from nonconverters, based on the baseline volumes of the left hippocampus, the banks of the right superior temporal sulcus, the right entorhinal cortex, the left lingual gyrus, and the rostral aspect of the left middle frontal gyrus. Prediction accuracy was 0.81, sensitivity was 0.63 and specificity was 0.89. We validated the generated predictive model with an independent data set constructed from the Alzheimer Disease Neuroimaging Initiative database, and again found high predictive accuracy (0.75)."}, {"section_title": "Introduction", "text": "Prediction of disease progress is very important to researchers studying Alzheimer disease (AD) [1] [2] [3] , and to clinicians taking care of these patients. Mild cognitive impairment (MCI) represents \"a transitional state between the cognition of normal aging and mild dementia\" 3 . The criteria for amnestic MCI 3 are: memory complaint, impaired memory function for age and education, preserved general cognition function, intact activities of daily living, and absence of dementia. Amnestic MCI patients progress to AD at an annual rate of 10-15% 3 ; this progression rate is much higher than the population AD incidence rate of 1-2% per year. Magneticresonance (MR) examination provides a noninvasive and reliable means for examining brain structure and function. Due to the rapid evolution of this technology, researchers now have the potential to improve prognostic accuracy by combining information from several modalities.\nConsequently, many researchers have attempted to use MR-derived features to identify the subset of MCI patients that will develop AD [4] [5] [6] [7] [8] [9] [10] . For example, Killiany et al. 8 constructed a discriminant model to differentiate patients with MCI who ultimately developed AD within three years, from those who did not. Using volumes of the banks of the superior tempo-such BN-model class is called naïve Bayes, in which C is a root node, and other variables are children of C in the BN graph. Naïve Bayes BNs require fewer computational resources than unrestricted BN models, yet the former have been shown to demonstrate excellent classification performance in empirical studies 16 . We therefore chose to base BOPEL on the naïve Bayes class of BNs.\nWe applied BOPEL to an ongoing study of neuroanatomic and neurochemical features that may predict conversion from MCI to AD; we refer to this study as PCD (prediction of cognitive decline). To validate the BN model generated by BOPEL, we applied the BN to an independent test sample acquired from the same population that we used to generate the predictive model. We acquired this independent test data set from the Alzheimer Disease Neuroimaging Initiative (ADNI) database."}, {"section_title": "Materials", "text": "The PCD study included 26 subjects with amnestic MCI. These individuals were recruited by the State-funded Alzheimer disease Research Center of California, University of California San Francisco, and Memory Disorders Clinic at the San Francisco Veterans Affairs Medical Center.\nAll participants had MCI at baseline, based on Petersen's criteria 17 . All subjects were diagnosed after an extensive clinical evaluation, including a detailed history, physical, and neurological examination, neuropsychological screening, and study partner interview. Study partners (a friend or relative who can accompany the volunteer to all clinic visits or can answer questions over the phone) had regular contact with, and knew the subject for, at least 10 years. As part of the neurological examination, all subjects and study partners were queried about initial and current symptoms, under the following categories: (1) memory, (2) executive, (3) behavioral, (4) language, (5) visuospatial, 20 , the California Verbal Learning Test 21 , and the Weschsler Memory Scale Visual Reproduction Test 22 . The interview with the study partner was based on the Clinical Dementia Rating (CDR) to assess functional ral sulcus and anterior cingulate as regions of interest, the model-based on a discriminant function achieved sensitivity = 0.68 and specificity = 0.48. Most investigations of prediction of AD conversion have generated predictive models based on conventional statistical analysis or machine-learning approaches, including discriminant function analysis 8 , logistic regression 5, 6, 9 , and support vector machines 4, 11 . Many of these analyses have been hindered by undersampling -that is, a small number of subjects relative to a large number of observed variables. Undersampling often leads to over-fitting, a situation in which the predictive model describes noise, rather than true associations among the variables being observed.\nTo address these problems, we propose a novel outcome-prediction approach that we call Bayesian Outcome Prediction with Ensemble Learning (BOPEL). Constructing outcome-prediction models based on image data is a challenging problem. Generalizability, a model's ability to correctly classify a future case sampled from the same population used to generate the predictive model, is a crucial characteristic of a predictive model, in that it directly bears on the utility of applying that predictive model in the clinic. However, in many previously reported studies, the number of variables observed greatly exceeded the number of subjects.\nIn the case of undersampling, if the outcomeprediction method does not incorporate feature selection or regularization, the resulting predictive model is prone to overfitting. An overfitted model usually has poor generalizability. BOPEL uses regularization 12 , feature selection 13 , and ensemble learning 13 to address the overfitting problem. BOPEL is based on a Bayesiannetwork (BN) representation, which has an embedded Bayesian regularization procedure; this approach has achieved high prediction accuracy in a variety of applications 14 . BOPEL also incorporates resampling methods 13 to stabilize the feature-selection process, and it utilizes boosting 15 to improve prediction performance.\nA Bayesian network (BN) is a probabilistic graphical model that represents a joint probability distribution over a set of variables. Nodes in a BN graph represent variables of interest, and edges represent probabilistic associations among variables. In a BN, each node has a conditional-probability distribution, which quantifies the association between that variable and the variables with which it is associated.\nThere are different types of BNs, based on constraints on allowed model structures 14 . One follow-up met the NINCDS-ADRDA criteria for AD. The non-converter group (n = 18) contained subjects who met MCI criteria at baseline and at follow-up.\nEach individual underwent structural MR examination and MR spectroscopy (MRS) at baseline. For each subject, high resolution T1weighted MR images were acquired, with parameters: magnetization prepared rapid gradient echo imaging with TR/TE/TI = 300/9.7/4 ms, 15º flip angle, 256 × 256 field of view. The T1-weighted volumes consisted of 154 1.5-mm thick coronal images with 1 mm × 1 mm inplane resolution. The reconstructed image voxel size was 1 mm × 1 mm × 1.5 mm. Figure  1 shows the baseline T1-weighted images for two subjects in the PCD study. For single-voxel proton spectroscopy, the voxel was placed in the lowest portion of the posterior aspect of the parietal lobe, such that it did not overlap with the occipital lobe. Acquisition parameters were TR/TE/TM = 11800/20/10 ms, voxel volume was 8.1 mL, with dimensions of approximately 22.5 mm left-right, 24 mm anterior-posterior, and 15 mm superior-inferior, to cover most of the abilities, and on the Neuropsychiatric Inventory to evaluate behavior. Screening for depression was based on the 30-item Geriatric Depression Scale (self-report) and an interview with the study partner. Diagnosis was determined by consensus involving the neurologist, neuropsychologist, and nurse using only the diagnostic information described above.\nSubjects were excluded if they met criteria for dementia (Diagnostic and Statistical Manual of Mental Disorders, Fourth Edition (DSM-IV)), a history of a neurological disorder, current psychiatric illness, head trauma with loss of consciousness greater than 10 minutes, severe sensory deficits, substance abuse.\nEach participant underwent clinical and neuropsychological assessments annually. The diagnosis of AD was based on the National Institute of Neurologic and Communicative Disorders and Stroke and Alzheimer Disease and Related Disorders Association (NINCDS-ADRDA) criteria 23 .\nOn the basis of these evaluations, we divided these 26 subjects into two groups. The converter group (n = 8) included subjects who met MCI criteria at baseline, but within 5 years of (for each of 70 structures defined in Freesurfer) and intracranial volumes. This automated procedure for volume calculation has been validated by several research groups [27] [28] [29] . As is typically done for volumetry, we normalized these regional volumes to total intracranial volume, and then normalized each feature to zero mean and unit variance. We used the GAmma Visual Analysis (GAVA) software application 30 to perform baseline correction of the MRS data. GAVA generated seven neurochemical baseline features, which were metabolite levels in the posterior cingulate: Myo-inositol (mI), NAA, Creatine (Cr), Choline (Cho), NAA/Cho, NAA/Cr, and Cho/Cr. We normalized these features to zero mean and unit variance."}, {"section_title": "Bayesian outcome prediction with ensemble learning (BOPEL)", "text": "BOPEL includes two components: predictivemodel generation, and application of this model for prediction. The predictive-model-generation component constructs a predictive model M. The prediction component uses M to infer the state of the outcome variable (in this case, MCIAD conversion) for a new patient, based on the states of baseline features X.\nThe input to BOPEL's model-generation process consists of a training data set, D = {X, C}, where C is a binary outcome variable that assumes a value in {conversion, no conversion}, and X i is a baseline feature (e.g., elevated Cho, decreased volume of a structure). BOPEL uses the K2 score 31 to compare candidate BN models; this score reflects how well a model represents associations among variables in a data set. The output of BOPEL's model-generation process is a predictive BN model M.\nposterior cingulate gray matter. We selected the posterior cingulate region because several studies have reported metabolic changes in this region in MCI and AD patients 24, 25 .\nFor model validation, we used an independent data set constructed from version 2010-11-20 of the ADNI database 25 (http://www.loni. ucla.edu/ADNI), which included 397 subjects with MCI at baseline. We selected age-and sex-matched subjects from the ADNI database with respect to the PCD study. A general practice in the machine-learning community is to ensure that the class distributions of the training data set and the validation data set are comparable. For the purposes of this analysis, we ensured that the proportions of converters in the PCD and ADNI data sets were comparable. Based on these criteria, we selected 48 ADNI subjects to build a validation data set."}, {"section_title": "Methods", "text": "The outcome-prediction problem involves the generation of a model that predicts the outcome variable, denoted by C, based on a set of features measured at baseline, denoted by X. In this paper, we assume that C is binary (i.e., conversion/no conversion). The feature vector X can include imaging-derived features -such as regional gray-matter volume -and demographic variables, such as age."}, {"section_title": "Data preprocessing and feature extraction", "text": "Most structural MR studies of AD conversion have been based on regional volumes. We used Freesurfer (an MR brain image processing software package) 27 to process T1-weighted MR images, and to compute regional volumes "}, {"section_title": "Model evaluation", "text": "We used leave-one-out cross validation (LOOCV) to evaluate BOPEL's prediction performance. In LOOCV, we partitioned the data set D into N total data sets (N total is the total number of subjects in the study). During each iteration, one subject was left out to test the predictive model, and a model was generated based on the remaining subjects.\nWe evaluated BOPEL's performance based on five metrics: accuracy, sensitivity, specificity, positive predictive value, negative predictive value. Predictive accuracy (acc) is defined as where N corr is the number of correctly labeled subjects; the error rate (err) is defined as 1acc. Sensitivity is the proportion of subjects who progress to AD and are labeled as converters by BOPEL. Specificity is the proportion of subjects who do not progress to AD and are labeled as non-converters by BOPEL. Positive predictive value (PPV) is the proportion of subjects with positive test results (labeled as converters) who are correctly labeled. Negative predictive value (NPV) is the proportion of subjects with negative test results (labeled as nonconverters) who are correctly labeled.\nTo estimate the consistency of feature selection, we computed the edge frequency, defined as where I [condition] is a function that returns 1 if a condition is true, and that otherwise returns the value 0. child i (C) is the child set of C in the i th model."}, {"section_title": "Results", "text": "During the follow-up period, eight of the 26 subjects had progressed to probable AD. Table 1 lists these subjects' baseline demographic characteristics and a subset of the memory scores and measures of functional activities. The mini-mental state examination (MMSE) is a questionnaire test to screen for cognitive impairment; a higher score is better (total possible was 30). The CVTR score (from the California Verbal Learning Test II) measures total recall from five learning trials; a higher score is Figure 2 illustrates the predictive-modelgeneration process. First, BOPEL converts any continuous baseline variables into categorical variables by thresholding. BOPEL determines the optimal threshold based on the resulting binary variable's K2 score.\nAfter discretization, BOPEL performs feature selection. BOPEL uses BN-structure generation for feature selection, which has been widely employed for generating predictive BN models 14 .\nIn BOPEL, the feature-selection process finds a subset of features that, when combined into a naïve Bayes network, have maximal K2 score.\nAfter BOPEL generates the optimal BN, the child set of C in that BN constitutes the selected features. For example, if the BN generated by BOPEL contains the edges C → X 1 , and C → X 3 , then the selected feature set is {X 1 , X 3 }.\nOne problem with this approach is that the feature-selection process may not be stable; that is, it may not return similar results given small perturbations of the input D. This instability may be due to the use of heuristic search, or due to small sample size, among other causes. To solve this problem, BOPEL incorporates ensemble learning to stabilize the feature-selection process. In particular, BOPEL applies bootstrap resampling to D, resulting in a series of re-sampled data sets. Then, for each re-sampled data set, BOPEL generates a BN model, from which we obtain the feature set (i.e., baseline measurements that are predictive of outcome). In the feature-aggregation step, BOPEL calculates the frequency of each feature, ranks features by how frequently they appear, and selects the top-ranked features. The number of highly ranked features to be included in the final model is determined based on internal cross-validation. Once BOPEL constructs a predictive model, it uses maximumlikelihood methods 32 to estimate the conditional probabilities for this model.\nAlthough BOPEL builds models using features that are strongly associated with C, there is no exact correspondence between data likelihood and label-prediction accuracy 14 ; that is, M may not achieve high prediction accuracy, even though it consists of the most frequently identified predictive features. To solve this problem, we incorporated boosting 15 -a form of ensemble learning -into BOPEL, to generate an ensemble of predictive models. Briefly, boosting generates an ensemble of models by perturbing the data D, and predicts the state of C for new cases by combining predictions across all models in the ensemble. frequency greater than 0.5 (that is, they were included in the majority of models): LH (frequency = 1.0), RSTSBank (frequency = 0.65), REnt (frequency = 0.80), LLing (frequency = 0.88), and LRMF (frequency = 0.58). We consider these features to be stable; that is, they were frequently detected across a series of perturbations of the data. These features exactly correspond to the features of M*. Table 2 lists baseline volumes for these five structures, for the converter and non-converter groups.\nAs estimated by cross validation, BOPEL's accuracy was 0.81, sensitivity was 0.63, specificity was 0.89, positive predictive value was 0.71, and negative predictive value was 0.84.\nTo validate the model generated by BOPEL, we used an independent data set constructed from the ADNI database 26 ; Table 3 lists demographic information for these subjects.\nBaseline T1-weighted MR examinations for these subjects were acquired according to the ADNI acquisition protocol 26 , and regional brain volumes were calculated by the ADNI investigators using Freesurfer. We normalized these regional volumes to total intracranial volume, and then normalized each feature to zero mean and unit variance. The ADNI MR-acquisition protocol does not include MRS data, however, since the final diagnostic model based on the PCD data set only used features from structural MRI, the lack of MRS data in the ADNI validation data set had no effect on our validation. better. The functional activities questionnaire (FAQ) 32 measures functional abilities; a lower score is better.\nWe used the Wilcoxon rank-sum test to detect group differences for continuous variables (age, education, MMSE, CVTR, and FAQ), and the Fisher exact statistic to detect group differences for categorical variables (sex and handedness). We found no significant difference in age, sex, handedness, education, MMSE, CVTR, or FAQ.\nLOOCV resulted in 26 training data sets and 26 predictive models. We found that the predictive features identified by BOPEL were stable across different predictive models. In particular, of the 26 predictive models that BOPEL generated during cross validation, nine (35%) contained the same feature set, consisting of volumes of the left hippocampus (LH), the banks (i.e., adjacent cortical areas) of the right superior temporal sulcus (RSTS-Bank), the right entorhinal cortex (REnt), the left lingual gyrus (LLing), and the left rostral middle frontal gyrus (LRMF). Let M* denote this five-variable set. Other models differed only slightly from M* (i.e., by the inclusion or exclusion of no more than two variables). This high concordance was probably due to our use of ensemble learning to stabilize the modelgeneration process.\nThe 26 models that BOPEL generated in the course of LOOCV contained a total of 13 different features. Of these features, five had Table 2 Mean regional volumes predictive of AD conversion; standard deviations are in parentheses. We first adjusted these regional volumes to total intracranial volume, and then normalized them to zero mean and unit variance.\nHippocampus and entorhinal cortex are among the biomarkers most consistently found to predict AD conversion 5, 7 . Devanand et al. 5 evaluated the utility of MR hippocampal and entorhinal cortex atrophy in predicting AD conversion. They used logistic regression to build the predictive model, and found that hippocampal and entorhinal cortical atrophy contributes to the prediction of conversion to AD.\nWe also found that the volume of the banks of the right superior temporal sulcus was a predictor of AD conversion. Killiany et al. conducted discriminant function analysis, including a total of 14 variables: 11 regions of interest, and age, sex and intracranial volume, for each subject. They reported that the volume of the banks of the right superior temporal sulcus contributed significantly to the discrimination of patients with MCI who ultimately developed AD within three years, from those who did not 8 . The superior temporal sulcus region has been thought to play a role in memory, or in controlling or regulating attention necessary for memory 34 . BOPEL also identified low baseline volume of the left lingual gyrus as being predictive of AD conversion. Similarly, Chetelat et al. analyzed MR images of 18 amnestic MCI individuals (seven converters) using voxel-based morphometry, and reported that the lingual gyri had lower baseline gray-matter volume in converters 35 . We found that lower baseline volume of the left rostral middle frontal gyrus was predictive of AD conversion. This biomarker for AD conversion was also reported by Whitewell et al. 36 , based on voxel-wise morphometry.\nWe found hemispheric (left-right) differences in the five brain regions that are predictive of AD conversion: three of these regions are in the left cerebral hemisphere, and two are in the right hemisphere. Of existing studies that use regional volumes to predict AD conversion, some 5, 6, 8 have combined the volumes of left-and right-sided structures. However, Chételat et al. 35 used voxel-based morphometry to map structural changes associated with conversion from Applying the predictive model built based on the PCD data set (which did not incorporate any information from the ADNI validation data set), and classifying subjects in the ADNI validation data set (converter or non-converter), we found that BOPEL's prediction accuracy was 0.75, sensitivity was 0.56, specificity was 0.87, positive predictive value was 0.71 and negative predictive value was 0.76. Given complete independence of the data we used to build our predictive model and the test (ADNI) data, this experiment indicates that BOPEL's model accurately predicts MCI-AD conversion."}, {"section_title": "Discussion and Conclusion", "text": "We found that BOPEL uses baseline structural-MR data to predict MCI to AD conversion with high accuracy. Of note, prediction accuracy was almost as high for independently acquired ADNI subjects.\nBOPEL, a Bayesian approach to outcome prediction, has the following advantages over other approaches. First, it is accurate: BOPEL uses a BN representation with boosting to increase model-representation capacity, and incorporates resampling-based feature selection to prevent over-fitting. Second, ensemble learning ensures that models generated by BOPEL will be stable even when data are undersampled, which is commonly the case in outcome-prediction studies. Third, the models generated by BOPEL are declarative in nature, and can be easily understood. Other approaches, such as logistic regression, also have this advantage, however support vector machines and neural networks do not.\nIn our analysis of data from the PCD study to predict AD conversion, we found that five features were predictive of AD conversion: volumes of the left hippocampus (frequency = 1.0), the banks of the right superior temporal sulcus (frequency = 0.65), the right entorhinal cortex (frequency = 0.80), the left lingual gyrus (frequency = 0.88), and the left rostral middle frontal gyrus (frequency = 0.58). In this study, we used cross-validation and an independent validation data set to estimate model accuracy. However, most of the studies in 5, 6, [8] [9] [10] reported discrimination accuracy only. That is, most researchers computed prediction accuracy by applying the predictive model to the training data that generated the model. For instance, Dickerson et al. 6 built a predictive model with sensitivity = 0.83 and specificity = 0.72, based on entorhinal cortex as the neuroanatomic marker, and logistic regression as the classification approach. However, these sensitivity and specificity measures were obtained by applying the logistic regression to the same training data set. Relative to the accuracy estimated by cross-validation or an independent validation data set, discrimination accuracy yields a highly optimistic estimate of model generalizability and performance 13, 38 .\nAlthough BOPEL analysis of the PCD study yielded biomarkers that accurately predict MCI → AD conversion, these results do not imply that only neuroanatomic and/or neurochemical features can predict AD conversion. Other imaging-derived or non-imaging features may also be predictive of AD conversion. Predictors of conversion from MCI to AD include neuropsychological predictors, neuroradiological markers, APOE genotype, depression, and blood and cerebrospinal fluid biomarkers. For example, Small et al. reported that features derived from Positron Emission Tomography (PET) images obtained with 2-deoxy-2-[F-18]fluoro-D-glucose can differentiate subjects with MCI from those with AD and normal controls 39 . Jack et al. 40 found that Pittsburgh Compound B (PiB) and MRI provided complementary information to discriminate between cognitively normal, amnestic MCI, and AD subjects; furthermore, diagnostic classification using both PiB and MR was superior to using either modality in isolation. With respect to neuropsychological predictors, Dierckx et al. 41 reported a score of 0 or 1 out of 6 on the Memory Impairment Screen plus as a good indicator of progression to AD among MCI patients. Much research has focused on the discriminative power of β-amyloid and tau proteins to predict AD conversion. For example, Mitchell 42 performed a meta-analysis in-MCI to AD and reported \"essentially symmetrically distributed\" gray-matter (GM) loss in converters ( Figure 5 in Chételat et al 35 ) . Their findings suggest that there are no left-right differences in regions characterizing AD conversion. The discrepancy between Chételat et al.'s and our results can be explained as follows. First, our study was atlas-based, whereas Chételat et al.'s study was voxel-based; therefore, the feature types in our and Chételat et al.'s studies are not directly comparable. Second, Chételat et al. did not build a predictive model; their goal was to find regions demonstrating significantly greater GM loss in converters relative to nonconverters. It is possible that features manifesting group differences were not included in our predictive model. For example, in our study, baseline MMSE demonstrates some degree of group difference (p-value = 0.11). However, baseline MMSE was not included in the predictive model because this feature provided no additional predictive power given the five features included in the model. Third, there are some differences between the study population in Chételat et al.'s study and that of the PCD study. One significant difference is education. Subjects in the PCD study were more highly educated (mean education > 16 years), relative to subjects in Chételat et al.'s study (mean education = 10 years).\nWe included MRS features into the PCD study because several studies had demonstrated that MRS features differentiate normal elderly subjects, patients with AD, and patients with MCI 24, 25, 37 . We found that the final predictive model generated by BOPEL did not include MRS features. This result suggests that, given structural MR features, the additional predictive value of MRS features to predict AD conversion is not significant. However, we should be cautious accepting this finding because of small sample size.\nIn this study, we used the ADNI validation data set (a subset of the ADNI database) to validate the generated predictive model. Predicting AD conversion based on the ADNI study is a very challenging problem. In a recent study of predicting AD conversion based on ADNI, Cuingnet et al. 11 used a support vector machine-based predictive model which used regional cortical-thickness as predictor variables. For evaluation, they randomly split the set of participants into two groups of the same size: a training set and a testing set. They reported sensitivity = 0.27 and specificity = 0.85. We obtained sensitivity = 0.56, We plan to evaluate BOPEL on data sets with large sample sizes, and on other biomedical data sets. There are a few relatively large-scale studies, such as the ADNI study 26 , in which 400 subjects who have MCI were recruited. Analyzing these data will allow us to quantify the effects of sample size on BOPEL's models' prediction accuracy.\nIn these experiments we focused on outcome prediction for a single categorical outcome variable. Many other studies predicting MCI to AD conversion followed a similar overall approach 4, 5, [7] [8] [9] [10] . Other researchers have focused on regression analysis of a continuous outcome variable, such as predicting the time taken for MCI to AD conversion. An interesting direction for our future work is to combine the ensemble learning used in BOPEL with regression analysis, which could provide an estimate of the number of years until conversion."}, {"section_title": "Acknowledgement", "text": "Drs. Chen cluding six studies with MCI subjects, and found that P-tau was modestly successful in predicting progression to dementia in MCI.\nOverall, different predictors provide complementary information, and combining them can improve sensitivity and specificity. We plan to include these features in a BOPEL analysis and build more accurate models of AD conversion.\nBOPEL is based on the discrete, rather than continuous, Bayesian-network representation. We adopted a Bayesian network classifier based on discrete variables, because it has been found to achieve high classification accuracy, it can represent nonlinear multivariate associations among variables, and it readily supports embedded feature selection. However, using discrete Bayesian networks in BOPEL required that we threshold all continuous variables, possibly leading to loss of information. Given that BOPEL accurately predicted AD conversion in individuals with MCI for the PCD data set, and for an independent data set constructed from the ADNI database, it is likely that thresholding did not cause severe loss of information in this study. In future work, we plan to implement methods for analyzing these data that do not involve discretization, to determine the effects of discretization on our results. Also, we restricted the BN architecture to the naïve Bayes class. There exist other types of Bayesian-network classifiers, such as unrestricted BN classifiers 14 and BN classifiers with inverse-tree structure 43 . In the future, we will examine whether the performance of BOPEL can be improved by using other types of BN classifiers.\nThe automated procedure for volume calculation provided by FreeSurfer has been validated by several groups of investigators. Desikan et al. 28 assessed the validity of this automated volume calculation system by comparing the regions-of-interest (ROIs) generated by Free-Surfer to those generated by manual tracing. They used intraclass correlation coefficients to measure the degree of mismatch between FreeSurfer and manual tracing. They found that the automated ROIs were very similar to the manually generated ROIs, with an average intraclass correlation coefficient of 0.835. Similarly, Tae et al. 29 reported that FreeSurfer's automated hippocampal volumetric methods showed good agreement with manual hippocampal volumetry, with intraclass correlation coefficients of 0.846 (right) and 0.848 (left). This automated procedure for volume calculation was also used in the ADNI study. "}]