[{"section_title": "LIST OF FIGURES", "text": ""}, {"section_title": "LIST OF TABLES", "text": ""}, {"section_title": "Introduction", "text": "The surf zone is an energetic region characterized by wave-breaking induced currents, such as undertow, alongshore currents, and low frequency motions. The surf zone is also a dynamic region where currents alter beach morphology and induce sediment transport. Surf zone eddies (f < 0.01 Hz) are low frequency motions that are primarily responsible for nearshore mixing (Spydell et al., 2007) and contribute to marine sediment transport and shoreline erosion. In cases of slowly evolving vortex pairs, surf zone eddies (also termed \"eddies\") also control beach morphology through the development of rhythmic rip channels (Reniers, 2004). In addition to influencing the local morphology and shoreline, eddies affect public health through the distribution of tracers, such as pathogens, throughout the surf zone and the health of local eco-systems through transportation of larvae offshore. Surf zone eddies were first identified by Oltman-Shay et al. (1989) caused by shear instabilities in the alongshore current. They are also directly forced through alongshore nonuniform wave breaking caused by wave groups (Reniers et al., 2004;Long and Ozkan-Haller, 2009), short-crested breaking O(10-50m) due to along crest variation in wave dissipation (Peregrine, 1998;Feddersen, 2014), and alongshore variation in bathymetry (MacMahan et al., 2005;Reniers et al., 2007). Eddies are often considered two-dimensional features with horizontal length scales, ranging from O(10m) to O(100m) (Oltman-Shay et al., 1989;Noyes, 2004), that are larger than the local water depth. Previous field studies focused on the behavior of two-dimensional eddies in the dispersion of contaminants and sediments within the surf zone (Spydell and Feddersen, 2008), while several numerical modeling studies focused on decomposing the influence of eddy generation mechanisms on eddy formation (Long and Özkan-Haller, 2009;Feddersen, 2014). Numerical modeling efforts also include the study of two-dimensional eddy behavior using wave-resolving (WR) and wave-averaged (WA) models within various bathymetric environments, including alongshore uniform beaches (Long and Ozkan-Haller, 2009;Feddersen, 2014) and rip channels (MacMahan et al., 2004). These depth-averaged studies, however, did not consider depth-dependent currents and their influence on eddy structure. Analyses of field data from the Duck94 experiment (Lippmann et al., 2010) and the recent Surf Zone Eddy Experiment (SUZEE) at Duck, NC (Henderson, 2014) indicate the presence of vertical structure in the eddy currents and phases. In particular, Henderson (2014) notes the variation of eddy structure within and outside the surf zone. Near depth-uniform eddy structure is observed within the surf zone while strong depth variability of eddies occurs in the outer surf zone and outside the surf zone. This study numerically investigates the vertical structure of eddies and the forcing mechanisms that alter their structure, such as wave breaking, bottom friction, and horizontal advection, using the Coupled-Ocean-Atmosphere-Wave-Sediment Transport Model (COAWST) (Warner et al., 2010). In particular, we utilize the phase-averaged wave model SWAN and the circulation model ROMS, which newly incorporates the vortex force formalism (Kumar et al., 2012). The vortex force formalism provides a full description of the vertical wave forcing profile, enabling us to accurately model the vertical variation of surf zone eddies. We focus our analyses using model results produced from conditions experienced during the SUZEE field experiment (Henderson, 2014), which is described in Section 3. Details of the model, incorporated model physics, and model inputs are outlined in Section 4. Section 5 reviews the results of model simulations as well as comparisons of modeled and measured data. A discussion of forcing mechanisms contributing to the vertical structure and variation 4 of surf zone eddies is included in Section 6. Finally, a summary and conclusions are provided in Section 7."}, {"section_title": "Field Site and Experiment", "text": "A field study was conducted at the U.S. Army Corp of Engineer's Field Research Facility (FRF) in Duck, NC ( Figure 1). The bathymetry is characterized by a moderate slope with nearly alongshore uniform sand bars along the northern and southern portions of the site. The beach is incised by a large trench beneath the FRF pier, which extends approximately 500m offshore, at the alongshore position y = 515m. From October 16 to November 7, 2011, a coherent array of Acoustic Doppler Current Profilers (ADCPs) was deployed to the north of the pier. The array included seven acrossshore instruments with vertical bins of 0.66m and six instruments in the alongshore with vertical bins of 0.33m ( Figure 1). In addition to the array of in situ current meters, we utilized the FRF's on-site instrumentation and data to ascertain the bathymetry, wave spectra, tidal elevations, and meteorological data. Bathymetry measurements are recorded using the Coastal Research Amphibious Buggy (CRAB), which measured the full bathymetry out to the 8m contour on October 17 and November 17. In addition to the full bathymetry profiles, a small region of the beach near the coherent array was profiled on November 7. Offshore wave heights, directions, and periods are determined from wave spectra measured by fifteen pressure gauges located at the 8m bathymetry contour (i.e. 8m array). Spectral data are sampled at 2Hz and time averaged over 2 hours, 16 minutes, and 32 sec (Long and Oltman-Shay 1991) to provide the full frequencydirectional spread of the wave energy. Additionally, tidal and wind data are measured at the seaward end of the pier. Tidal data are reported every six minutes from the NOAA tide gauge while wind data are obtained at 10 minute intervals from an RM Young Marine anemometer located 18.55m above the National Geodetic Vertical Datum (NGVD). During the deployment, three notable storms occurred, beginning on October 19, October 28, and November 4, respectively ( Figure 2). During the first storm, waves consistently approached from the southeast at oblique angles of -40° from shore normal with wave heights and periods ranging from 0.3m to 1.8m and 5sec to 10sec, respectively. The second storm, beginning on October 28 and continuing through November 1, is characterized by waves varying their approach from the northeast at an oblique angle of +50° to nearly shore normal with wave heights ranging from 1m to 2.2m and wave periods changing from 4 to 12 sec. Finally, during the third storm, waves propagated nearly shore normal with wave heights 6 reaching 4.3m with periods of 5 to 12sec. The third storm was a particularly large event with waves breaking near the 8m isobath. In this study, we focus on circulation and eddy events when wave breaking occurs within the vicinity of the in situ current meters. In particular, we investigate events on October 19 and October 30.  Bulk wave parameters from October 16-November 7. Wave heights are shown in the top panel, peak wave directions are in the center panel with positive angle indicating wave approaching from the northeast and negative angles indicating waves approaching from the southeast, and peak wave periods are portrayed in the bottom panel."}, {"section_title": "8", "text": ""}, {"section_title": "Model Description", "text": "Model simulations are conducted using the Coupled Ocean Atmospheric Wave Sediment Transport (COAWST) modeling system (Warner et al., 2010). In particular, we use the phase-averaged wave model Simulating Waves Nearshore (SWAN) and the Regional Ocean Modeling System (ROMS) circulation model. Data are passed between SWAN and ROMS using the Model Coupling Toolkit (MCT) (Warner et al., 2008)."}, {"section_title": "Wave Model", "text": "SWAN (Booij, 1999) solves the spectral action balance Equation (Eq. 1) to compute wave propagation and dissipation processes. In the action balance, the action density, N, is defined as N = E/σ, where E is the wave energy, which is a function of the wave height, and σ is the relative radian frequency, while the depth-averaged currents are given by . The left side of Equation 1 describes linear wave propagation. The first term is the evolution of the wave locally; the second term indicates the advection of the wave spatially in an x,y coordinate system, where c g is the relative group speed; and the third and fourth terms quantify advection of the action density in spectral space. The right side of Equation 1 represents alterations to wave action caused by source, sink, or redistribution terms. S in is wave growth in response to wind input and S ds,br is the dissipation due to wave breaking. Upon completion of SWAN calculations, the Model Coupling Toolkit sends bulk parameters of the wave height, direction, and period to ROMS for circulation computations."}, {"section_title": "Circulation Model", "text": "ROMS is a three-dimensional, free-surface, topography following numerical model that solves the finite difference approximate of the Reynolds Averaged Navier-Stokes Equations with Boussinesq and hydrostatic approximations using a split explicit barotropic time stepping algorithm (Shchepetkin and McWilliams, 2005;Haidvogel et al., 2008;Shchepetkin and McWilliams, 2009). Of particular import is the recent implementation of the vortex force formalism in ROMS, which offers an alternative momentum balance formulation to the radiation stress formalism. The vortex force formalism describes the full vertical variability of wave forcing by separating the radiation stress into conservative (i.e. horizontal vortex force) and non-conservative (i.e. dissipation due to wave breaking and roller) components. By separating the forcing in this manner, wave forcing terms are divided into components of known vertical variation and empirically computed variation. COAWST implements the vortex force formalism following the methodology of Uchiyama et al. (2010). Specifics regarding this implementation are detailed in Kumar et al. (2012). (2) In Equations 2-4, the three-dimensional Eulerian currents are represented by (u,w); f is the Coriolis force; φ is the dynamic pressure normalized by the mean density ρ 0 ; F is the nonwave non-conservative force (i.e. body force); D is momentum mixing caused by viscosity and diffusion; (J,K) represents the horizontal and vertical vortex forcing, respectively; is the lower Bernoulli head, which offers an adjustment to the mean pressure to account for waves; and F w is the total momentum flux due to non-conservative processes, such as wave breaking and roller acceleration. The vortex force is the physical interaction between the Stokes drift and vorticity and is described as Where is the vertical unit vector and (u st , w st ) are the Stokes velocities given by 10 8E is the wave energy; c is the phase speed; k is the wave number; h(x) is the depth; z is the vertical coordinate ranging from h(x) ≤ z ≤ , where is the mean sea level and is the quasi-static sea level. The wave energy, celerity, and wave number are computed using the root mean squared wave height and peak wave period. Using these Equations, COAWST computes the two and three dimensional currents, which are then provided to SWAN during model coupling."}, {"section_title": "The Vortex Force Formalism Momentum Balance", "text": "The across-shore and alongshore momentum balances depend on the wave breaking forcing (a combination of the wave breaking and wave roller accelerations), bottom friction, pressure gradient, horizontal vortex force, horizontal and vertical advection, and vertical mixing. Specifics regarding the balances are summarized here, but further details are provided in Kumar et al. (2012). In the depth-averaged case, the across-shore momentum balance primarily occurs between the wave breaking forcing terms and the pressure gradient. The horizontal vortex force, horizontal advection, and bottom friction terms are typically weak in the across-shore balance, but contribute to counter-acting wave forcing terms. The vertical variation of the across-shore momentum terms adds further complexity to the balance. The wave forcing term is a surface stress acting on the upper portion of the water column. Vertical mixing and advection primarily balance the non-conservative wave breaking. Vertical mixing and advection, the horizontal vortex force, and horizontal advection -which all vary with water depth -balance the depth-uniform pressure gradient. The depth-averaged alongshore momentum balance relies on a primary balance between the wave breaking forcing and bottom friction and a secondary balance between the pressure gradient and the combined horizontal vortex force and advection terms. The magnitude of the primary balance terms is usually larger than the secondary balance terms. The vertical variation of the alongshore momentum balance follows a similar structure to the balance of across-shore momentum terms. The wave forcing is primarily balanced by the vertical mixing and advection terms, while the depth-uniform pressure gradient is counteracted by the combination of the depth-varying horizontal vortex force, horizontal advection, and the vertical mixing and advection."}, {"section_title": "Incorporated Model Physics", "text": "Two-way coupling, which enables currents to affect wave propagation and transformation and vice versa, is incorporated into the ROMS and SWAN simulations. The models are coupled every 5 seconds. In SWAN, we specifically neglect the effects of nonlinear quadruplet interactions and white capping. We also exclude bottom friction because it is negligible over small distances. Wave breaking is accomplished using the Battjes and Janssen (1978) formulation with a breaking constant, γ, of 0.6 and a proportionality coefficient for the rate of dissipation, α, of 0.9. Model runs are conducted using 5 degree directional resolution as well as a low discrete frequency of 0.04Hz and a high discrete frequency of 1Hz distributed into 20 bins. The circulation model implements a third-order upstream advection scheme to solve the finite difference method. Walls are placed along the western, northern, and southern boundaries of the domain. Northern and southern boundaries are extended sufficiently far away from the region of interest so that wall effects (i.e. wave shadow and recirculation) do not impact model results. At the offshore boundary, free surface Flather radiation conditions and Neumann boundary conditions are included. We also use Reniers' roller formulation (Reniers, 2004) with 10% of wave dissipation provided by the roller in the circulation model and the quadratic friction formulation with a coefficient of 0.001. Horizontal mixing of 0.05m 2 /s is included and vertical mixing is implemented through the Generic Length Scale (GLS) mixing scheme using a wave amplitude roughness of 0.5 and wave dissipation roughness equal to 0.06. Simulations also neglect the effect Earth's rotation."}, {"section_title": "Model Inputs", "text": ""}, {"section_title": "Bathymetry, Tides, and Winds", "text": "Bathymetry data are refined to 5m and 10m across-shore and alongshore resolution, respectively. The regular gridded coordinates are generated by linearly interpolating CRAB data from the FRF. (Note, we also tested alternate methods of grid generation and smoothing with a loess filter as proposed by Plant et al. (2002) but noted few differences in results.) Bathymetry measurements from October 17 are used for model simulations on October 19 and October 30. Tide and wind data are input directly using verified measurements from NOAA and the FRF, respectively. Bathymetry, tide, and meteorological data measurements are reported using the National Geodetic Vertical Datum (NGVD)."}, {"section_title": "Wave Data", "text": "Spectral wave data from the 8m-array are linearly interpolated to half hour measurements and input at the offshore boundary. Using the measured spectra, an offshore wave group envelope is generated using the methodology of Van Dongeran et al (2003). This methodology describes the water surface elevation (η) along the offshore boundary as the summation of wave components with a given frequency (f), direction ( ), phase ( ), and amplitude (B) with the relationship 13where y represents the alongshore position, k is the wave number from linear dispersion, and the subscript i indicates wave components. We use a Fast Fourier Transform to carry out the summation. Therefore, the frequencies associated with each component are determined based on the desired length of the time series and the increment time step (Δt) for each measurement, and the values for the angle associated with each component are generated using the directional spread function as a probability density function (van Dongeren et al (2003))."}, {"section_title": "13", "text": "The amplitude associated with each wave component is computed by integrating the spectral density within each frequency and directional bin. The envelope of the generated time series is then determined by taking the Hilbert transform of the water surface elevation time series. Data are smoothed using a box-car average of 50 seconds to account for group periods and sampled every 5 seconds. We compute the generated wave energy at every offshore location at each instance in time from the generated wave amplitude using the relationship 14The generated wave energy is compared to the original spectra energy to determine an energy modulation factor (EMF) at every alongshore position at each instance in time. The spectral components from the original energy spectra are multiplied by the EMF to modulate the spectral energy to match the generated envelope. We closely follow previous studies' efforts for implementing wave groups and adapt them for use with SWAN. Following the methodologies of Long and Özkan-Haller (2009), we apply a specific carrier wave with modulated amplitude at the offshore boundary. To accomplish this in SWAN, we collapse the two-dimensional spectra so all wave energy is summed into one frequency and directional bin (the carrier wave). Our formulation also allows for the inclusion of two carrier waves to represent the full two-dimensional spectra in cases where the peak energy from swell is at least 50% of the peak energy of the local sea. For consistency, in simulations that do not include the influence of wave groups, we also collapse the two-dimensional spectra into the carrier wave component. In this manner, we capture the bulk parameters of the wave spectra, which are passed from SWAN to ROMS, and maintain wave groupiness throughout wave propagation."}, {"section_title": "Results", "text": "A twelve hour simulation and a ten hour simulation were conducted to ascertain the circulation and eddy behavior and variability on October 19 and October 30, respectively. Simulations were conducted including and excluding wave groups. In runs excluding wave groups, we also investigated changes to the circulation caused by using the full spectra versus the carrier wave spectra at the offshore boundary. Model runs including and excluding wave groups demonstrated significantly different behavior in circulation patterns. The different simulations resulted in similar magnitudes and profile shapes for mean currents when compared to the across-shore and alongshore instrument measurements, but the presence of eddies differed. Simulations incorporating wave groups showed eddies forming and propagating along the shoreline, while simulations disregarding wave groups did not indicate the presence of eddies. Instead, only a slightly fluctuating, meandering alongshore current formed during the simulation. For cases excluding wave groups, we also tested the application of the full spectra versus the carrier wave spectra at the offshore boundary. Mean circulation and comparisons of modeled and measured currents at instrument transects provided similar results when the original twodimensional spectra showed one peak. The full two-dimensional spectra provided slightly smaller errors than the carrier wave spectra results, but differences in the errors were generally insignificant. In cases where the two-dimensional spectra shows a second energy peak due to swell that is captured by our algorithm (see Section 4.4.2), modeled and measured currents showed similar results. When the second energy peak from swell was not captured by our algorithm for the carrier wave, circulation patterns and the current behavior differed between simulations, causing reduced alongshore currents and occasionally prompting unexpected return flow in the currents. In the following analysis, we only present the results from simulations including wave groups at the offshore boundary as well as the tidal and meteorological data from the FRF."}, {"section_title": "General Circulation Features", "text": ""}, {"section_title": "October 19", "text": "The first storm begins on October 19 (see Figure 2). Early in the morning 0.68m waves with a period of 4.5 seconds approach at an oblique angle of -54° from the southeast (measured from shore normal). As the storm strengthens, wave heights and periods increase to 1.6m and 10.7 seconds, respectively, and continue to propagate from the southeast at peak angles ranging from -42° to -36°. The oblique approach of the waves drives a northward alongshore current. The changing wave conditions also generate complex circulation patterns and eddies that vary during the storm (see Figure 3). Throughout the simulation, the two-dimensional structure and size of eddies change. When offshore wave heights are approximately 0.75m and the peak alongshore current is 1m/s, round and organized eddies appear regularly along the shoreline (Figure 3, left panel). The eddies increase in diameters as they propagate northward, especially within the vicinity of the trench. Eddy behavior changes, however, as the offshore wave heights and magnitude of the peak alongshore current increase to 1m and 1.25 m/s, respectively. Under these conditions, the eddies lose their circular structure and elongate to become part of the strong, meandering current ( Figure 3, center panel). The alongshore current aids in the formation of a nearshore gyre that lingers near the across-shore instrument array at y = 900m. Eddy behavior and formation changes near the peak of the storm when the offshore wave heights and peak longshore currents increase to 1.25m and 1.5 m/s, respectively, and vortex shedding initiates to the south of the trench (Figure 3, right panel). As the vortices continue to propagate past the trench toward the instrument array, they increase in size and show a less circular form, as observed near y=900m. \nModel results throughout the trial period show average root mean squared errors of the wave height, cross-shore current, and alongshore current equaling 0.12m, 0.09m/s, and 0.22m/s, respectively. The normalized root mean squared errors indicate the model varies from measured wave heights, across-shore currents, and alongshore currents by 0.10, 1.9, and 0.32, respectively. The model, therefore, adequately resolves the wave heights and the alongshore current behavior throughout the simulation period but strongly differs from the measured across-shore current. Justification for the differences in the measured versus modeled acrossshore current is provided below. At the beginning of the storm, the model under predicts wave heights ( Figure 5). As a result, shoaling continues longer and wave breaking commences at the across-shore location of 180m. Despite differences in the modeled and measured wave height, the model captures the magnitude and shape of the alongshore and across-shore currents ( Figure 5, left panel). Due to the obliquity of wave propagation, a strong narrow surf zone forms with a peak alongshore current of 0.95m/s. The across-shore currents are small throughout the cross section with a maximum depth-averaged current of 0.1m/s. Note in this study positive signs indicate northern directed alongshore currents and offshore directed across-shore currents, respectively. As offshore wave heights increase to 1m and 1.3m, modeled wave breaking commences further offshore at x = 200m and 300m, respectively, creating a broader surf zone. The model provides a similar wave shoaling and breaking profile to observations when offshore wave heights are 1m and produces smaller wave heights at the commencement of breaking when offshore wave heights are 1.3m. The modeled depth-averaged alongshore current profiles match the shape and magnitude of the observed alongshore currents with modeled peak currents of 1.25 m/s when offshore waves are 1m and 1.5m/s when offshore wave heights are 1.3m. The alongshore current profiles show slightly stronger current magnitudes compared to observations near shore and reach their peak magnitude further offshore than observed currents. The modeled across-shore current profiles also demonstrate similar behavior and shape to the field data further offshore, but the magnitude of model results is greater and more onshore-directed. The disagreement between modeled and observed currents may result from the incorrect placement of the gyre to the south of the instrument transect (Figure3), which can occur due to small changes in bathymetry after surveying (Wilson et al., 2014). Therefore, since measured across-shore currents are small and modeled currents are larger due to the presence of the gyre, the large normalized root mean squared error between the data is expected and justified. Three-dimensional comparisons of modeled and measured data at 11:00 on October 19 indicate the model reflects the measured vertical current profiles ( Figure 6). Modeled and measured across-shore current data differ the greatest at sensor 1, while alongshore currents vary more significantly for sensors 5-7. At across-shore sensors 1through 4, strong shoreward-directed flow and weak offshore directed flow are observed in the modeled across-shore velocities while measured velocities demonstrate weaker onshore and stronger offshore directed flow, resulting in NRMSE ranging from 3.23 at sensor 1 to and 0.56 at sensor 4 (Table 2). Comparisons between measured and modeled results for sensors 5-7 show similar vertical variation in the velocity profile (NRMSE ranges from 0.19 to 0.28 among the instruments) with weak onshore directed flow at the water surface and velocities approaching zero at the bottom. Alongshore velocities are over-predicted by the model at sensors 1 and 2 with NRMSE of 0.64 to 0.32, respectively. At sensors 3 and 4, the model and measured velocities closely resemble each other, resulting in NRMSE of 0.02 and 0.08. Further offshore at sensors 5-7, the model under-predicts that alongshore current and NRMSE increase up to 0.24. Overall, the average RMSE at the across-shore instrument array ranges between 0.02m/s and 0.27m/s for the across-shore current and between 0.07m/s and 0.47m/s for the alongshore current throughout the simulation period. The mean NRMSE for the across-shore current varies between 0.28 and 3.69 with the worst agreement occurring at instrument 1 and improving for instruments further offshore. The mean alongshore current NRMSE at instrument locations throughout the simulation period ranges between 0.10 and 0.59 with the smallest errors appearing further offshore. Table 3 includes further information on the mean bias and errors associated with each instrument throughout the simulation period as well."}, {"section_title": "October 30", "text": "The second storm occurs on October 30. Wave heights at the beginning of the day are 1.76m with a peak period of 8.8 seconds and approach from the northeast at a peak direction of 12°. Throughout the simulation period, wave heights reduce to a minimum of 1.65m with a peak period of 10.7 seconds and the peak direction reducing to 6° from shore-normal. For the majority of the simulation, the circulation is reminiscent of the behavior shown in the left panel of Figure 4. There is a strong, meandering southward-directed alongshore current to the north of the pier. As the flow propagates into and past the trench, weak vorticity is observed. At hour 11.75, eddies are observed to the north of the trench. The eddies lose their circular form and strength when they are within the trench (see central panel at y = 500m), and reform to the south of the trench. Finally, near the end of the simulation period, large, circular eddies form within the vicinity of the instrument array and extend outside the surf zone to across-shore instrument 6. When these large eddies propagate south past the trench, the strength of their vorticity weakens and they do not reform along the southern portion of the beach. \nThe storm occurring on October 30 is characterized by waves approaching from the northeast with offshore wave heights fluctuating between 1.3m and 1.7m. The in situ bathymetry data collected from the instrument array on this day indicate the presence of a small bar at x = 225m, which was likely formed by offshore sediment transport occurring during the storm. observations. During these simulation hours, the NRMSE for 09:00 and 13:00 are 0.24 and 0.32, respectively.   (Kumar et al., 2012). Since Earth's rotation is not accounted for in our model physics, it is not surprising that the model does not capture this behavior. The average RMSE is 0.04m/s and the mean NRMSE is 0.18 during the simulation hour. Table 4 provides specific details for each instrument's mean error. The alongshore current profiles indicate the model predicts stronger currents near shore and weaker currents offshore compared to measured results. This may also result from missing inner shelf physics, such as wind stress created over a larger coastal domain, the exclusion of Coriolis forcing, or greater shelf circulation patterns. Overall, the RMSE associated with the alongshore current is 0.21m/s and the mean NRMSE is 0.26 during the simulation hour. Further details are in Table 4. Throughout the entire simulation period, the NRMSE (Table 5) ranges between 0.09 and 0.3 for across-shore current comparisons and between 0.1 and 0.36 for alongshore current comparisons. Differences between the measured and modeled across-shore current are greatest at instrument 3, while the greatest differences in alongshore current results occur further offshore for instruments 5-7.   Table 5 Mean bias, RMSE, and NRMSE between modeled and measured vertical current profiles at the acrossshore instrument transect from October 30. Blank answers in column 4 result from no instrument measurements for bias, RMSE, NRMSE calculations. Results reflect the average over the first 10 simulation hours when the input spectra captures the two peaks of the original spectra. "}, {"section_title": "Model/In situ Current Comparisons", "text": "Field and model data are compared to ascertain model accuracy. Comparisons of the hourly mean wave heights as well as the two-and three-dimensional across-shore and alongshore currents are analyzed. During the field experiment, small errors in current measurements may exist due to a +/-5° instrument orientation error. Generally, this potential error does not alter measured currents by more than a few cm/s, but it is important to note as a source of potential difference between modeled and observed results. The model shows good agreement with the wave height and alongshore current field measurements with normalized root mean squared errors of 0.1 and 0.32, respectively, on October 19 and errors of 0.06 and 0.24 on October 30 (Table 1). The across-shore current agreement between model and field data is poor on October 19 (NRMSE is 1.9), but the October 30 simulation shows strong agreement with field measurements with a normalized root mean squared error of 0.18. RMSE is calculated by averaging the errors over all instruments for all simulation hours. Additionally, we compute the normalized root mean squared errors (NRMSE) by dividing the hourly RMSE for the wave heights and currents by the maximum measured wave height and currents, respectively, during the simulation hour. Finally, we average each hourly NRMSE over all across-shore instrument locations for the entire simulation period. "}, {"section_title": "Figure 6", "text": "Modeled (thick black) and measured (red dots) across-shore velocity profiles (top panel) and alongshore velocity profiles (bottom panel) along the across-shore instrument bathymetry transect from October 19. The thin black line at 0m is the still water level and the thin vertical lines indicate the instrument location and zero-line for currents.  "}, {"section_title": "Eddy Variance", "text": "We are interested in the variability associated with the low frequency eddy motions. To isolate eddy velocities, we linearly de-trend the velocities and band-pass filter across-shore and alongshore velocities to include frequencies < 0.01Hz. With this information, we ascertain locations of significant eddy variability. Regions of high across-shore current variance indicate changes in the across-shore current caused by rip or eddy movement, while regions of high variability in the alongshore current are associated with changes to the alongshore current (i.e. meandering current) or eddy propagation parallel to the shoreline. We compare the model data and measured in situ eddy variances to assess whether the model is capable of depicting similar variance trends and behaviors; however, because our treatment for the generation of offshore wave groups uses a random phase function, we do not anticipate that the model will capture the exact variance behavior recorded by the current meters for any particular hour. Instead, we validate the model by ensuring we are in the range of appropriate variance levels. We compute the across-shore and alongshore eddy variances over the full domain. Then, using the instrument array transect locations, we interpolate model results to instrument positions. Using the seven (for the across-shore array) and six (for the alongshore array) modeled variance points, we compute the hourly mean across-shore and alongshore eddy variance for each instrument transect. From the hourly mean variances, we compute representative across-shore and alongshore eddy variances for each transect over the entire simulation period. A similar method is applied to the measured variances at the instrument transects. Table 6 shows the comparison of variances from the modeled and measured data. The model reports higher variances than observations on October 19. Typically, the acrossshore transect variances reported by the model were higher shoreward of 200m, especially for the alongshore current variance (see Figure 9 for an example). Modeled eddy variances at the alongshore transect also over-predict the variability. The eddy velocity variances are one or two orders of magnitude larger than the measured variances because of three events when large wave-group generated eddies propagated outside of the surf zone, increasing the measured variability during these simulation hours. Although large variances corresponding to this type of event are not observed in the instrument data, it is likely that similar events do occur in nature. We will more thoroughly investigate a model event leading to higher than recorded variability later. If the three hours of large variability are disregarded in the variance calculations, the model better resembles instrument variability. The across-shore current variance at the across-shore transect is the same order of magnitude as the measured values, while the across-shore eddy variance at the alongshore transect remains an order of magnitude larger than observations. The alongshore eddy variance at both instrument transects also remains one to two orders of magnitude larger than observations. Overall, the model is capable of reproducing the acrossshore and alongshore eddy variance profiles measured in the field. Figure 9 illustrates the two-dimensional eddy variance throughout the domain and at the instrument transects. The comparison of eddy variances on October 30 shows similar results between the modeled and measured data (Table 6). Both across-shore and alongshore currents at both instrument transects share similar magnitudes in variability. Figure 10 also demonstrates variance in eddy currents predicted by the model throughout the domain and the model/instrument comparison at the transects. The model captures the profile behavior and variations at the across-shore and alongshore instrument transects, but occasionally misplaces the peak of the profile, as observed in the alongshore eddy variance at the across-shore transect. This   "}, {"section_title": "Discussion", "text": "Throughout the simulations, eddies propagate and create varying circulation patterns within the domain. To narrow the scope of our study and investigate the vertical structure of eddies, we isolate our analyses to the region within the vicinity of the instrument array pictured in Figure 1. We also limit our analysis to two events-one on October 19 and one on October  Top row shows the depth-averaged across-shore eddy variance, difference between top and bottom across-shore eddy variance, the normalized difference between the top and bottom across-shore eddy variances, and the variance due to wave breaking and roller, respectively. In the central plots, points labeled 1 and 2 are referenced in further analysis. Black contour line on the upper panel corresponds to low wave dissipation variance of 1E-5 W 2 /m 4 and the white contour line corresponds to high wave dissipation variance of 3E-4 W 2 /m 4 . Bottom panel shows the across-shore eddy current variability, difference between variability at the top and bottom of the water column, the normalized difference in the across-shore eddy variances, and the variance of the across-shore bottom stress. Black contours correspond to low variance in bottom stress (3E-9 m 2 /s 4 ). Black dots represent points of positive and negative difference in across-shore eddy variances."}, {"section_title": "Figure 12", "text": "Panel shows the alongshore eddy current variability, difference between variability at the top and bottom of the water column, the normalized difference in alongshore eddy current variability, and the variance of the alongshore bottom stress. Black contours correspond to low variance in bottom stress (3E-8 m 2 /s 4 ) and white contours correspond to high levels of bottom stress variance (2E-7 m 2 /s 4 ). Black dots (points 1 and 2) represent points of positive and negative difference in across-shore eddy variances."}, {"section_title": "Influence of Wave Breaking and Roller Dissipation", "text": "Alongshore non-uniform wave breaking can generate surf zone eddies or influence existing eddies (Long and Ozkan-Haller, 2009). Here, we are interested in understanding the influence of wave breaking dissipation on the vertical structure of eddies. In particular, we investigate the relationship between the variance of wave breaking and roller dissipation and the variance of the eddy velocities. Figure 11 shows the variance of wave breaking and roller dissipation is primarily observed between 200m and 400m offshore. Shoreward of 200m, depth-induced breaking occurs regularly, so we anticipate the variance of wave breaking to be low in these regions. Our treatment of the offshore wave envelope modulates waves so alongshore variability in the wave height exists. The larger waves from the envelope break further offshore at irregular intervals, increasing the variability within the outer portion of the surf zone. Regions of high depth-averaged and depth varying across-shore eddy velocity variance are primarily within regions of some wave breaking and roller dissipation variance. To illustrate this, we select a low value of 1E-5 W 2 /s 4 for the wave breaking dissipation variance to outline the edge of wave forcing variance (black outline on top panels in Figure 11). Areas of low wave breaking and roller dissipation variance encompass regions of high depth-averaged and depth varying across-shore eddy current variance. Interestingly, regions of the highest wave breaking and wave roller dissipation variability (σ WaveDissipation 2 ≥ 3E-3 W 2 /m 4 ) overlap with regions where the across-shore eddy variance at the bottom of the water column is greater than the variance at the top of the water column. This behavior hints at a relationship between wave dissipation and a decrease of across-shore eddy variance on the upper portion of the water column throughout the simulation hour. "}, {"section_title": "Influence of Bottom Friction", "text": ""}, {"section_title": "Normalized Vertical Difference in Eddy Velocity Variance", "text": "Outside regions of pronounced wave dissipation variance and bottom stress variance, vertical structure in the normalized difference of the eddy current variance at the top and bottom of the water column is observed. The difference in the normalized across-shore eddy current variance indicates the variance is stronger at the water surface than it is at the bottom ( Figure   11). This behavior is particularly evident seaward of the across-shore position of 400m. Furthermore, the normalized alongshore eddy current variance shows within the vicinity of the outer surf zone and outside the surf zone, a prominent eddy variance structure exists. Within the outer surf zone (near the across-shore position of 300m), the variance at the bottom of the water column is stronger than the variance at the top of the water column. Outside the surf zone, however, the alongshore eddy current variances are stronger at the top of the water column than at the bottom.\nThe normalized difference in the across-shore and alongshore eddy current variances predict different behavior from Event 1. In this scenario, the normalized difference in the acrossshore eddy current variances outside the regions of strong wave dissipation variance and across-shore bottom stress variance suggests the velocity variance at the bottom of the water column is stronger than the variance at the water surface ( Figure 18). The normalized difference in the alongshore eddy current variance, however, does not depict as ubiquitous a trend as observed in the difference in the normalized across-shore eddy current variance. In the outer surf zone and outside the surf zone, the difference in the normalized alongshore eddy current variance shows interspersed regions of weakly stronger variance at the top of the water column and weakly stronger variance at the bottom of the water column (Figure 19).   Figure 21 illustrates the seaward portion of the eddy is located in a region of weak wave breaking towards the outer edge of the surf zone, while the shoreward portion of the eddy lies in a region associated with higher wave forcing. At this time, waves approach from the northeast. When they break, they reduce offshore directed currents associated with the rotation of the eddy and enhance the southern-directed alongshore current at the top of the water column. Differences between the velocities at the top and bottom of the vortex are also more severe in regions of higher wave breaking. Wave forcing along the upper portion of the water column, therefore, contributes to a tilt in the eddy, helping to create the 4m displacement between the 0.01s -1 vorticity contours at the top and bottom. We note this displacement is on the order of the model's horizontal resolution, but we believe the displacement is realistic. To further enhance our understanding, we look at an across-shore transect of vorticity and the momentum balances at y = 1,060m. The vertical structure of the forcing terms highlights components linked to the vertical structure of the eddy (Figure 22)."}, {"section_title": "Vertical Difference and Structure of Vorticity", "text": "To understand causes of vertical variation in eddy structure, we focus our analysis to studying the behavior associated at the black points in Figure 11 that correspond to regions of positive and negative differences in the across-shore eddy velocities. We will refer to the point located in the region of positive across-shore eddy variance difference as point 1 and the point located in the region of negative across-shore eddy variance difference as point2. Time series analysis and snapshots of the eddy behavior point to reasons for vertical eddy structure."}, {"section_title": "Time Series Analysis", "text": "To understand the mechanisms altering the vertical structure of eddies, we plot a time series of wave breaking, bottom friction, horizontal advection, currents, and vorticity at the top and bottom of the water column at points 1 and 2. This way, when changes to the vertical structure of an eddy occur, we can attribute the change to a specific parameter. At hour 14, a large eddy forms and propagates offshore, offering an opportunity to observe eddy variation outside the surf zone. The time series of vorticity indicates that as the positive eddy advects past point at hour 14.2 the eddy is relatively depth uniform. As the positive eddy propagates seaward past point 2, the magnitude of the current is larger near the bottom compared to the top. This also corresponds to a large wave breaking event at point 2, which we believe is random and not caused by the positive eddy. Wave breaking induces shoreward directed currents at the top of the water column, which counteract the offshore-directed flow associated with the eddy along the upper portion of the water column, thereby reducing the currents along the upper portion of the water column (see Figure 13). Simultaneously, the eddy shows larger vorticity at the bottom of the water column compared to the upper portion of the water column. Interestingly, the same behavior is not observed for the negative eddy propagating offshore. As the negative eddy passes the points of interest, wave breaking is weak at point 1 and point 2 as the incoming wave group height decreases. As a result, the eddy maintains a nearly depth uniform structure. The alongshore components of the current, bottom stress, horizontal advection and wave breaking and roller momentum balance terms also offer insight to changes in forcing that affect the vertical vortex structure. During the event where the positive eddy propagates offshore and passes point 2, wave breaking and roller momentum terms are positive, indicating that the wave wants to push the fluid northward (given wave incidence from the southeast). Simultaneously, an increase in bottom stress is observed with the event. The difference between wave forcing and bottom friction dissipation causes a vertical shear in the alongshore current, forcing a faster current at the top than at the bottom, which leads to a tilt in the vortex. This is particularly apparent at hour 14.25 ( Figure 13, column 2) when the positive vorticity is directed south by currents associated with offshore portions of the vortex. At this time, friction is weak but slightly positive and the alongshore current at the bottom is slightly negative, indicating the southern-directed motion associated with the eddy. Alongshore currents at the top of the water column, however, remain positive as a result of the northern directed wave forcing at the top of the water column. The tilt in eddy structure creates a 20 second lag between the arrival of the peak vorticity at the bottom of the water column and the top of the water column."}, {"section_title": "Figure 13", "text": "Time series analysis at positive variance difference point (warm colors) and negative variance difference point (cool colors). Dark red and blue are measurements at the top of the water column while light red and blue are measurements at the bottom of the water column. The left hand column shows the wave breaking and roller, bottom stress, and horizontal advection momentum terms from the across-shore momentum balance as well as the across-shore currents and vorticity. The right hand column shows the same for alongshore momentum terms and current."}, {"section_title": "Snapshot of Eddy Structure", "text": "Visualizing changes to eddy structure is difficult because of vortex tilting and changes caused by wave breaking, friction, and advection. In order to visualize the structural changes of the eddy and dissect the causes of the vertical variation, we focus on a snapshot of the vortex during the large wave breaking event at 14.25 hours. In particular, we study the contours of vorticity at the uppermost and lowermost vertical bins within the water column (Figure 14). We analyze the snapshot in four components: the seaward portion of the vortex, the southern portion of the vortex, the central portion of the vortex, and the neck of the vortex (defined as the elongated region of the eddy near the shoreline). Wave breaking, friction, and horizontal advection play various roles in forming the vertical structure of the eddy within each of these sections. The seaward portion of the eddy is defined as the section extending seaward of x = 300m. Figure 15 shows wave breaking occurs within this region, especially within the vicinity of the positive vorticity. When the waves -which are approaching from the southeast -break, they force the fluid at the top of the water column shoreward and to the north. Corresponding to the forcing, the offshore-directed current at the top of the water column is reduced and the northward alongshore current is enhanced. The weaker vorticity observed at the top of the water column, therefore, reflects the reduction in across-shore current strength while the northern translation of the eddy at the top of the water column is associated with the wave forcing that is surface intensified. A similar northern shift in the upper portion of the vortex is observed for the -0.03s -1 contours at x = 350m and y = 825m, even though the wave forcing is weaker in this region than it is at the positive vorticity contours. The southern portion of the eddy (defined as the region below y = 825m and shoreward of x = 300m) is located outside the surf zone with aligned velocity vectors, indicating the behavior throughout the water column is similar. This region does not experience wave breaking, but weak bottom friction is present ( Figure 16). Friction counteracting the currents at the bottom of the water column weakens them, and causes the vorticity to weaken with water depth. Near x = 300m and y = 750m (Figure 15), the -0.03s -1 contour lines at the top and bottom exemplify that within this region the vortex maintains its shape (i.e. minimal tilting and stretching) but loses strength with water depth. The central portion of the eddy is defined as the region between the across-shore positions of   "}, {"section_title": "October 30 Event 2", "text": "On October 30, waves represented with a bi-modal spectra approach from the northeast. Eddies propagating from north to south on October 30 typically remain at the edge of the surf zone (rather than being ejected outside the surf zone). Despite the difference in propagation behavior from Event 1, the vertical structure of eddies respond in a similar manner to wave forcing, bottom friction, and horizontal advection."}, {"section_title": "Vertical Structure of Eddy Variances", "text": "During the simulation hour of interest, round eddies form on the northern bar and propagate south. As they pass the area of interest (box in Figure 1), eddies become less structured and relax into a loose curl (central panel Figure 4 at y = 750m). The vorticity is weaker than the vorticity observed during Event 1, and eddies are never ejected outside the surf zone. As a result, weaker variances in the eddy currents are observed during this simulation hour. The across-shore and alongshore eddy variances are an order of magnitude smaller than the variances observed in Event 1. Here, larger depth-averaged across-shore eddy variances are observed between the across-shore positions of 200m and 300m ( Figure 18), and high alongshore eddy variances are confined shoreward of 250m in the across-shore ( Figure 19).  "}, {"section_title": "Influence of Wave Breaking", "text": "In Figure 18, the difference in across-shore eddy variance (top central panel) shows the bottom of the water column is usually more variable seaward of the across-shore position of 250m. Shoreward of this across-shore location (and inside the surf zone), the difference in across-shore eddy currents indicates larger across-shore eddy variances at the top of the water column or nearly depth uniform variances. Regions of high variance in wave dissipation correspond to regions where the across-shore eddy variance is stronger at the bottom than at the top. A few narrow regions of high variance in wave dissipation overlap with zones where the across-shore eddy variance at the top of the water column is weakly stronger than the bottom. This is not unexpected, however, because of horizontal mixing processes. Therefore, a relationship between regions of weaker eddy current variance at the water surface and high wave dissipation variance also exists when eddies hug the edge of the surf zone during propagation."}, {"section_title": "Influence of Bottom Stress", "text": "Across-shore bottom stress variances larger than 0.3E-9 m 2 /s 4 generally correspond to regions of larger across-shore eddy variance at the water surface ( Figure 18). The seaward edge of the region of high across-shore bottom stress variance overlaps with some areas of larger variance at the bottom of the water column (indicated in blue). This is not unexpected, however, since these regions also correspond to areas where wave dissipation variance is large. This suggests that, in regions of overlapping wave dissipation variance and acrossshore bottom friction variance, wave dissipation variance controls the vertical eddy variance behavior. Therefore, a correlation between larger across-shore bottom stress variances and larger across-shore eddy current variances at the surface also exists in situations where eddies are not ejected outside the surf zone. The areas associated with the largest difference in alongshore eddy variance correspond to regions of high depth-averaged alongshore eddy variance. The variance of alongshore eddy currents are almost always higher at the top of the water column than they are at the bottom of the water column. Additionally, regions of the largest differences in alongshore eddy variance correspond to regions of low bottom stress variance."}, {"section_title": "Snapshots of Eddy Vertical Structure", "text": "The across-shore transect of vorticity indicates the eddy is located on the seaward side of the bar. The edges of the positive vorticity are outlined with black contours. The upper portion of the eddy tilts towards the shoreline. Furthermore, seaward of the across-shore position x = 250m, the vorticity at the water surface is weaker than it is at the bottom. Near the shoreward edge of the eddy, however, this behavior changes and the eddy is slightly stronger at the top of the water column compared to the bottom. The across-shore momentum balance shows strong forcing terms within the contours of positive vorticity. These forcing terms affect on the vertical variation of the eddy. Across-shore wave forcing terms are present beginning at the seaward edge of the eddy. From the outer edge of the eddy to the across-shore position of 250m, wave forcing (which is primarily balanced by vertical mixing and advection at the top) is the predominant forcing mechanism within the upper portion of the water column, weakening the vorticity in this region. The magnitude of wave forcing increases until the bar crest and diminishes within the bar trough. The across-shore horizontal advection and vortex force terms also contribute to the eddy shape by advecting the eddy landward. The vertical structure of the horizontal advection and vortex forces are strongest near the top of the water column as well, aiding in the landward displacement of upper vorticity contours. Together, these forcing mechanisms create a 4m displacement between corresponding vorticity contours at the top and bottom of the water column. Interestingly, the alongshore momentum balance indicates weak forcing within the vorticity contour lines. Some influence of wave forcing and horizontal advection and vortex forcing are observed at the top of the water column on the shoreward side of the eddy. The alongshore momentum balance, however, generally indicates alongshore forcing terms only have significant magnitudes over the bar crest. Therefore, the role of alongshore forcing components minimally contributes to altering the vertical structure of the eddy at this time."}, {"section_title": "Figure 22", "text": "The across-shore momentum balance (left column) and the alongshore momentum balance (right column) at the across-shore location y = 1,060m. The top panel shows the transect of vorticity; the second panel shows the horizontal advection and horizontal vortex force; wave breaking and wave roller acceleration terms are in the third panel; the fourth panel illustrates the vertical advection and mixing; and the fifth column depicts the pressure gradient. Black lines indicate 0.01s -1 vorticity contours at the outer edge of the vortex."}, {"section_title": "Summary and Conclusions", "text": "This study investigates the vertical variability of surf zone eddies with the numerical model COAWST. Using the wave model SWAN and circulation model ROMS, we run simulations corresponding to the SUZEE field experiment conducted from October 16 to November 7, 2011 at Duck, NC. We limit our study to simulating stormy conditions on October 19 and October 30 to assess the presence and structure of eddies. Analyzed simulations incorporate wave groups generated using the methodology of Van Dongeran et al. (2003). Accordingly, we apply a carrier wave with modulated amplitude at the offshore boundary. To accomplish this in SWAN, spectral data gathered from the 8m array are collapsed so all energy is summed into one frequency and one directional bin. In cases where the peak energy from swell is 50% of the peak energy of the local sea, our treatment allows for two carrier waves. We verify model results by comparing the modeled two-and three-dimensional across-shore and alongshore currents to measurements. The NRMSE for wave heights and depth-averaged currents on October 19 are 0.10, 1.9, and 0.32, respectively, while the NRMSE on October 30 are 0.06, 0.18, and 0.24. The depth variation of the across-shore and alongshore currents are similar between the model and measurements, as well. The NRMSE for across-shore and alongshore currents on October 19 ranges from 0.28 to 3.69 and from 0.10 to 0.59, respectively. Highest errors are associated with measurements at the first sensor in the acrossshore instrument array at the shallowest water depth. On October 30, the NRMSE for acrossshore and alongshore currents varies from 0.09 to 0.3 and 0.1 to 0.36, respectively. Differences in model results are attributed to the placement of a gyre just south of the acrossshore instrument array on October 19 and the exclusion of Coriolis forcing and large-scale shelf circulation during simulations. Model predictions of eddy current variability are also verified against recorded data through comparisons of the variance of hourly mean variances. Overall, eddy variances predicted by the model correspond well to measured eddy variances. A comparison of variances on October 19 shows that the modeled across-shore eddy variance at the across-shore transect is the same order of magnitude as observed. Modeled alongshore eddy variances at the acrossshore array transect are larger than those reported by instruments as a result of higher variability reported shoreward of x = 200m. At the alongshore array transect, both acrossshore and alongshore modeled eddy variances are an order of magnitude greater than those reported by instruments, as well. Modeled variance results at both array transects on October 30, however, are similar to variance measurements. We also note that simulations neglecting wave groups resulted in negligible variability in eddy currents, further hinting at the importance of wave groups in the variance of eddies. Based on the agreement between the model and observation data, we analyzed specific hours of high variability to ascertain the mechanisms contributing to changes in an eddy's vertical structure. Specifically, we investigate the effects of wave breaking, bottom friction, and horizontal advection. We first investigate the relationships between depth-averaged eddy variances, We further investigate the relationships observed over hourly variances by looking at time series analysis and snapshots of the forcing mechanism and eddy structure during the hours of interest. A strong relationship between wave breaking and changes to the vertical eddy structure is observed. In Event1, we closely inspect the cause of this phenomenon. If an eddy is ejected outside the surf zone through vortex shedding and wave breaking occurs over the eddy, the wave forces counteract the offshore directed currents at the top of the water column; thus, they reduce the strength of the upper portion of the eddy. Regardless of whether an eddy is shed outside the surf zone with strong offshore-directed currents or travels with the alongshore current at the outer edge of the surf zone, wave breaking causes a shoreward displacement of the eddy at the water surface, as observed in both Events 1 and 2. Surface stresses caused by wave breaking and roller acceleration are, therefore, capable of altering the strength of the eddy near the water surface and contribute to vortex tilting. Bottom stresses also alter the strength of eddies with depth. In cases where wave breaking is not observed over the eddy, bottom friction controls the decay of eddy strength with depth. Without additional strong forcing mechanisms to displace the eddy, the strength of vorticity decreases gradually and the center points of vorticity contours for the eddy remain aligned with water depth (Event 1). Horizontal advection influenced the displacement, or tilting, of eddies regardless of whether or not the eddy was in a region of high wave breaking or bottom friction. In Event 1, horizontal advection was the strongest forcing mechanism in the momentum balance at the top of the water column within the neck of the analyzed eddy, causing vorticity contours at the surface of the eddy to extend 10m further offshore than the bottom. During Event 2, vertical variation in horizontal advection is observed on the shoreward side of the eddy and contributes to the displacement observed at the top of the water column. Vertical variation in eddy structure is difficult to analyze because of the complex and interconnected relationships between the forcing mechanisms that form and alter eddy structure. We identify the relationship and influence of wave breaking and bottom friction in altering the strength of eddies at the top and bottom of the water column as well as how these forcing mechanisms aid in creating a tilt of the vortex structure. We show horizontal advection may contribute to vertical variation and displacements in eddy structure, as well. Further investigation into the causes of vertical eddy variability, such as horizontal mixing and vertical eddy viscosity, is necessary to more thoroughly understand and anticipate the vertical eddy structure. An improved understanding of vertical eddy structure will aid in better predictions for sediment mixing, changes to beach morphology, and pollutant transport."}]