[{"section_title": "", "text": "Theories of school dropout (Appleton et al., 2008;Fredricks et al., 2004;Rumberger, 2006) and a growing body of research also suggests that contextual (Dotterer & Lowe, 2011;Hong & Ho, 2005;Patrick, Ryan, & Kaplan, 2007;Ryan & Patrick, 2001;Wang & Holcombe, 2010;You & Sharkey, 2009) and self-system (Caraway et al., 2003;Furrer & Skinner, 2003;You & Sharkey, 2009) variables influence school engagement and dropping out from school. However, it is not clear how aspects of social context influence multiple forms of engagement simultaneously or how different types of contextual and self-system variables interact to affect students' engagement and lead to decisions to dropout from high school (Fredricks et al., 2004). The self-system model of motivational development (SSMMD) integrates contextual and self-system variables and provides a framework for describing processes that initiate and sustain a decline in student engagement (Connell & Wellborn, 1991;Skinner, Furrer, Marchand, & Kindermann, 2008;Skinner, Kindermann, Connell, & Wellborn, 2009;Skinner & Wellborn, 1994). Using the SSMMD, the central objective of the present study is to empirically test the mechanism involved in the dropout process."}, {"section_title": "Self-system model of motivational development", "text": "SSMMD posits that individuals possess an innate need to connect with others and interact effectively with their environment. It also asserts that the relationship of a given social context (e.g., family support, teacher support, peer support) and an individual's self-system processes (e.g., perceived identification with school, perceived control) is influenced by the extent to which the social context meets or ignores (fulfills or neglects) these basic needs. Further, self-system profiles differentially influence engagement-related behaviors, which directly contribute to educational outcomes such as student achievement and dropping out. That is, SSMMD suggests that 1) self-systems mediate the relation between a social context and school engagement and that 2) engagement mediates the relation between self-system processes and student outcomes. This model is shown in Fig. 1. Studies have provided empirical support for SSMMD, as applied to academic achievement (Connell, Spencer, &Aber, 1994;Skinner et al., 2008;Wang & Holcombe, 2010). For instance, Connell et al. (1994) conducted path analyses among a sample of 10-to 16-yearold African American youth. Nearly all proposed relations based on SSMMD were significant. In particular, students' perception of parental involvement predicted self-system processes (a composite measure of perceived competence, perceived relatedness to self, and perceived relatedness to others), which in turn predicted students' emotional and behavioral engagement. Engagement predicted educational outcomes (a composite measure reflecting the degree of risk for school departure based on attendance, test scores, grade-point average, suspension, and retention). Skinner et al. (2008) found that teacher support and students' self-system processes (perceived control, autonomy orientation, and sense of relatedness) were significant predictors of behavioral and emotional engagement. Moreover, self-system processes mediated the association between teacher support and student engagement. More recently, Wang and Holcombe (2010) examined the relationships among middle school students' perception of school environment, engagement, and achievement. Structural equation modeling revealed that students' perception of school environment in seventh grade (performance goal structure, mastery goal structure, support of autonomy, promotion of discussion, and teacher social support) affected their school engagement (behavioral, emotional, and cognitive engagement) and, in turn, influenced students' academic achievement in eighth grade. In contrast, empirical support for SSMMD, as applied to dropping out from high school, is limited. Available evidence, however, suggests that SSMMD can provide an organizing framework for better understanding the role of contextual, self-system, and engagement variables in dropping out from high school. To illustrate, Connell, Halpern-Felsher, Clifford, Cri-chlow, and Usinger (1995) used SSMMD to examine behavioral, psychological, and contextual predictors of staying in high school among a sample of African American adolescents. The authors found that higher levels of support from teachers and adults at home were associated with higher levels of perceived competence, perceived relatedness, and perceived autonomy. These self-perceptions then predicted students' level of school engagement. School engagement positively predicted males' staying in school. Among females, the association between engagement and staying in school was not significant. These findings, while promising, are subject to important limitations, notably the unidimensional conceptualization of the engagement construct and the relatively homogenous sample (African American adolescents from an urban school district). There is a need for replication with other populations. There may also be value in applying more nuanced conceptualizations of the engagement construct, including multidimensional models. Researchers have tended to study the impact of either teacher or parent support on selfsystem and engagement (Hong & Ho, 2005;Patrick et al., 2007;Ryan & Patrick, 2001;You & Sharkey, 2009). Past research has linked teacher support to student self-system and engagement. Support from teachers enhanced students' focus on mastery of goals (Patrick et al., 2007), feeling of academic efficacy (Patrick et al., 2007;Ryan & Patrick, 2001), and self-regulated learning (Ryan & Patrick, 2001), which in turn facilitated students' cognitive and behavioral engagement (Patrick et al., 2007;Ryan & Patrick, 2001). Although support from teachers is important for student learning and development, support from parents is also related to student self-perception and engagement. Parent support promotes students' perception of control and perception of self, which in turn promote engagement and benefit student learning (Hong & Ho, 2005;You & Sharkey, 2009). However, few studies have examined the impact of both supports in a single study. As a consequence, little has been learned about how parent and teacher support influence and differentially predict students' self-system and engagement. Finally, the relationship of engagement and dropping out is understood primarily in terms of student behavior. For example, Finn and Rock (1997) found that behavioral engagement significantly differentiated unsuccessful school completers, successful school completers, and school dropouts among 1803 minority students from low-income backgrounds. Rumberger (1995), using data from the National Education Longitudinal Study of 1988, found that moderate to high absenteeism, behavior problems, and having no school or outside activities were highly predictive of dropping out. More recently, Ream and Rumberger (2008) investigated the effect of behavioral engagement on school completion and dropout among Mexican American and non-Latino White students, finding that engagement directly influenced high school graduation. Archambault, Janosz, Fallu, and Pagani (2009) used a three-part engagement construct encompassing behavioral, affective, and cognitive dimensions to successfully predict dropout. Although the global measures of engagement predicted school dropout, behavioral engagement was the only unique factor with statistically significant predictive value. In contrast, few studies have examined academic engagement as it relates to dropping out from high school."}, {"section_title": "Purposes of the present study", "text": "The present study addresses limitations in the research on engagement and dropping out where SSMMD provides the theoretical framework. We assess how indicators of social context (e.g., teacher and parent support), self-systems (e.g., perception of control, identification with school), and engagement (e.g., behavioral and academic engagement) relate to academic achievement and dropping out of high school. Fig. 1 depicts the proposed model, which comprises five parts. We hypothesized that higher levels of support from teachers and parents would positively influence students' perception of self, that positive self-perceptions would positively influence students' behavioral and academic engagement and academic achievement, and that high levels of behavioral and academic engagement and achievement would decrease the likelihood of dropping out of high school. We further anticipated that self-perceptions would mediate the relations between teacher and parent support and academic and behavioral engagement and that academic and behavioral engagement would mediate the relationship between the two self-perceptions and dropping out of high school."}, {"section_title": "Method Participants", "text": "Participants in this study were part of ELS: 2002ELS: -2004, designed by the National Center for Education Statistics to provide trend data about the experiences of a cohort of high school 10th-graders as they proceeded through high school and into postsecondary education or their careers (Ingels, Pratt, Rogers, Siegel, & Stutts, 2004). The base-year study was carried out in a national probability sample of 752 public, Catholic, and private schools in the spring of the 2001-2002 academic year. In total, 15,362 students completed the base-year questionnaire, as did 13,488 parents, 14,081 teachers, 743 principals, and 718 librarians (Ingels et al., 2007). The first-follow-up survey occurred in 2004, when most sample members were high school seniors-others had dropped out or completed high school early. The second follow-up occurred in 2006, when many sample members were in college for up to their second year of enrollment and others were employed. One additional follow-up is planned for 2012 to document later outcomes, including persistence in higher education or transition into the job market (Ingels et al., 2007). For detailed information about ELS: 2002ELS: -2004, please see http://nces.ed.gov/surveys/els2002. We used the sample of 14,781 base-year students who participated in the first wave of the study and who were resurveyed in 2004 and identified as either still enrolled in school (n = 13,995) or dropped out (n = 786). Of this sample, 49.4% (n = 7309) were male and 50.6% (n = 7472) were female. Approximately 57% (n = 8459) of the participants were White, 14.4% Hispanic (n = 2126), 13.3% African American (n = 1962), 9.5% Asian (n = 1401), and 5.6% (n = 833) American Indian or of mixed race. Table 1 describes in further detail the demographic characteristics of the sample by dropout status. To generate national population estimates for our analyses, we used the base-year/first-follow-up panel weight."}, {"section_title": "Measures", "text": "We drew all data for this study, except dropout status, from the base-year survey, when students were in 10th grade. For dropout status, we used data from the second wave, when most of the students were in 12th grade."}, {"section_title": "Parent support in 10th grade", "text": "Six items from the student questionnaire measured parent support, capturing the frequencies of parent and school communications concerning students' school problems. On a 3-point scale (never, sometimes, and often), students reported the frequency with which they and their parents spoke about school in general, school-related activities, topics studied in class, and issues that troubled them. The following is a sample item: \"In the first semester or term of this school year, how often have you discussed things you've studied in class with either or both of your parents or guardians?\" Higher scores reflected greater parent support. The construct reliability (Hancock & Mueller, 2001) of this latent variable was .83."}, {"section_title": "Teacher support in 10th grade", "text": "This latent construct represents students' perceptions of the level of care and support from teachers. The construct included five items, and responses ranged from 1 (strongly agree) to 4 (strongly disagree). The following is a sample item: \"In class, I often feel 'put down' by my teachers.\" Items were coded, so that higher scores represented greater teacher support. The construct reliability was .74."}, {"section_title": "Perceived control in 10th grade", "text": "Perceived control included 4 items from the student questionnaire that assessed the extent to which students believed they were able to produce positive, and prevent negative, outcomes in school. Responses were rated on a 4-point scale (almost never, sometimes, often, and almost always). The following is a sample item: \"When I sit myself down to learn something really hard, I can learn it.\" Higher scores indicated higher perceived control. The construct reliability was .84."}, {"section_title": "Perceived identification with school in 10th grade", "text": "Identification with school included three items from the student questionnaire that measured students' interest and satisfaction with school. Two items had response options on a 4-point scale, ranging from 1 (strongly agree) to 4 (strongly disagree). The following is a sample item: \"I go to school because I think the subjects I'm taking are interesting and challenging.\" The item \"How much do you like school?\" had response options ranging from 1 (not at all) to 3 (a great deal). Items were coded, so that higher scores indicated higher perceived identification with school. The construct reliability of this scale was .78."}, {"section_title": "School engagement in 10th grade", "text": "The school engagement index consisted of 12 items that measured behavioral and academic dimensions of engagement. The items were coded, so that higher scores reflected higher levels of school engagement. Behavioral engagement included four items from the student questionnaire that measured the extent to which students conformed to classroom norms, such as not skipping school and not getting in trouble. Responses were rated on a 5-point scale (never, 1-2 times, 3-6 times, 7-9 times, and 10 or more times). The following is a sample item: \"I got in trouble for not following school rules.\" The construct reliability of this latent variable was .69. The academic engagement scale included eight items from a questionnaire that measured English and mathematics teachers' perception of student effort, persistence, and attention in their classes (for more details, see Table 2). Responses for four items were rated on a 2-point scale (yes or no). The following is a sample item: \"Does this student usually work hard for good grades in your class?\" Responses for another four items were rated on a 5-point scale (never, rarely, some of the time, most of the time, and all of the time). The following is a sample item: \"How often does this student complete homework assignments for your class?\" The construct reliability of this scale was .80."}, {"section_title": "Academic achievement", "text": "Academic achievement was estimated as a latent variable using standardized T-scores in math and reading. The standardized T-score provided a norm-referenced measurement of achievement with a mean of 50 and standard deviation of 10. The construct reliability of this scale was .86."}, {"section_title": "Student dropout status in 12th grade", "text": "To ascertain the impact of school engagement on dropout, we used the ELS: 2002-2004 12th-grade measure of dropout status (1 = enrolled in 12th grade, 0 = identified spring term 2004 dropouts). Dropouts were defined as 10th-grade cohort members who were not enrolled in school during the spring term 2 years later, who had not received a high school diploma or general educational development credentials, and who had missed 4 or more consecutive weeks not due to accident or illness."}, {"section_title": "Plan for analysis", "text": "To answer the research questions, our analysis comprised two steps. First, we assessed the fit of the measurement model, using confirmatory factor analyses (CFAs). Second, we used structural equation modeling to test our hypothesized model of dropping out of high school. We used bootstrapping to test the indirect effects (see Preacher & Hayes, 2008;Shrout & Bolger, 2002). We requested the recommended minimum of 500 bootstrap samples (Cheung & Lau, 2008) drawn with replacement from the full dataset of 14,781 cases. Bootstrapping is a recommended method for testing mediation, as it does not require the normality assumption and has greater statistical power and control for Type I error than the widely used three-step multiple regression approach ( Baron & Kenny, 1986) or the Sobel (Sobel, 1982) test (Fairchild & McQuillin, 2010;Lau & Cheung, in press;MacKinnon, Lockwood, Hoffman, West, & Sheets, 2002;MacKinnon, Lockwood, & Williams, 2004;Preacher & Hayes, 2004;Shrout & Bolger, 2002). Support for a mediating role is indicated if the bootstrap (bias-corrected) confidence interval does not include zero. In that case, we can conclude that there is a 95% probability that the indirect or mediating effect is significant. We conducted all statistical analyses with Mplus 5.21 (Muthén & Muthén, 1993. Because most of our measures are categorical, we used robust mean-and variance-adjusted weighted least squares (WLSMV) to estimate our models. The WLSMV estimator produces consistent parameter estimates, unbiased standard errors, and corrects χ 2 when there are categorical variables (Brown, 2006;Muthén & Satorra, 1995). WLSMV utilizes all available data without either imputing values or deleting cases, based on the assumption that missing data is missing completely at random (Little, 1995). To evaluate the fits of the measurement and structural models, we relied on a set of test statistics: the Steiger-Lind root mean square error of approximation (RMSEA; Steiger, 1990), the Bentler comparative fit index (CFI; Bentler, 1990), and the Tucker-Lewis index (TLI), which are less sensitive to large samples than the more traditional chi-square statistic. We followed the Hu and Bentler (1999) guidelines for evaluating the fit between the target model and the observed data: 1) RMSEA values less than 0.05 indicate excellent fit, and values in the vicinity of 0.08 indicate acceptable fit; 2) CFI and TLI values of .95 or greater indicate an excellent fit, and coefficients of 0.90 indicate a good fit."}, {"section_title": "Results", "text": ""}, {"section_title": "Measurement model", "text": "The first step in our analyses involved confirming the existence of our hypothesized latent constructs via CFAs. In the first CFA model, we specified a five-factor model to verify the structure of school engagement in terms of behavioral engagement and academic engagement, the structure of self-system processes in terms of perception of control and identification with school, and the structure of academic achievement. As Table 2 suggests, all item parcels loaded significantly onto their respective factors, with standardized loadings ranging from .48 to .67 on behavioral engagement, from .20 to .87 on academic engagement, from .69 to .83 on perception of control, and from .62 to .79 on identification with school. Each of the overall goodness-of-fit indices suggested that the five-factor model fit sample data very well, χ 2 (176) = 2078.808, p > .05, RMSEA = .027, RMSEA C.I. = .026-.028, CFI = .96, TLI = .96. In the second CFA model, we specified a two-factor model to verify the structure of teacher support and parent support. All item parcels loaded significantly onto their respective factors, with standardized loadings ranging from .42 to .78 on teacher support, and from .55 to .77 on parent support. Each of the overall goodness-of-fit indices suggested that the twofactor model fit data well, χ 2 (43) = 521.202, p > .05, RMSEA = .027, RMSEA C.I. = . 025-.030, CFI = .98, TLI = .97. We next fitted a measurement-only model, which is equivalent to fitting a CFA while simultaneously allowing all factors to correlate with one another. The measurement model showed a good fit to the data, χ 2 (465) = 5541.743, p > .05, RMSEA = 0.027, CFI = 0.97, TLI = 0.96. Table 3 presents the correlations among the latent constructs in the model. All variables appeared to have low to moderate correlations (from −.01 to .61), allowing us to eliminate the problems of multicollinearity (Kline, 2005). In conclusion, the results of CFA supported the measurement component of the proposed model, suggesting that items adequately measured their underlying latent factors."}, {"section_title": "Structural model", "text": "We used structural equation modeling to examine how social context, self-perceptions, school engagement, and academic achievement contribute to dropping out of high school. According to the hypothesized model (see Fig. 1), student perceptions of teacher and parent support predict students' perceptions of control and identification with school, which in turn predict students' behavioral and academic engagement and academic achievement, which in turn predict dropout. The hypothesized model fit the observed data well (fit indices for the model without bootstrap resampling procedure: χ 2 (472) = 8297.830, p > .05, RMSEA = . 033, CFI = .96, TLI = .95). SSMMD-related constructs, as a whole, accounted for 36.8% of the variance in dropping out of high school. Fig. 2 is a path diagram showing the fully standardized direct effects. Table 4 shows the specific mediation effects, the bootstrap estimates, and the 95% bias-corrected confidence intervals. For the sake of clarity, we first describe the direct paths within the model and then present the indirect effects."}, {"section_title": "Direct effects between social context and self-system processes", "text": "Both contextual variables were positively associated with students' perception of control (β = .26, p < .05 for teacher support; β = .34, p < .05 for parent support) and identification with school (β = .51, p < .05 for teacher support; β = .23, p < .05 for parent support). That is, as students' perception of teacher support and parent support increased, their positive perception of control and of identification with school also increased."}, {"section_title": "Direct effects between social context and school engagement", "text": "We also tested the direct paths from contextual variables to school engagement. The results indicated that both contextual variables significantly contributed to academic (β = .18, p < . 05 for teacher support; β = .16, p < .05 for parent support) and behavioral engagement (β = . 22, p < .05 for teacher support; β = .12, p < .05 for parent support)."}, {"section_title": "Direct effects between self-system processes and school engagement and academic achievement", "text": "Perceived control was positively associated with academic engagement (β = .19, p < .05) and academic achievement (β = .39, p < .05). Identification with school was positively associated with behavioral (β = .24, p < .05) and academic (β = .04, p < .05) engagement and negatively associated with academic achievement (β = −.25, p < .05). Perceived control was not a significant predictor of behavioral engagement (β = .03, p > .05)."}, {"section_title": "Direct effects between school engagement and academic achievement", "text": "Academic and behavioral engagement were positively associated with achievement (β = .33, p < .05 and β = .11, p < .05 respectively)."}, {"section_title": "Direct effects between school engagement and achievement in 10th grade and dropping out of school in 12th grade", "text": "Behavioral and academic engagement and achievement were associated with decreased likelihood of dropping out of high school (β = −.30, p < .05, β = −.27, p < .05, and β = −.20, p < .05, respectively)."}, {"section_title": "Mediated effects between self-system processes in 10th grade and dropping out of school in 12th grade", "text": "The specific indirect effect of perception of control on dropping out of high school through academic engagement was significant (β = −.05, BC 95% CI = −.07, −.03) and through behavioral engagement was not significant (β = −.01, BC 95% CI = −.02, .01). Greater perception of control led to greater academic engagement, which in turn decreased the probability of dropping out of high school. The direct effect of perceived control on dropping out of high school was not significant (β = −.03, p > .05), implying that academic engagement fully mediated the relations between perceived control and dropping out of high school. Additionally, the specific indirect effect of identification with school on dropping out of high school through behavioral engagement was β = −.07, BC 95% CI = −.10, −.05 and through academic engagement was β = −.01, BC 95% CI = −.02, .00. Greater identification with school led to greater behavioral and academic engagement, which in turn decreased the probability of dropping out of high school. The direct effect of perceived identification with school on dropping out of high school was not significant (β = .05, p > . 05), indicating that behavioral and academic engagement fully mediated the relations between identification with school and dropping out of high school."}, {"section_title": "Mediated effects between social context and school engagement", "text": "Our first outcome variable of interest in these mediation analyses was academic engagement. The specific indirect effect of teacher support on academic engagement through perception of control was β = .05, BC 95% CI = .04, .06 and through identification with school was β = .02, BC 95% CI = .001, .04. That is, greater teacher support led to greater perceived control and identification with school, which in turn increased academic engagement. The specific indirect effect of parent support on academic engagement through perception of control was β = .06, BC 95% CI = .05, .08 and through identification with school was β = .01, BC 95% CI = .001, .02. In other words, greater parent support led to greater perceived control and of identification with school, which in turn increased academic engagement. The direct effect of teacher support on academic engagement was significant (β = .18, p < .05) and so was the direct effect of parent support on academic engagement (β = . 16, p < .05). These findings indicate that self-system processes partially mediated the relations between the social context and academic engagement. Our second outcome variable of interest was behavioral engagement. The specific indirect effect of teacher support on behavioral engagement through perception of control was not significant (β = .01, BC 95% CI = −.01, .02) and through identification with school was significant (β = .12, BC 95% CI = .10, .14). The specific indirect effect of parent support on behavioral engagement through perception of control was not significant (β = .01, BC 95% CI =−.01, .02) and through identification with school was significant (β = .05, BC 95% CI = .04, .07). The direct effect of teacher support on behavioral engagement was significant (β = .22, p < .05) and so was the direct effect of parent support on behavioral engagement (β = .12, p < .05). These data indicate that identification with school partially mediated the relation between contextual variables and behavioral engagement."}, {"section_title": "Discussion", "text": "The purpose of this study was to examine the interdependence of school engagement and dropping out in the context of SSMMD. The self-system model proved to be valid. First, results revealed that contextual factors, including teacher support and parent support, positively influenced students' self-perceptions (perceived control and identification with school) and school engagement (academic and behavioral). Second, students' perceived control positively influenced academic engagement and achievement, while identification with school negatively influenced achievement and positively influenced academic and behavioral engagement. Third, as expected, academic and behavioral engagement positively influenced students' achievement, and academic and behavioral engagement and achievement measured in 10th grade influenced dropping out of school in 12th grade. Fourth, engagement fully mediated the relation between the self-systems and dropping out of high school. Also, self-systems partially mediated the relation between the social context and school engagement. Given these results, the present study contributes to the school engagement and dropout literature in five ways. First, using data from a nationally representative sample, this study provides empirical support for SSMMD as applied to the important problem of dropping out of high school. Although similar models of school dropout were recently proposed by Appleton et al. (2008), Fredricks et al. (2004), and Rumberger (2006), the authors did not test the underlying process model empirically. The only study that empirically tested the SSMMD as applied to the dropout process was conducted by Connell et al. (1995). The results of the present study not only confirm Connell el al.'s finding, but also extend it to a nationally representative sample of high school students. Additionally, by measuring engagement as a multidimensional rather than a unidimensional construct we underline the importance of behavioral and academic engagement in the dropout process. Second, this study provides further support for the role of social context in self-system processes and school engagement. Most research to date has focused on the impact of teachers (Patrick et al., 2007;Ryan & Patrick, 2001) or of parents (Hong & Ho, 2005;You & Sharkey, 2009) on student self-system processes and school engagement. Very little work has compared the relative impact of the two sources of social support. Results from this study suggest when teachers show interest in students, praise their efforts, and contribute to community building within the school; they directly influence students' perception of self and nurture students' levels of school engagement. Similarly, when parents speak frequently with their children about school-related topics, they contribute to students' sense of identification with school, their general perception of control. As control and identification with school are enhanced, these energizing internal mechanisms motivate students to be academically and behaviorally engaged in school activities. Third, the findings suggest that students' self-systems affect their school engagement and academic achievement. This result not only confirms previous findings (Furrer & Skinner, 2003;Legault, Green-Demers, & Pelletier, 2006;Skinner et al., 2008), but also provides new evidence about the magnitude of the effects. The direct effect of identification with school on behavioral engagement (β = .24) was twice the magnitude of the direct effect of identification with school on academic engagement (β = .04). In addition, the effect of perceived control on academic achievement (β = .39) was about twice the magnitude of the effect on academic engagement (β = .19). Contrary to our expectation, the effect of perceived control on behavioral engagement was not significant (β = .03). Hence, our findings suggest that behavioral engagement was more influenced by perceived identification with school, and academic engagement and achievement were more related to perceived control. That is, students who identify with their school are more likely to conform to classroom rules and regulations, and students who believe in their ability to control the outcome of their educational experience are much more likely to work hard, complete homework, be attentive in mathematics and English classes, and score higher on achievement tests. Fourth, our results suggest that behavioral and academic engagement and academic achievement are key variables to consider when predicting high school dropout. This finding is in line with research that has shown that behavioral disengagement (Archambault et al., 2009;Ekstrom, Goertz, Pollack, & Rock, 1986;Finn, 2006;Ream & Rumberger, 2008) and academic achievement (Battin-Pearson et al., 2000;Hardre & Reeve, 2003) are precursors of dropping out of high school. However, the present findings expand this research and provide evidence that academic engagement also is also a significant predictors of dropping out of high school and that it's utility in predicting dropout is similar to that of behavioral engagement. Educators and policymakers interested in preventing school dropout may want to consider how to implement intervention strategies aimed at increasing students' academic and behavioral engagement and academic achievement (Reschly, 2010). Fifth, this study suggests that academic and behavioral engagement are critical mediators between self-system processes and dropping out of high school. This finding suggests that students' perception of control and identification with school may serve a dynamic purpose by initiating and sustaining a willingness to participate in academic activities and to conform to school rules and regulations, which in turn decrease the likelihood of dropping out of high school. The current study has several limitations. First, the data were from an extant database; therefore, the measures of parent support and teacher support were limited in scope and design. Parent support is a multidimensional construct (Epstein, 1995;Fan, 2001). However, in this study, we examined only one dimension of parent support. More studies employing the multidimensional approach of parent involvement are warranted. Similarly, we focused on only one facet of school context: teacher support. The ELS did not collect data about further aspects of teacher work, including support of autonomy and promotion of performance goals. Future research should investigate these aspects of teachers' work. Second, we relied mostly on self-report information from students and teachers to assess perception of social context, perception of self, and school engagement. Although self-report measures are appropriate \"when the theory or construct involved is attitudinal or perceptual\" (Schmitt, 1994, p. 393), one could draw a more comprehensive picture by implementing multiple methodologies (e.g., observations). Third, findings are based on two time point. Thus, it is not known how results might vary if studied across multiple time points. Future research with longitudinal data could address this limitation. In summary, despite the limitations, the findings of the present study are significant for both theory and practice. The study contributes to the literature by explicating the contributions and interactions of social context, self-system processes, and school engagement in predicting dropping out from high school. More specifically the present results highlight the centrality of supportive teachers and parents for promoting positive self-perceptions of control and identification with school and for nurturing student academic and behavioral engagement. Our results also underscore the importance of behavioral and academic engagement and academic achievement in predicting dropping out of high school. Our data offer further evidence that behavioral and academic engagement mediate the link between self-systems and dropping out of high school and that self-perceptions mediate the relations between teacher and parent support and academic and behavioral engagement. Future studies that focus on applying SSMMD to high school dropouts might consider testing this model across genders and ethnic groups. Self-system model of motivational development applied to dropping out of high school. Dotted lines represent significant indirect effects, and solid lines indicate significant direct effects. Adapted from Connell and Wellborn (1991); Skinner et al. (2008);and Skinner et al. (2009). Standardized coefficients for the self-system model of motivational development applied to dropping out of high school. Only significant direct paths (p < .05) are shown.  Table 3 Intercorrelation among latent and observed variables.  Standardized bootstrap estimates and 95% bias-corrected confidence intervals for indirect effects. Note. N = 14,781. BC 95% CI = bias-corrected 95% confidence intervals (if does not contain zero, the mediated effect is significant); * p < 05;"}]