[{"section_title": "Abstract", "text": "The rapid growth and co-option of the local agriculture movement highlights a need to deepen connections to placebased culture. Selection of plant varieties specifically adapted to regional production and end-use is an important component of building a resilient food system. Doing so will facilitate a defetishization of food systems by increasing the cultural connection to production and consumption. Today's dominant model of plant breeding relies on selection for centralized production and end-use, thereby limiting opportunity for regional differentiation. On the other hand, end-user-driven selection of heirloom varieties with strong cultural and culinary significance may limit productivity while failing to promote continued advances in end-use quality. Farmer-based selection may directly reflect local food culture; however, increasing genetic gains may require increased exchange of germplasm, and collaboration with trained plant breeders. Participatory farmer-breeder-chef collaborations are an emerging model for overcoming these limitations and adding the strength of culturally based plant breeding to the alternative food movement. These models of variety selection are examined within the context of small grain and dry bean production in Western Washington."}, {"section_title": "Introduction", "text": "In the USA, the alternative agriculture movement has arisen in response to perceived failures of industrial agriculture associated with intensification of human land-use (Foley et al., 2005) . The alternative agriculture movement, which has been described as 'new,' 'sustainable,' 'regenerative' and 'agroecological' agriculture, seeks to develop production models and food systems which support local economies, reduce impacts on the environment, deliver high quality food directly to consumers and strengthen food sovereignty (Hamilton, 1996; Feenstra, 1997; Kloppenburg et al., 2000; Pearson, 2007; Gliessman, 2012; Holt-Giménez and Altieri, 2012) . The complexity of goals associated with alternative agriculture was addressed by Kloppenburg et al. (2000) who worked with a group of 'competent, ordinary people' to expand the definition of a sustainable food system, concluding, '[i]t is through honoring and understanding the multiple dimensions of motivation and intent that people bring to the transformation project [of food system sustainability] that it can actually be brought to fruition.' The importance of sustainable production practices that increase productivity and maintain ecosystem services has also been recognized, including the potential contributions of plant-breeding programs (Tilman et al., 2002) .\nAs part of the alternative agriculture movement, Hamilton (1996) called for increased transparency in consumer food markets by accompanying food products with, '… not just traditional information as seen with the nutritional labels, but other information as well, such as who raised it, how was it raised, what is in it, what variety is it and what is its history?' This is in direct contrast to the dominant model of food production in which commodities are fetishized by the obfuscation of the underlying components of production (Marx, 1906) . As Allen and Kovach (2000) point out, 'When consumers consider a strawberry in the market, … they tend to regard its value as a function of its material characteristics, not as a function of processes that include backbreaking labor, soil erosion, and public research investment'. This is particularly true in the case of staple commodity crops, such as wheat, which are often distanced from the end-user by additional layers of processing, such as milling and baking (Hills et al., 2013b) ."}, {"section_title": "Defetishization of commodity food", "text": "Commodity defetishization is a process of revealing the underlying social connections and production impacts of food as described by Allen and Kovach (2000) in the context of organic agriculture. Another example of this process is punk cuisine in which, 'Mainstream American food, with its labor and natural components cooked beyond recognition, is countered with the raw and rotten foods of punks; foods that are ideally natural, home grown, stolen, discarded, and uncommodified' (Clark, 2004) . In punk culture, food can be cleansed of its commodity character by dumpster diving on the one hand or growing it yourself on the other hand. This approach to food consumption fosters a direct connection to food production and the waste stream, which is absent from the commodity food distribution system.\nCelebrity chefs may also facilitate a defetishization of food by celebrating the stories of food producers and the exceptional quality of products. This has been demonstrated by the success of farm-to-table restaurants such as Chez Panisse, which pioneered a cuisine, 'based on the finest and freshest seasonal ingredients that are produced sustainably and locally' (Chez Panisse).\nIn his recent book, The Third Plate, chef Dan Barber advocates for developing regional cuisines. Such an approach would bring attention to crops which are important for the functioning of the whole agricultural system, not just the high value cuts of meat and flashy vegetables (Barber, 2014) . Through such efforts chefs are able to directly engage consumers with description and sensory experience of food placed in a regional context."}, {"section_title": "Local agriculture, local-wash and Terroir", "text": "Local food has arisen as a central theme of the alternative agricultural movement and is championed as a means to build connection between producers and consumers (Kloppenburg et al., 1996; Feenstra, 1997; Wilkins, 2005; Ostrom, 2006; Adams and Salois, 2010) . In the USA, the success of local agriculture is reflected in the expansion of direct marketing to consumers. For example, the number of farmers markets increased 63% between the years 1994 and 2000 (Payne, 2002) and the value of direct-market sales increased 105% between 1997 and 2007 (Martinez et al., 2010) . However, as has been discussed in regards to the industrialization of organic production (Buck et al., 1997; Allen and Kovach, 2000) , this success has also opened the messages of local agriculture to co-option (DeLind, 2011) .\nThe term 'local-wash' was recently introduced to represent the disconnects between usage of the term local in advertising and objectives of the alternative food movement (Cleveland et al., 2015) . Local food is often defined in terms of a specific distance or political boundary. Food system scholars have pointed out the limitations of such strict spatial definitions. Cleveland and his co-authors (Cleveland et al., 2015) cite cases where the assumed goals of local agriculture are contradicted, or not defensibly linked, to the reality of local food production. Consumer, and supply chain intermediary, perception of local food has been found to be flexible, depending on the product in question and location of individuals purchasing the food (Selfa and Qazi, 2005; Hills et al., 2013b; Carroll and Fahy, 2015) . Despite these challenges, local agriculture has potential to contribute to a defetishization of food systems through the strengthening of regional food culture.\nThe concept of terroir links food quality directly to a sense of place. In the European Union, terroir is supported by the legally defined Protected Designation of Origin which can include products, 'whose quality or characteristics are essentially or exclusively due to a particular geographical environment with its inherent natural and human factors' (European Union, 2012) . In an evaluation of landrace bean varieties, researchers in France found end-use quality was influenced by interactions between the effects of environment and bean variety providing direct support for the notion of terroir (Florez et al., 2009) . Similar concepts of terroir are developing in the USA.\nIn an exploration of artisan cheese production in Wisconsin, Bowen and Master (2014) noted that strengthening the alternative food movement will come from a deeper connection to values of 'heritage and territory.'\nIn order to reground the local food movement, DeLind (2011) argues that we need to connect local food with 'the art of place-making,' and 'find ways to keep them both connected and vital, ways to marry poetry and science.' While organic farmers, chefs and punk activists have all taken on roles in the alternative agriculture movement, plant breeders are underutilized in achieving the goals of local agriculture."}, {"section_title": "Plant breeding for local food systems", "text": "Plant breeding is often described as the art and science of crop improvement, and more recently as a business (Bernardo, 2010) . Plant breeding is contextualized by the boundaries that define the selection of new crop varieties, which in many ways reflect boundaries of local food systems. These include biological boundaries enforced by precipitation regimes, day length, temperature extremes and pest pressure, as well as cultural boundaries such as available infrastructure and consumer preference. Acknowledging the complexity of interactions between these factors will require a reassessment of the plant-breeding process and the interpretation of genotype × environment interaction (Desclaux et al., 2008) . Public plant breeders may be subject to political boundaries as universities are beholden to regional stakeholders and taxpayers, which may influence variety selection priorities (Dawson and Goldberger, 2008) .\nIn the past decade, there has been a decline in regional public plant-breeding programs, as well as consolidation of the private seed industry and the use of increasingly restrictive forms of intellectual property protection (Frey, 1996; Guner and Wehner, 2003; Stuber and Hancock, 2007; Pardey et al., 2013) . This commodification of plant breeding and the seed system, in general, is viewed as being at odds with the goals of the alternative agriculture movement (Kloppenburg, 2005) . In contrast, there has also been increased interest in the development of varieties specifically for organic production (Lammerts van Bueren and Myers, 2012) . This has been the focus of the recently established Student Organic Seed Symposium and may stimulate a revival of interest in public plant breeding at Land Grant Universities (Luby et al., 2013) . Selection for organic agriculture is targeted to a production system, while potentially complimentary; it does not inherently address the needs of local food production.\nTo improve understanding of how plant breeding can be incorporated into efforts to directly support local agriculture and facilitate a defetishization of commodity food production, we review four approaches to crop enduse selection: (1) Centralized; (2) Consumer-based; (3) Farmer-based; and (4) Participatory. These models will be discussed within the context of selecting barley (Hordeum vulgare), wheat (Triticum aestivum) and dry beans (Phaseolus vulgaris) for Western Washington."}, {"section_title": "Small grains and dry beans in Western Washington", "text": "Washington State is divided physically and culturally by the Cascade mountain range, creating two geographically distinct regions. Western Washington has a marine climate and dense urban population centers. The current food culture and production system found in the 19 counties located west of the Cascades have evolved out of an early recognition of the productive potential of the region as well as consistent access to local markets. In 1916, a regional farm paper featured an article calling for the building of more farm communities in the region, proclaiming, 'The time is coming when the Puget Sound basin will be one of the richest most intensely cultivated and densely populated sections of the agricultural world … supply [ing] the daily food necessities for the industrial centers and commercial cities … for the reason that location cannot be changed' (Shomaker, 1916) .\nToday the agricultural economy in Western Washington is characterized by high-value products, such as dairy, berries, fresh market vegetables, vegetable seed, floriculture, nursery-stock and shellfish aquaculture produced on diverse small-to medium-size farms. According to the USDA 2012 Census of Agriculture, the annual farm-gate value of agricultural products produced on the 16,345 farms in the 19 counties west of the Cascades is US$1.44 billion (WSDA, 2014) . There are 113 farmers markets registered with the Washington State Farmers Market Association, 80% of which are located in Western Washington (Washington State Farmers Market Association, 2014), reflecting regional interest in local food.\nDespite this interest there remains a gap between production and consumption of key staple crops, including legumes and small grains (American Farmland Trust, 2012) . Recent efforts to re-localize staple crop production have focused primarily on the potential of adding value by overcoming barriers to local milling and baking (Hills et al., 2013a, b) . Increasing the value of these crops is critical because small grains have a relatively low economic value yet they remain an integral part of regional production systems. Primarily grown in rotation with higher value crops, small grains can help break disease and weed cycles, maintain soil organic matter and diversify income sources.\nIn addition to adding value to existing rotational crops, there is a need to introduce new crops to local farming systems. In 2010, a regional frozen pea industry was lost when the last processing facility left Western Washington (McMoran, 2009) . This effectively eliminated a major legume crop from regional cropping systems. Dry beans have been identified as a potential crop for Western Washington, which may help fill this gap (Wagner et al., 2006) . However, barriers to adoption include access to equipment, and availability of regionally adapted varieties . These are barriers which plant breeding can help to overcome.\nThe maintenance and incorporation of cereal and legume crops as a part of Western Washington cropping systems will help maintain and increase crop system diversity while providing a local supply of staple crops. High land prices and a shrinking agricultural land base due to demand for residential and commercial development have placed increasing pressure on agriculture in Western Washington (Canty et al., 2012) . Increasing the value of grains and legumes within the rotation system is one way to maintain economically viable farms capable of withstanding this pressure. Appropriate equipment, soil management and development of infrastructure and markets are critical components of a local food system. Here we focus on the largely overlooked potential of plant breeding to support such a local agricultural system."}, {"section_title": "Model 1. Centralized end-use selection: Striving for location-neutrality", "text": "Centralized plant breeding relies on clearly defined and easily measured selection criteria to achieve rapid genetic gains toward a goal. This approach has been compared with an accelerated form of evolution (Cleveland and Soleri, 2007) . In selection, breeders must define a reasonable region of adaptation (Ceccarelli, 1989) ; however, there is an economic incentive for breeding programs to select for broadly adapted varieties, because this will increase the potential acreage and market of these varieties (Atlin et al., 2001) .\nBroad-adaptation, including both agronomic and enduse quality, is an important criterion for breeding commodity crops, which must meet specific quality parameters, even when grown across large geographic regions. End-use selection in wheat exemplifies how centralized plant breeding works. Wheat is the most widely grown crop (in terms of global land area) and must meet wellestablished quality standards for the concentrated milling and baking industries (USDA-FAS, 2014). In a review of wheat breeding for end-use quality, Bushuk (1998) wrote, 'The quality of protein in future wheat cultivars will have to be location-neutral.' This approach to breeding separates production, place and culture, creating a placeless commodity product.\nBreeding barley for consistent malting quality is another case where specific end-use parameters have shaped breeding strategies and the resulting crop diversity. Within the USA barley is primarily used for animal feed and brewing purposes with a small percentage utilized for food (Baik and Ullrich, 2008) . The malting and brewing industry is highly concentrated with the top ten malting companies accounting for 44% of global malt production (Punda and Prikhodko, 2009) . Two international brewers control over 210 distinct brands (Kenney, 2013) and the top four firms control over 40% of global sales (Howard, 2013) . To ensure that malting barley is of consistent quality for such large-scale processing, new varieties must meet American Malting Barley Association (AMBA) standards prior to entering production. Guidelines for barley breeders, developed by AMBA, include 18 quality parameters such as kernel size, activity of starch degrading enzymes and extractable sugar. These guidelines conclude with the additional note that 'malted barley must provide desired beer flavor' (AMBA, 2014) . This raises the question of who is defining beer flavor and how might it be influencing the breeding process.\nHistorically AMBA guidelines have been divided into two categories, two-row and six-row, referring to the morphology of the barley spike. In 2014, an additional category was included for all-malt brewing, a style of beer production that utilizes malted barley as the sole source of starch. The Craft Brewers Association also published a white paper advocating the development of varieties better suited to the needs of the craft brewing industry, which typically relies on all-malt brewing methods (Brewers Association, 2014) . The authors note that, 'as a result of the recent varietal progression … the sensory profiles of their flagship brands have evolved over time, drifting towards lower overall flavor impression and/ or complexity.' This request for a diversification of end-use quality is of particular relevance to Western Washington where there are over 150 licensed breweries (Washington State Liquor Control Board, 2014) . Even if there is an increase in selection of barley varieties for all-malt brewing, meeting a nationally defined quality parameter does not promote regional differentiation essential for supporting local food systems.\nTo meet strictly defined malt quality parameters, barley breeders have relied on conservative approaches to variety development such as advanced cycle breeding, in which elite lines within a breeding program are reused as parents for developing new varieties. Although this approach has resulted in gains in agronomic performance of North American barley while continuing to meet malting quality targets (Rasmusson and Phillips, 1997) , there has been a reduction in genetic diversity within both six-and two-row germplasm (Martin et al., 1991; Horsley et al., 1995; Matus and Hayes, 2002; Condón et al., 2008) . This reduction in diversity may increase vulnerability to biological and abiotic stress (Condón et al., 2008) , and limit options for end-users interested in alternative styles of production. A centralized breeding process generates a self-fulfilling cycle in which selection criteria are established, the genetic diversity of breeding programs is reduced to meet these criteria, which reduces the opportunity for identifying novel end-use qualities, and industry standards are not challenged to expand; thus the selection cycle is repeated.\nIn major bean-producing regions of the USA, consolidation of dry bean processing has driven a restructuring of bean production and variety selection to meet industry needs (Bingen and Siyengo, 2002) . Canning quality is the primary end-use parameter for dry beans and is the focus of centralized breeding efforts (Heil et al., 1992) . Bean breeding efforts are primarily focused on major market classes such as pinto, black, navy and kidney, though programs will occasionally release non-commodity colored patterned types. Introducing beans to Western Washington will require not only breeding for local agronomic adaptation, but also selecting varieties with unique patterns desirable in local markets (Wagner et al., 2006) . Given the lack of regional processing facilities, and consumer demand for bulk dry beans, canning quality is not an important quality parameter for Western Washington.\nBreeding for increased yield of crops grown in Western Washington, while selecting for a commodity end-use, such as large-scale malt production in the case of barley or canning in the case of beans, does not serve to achieve the goals of a robust local food system. Relative to other parts of the state or country where lower land values, established processing and transport infrastructure allow for production on a larger scale, Western Washington growers are placed at an economic disadvantage when they enter the commodity market. This model of centralized breeding for commodity production and end-use uniformity may be very effective in terms of rapid genetic gain; however, it adds relatively little to the local food economy and culture.\nIn an early critique of public research devoted to meeting specific commodity food processing needs, Hightower (Hightower, 1972) wrote:\n\"But mechanization means more than machinery for planting, thinning, weeding and harvesting. It also means improving on nature's design-breeding new food varieties that are better adapted to mechanical harvesting. Having built machines, the land grant research teams found it necessary to build a tomato that is hard enough to survive the grip of mechanical 'fingers'…\"\nHightower's critique shows how centralized variety selection specifically for industrial production and processing is perceived by the public as being out of touch with the cultural and culinary aspects of agriculture. Heirlooms are a common response to this model of varieties bred for mass production, storage and processing.\nModel 2. Consumer-based end-use selection: The heirloom dilemma Generally defined as a crop grown in a region for over 50 years, heirlooms are often strongly connected to a local culture or even the history of a single family (DeMuth, 1998) . The concept of heirloom as presented here is similar to 'conservation variety' which was added to European seed legislation in 2008 (Bocci, 2009) . The term heirloom is used in the present paper because of its role in US food markets, while recognizing the complexity of defining varieties (Chable et al., 2008) . Concerns regarding loss of agro-biodiversity stimulated the development of citizen movements in Europe to provide a framework for the production and marketing of locally adapted crop varieties (Bocci and Chable, 2009 ).\nIn the USA, heirloom tomatoes have emerged as an icon in the local food movement (Jordan, 2007) and recently heirloom apples have been highlighted as an emerging culinary trend (National Restaurant Association, 2014) . In the case of apples, local agricultural markets have been credited with maintaining a wider diversity of varieties (Goland and Bauer, 2004) . Interest in heirlooms is not limited to high-value fruits and vegetables.\nEfforts to bring uniqueness to staple crops have included the reintroduction of heirloom cultivars, which are being promoted for their unique flavor, quality profiles and cultural significance. 'Sonora' wheat has been celebrated in the re-localization of wheat in Arizona (Morris et al., 2013) . This variety is featured in the Arc of Taste, an initiative of the Slow Food movement with the goal of 'collecting small-scale quality productions that belong to the cultures, history and traditions of the entire planet' (Slow Food International). Similarly, the 'Red Fife' presidium was established in Canada to, 'relaunch Red Fife by introducing it to artisan bakeries' (Slow Food International). While heirloom varieties offer an avenue to connect food to a place and tradition, they are subject to fetishization by removal from the geographic and historic context that gives them agronomic, cultural and culinary value.\n'Scots Bere' is a barley landrace which was historically cultivated and milled into flour in parts of the UK. It is still cultivated and milled on a small scale in parts of the UK and used in the production of special bannock bread (SASA). Scots Bere also features in the history of early settlement in the Pacific Northwest and was likely one of the first barley varieties introduced to the region (Scheuerman, 2013) . Trials conducted in 2012 at the Washington State University Northwestern Washington Research and Extension Center in Western Washington showed that the yield of Scots Bere was 33% of the highest yielding variety, and Scots Bere was the lowest yielding variety in the trial (data available online at: http://plantbreeding.wsu.edu/Organic-Spring-Barley-2012. pdf, note that Scots Bere was designated 'Tolmie Bere' for this trial). Similarly, organic trials conducted in Eastern Washington between 2004 and 2006 showed that Red Fife and Sonora yielded 17 and 67%, respectively, as much grain as the highest yielding modern wheat included in the trial (Murphy et al., 2008a, b) . If the yield of heirloom varieties is well below half the yield of modern varieties, are consumers prepared to pay twice as much for these crops?\nThough infrequent, heirloom varieties optimally suited to specific farming systems or environments that have been ignored by modern breeding programs can be utilized by growers. For example, the wheat 'Canus' (released in 1934) had grain yields higher than or comparable with modern varieties when grown on three organic farms in Western Washington (Murphy et al., 2011) . In addition to desirable agronomic qualities, Canus had high concentrations of Ca, Cu, Fe, Mg, Mn, P and Zn in the seed, indicating its potential usefulness in local markets as a value-added and nutritionally dense variety.\nThe yield potential of heirloom dry beans has also been investigated. Variety trials conducted in Michigan found that heirloom bean varieties were not agronomically competitive, even when grown in low input organic production systems (Heilig and Kelly, 2012) . This is contrary to trials conducted in Western Washington, which have identified heirloom beans with agronomic qualities comparable with modern varieties . These findings may reflect the lack of an active dry bean breeding effort in Western Washington. Similarly, the wheat variety Canus, described above, was evaluated in comparison with modern spring wheat varieties specifically selected for production in Eastern Washington, prior to active wheat breeding efforts in Western Washington.\nEven when heirloom varieties are identified with desirable end-use qualities and agronomic performance, the question remains, can end-use qualities be improved through selection? Reluctance to improve the culinary value of heirlooms may be due to public perception that plant breeding is detrimental (or even considered by some to be actively dangerous, as in the case of genetic engineering) to food quality (Bredahl, 2001) . In a study of European consumers, Guerrero et al. documented the perception that, 'the application of innovations may damage the traditional character of Traditional Food Products' (Guerrero et al., 2009 ). In the USA, plant breeding has been critiqued in the popular press as a form of innovation which has damaged the character of crops, in particular reducing their nutritional quality (Robinson, 2013) .\nGiven the generally low-yield potential, promoting the commercial production of heirloom varieties has the potential to be actively detrimental to local food systems. An exception to this may be when varieties have been actively selected and maintained by farmers within a region, such as is occurring with the peasant seed movement in Europe (Bocci and Chable, 2009 )."}, {"section_title": "Model 3. Farmer-based end-use selection: Development of folk varieties", "text": "Much of the current global agro-biodiversity has developed through farmer-based maintenance of landraces and the active selection of 'folk varieties' (Berg, 2009 ). Farmer-based selection is a process in which varieties are actively maintained or bred by a farmer or community without outside assistance from formally trained plant breeders (Berg, 2009 ).\nGenerally, farmer-based selection is limited in regions, or in crops, where there is a well-established variety selection and dissemination system. In Europe, the development and marketing of farmer-selected varieties is actively restricted by regulations of variety release and propagation (Bocci and Chable, 2009 ). Despite these challenges there is active farmer-based conservation and selection of crops. A combined ethnobotanical and population genetics study of a diverse wheat population in France found that farmers maintained and selected diverse subpopulations from a single population-variety, consistent with reports of seed diffusion and propagation (Thomas et al., 2012) .\nWhile the establishment of conservation varieties (as addressed in Model 2) may offer increased access to diverse, unique and locally adapted germplasm, the peasant seed movement acknowledges the evolutionary process of crop variety development and challenges the strict definitions of breeding to include farmer-based and participatory methods (Chable et al., 2008; Bocci and Chable, 2009) .\nIn Tibet, barley is central to agriculture and cuisine, and specific varieties are prized for the preparation of common dishes. 'Lhazi Ziqingke,' a purple seeded barley is preferred for preparation of Chang, a fermented drink, and the pale colored 'Garsha' is preferred for the preparation of Tsangpa, a roasted barley flour (Tashi et al., 2012) . In the highland region of Ethiopia, Shewayrga and Sopade (2011) identified 15 barley landraces and 20 main barley foods and drinks associated with those varieties. These distinct landraces and colored grains are examples of selection for 'perceptual distinctiveness' which enables farmers and consumers to quickly associate specific varieties with agronomic, and end-use qualities (Gibson, 2009) . In local food economies perceptual distinctiveness helps farmers rapidly differentiate their products and build connects between specific varieties and consumers.\nThe incentive for farmers to select varieties may be greater in Western Washington because the distance from major seed distributors and breeding programs located in Eastern Washington makes obtaining welladapted varieties relatively difficult. While barley seed is commercially available, the desire to maintain and improve locally adapted varieties has resulted in some Western Washington farmers maintaining their own varietal blends, which may eventually develop into distinct farmer selected varieties (Sam McCullough, pers. comm.) . In this case, selection is an informal process in which planting a mixture of pure line varieties allows for undirected outcrossing to occur at low rates between distinct genotypes. Over time natural selection and consistent replanting of the highest quality seed may lead to gradual shifts in the genetic composition of this population as has been reported in studies of evolutionary breeding (Murphy et al., 2005) .\nWhile such long-term farmer-based selection can lead to the development of varieties with specific agronomic and end-use qualities, increasing the rate of genetic gain requires the introduction of novel genetic material through seed exchange (Ellen and Platten, 2011; Pautasso et al., 2013) . In Western Washington a handful of organizations such as Olympia Seed Exchange, (http://www. olympiaseedexchange.org/), Lopez Community Land Trust Seed Library (http://www.lopezclt.org/seed-securityinitiative-and-seed-library/) and the Orcas Island Seed Library (http://www.orcaslibrary.org/seeds.html) facilitate the stewardship and exchange of seed.\nIn a description of informal seed exchanges in the UK, Ellen and Platten (2011) describe the accidental 'leakage' of germplasm from research stations to producers. Such a transfer of germplasm from researchers to farmers is a potentially valuable source of new genetic diversity for farmer-based selection. This leakage could be deliberately facilitated through direct collaboration between plant breeders and farmers. Additionally, the use of directed crosses, particularly in self-pollinated species, has the potential to greatly increase genetic gain; this may be carried out by farmers or through a participatory process as described below.\nModel 4. Participatory end-use selection: Farmer-breeder-chef collaboration Murphy et al. (2005) describe an evolutionary participatory breeding approach to selection for low-input systems in which on-farm selection is supplemented with segregating populations generated by university researchers. Such direct farmer research collaborations may be particularly effective for improving agronomic qualities; however, additional perspectives are necessary for the selection of complex end-use qualities such as baking and brewing. The farmer-breeder-chef collaborative approach seeks to leverage the agronomic skills and knowledge of the farmer, the culinary perspective of the chef and the logistical skills of the breeder to develop varieties with local adaptation and end-use potential.\nCultural and culinary attributes of crop varieties have been recognized as important aspects of farmer adoption of new varieties in developing countries (Morris and Bellon, 2004) . In the context of low-input systems in developed countries, the need to achieve acceptable enduse quality is generally addressed by initiating participatory breeding projects with high-quality parents, due to the difficulty of actively selecting for end-use quality early in a breeding program (Murphy et al., 2005) . Integrating end-use selection fully into participatory plant breeding will require a recognition of the complexity of interactions between genotype, bio-physical environment, crop management as well as social components of actors, outlets, regulations and societal dynamics as described by Desclaux et al. (2008) .\nIn parts of the USA, farmer-breeder-chef collaborations have emerged as a potential means of improving end-use qualities. The mission of the Culinary Breeding Network, located in Portland, Oregon is: 'to bridge the gap between breeder and eaters to improve agricultural and culinary quality in the Northwest' (Culinary Breeding Network). This project has contributed to the selection and subsequent market success of several new pepper varieties (Waterbury, 2013) , demonstrating how engaging the culinary community in the selection process can facilitate rapid adoption of new varieties. Rivière et al. (2015) describe a participatory breeding program in France that worked to improve productivity of organic bread wheat. In this project, the original parental variety selections were made by a farmer-baker and hybridizations of these parental varieties were performed on-farm. Researchers facilitated quality and genetic analysis of the breeding populations. Early generation selections were made by participating farmers based on agronomic quality (Rivière et al., 2015) . In supplementary materials, the authors note that meeting specific end-use parameters were not critical because craft bakers within the community could work with diverse wheat varieties to create marketable bread. In this case, the need for end-use quality was balanced by increased agronomic performance and the creative skills of bakers embedded in a local food system. Surveys of bakers in Western Washington indicated that consistency was a major concern regarding the sourcing of local flour (Hills et al., 2013a) . A more direct engagement with bakers during the variety selection process could help overcome this barrier and facilitate the adoption of new locally grown varieties.\nThe development of malting barley in the Czech Republic reflects an approach to regional plant breeding that is inspired by local culture. Czech plant breeders have effectively increased the agronomic quality of barley and improved certain aspects of malting quality, while still maintaining the specific malting attributes necessary for production of distinctively Czech style beer (Kosar et al., 2004) . This process of selecting for specific malting quality characteristics is similar in ways to the breeding guidelines developed by AMBA (2014). However, the Czech model promotes a regional style of barley, which is currently lacking from malting barley selection in the USA. Following a similar approach, Western Washington brewers could facilitate the selection of unique regional varieties.\nItalian researchers undertook a project to improve the agronomic qualities of an Italian bean landrace (Almirall et al., 2010) . This work resulted in higher yield potential and upright plant architecture desirable for mechanical harvest. Advanced breeding lines were also selected for decreased cooking time, and reduced vulnerability to splitting while maintaining desirable flavor and appearance characteristics. Western Washington heirloom dry beans are a potential genetic resource which could be improved in a similar manner. In these examples, heirloom varieties may serve as a genetic resource for developing a new crop variety that meets local culinary standards. However, the introduction of parental germplasm from other regions and food traditions may be necessary to facilitate genetic advances in agronomic and even end-use quality.\nPlant breeding can also expand culinary traditions within a region. In Ethiopia, collaborative efforts between farmers and breeders, including end-use quality evaluation resulted in the release of barley particularly well adapted to the production of injera, a regionally important staple food (Abraha et al., 2013) . Prior to the initiation of this breeding project, barley was generally considered inferior to tef (Eragrostis tef) for the production of injera. Through engaging farmers and cooks in the process of selection the breeders were able to develop a variety that expanded the culinary potential of barley. By combining agronomic improvements with such deliberate selection for end-use quality participatory breeders can add to the productivity and diversity of regional cropping systems and cuisine.\nIn Washington, Oregon and Idaho, a farmer-breederchef collaboration is currently underway to select highyielding and flavorful hull-less, food grade barley with high β-glucan content. As most barley varieties used for food are high-yielding hulled varieties, nutritional compounds found in the pericarp are removed during the pearling process and this product is no longer considered to be a 'whole-grain.' In this farmer-breeder-chef participatory breeding project, organic farmers select among elite hull-less varieties for farming system appropriate agronomic traits of interest (resistance to lodging and disease, early maturity, plant height, weed suppression ability, etc.), breeders select for high yields and high β-glucan content, and chefs select for taste, texture, cooking and baking quality, and unique flavors. As with the Ethiopian example this approach has the potential to add new culinary options to local food systems, while increasing crop productivity.\nParticipatory wheat breeding and variety selection projects have emerged out of grain re-localization movements across the USA. On-farm selection and agronomic evaluation of wheat populations is underway in Vermont (Darby et al., 2013) as is active evaluation of end-use quality in collaboration with local bakeries (George, n.d.) . Within Western Washington, the goal of the Bread Laboratory, located at the Washington State University, Northwestern Washington Research and Extension Center is to, '… combine science, art, curiosity, and innovation to explore ways of using regionally available grains to move the craft of whole grain bread baking and other grain usage forward.' This is achieved through a collaborative approach involving farmers, bakers, millers, maltsters and chefs in the process of variety development and selection. The success of this approach to plant breeding will be put to the test in the near future as varieties of wheat, barley and oats bred specifically for Western Washington are released by the program.\nNumerous arrangements have been made in the development of participatory plant-breeding projects (Li et al., 2014) . A fundamental aspect of this process is the recruitment of stakeholders early in the process to define goals and develop selection criteria. Selection for end-use quality may be achieved through nutritional or functional testing, and/or organoleptic sensory analysis as described by Vindras-Fouillet and co-authors in the evaluation of wheat varieties (Vindras-Fouillet et al., 2014) . Given the potential of information to alter preference (Kihlberg et al., 2005) selection methodologies which can isolate perceived value are critical for making genetic gains in end-use quality.\nThe logistical challenges and cost of evaluating organoleptic quality on a large scale will require end-use selection to occur at advanced stages of testing. The initiation of a breeding program with parental types that have desirable end-use qualities, or heirlooms with specific cultural significance, will help facilitate the development of a varieties suited to regional end-use. As was noted above in the discussion of Model 2, the selection for culinary quality must be balanced with necessary agronomic qualities. For efficiency, selection may be carried out by specific participants at different stages, for example the farmer may identify lines with suitable agronomic qualities which can then be evaluated by the chef for culinary acceptability. Broader consumer participation in selection could also be facilitated through public events (Vindras-Fouillet et al., 2014) . Through this participatory process the role of the breeder could evolve from identifying suitable parent lines to generating diversity through crossing and facilitating selection at different stages of the process."}, {"section_title": "Discussion", "text": "Because plant breeding operates at the intersections of production, processing and consumption, it has the potential to support local food systems through the development of regionally and culturally appropriate varieties. Achieving this may require approaching the development of enduse criteria in a participatory manner as described in Model 4. In the case of Western Washington, participatory plant breeding has the potential to contribute to ongoing efforts to add value to small grains and dry beans.\nThe presence of over 150 breweries in Western Washington (Washington State Liquor Control Board, 2014) and the recent establishment of Skagit Valley Malting, a craft malting facility, suggest the potential for adding value to local barley. In particular, the relevance of varieties with non-commodity quality profiles is demonstrated by Skagit Valley Malting successfully utilizing the recently released variety 'Alba', which did not meet the standards of malting quality established by AMBA (Graebner et al., 2014 ). Future regional breeding efforts can place a high priority on agronomic performance and disease resistance, while engaging the creativity of end-users in the development of suitable varieties.\nThe selection of dry beans in Western Washington reflects the complexity of developing varieties which are profitable for producers as well as accessible to the broader community. Efforts to promote consumption of beans in regional classrooms are underway and could represent one target for community engagement . There is also potential to select for a high-end culinary market, as local restaurants have already recognized the value of regional heirloom varieties (Leson, 2013) . To meet the goals of food sovereignty associated with local agriculture, quality evaluation could be broadened to include low-income members of the community. Such an approach could also help bring the benefits of public research to 'multicultural and disadvantaged farmers' (Ostrom et al., 2010) .\nThrough a participatory approach, plant breeders can leverage the technical and artistic skill of the culinary community. In doing so, quality selection can be brought out of the laboratory, and laid out for '… public participation in prototyping … around a public forum like a dinner table' as proposed by Carruth (2012) in a discussion of artscience collaboration. Increasing public engagement may also serve to reinvigorate support for classical plant-breeding education and research (Gepts and Hancock, 2006) . This is critical as the number of public programs training plant breeders has been in decline (Frey, 1996; Guner and Wehner, 2003; Stuber and Hancock, 2007) and plant breeding for local food systems will require a much greater number of regionally based plant breeders and associated seed distribution systems.\nIn the absence of robust public funding alternative sources of revenue will be necessary to support public plant breeding. Revenue may need to be generated from a variety of sources, including royalties, end-user fee or funding from private enterprises. As outputs of the public breeding program can be considered a public commons, maintaining fair and open access to public varieties is an important component of contributing to a local food system. Royalties or user fees may put a disproportionate burden on lower income members of the public as has been demonstrated and critiqued in the case of paying for access to public lands (More and Stevens, 2000) . In some cases, the cost associated with development of new varieties may need to be defrayed by civically engaged private enterprises such as bakeries or breweries which may benefit directly from the development of new varieties. Li and co-authors (Li et al., 2014 ) discuss models of plant genetic resource conservation and participatory plant breeding which engage various public and private actors in the selection, production and marketing of varieties. The appropriate model for a given crop and region will reflect the needs and limitations of local producers, consumers and regulatory institutions.\nGlobally, germplasm is increasingly viewed as a product to be controlled and marketed by public universities and private companies (Kloppenburg, 2005) . Within the USA there has been a trend toward increasingly restrictive forms of intellectual property in the plantbreeding industry (Pardey et al., 2013) . The Open Source Seed Initiative (OSSI) is one potential model for redefining understanding of germplasm in a way that would support a participatory approach to plant breeding. This initiative revolves around a seed packet pledge which, 'is intended to ensure your freedom to use the seed contained herein in any way you choose, and to make sure those freedoms are enjoyed by all subsequent users' (OSSI). In an early manifestation of this concept, Kloppenburg described 'Biological open source … [as] … a plausible and fecund modality … for the actual repossession of a relatively autonomous space within which practices and ideas with transformative potential can be enacted' (Kloppenburg, 2010) . OSSI offers a vision of a\nprotected, yet open exchange of germplasm suitable for plant breeding for local food systems."}, {"section_title": "Conclusion: A culturally based approach to plant breeding", "text": "The models presented here represent a range of approaches to variety selection and plant breeding. Among these, participatory plant breeding is strongly positioned to facilitate a greater connection with local culture, strengthen the local food movement and help to resist co-option, through a defetishization of the food system. Participatory plant breeding has the potential to achieve gains in agronomic and end-use quality while honoring local knowledge and expanding culinary possibilities. Achieving these goals will require an expansion, and decentralization, of public breeding institutions, strengthening of regional seed systems and loosening of intellectual property restrictions on germplasm, and it will require plant breeders to pause and ask, what are we missing?"}]