[{"section_title": "Abstract", "text": "For more information on the USGS-the Federal source for science about the Earth, its natural and living resources, natural hazards, and the environment-visit https://www.usgs.gov or call 1-888-ASK-USGS.\nFor an overview of USGS information products, including maps, imagery, and publications, visit https://store.usgs.gov."}, {"section_title": "The Effects of Management Practices on Grassland", "text": ""}, {"section_title": "General Overview", "text": "The Brown-headed Cowbird (Molothrus ater) is an obligate brood parasite that relies entirely on host species to incubate its eggs and rear its young. The cowbird evolved on the open grasslands of the Great Plains, but its population expanded eastward and westward following European settlement ( fig. PP1 ; Mayfield, 1965; Rothstein and others, 1980; Lowther, 1993) . The species' current breeding distribution is widespread, covering much of the 48 conterminous United States, southern Canada, and northern Mexico. Note that northern Mexico is not shown in figure PP1 because the ability of the North American Breeding Bird Survey to document the status of the Brown-headed Cowbird and other North American bird species whose breeding ranges extend into northern Mexico has been limited by a lack of information from poorly surveyed regions in Mexico (Pardieck, 2008) . At the continental level, the cowbird reaches its highest abundance in the center of its breeding range in the northern Great Plains, and cowbird abundance generally declines with increasing distance from the Great Plains (Thompson and others, 2000; Igl and Johnson, 2007; Sauer and others, 2013) . Vernacular and scientific names of plants and animals follow the Integrated Taxonomic Information System (https://www.itis.gov/) and the 59th Supplement to the American Ornithological Society's Checklist of North American Birds (Chesser and others, 2018) .\nAlthough cowbirds are not considered a serious threat to their primary avian hosts (Ortega and others, 2005) , cowbird brood parasitism has been recognized as a potential threat to the survival of threatened and endangered species (for example, Kirtland's Warbler [Setophaga kirtlandii]; Kelly and DeCapita, 1982) and has been implicated in the declines of other bird species through reduced reproductive output (Rothstein, 1975 (Rothstein, , 1990 Mayfield, 1977; Payne, 1977; Brittingham and Temple, 1983; Sealy, 1992; Robinson and others, 1995) . As a result, efforts to control or limit cowbird populations in North America are common (Rothstein and Robinson, 1998; Ortega and others, 2005) . Elsewhere, Shaffer and others (2003) summarized factors that affect cowbird distribution and parasitic activity and described how cowbirds respond to grassland management practices (for example, burning, haying, and grazing), including those practices aimed at controlling or limiting cowbird populations. Keys to discouraging Brown-headed Cowbird parasitism or controlling populations of Brown-headed Cowbirds in the Great Plains are maintaining large expanses of grassland, eliminating foraging areas (for example, feedlots) and perch sites, and reducing the extent of overgrazed pastures (Shaffer and others, 2003) . Herein, cowbird parasitism rates are summarized for the 40 species of grassland birds included in \"The Effects of Management Practices on Grassland Birds\" (Johnson and others, 2019) ."}, {"section_title": "Rates of Cowbird Parasitism", "text": "Rates of cowbird brood parasitism, obtained from the literature and from unpublished data provided by colleagues, are summarized for 40 grassland bird species in table PP1. The frequency of nests parasitized was used as an index to the rates of parasitism, and the rate (percent) of cowbird parasitism was defined as the total number of parasitized nests (×100) divided by the total number of nests reported for a given species in a study.\nThe Brown-headed Cowbird is a host generalist; eggs of the cowbird have been found in nests of more than 220 species of North American birds (Ortega, 1998; Lowther, 2016 (table PP1) . There are no known records of cowbird brood parasitism for one passerine, the Sedge Wren (Cistothorus platensis), perhaps because the entrance to its globular-shaped nest is too small for female cowbirds to enter (Herkert and others, 2001 ). The McCown's Longspur (Rhynchophanes mccownii) is considered a host based on historical accounts consisting of one to two nests that were parasitized (Friedmann, 1963 ), but in records consisting of 10 or more nests, Nonpasserine species are generally considered to be unsuitable or inappropriate hosts of the Brown-headed Cowbird because the cowbird's diet or its developmental strategy (altricial) are incompatible with those of the hosts (Sealy, 2015) , and thus, nonpasserine nests usually are avoided by Brown-headed Cowbirds (Rothstein and Robinson, 1998; Sealy, 2015) . Sealy (2015 ) summarized Friedmann's (1929 , 1963 proposed requirements for the suitability of hosts of parasitic cowbirds (Molothrus species [spp.]): (1) the hosts exhibit an altricial post-hatching pattern of development, (2) the hosts lay eggs not much bigger than the cowbird's eggs, (3) the hosts place food into the nestlings' gaping bills, and (4) the hosts feed the young an arthropod diet that will sustain the cowbird's development. None of the four parasitized species of nonpasserine grassland birds are known to have raised cowbird young (Ortega, 1998; Sealy, 2015) . In contrast, most of the 21 passerine cowbird hosts are known to have fledged cowbird young from parasitized nests (Ortega, 1998; Shane, 2000; Green and others, 2002; Davis and Lanyon, 2008; Davis and others, 2014) . Only three grassland passerine hosts are not known to have raised cowbird young: Loggerhead Shrike, McCown's Longspur, and Nelson's Sparrow (Ortega, 1998; Yosef, 1996; With, 2010; Shriver and others, 2011) .\nThe reported rates of brood parasitism by Brown-headed Cowbirds vary considerably among and within grassland host species (table PP1) , making it difficult to identify generalizable patterns across a species' breeding range. Jensen and Cully (2005a, 2005b) and Igl and Johnson (2007) found evidence of decreasing parasitism levels among grassland birds as distance increases from the center of the cowbird's breeding range in the Great Plains. A few species with widespread breeding distributions follow this pattern, although not consistently, with generally higher parasitism rates in the southern or northern Great Plains and lower parasitism rates east and west of this area. These species include the Savannah Sparrow (Passerculus sandwichensis), Grasshopper Sparrow (Ammodramus savannarum), Eastern Meadowlark (Sturnella magna), Bobolink (Dolichonyx oryzivorus), and Dickcissel (table PP1) . Species with breeding ranges restricted to the northern Great Plains that do not conform to this pattern include the Sprague's Pipit, Chestnut-collared Longspur, McCown's Longspur, and Baird's Sparrow (Centronyx bairdii). Of these species, the Baird's Sparrow was the only species to experience heavy parasitism (36 percent), and that only occurred in one study (Davis, 1994; Davis and Sealy, 1998) . The data presented in table PP1 emphasize the complexity and variability of cowbird parasitism in North America and can serve as a reminder that cowbird parasitism rates are not constant across space or time. Brown-headed Cowbirds differentially parasitize hosts within the same habitats, even within the core of the cowbird's breeding range (Igl and Johnson, 2007) . Many factors affect parasitism rates, including location, habitat, proximity of nests to woodland and other habitat edges, alternate hosts, and defensive host behaviors. Mayfield (1965) indicated that grassland birds may have evolved behavioral defenses against Brown-headed Cowbird brood parasitism because of their long evolutionary history of co-occurrence in the Great Plains. Evolutionarily, however, cowbirds and their hosts have interacted for a relatively short period of time (2.8-3.8 million years) compared to other brood parasite-host systems on other continents (Rothstein and others, 2002; Peer and others, 2013) . As such, cowbirds lack some of the more sophisticated adaptations (for example, egg mimicry) possessed by other brood parasites (for example, Common Cuckoo [Cuculus canorus]), and host defenses against cowbird brood parasitism are less complex than defenses exhibited by hosts of other brood parasites (Peer and others, 2013) . Defenses possessed by cowbird hosts in grasslands include aggressively defending their nests against female cowbirds, egg rejection, desertion of parasitized nests, and burying cowbird eggs in the nest lining. Many cowbird hosts display aggressive behavior toward cowbirds (Ortega, 1998), including several grassland bird species: Loggerhead Shrike, Clay-colored Sparrow (Spizella pallida), Field Sparrow (Spizella pusilla), Bobolink, and Eastern Meadowlark Norman, 1976, 1977; Grieef, 1995; Ortega, 1998) . The success of aggressive behaviors in preventing cowbird parasitism is considered limited (Sealy and others, 1998; Peer and others, 2013) . About 13 percent of cowbird hosts are known to reject cowbird eggs (Peer and Sealy, 2004) . Of the grassland birds that have been identified as cowbird hosts, the Loggerhead Shrike is considered an egg rejecter (Rothstein, 1982 (Peer and others, 2000) . Nest desertion is considered a more effective anti-parasitism strategy. Among smaller cowbird hosts, nest desertion is a common response to cowbird parasitism (Ortega, 1998; Hosoi and Rothstein, 2000) . Nest desertion with subsequent renesting has been reported in about 16 percent of known cowbird hosts (Hosoi and Rothstein, 2000) , although the frequency of abandonment may be quite low (Sealy, 1999; Davis and Sealy, 2000) . The frequency of desertion of parasitized nests appears to be more common in grasslands and other nonforest habitats than in forest habitats (Hosoi and Rothstein, 2000) . Grassland birds known to abandon their nests as a result of parasitism or cowbird removal of host eggs include the Clay-colored Sparrow, Brewer's Sparrow (Spizella breweri), Field Sparrow, Lark Sparrow (Chondestes grammacus), Lark Bunting (Calamospiza melanocorys), Grasshopper Sparrow, Eastern Meadowlark, and Dickcissel (Baepler, 1968; Hill, 1976; Walley, 1985; Ortega, 1991; Hosoi and Rothstein, 2000) . Burial of cowbird eggs by a host is a less common defense against cowbird brood parasitism and is sometimes considered a continuation of nest building (Rothstein, 1975; Sealy, 1995) . The Clay-colored Sparrow occasionally buries cowbird eggs in its nest lining (Igl and Johnson, 2007) ."}, {"section_title": "Host Defenses against Parasitism", "text": ""}, {"section_title": "Summary", "text": "The Brown-headed Cowbird is an obligate brood parasite that relies entirely on host species to incubate its eggs and rear its young. The Brown-headed Cowbird is a host generalist; eggs of the cowbird have been found in nests of more than 220 species of North American birds. Although cowbirds are not considered a serious threat to their primary avian hosts, cowbird brood parasitism has been recognized as a potential threat to the survival of threatened and endangered species and has been implicated in the declines of other bird species through reduced reproductive output. In this chapter, we summarized the rates of cowbird brood parasitism for 40 grassland bird species. The reported rates of brood parasitism by Brown-headed Cowbirds varied considerably among and within grassland host species, and the factors that influence parasitism rates were described. Defenses possessed by cowbird hosts in grasslands include aggressively defending their nests against female cowbirds, egg rejection, desertion of parasitized nests, and burying cowbird eggs in the nest lining. "}]