[{"section_title": "Introduction", "text": "The Internet has woven its way into nearly every aspect of American life: people use it for communication, entertainment, education, and commerce opportunities (Horrigan and Rainie, 2006). In 2005, approximately 73 percent of Americans used the Internet from some location (Madden, 2006). Rural households, which have historically lagged behind in terms of Internet access, have seen dramatic increases in recent years -connecting at a rate of 53 percent in 2005 (Horrigan, 2006). The farming industry, in particular, has found several applications for this distance-negating technology, including checking weather forecasts, buying inputs and selling products online, or even setting up and running individual farm websites. The percentage of farms online has increased from 13 percent in 1997 to over 60 percent in 2005. In fact, nearly $30 billion of business was conducted online in the agricultural, forestry, and fishing sectors in 2005 (Dorfman and Watson, 2005). Given this increasing interest in online activity in the farming sector, several intriguing questions emerge. Namely, for farmers who do use the Internet as a part of their farm business, why does only a small subset (approximately 7 percent) choose to purchase farm inputs over it? Additionally, why do some farmers choose not to use the Internet at all? Do specific farm or operator characteristics lead to these discrepancies? This paper explores the factors affecting these questions, seeking to understand whether individual characteristics (age, race, or education) or farm characteristics (size, type, location) help explain this decision process. While several previous studies have looked at Internet adoption and use by farmers (Mishra and Williams, 2006;Batte, 2005), the questions answered in this paper make unique contributions. In particular, although numerous benefits from Internet access and effective use for farm households exist; previous research has not identified any factors affecting the particular reason for not making use of this technology. A firm understanding of the rationale behind this decision will provide information about perceived barriers and can be used to help develop educational programs dealing with particular aspects of Internet access for farmers."}, {"section_title": "Background", "text": "Numerous studies have looked at how farmers have incorporated the Internet into their lives and farm businesses. Mishra and Williams (2006) suggest that the propensity for a farm household to adopt the Internet is positively related to a number of variables, including age and educational level of the operator, the presence of a spouse, farm size and regional location. They are further able to examine whether the household uses the Internet specifically for farm business purchases, for household purchases, or both. They find that the results (positive impacts of age, education, farm size, and regional location) are very similar among all groups. There are several interesting differences, however, including a higher propensity for farms in the Heartland or Northern Great Plains region to use the Internet specifically to purchase farm inputs. This trend does not hold for purchasing household items, indicating that regional differences may contribute to how a particular farm uses the Internet. Rolfe, Gregor, and Manzies (2003) attempt to determine whether farmers adopt the Internet for (1) cost reduction purposes, or (2) increases in productivity. Their results give little evidence that farmers were able to identify either cost or time savings from using the Internet, but rather show that some value comes from adding to productivity increases, including availability of technical information. Similarly, Smith et al. (2004) investigate the perceived benefits of Internet adoption by Great Plains farmers, and found that most were using it as a source of information. Ninety-two percent of the respondents to their survey retrieved more than one type of information (such as financial, weather, or agricultural policy), and 50 percent collected at least four types of information. They also explored the decisions for farmers to make purchases over the Internet (although not specifying whether the purchases were for farm or household use), and found farm size and Internet experience to be the most important variables. Interestingly, farmers who made purchases over the Internet were not more likely to indicate that the Internet improved their competitiveness. The literature has also provided a thorough review of e-commerce businesses who attempted to cater to the agricultural industry. As the dot-com boom raged into the late 1990's, there was no shortage of start-ups looking at agricultural as the next logical industry for e-commerce to work its magic. Numerous websites opened that were geared towards providing farmers a place to purchase their inputs and take advantage of the many strengths of the Internet, such as the convenience of purchasing from home, the ability to conduct business 24 hours a day 7 days a week, and a reduction in cost from removing steps along the supply chain. Several agribusiness-oriented websites launched during this period, included Rooster.com (one-stop shopping and sales for farmers), Powerfarm.com (chemicals, seeds, and parts), and Farms.com (Kalaitzandonakes, Kaufman, and Wang, 2005). However, many of these entrants quickly realized that the ecommerce model did not apply so easily to the agricultural sector and either left the market or changed the direction of their business. The reasons suggested for this by the literature include issues with timely delivery and application that take into account the individual farmer's time constraints (Schmitz and Hansen, 2005) and a lack of personal interaction or full set of products (Kalaitzandonakes, Kaufman, and Wang, 2005). One constant theme throughout most empirical studies is the small percentage of farmers who make purchases for their farm online. The reasons for this are varied: some have hypothesized that growers are concerned about reliability and security of online trading (Zilberman et al., 2005), or are hesitant to go away from special relationships or credit arrangements that have worked for them in the past. Others have suggested that only those farmers with extremely optimistic attitudes about the profit-bearing potential of this technology are likely to engage in that particular aspect of e-commerce (Ernst and Tucker, 2001). This study furthers the existing literature by looking explicitly at those who have purchased farm inputs online and models the decision process based on a host of demographic, economic, and geographic variables. It also explores a previously unexamined aspect of farmers and Internet use -namely, the specific reasons why some farmers choose not to use it for their farm business."}, {"section_title": "Data and Descriptive Statistics", "text": "The data for this study comes from the 2005 Agricultural Resource Management Survey (ARMS), which is an annual survey of farm and ranch operators administered jointly by the National Agricultural Statistics Service and the Economic Research Service. ARMS data contain information regarding the financial condition of farms, operational characteristics, and the overall well-being of farm households. The 2005 survey asked specific questions regarding Internet use as part of the farm business. This included whether or not the Internet was used for the business. If the Internet was not used as part of the business, a follow-up question asked the following rationales for non-adoption: no computer, inadequate Internet service, Internet security concerns, and other. If the Internet was used as part of the business, then the survey respondent answered whether or not farm inputs were purchased over the Internet. This is only one of many potential uses of the Internet in a farm business. Mishra and Park (2005) list and analyze these other reasons for Internet adoption; however, they did not have the specific question of purchasing farm inputs over the Internet in their study. Table 1 summarizes the responses to the Internet-specific questions. Consistent with the existing literature on the topic, many respondents (over 70 percent) use the Internet for their farm business, but only a small percentage of those (6.6 percent) use it to purchase farm inputs. Although the 2005 ARMS only reports this particular Internet use by farmers, Mishra and Park (2005) found, in the 2000 ARMS, that the largest use of the Internet was to track commodity prices, 83 percent, and 7 percent stated they use the Internet to pay bills. The remaining respondents, approximately 30 percent, stated they did not use the Internet as part of the farm business. Even though \"other\" is the most cited reason for non-use, the other three reasons -no computer, inadequate Internet service, and Internet security concerns -are popular discussion points as why farmers do not adopt the Internet. Over one-third indicate that they do not have a computer in their household. Inadequate Internet service and Internet security concerns account for only a small percentage of the responses. The recent advancements in Internet service and security may explain why these reasons are not cited as frequently. To further explore the characteristics that may underlie these decisions, Table 2  Intermediate farms and commercial farms have less than $250,000 and more than $250,000 farm sales, respectively. Also, intermediate and commercial farm operators state their primary occupation is farming. After splitting the farm operators into two groups (those who use the Internet as a part of their farm business, and those who do not), several differences become apparent. Farm operators who do use the Internet tend to have higher levels of household income, have more 'farmers' or farm operators that indicate their primary occupation is farming, have more farm sales, and have higher levels of education. Farm operators who do not use the Internet for their farm business tend to be older and less educated. A measure of rurality (miles from a town of 10,000) does not seem to vary much between the two groups."}, {"section_title": "Methodology and Empirical Models", "text": "As in many adoption studies, this study utilize a random utility framework to conceptualize why a farmer would adopt the Internet in their farm business. The utility a farmer gains from adopting the Internet is hypothesized to be a function of exogenous variables specific to each farmer (these exogenous variables were presented earlier). A farmer will adopt the Internet if the utility received from adoption exceeds the utility of non-adoption. Therefore, a farmer will chose to adopt the Internet if it maximizes their utility. This choice is then made empirically tractable via discrete choice models. In the present study, a conditional logit model is estimated first on those farmers that adopted the Internet and chose to purchase farm inputs relative to those that adopted the Internet and did not purchase farm inputs. The next discrete choice model identifies important factors that influence why farmers do not use the Internet in their farming operation. A conditional multinomial logit model is estimated on those farm operators that do not use the Internet and the four different reasons serve as the choice or dependent variable -no computer, security concerns, inadequate Internet service, and some other reason (base group)."}, {"section_title": "Preliminary Results", "text": "The results of the conditional logit model are displayed in Table 3. In general, several intuitive variables appear to impact the decision to purchase farm inputs over the Internet. Operator age displays a negative relationship, implying that older farmers are less likely to purchase their inputs online. Further, the propensity to purchase farm inputs online is positively impacted by dummy variables for farmers with higher levels of education (similar to the results of Smith et al. (2004)), Caucasian race, and an intermediate sized farm. Most of these factors are similar to those found in a similar study performed by Mishra and Williams (2006). However, several results differ, including the lack of significance of both a quadratic age term and a variable for household income. Table 4 displays the results of the multinomial logit model dealing with the rationale for households that do not use the Internet as part of their farm business. Several results from this model are intuitive, such as the significantly negative education and income variables for farms who indicated that not having a computer kept them from using the Internet as part of their farm business. Also, older farmers are more likely to choose the \"no computer\" reason for non-adoption. A counterintuitive results, however, is that higher levels of education positively impact the likelihood of choosing \"security concerns\" as the reason for not using the Internet in the farm business. Possibly these individuals are more concerned with the potential ramifications of conveying private information over unsecured channels. Further, a measure of rurality (miles from a town of 10,000) has no statistical impact on any of the reasons, indicating that rural locations are not necessarily perceived as having worse Internet service.    Notes: Base group is \"other reason\" for not using the Internet as part of the farm business. Group 2 is \"security concerns\" for not using the Internet as part of the farm business. Group 3 is \"bad service\" for not using the Internet as part of the farm business. Group 4 is \"no computer\" for not using the Internet as part of the farm business. Pseudo R 2 equal 0.12 and sample size is 3,975."}]