[{"section_title": "LIST OF TABLES", "text": "Obesity is now considered a national public health crisis, as it is one of the most urgent and serious health threats confronting our nation (Polhamus, 2011). Being overweight is prevalent worldwide, and an ever-increasing problem that poses a serious risk to the physical and mental wellbeing of youth. It is an early risk factor for morbidity and mortality in adulthood, and has been associated with a myriad of psychosocial and cognitive impairments in adults. There has been some controversy regarding the cognitive impact of underweight and obesity, and malnutrition, in childhood and adolescence. In recent years, several studies have evaluated general effects of under-or overweight at various ages, as well as brain structures. The range of methodologies and outcomes of these investigations makes it difficult to draw straightforward conclusions about childhood weight status and its effect on cognitive performance. There are, however, enough studies illustrating a correlation between obesity and cognition to merit concern and further investigation. In a systematic review of studies on the cognitive impact of obesity, Cosgrove, Arroyo, Warren, and Zhang (2009), concluded that a decrease in cognitive functioning was linked to excess weight in children. They found attention, motor skills, and visual-spatial organization processes to be significantly lower in overweight and obese individuals, compared to their normal-weight peers (Cosgrove et al., 2009). The effects of obesity on the neuropathological systems have also been analyzed through neuroimaging and other technologies, which allows for dissection of the functional and structural changes in the brain related to increased adipose tissue. As with neuropsychological tests, these imaging methods are diverse, and provide insight into the neural networks that underlie food intake, chemical functioning, and abnormal brain structures in high-risk and obese individuals. Carnell and colleagues (Carnell, Gibson, Benson, Ochner, & Geliebter, 2012) published a summary of findings regarding neuroimaging and obesity in the child and adolescent populations -encompassing various regions of the brain, as well as behavioral investigations into the appetitive reward system. More specifically, when comparing lean and obese adults, it has been found that adults in the obese BMI range have dysregulated responses to visual food stimuli, particularly in the areas of the brain that control attention and cognitive control. Similarly, food tastes and smells trigger heightened responses in the memory, reward, and motivation centers of the brain with simultaneous lower activation in the areas controlling attention. The \"hot\", or hedonic, response system seeking rewards is activated. The review also suggested that weight gain in individuals with obesity may be attributable to decreased hypothalamic activity and inhibitory control, and down-regulation of dopamine receptors (Carnell et al., 2012). In turn, the visual, olfactory, and gustatory food cues become hypersensitive to overcome the insufficient food-reward response. Structural differences have also been noted in the brain of individuals with obesity across several studies, though most have not been able to assign causality (Carnell et al., 2012). More specifically, researchers have found that there is reduced volume of the hippocampus and thalamus -areas associated with emotional control, which may explain the higher rate of dementia and lower cognitive performance in adults with obesity (Carnell et al., 2012). For persons who were overweight and successfully dieted, research has shown that they continue to have heightened responses to food cues, and continue to show overactivation in the hypothalamus and visual cortices (the homeostatic and sensory areas of the brain). They also show increased activation of the attention and self-regulation executive functions (EF) of the brain. Similar findings of dysregulated functioning in the reward system of those at genetic risk for obesity have been reported, and are discussed in the genetics section that follows. Research on children with BMI's in the underweight range typically use clinical samples with confirmed diagnoses of Anorexia Nervosa (AN), an eating disorder characterized by an unhealthy, underweight BMI (Andrés-Perpiña, 2011;Bosanac, Olver, Kurlender, Stojanovska, Hallam, Norman, . . . Manktelow, 2007;Bradley, Taylor, Rovet, Goldberg, Hood, Wachsmuth, . . . Pencharz, 1997). Within these populations, findings are discordant and have small sample sizes, though Andrés-Perpiña (2011) reported decreased attention, memory, and visuospatial scores. Findings from studies exploring the relationship between cognitive functioning and weight status in children are discordant, and limited by variability or reliability of measures, and that they do not typically include children of low socioeconomic status -a known risk factor for obesity, or non-clinical samples of children with BMI's below the normal weight range (Inagami, Cohen, Finch, & Asch, 2006;Richards & Wadsworth, 2004). Further work is needed to clarify possible cognitive and learning deficits in children at either end of the weight continuum, using clinically and developmentally appropriate measures. The current study used the Third National Health and Nutrition Examination Survey (NHANES-III) dataset and developmentally defined body mass index cutoffs (Cole, Bellizzi, Flegal, & Dietz, 2000), cognitive and academic performance measures, as well as macronutrient intake on a nationally representative sample to address these issues. An important factor in empirical studies on the cognitive, and academic, performance of under-and over-weight young children is the assessment and inclusion of the environmental milieu. As has been demonstrated in a number of studies, the home and school environments, maternal education, demographic variables (e.g., SES, age, race/ethnicity), as well as eating and exercise behaviors are important covariates of obesity and cognition (Cosgrove et al., 2009;Datar, Sturm, & Magnabosco, 2004;Gorin, 2008;Gunstad et al., 2008;Li, Dai, Jackson, & Zhang, 2008;Kristine Lee Lokken, Boeka, Austin, Gunstad, & Harmon, 2009;Miller et al., 2009;Ogden, Carroll, Kit, & Flegal, 2012;Veldwijk, Scholtens, Hornstra, & Bemelmans, 2011). Research has shown that maternal intelligence, household SES, race/ethnicity, and age have the highest correlations with low cognitive and academic performance in children who are overweight (Datar et al., 2004;Li et al., 2008;Veldwijk et al., 2011); as well as those who are underweight and malnourished (UNICEF, 2009), though research on the latter is scarce. Furthermore, the Cosgrove (2009) report proposed different risk profiles for cognitive functioning and academic performance as an explanation for discordant findings in previous studies. This was supported by nonsignificant effects on academic performance when controlling for socioeconomic status (SES) (Cosgrove et al., 2009). Prospective research has suggested a causal and temporal relationship between weight status and reduced cognitive performance, with two key studies in this area conducted on adult populations (Nilsson & Nilsson, 2009;Gunstad et al., 2010). In Sweden, a nation-wide study of people aged 35-80 years underwent assessment of their episodic memory -memory for specific events, semantic memory -long-term recall of concepts, ideas, and meanings, and spatial abilities as measured by a block design test, four times over a period of 22 years (1998)(1999)(2000)(2001)(2002)(2003)(2004)(2005)(2006)(2007)(2008)(2009)(2010) (Nilsson & Nilsson, 2009). After controlling for comorbidities related to obesity, it was found that semantic memory was associated with increased weight status while episodic memory was not. Using data from the Baltimore Longitudinal Study of Aging, Gunstad, Lhotsky, Wendell, Ferrucci, and Zonderman (2010) found that, in adults with a mean age of 55.5 years, BMI's in the obese range were associated with lower global cognitive and EF skills over time, but no decline in attention capacity was reported. Gunstad (2010) speculated several explanations for this independent effect of obesity on cognition including inflammatory processes, neuroendocrine disorders, and heart problems. These vascular and inflammatory processes would not solely account for lower cognitive functioning in a younger population. While these mechanisms may be important in all children, they may play a more important role in younger children at the extreme ends of the weight spectrum. A circumscribed explanation for the cognitive differences associated with increased adipose tissue in children remains abstruse, and the evidence from population-based and clinical studies are discordant. Preliminary research suggests that obesity may be related to mild cognitive changes in adolescents and adults, principally in the frontal cortex -an area associated with executive control of rewards, attention, short-term memory, planning, and motivation. Overweight status has also been implicated as a maker for poor academic performance, though it has been suggested that poor academic outcomes may not be caused by obesity, rather that they are better explained by socioeconomic factors. Outcomes from the current study will allow for replication of previous investigations on the cognitive and academic factors related to obesity in young children, and expand the knowledge base by exploring whether macronutrient intake, cognitive, and academic performance variables are related in the early childhood and adolescent populations. Specifically, the current study addresses whether lower cognitive functioning and academic performance characterize children who are underweight, overweight, or obese, and explores the relationship between cognitive functioning, academic performance, selected macronutrient intake, and weight status. Previous investigations' inconclusive or weak findings on the relationships among weight status, cognitive functioning, and/or academic performance were addressed in the current study through use of a large, nationally representative sample. This was done using BMI cut points based on large, international datasets that are linked to adult cutoffs making them good indicators for negative health outcomes, and examination of the possible contribution of macronutrients to these associations. Further understanding of these connections will contribute critical information about associations between cognitive functioning and the body, informing weight loss or gain strategies and reduction of malnourishment and obesity-related health risks."}, {"section_title": "CHAPTER 2", "text": ""}, {"section_title": "Background", "text": "The activities that children and adolescents partake in, such as playing, school, and thinking all depend on energy consumption and what is stored in their bodies. Many of the nutritional problems children have involve energy imbalance: slow weight gain in infancy (a.k.a., failure to thrive) is related to deficient energy intake. AN is a discretionary restriction in energy intake, and can lead to poor growth and failure to gain weight in children. Obesity, on the other end of the spectrum is, broadly, an over-consumption and under-expenditure of energy resulting in weight gain. Food, the main source of energy for the body, is taken in through eating which driven by several factors, including the appetitive reward system, which is discussed below. The relationship between the environment, cognition, nutrition, weight status, and health outcomes across the lifespan has been a highly researched and debated topic over the past two decades. Follows is a review of (1) the cognitive framework most often affected by a weight status in the lower and upper extremes, (2) a model of the neurobiophysiological underpinnings of appetite and reward, (3) the prevalence and comorbidities of abnormal weight status, and (4) the relationship between weight status and cognition."}, {"section_title": "Cognitive Framework: Executive Functioning", "text": "Cognitive functioning is the process of taking in, processing, integrating, storing, and retrieving information. These functions occur throughout the cortex and include the tasks of attention, language, memory, perception, and the executive functions -volition, planning/organization, attention, cognitive flexibility, working memory, initiation, selfregulation, and sequencing (Best & Miller, 2010;Luria, 1973). Of the deficits reported in people with an underweight, overweight, or obese weight status; the executive functions are the most discussed (Boeka & Lokken, 2008;Braet, Claus, Verbeken, & Van Vlierberghe, 2007;Kamijo et al., 2012;Lokken, Boeka, Austin, Gunstad, & Harmon, 2009;Pauli-Pott, Albayrak, Hebebrand, & Pott, 2010;Waldstein & Katzel, 2005). While the specific areas of weakness vary by age, the cognitive processes of inhibition, planning, attention, and cognitive flexibility (shifting attention between different activities) have been associated with weight status and eating behaviors."}, {"section_title": "Executive Functions", "text": "Executive functions are psychological processes that allow conscious control over actions and thoughts: controlling inhibition, directing attention, allowing cognitive flexibility, and allowing manipulation of information in short-term memory. Developmental research on EF processes suggests that executive dysfunction, characterized by poor problem solving, poor planning, perseveration, and cognitive inflexibility (Best & Miller, 2010;Lehto, Juujarvi, Kooistra, & Pulkkinen, 2003;Pennington, 1997), may (1) not actually be abnormal in children, but rather a function of varying developmental trajectories, sequences, or processes (Best & Miller, 2010;Claire Hughes & Ensor, 2008;Romine & Reynolds, 2005), and (2) show linear improvement and lateralization throughout childhood (Best & Miller, 2010;Klenberg, Korkman, & Lahti-Nuuttila, 2001;Mandell & Ward, 2011;Pennington, 1997;Romine & Reynolds, 2005;Welsh, Pennington, & Groisser, 1991). The following review of the theories, developmental perspectives, environmental influences, as well as measurement of EF's will elucidate the areas in need of further examination in young children, related to obesity."}, {"section_title": "Theories of Executive Functions", "text": "Findings on the development of EF in early childhood will guide translational research, interpretation, as well as validation and creation of new measures. Currently there are two main theories of EF organization in early childhood, the (a) unitary construct and, (b) constituent component construct. To understand the frontal lobes' functioning it is necessary to identify common operational topographies and neural networks that transcend the individual EF's. The unitary construct supports the notion that there is a central attention system that regulates the different sub-processes of EF, particularly in children ages twothrough six-years-old (Baddeley, 1996;Carlson, S. M., 2011;Garon, Bryson, & Smith, 2008;Wiebe et al., 2011). This view has been advanced by studies reporting correlations between adult and child measures of EF's (Carlson, S. M., Mandell, , Williams, 2004;Diamond, Prevor, Callender, & Druin, 1997;Friedman et al., 2008;Hughes, 2002;Kochanska, Murray, Jacques, Koenig, & Vandegeest, 1996;Lehto et al., 2003;Miyake et al., 2000) as well as correlations between the different tasks and central attention processing (Engle, 2002;Visu-Petra, Benga, & Miclea, 2007;Welsh, Nix, Blair, Bierman, & Nelson, 2010). A second, constituent constructivist, view on EF emphasizes dissociable processes with most of the literature focusing on working memory and inhibition (Diamond et al., 1997;Pennington, 1997;Welsh et al., 1991). Research on this second theory has shown that the various EF abilities have different developmental trajectories (Archibald & Kerns, 1999;Carlson, 2005;Klenberg et al., 2001;Luciana & Nelson, 2002;Rosso, Young, Femia, & Yurgelun-Todd, 2004;Welsh et al., 1991). Within the constituent theory, tasks measuring EF in early childhood cluster in three primary domains: (a) set-shifting, (b) working memory, and (c) inhibition (Collette et al., 2005;Hughes, 1998Hughes, , 2011Lehto et al., 2003;Miyake et al., 2000;Miyake & Friedman, 2012;Pennington, 1997;Welsh et al., 1991). Review of various EF's within each of these frameworks is presented below, and influential factors considered. Hot and Cool Theory of Executive Function. Further dissection of the EF framework has been considered with the notion of \"hot\" and \"cool\" EF's, with the majority of childhood EF studies focusing on cool functions (Hongwanishkul, Happaney, Lee, & Zelazo, 2005;Metcalfe & Mischel, 1999;Zelazo, Müller, Frye, & Marcovitch, 2003). The former, \"hot\" system, controls emotional processing and triggers/stimuli, while the \"cool\" system relates to thought representations and spatiotemporal reflections (Metcalfe & Mischel, 1999). Using the delay of gratification paradigm, research has illustrated the \"hot\" emotional system as the core of impulse control in light of consequences. One such study by Marcelino and colleagues Adam, Couronne, Köster, and Sieffermann (2001) used food as the stimulus and reported that people had lower impulse control, reported heightened appetites, and ate more after seeing the food. That is, when people were presented with an in vivo presentation of a food stimulus, pizza in this case, they reacted emotionally, were more present-focused, and thus less able to delay gratification. The hot and cool model states that the same stimulus can activate both the \"hot\" and \"cool\" processes (Metcalfe & Mischel, 1999). Specifically, both the \"hot\" and \"cool\" processes represent elements of the stimulus; and while the \"hot\" activation produces an emotional reaction, activation of the \"cool\" system allows for metacognition, self-reflection, and contextual and consequential information (Metcalfe & Mischel, 1999). Given the intercorrelation between hot and cool spots, it may be that self-control is possible when a \"hot\" spot is activated that overlaps with a \"cool\" spot; when they share a node (Metcalfe & Mischel, 1999), and the \"cool\" system is able to retain some reflective actions and control over the primitive, instantaneous emotional responses. In the \"cool\" EF system a goal is attained through monitoring, working memory, and perceptual processing -intake of the environment to stimulus perception. Theoretically speaking, if a person has the cognitive resources to stop the predominant, emotionally driven, \"hot\" responses to a stimulus they will be able to select an appropriate stimulus (i.e., healthy food choice)."}, {"section_title": "Unity/Diversity Theory of Executive Functions. A relatively new perspective in EF", "text": "frameworks, the Unity/Diversity schema focuses on the components of EF that are not encompassed by common factors of working memory, shifting, or inhibition (Friedman, Miyake, Robinson, & Hewitt, 2011;Friedman et al., 2008;Miyake et al., 2000;Miyake & Friedman, 2012). Confirmatory factor analysis has demonstrated that inhibition, working memory (WM), and set-shifting are interrelated variables each contributing to the EF construct (Miyake et al., 2000). Current research on this framework focuses on the underlying abilities utilized by each EF component and whether a particular skill taps the common EF (unity) or a specific EF factor (diversity). In determining the commonality between these EF components, Friedman and colleagues (2011; found that inhibition does not contribute unique variance to individual differences in EF. Though the mechanisms behind shifting skills is unknown at present, it is hypothesized that the components of EF specifically responsible for attention shifting reflect cognitive flexibility (facility transitioning between tasks) (Miyake & Friedman, 2012); rather than the more common view that the components of cognitive flexibility, working memory, shifting, and self-monitoring are fundamental for all components of EF, as well as response inhibition (Luria, 1973;Munakata et al., 2011). While the above frameworks are divergent in their conceptualization of EF components and the correlation between them, they are not necessarily mutually exclusive. The Hot and Cool systems theory illustrates the regulation of emotional processing of stimuli and thought, and spatiotemporal representations, respectively; while the Unity/Diversity framework can be used to explain the individual differences within the various factors of EF, and the mechanisms used, which underlie people's working memory (WM) and attention shifting abilities."}, {"section_title": "Developmental Perspectives", "text": "The developmental literature supports both the independence and unifying nature of EF; that is to say an \"integrative framework\" (Garon et al., 2008;Miyake & Friedman, 2012). Statistical approaches, such as structural equation modeling, have been employed to explain latent variables and common factor loadings for various tasks within each of the EF domains. The components of EF's are difficult to study because they are not pure, but rather interrelated. Using confirmatory factor analysis, Miyake (2000) found that in older adolescents while items are partially independent, they are still correlated and a purer measure of the EF unitary construct. In younger children, ages 8-13, three partially dissociated but moderately intercorrelated variables were found (Lehto et al., 2003). In contrast, Huizinga, Dolan, & van der Mole (2006) found common factors only between working memory and set-shifting, excluding inhibition, deducing dissociation between these EF components. Willoughby and colleagues (2010) also found that the unidimensional model of EF best fit early childhood, in one of the first prospective studies of EF, with no exclusionary criteria. These results are similar to other studies conducted on children (Carlson, S. M., Mandell, Williams, 2004;Hughes & Ensor, 2007;Wiebe, Espy, & Charak, 2008), which are in contrast to what we know about the differentiated nature of EF in older children and adults. Mole (2006) found common factors only between working memory and set-shifting, excluding the inhibition factor, deducing dissociation between these EF components. As described above, the frontal cortex and EF's develop throughout childhood, which may be inseparable from other cognitive capacities (Allan & Lonigan, 2011;Fuhs & Day, 2011;Halperin, Healey, Zeitchik, & Ludman, 1989;Luria, 1973;Monette, Bigras, & Guay, 2011) as well as social influences (Lewis & Carpendale, 2009;Luri a, 1980;Vygotsky, 1978). A meta-analysis conducted by Hughes (2011) (Barnett et al., 2008;Bierman, Nix, Greenberg, Blair, & Domitrovich, 2008;Diamond, Barnett, Thomas, & Munro, 2007). In contrast to the direct and incidental ways parents enhance children's EF, a chaotic home environment has been associated with poor EF development (Asbury, Wachs, & Plomin, 2005;. While it is difficult to deconstruct the interplay between environment and genetics, Asbury, Wachs, and Plomin (2005) (Anderson et al., 2010). Related to these periods in early childhood, preschool-aged children of mothers with depression have shown more behavior problems as reported by parents and teachers than those without such environmental stress , and older children and adolescents living with depressed mothers (Klimes-Dougan, Ronsaville, Wiggs, & Martinez, 2006;Micco et al., 2009 "}, {"section_title": "Appetitive Reward System", "text": "Food consumption may be attributed to impulsive emotional responses and tied to biological drives, viewed by some as an addiction (Davis & Carter, 2009;Frascella, Potenza, Brown, & Childress, 2010). While this latter view is slightly controversial, an understanding of the neural underpinnings of information processing systems in the executive and cognitive functions is less disputed. Dagher (2009) outlined the role of these networks as performing the following functions: (1) learning about food and associating it with a reward, (2) giving attention to food rewards, (3) assigning a value to environmental stimuli, and 4incorporating environmental and homeostatic information to ascertain amount of food available and the amount energy the body needs. An overview of food reinforcement neural networks is not within the scope of this paper, but may be found in Epstein's 2007 paper (Epstein et al., 2007). In addition to contextual and individual factors, such as those discussed in the above sections, cued responses to food are captured by both the \"hot\" and \"cool\" modes of information processing. The food nutrient information is relayed to the hypothalamus, and other brain structures, from the gut while the amygdala, striatum, and orbitofrontal cortex respond to conditioned stimuli in the environment (Adam & Epel, 2007;Dagher, 2009). The \"hot\" cues, linking emotional response to the environment, may make it difficult to control inappropriate responses to and shift attention from an immediate temptation to long-term goals (e.g., weight loss or maintenance) (Lu, 2011). Simultaneous with the automatic emotional response, the \"cool\" nodes are activated, and in the case of food, a person's willpower is tested by their ability to resist the temptation for such food -a capacity largely dictated by cognitive resources to control the impulse to eat (Metcalfe & Mischel, 1999). When one is able to process a favorable or unfavorable outcome, it is thought that a \"hot spot\" is connected to a \"cool\" node, allowing for the emotional response to be activated with simultaneous exercise of willpower and goal-directed behavior (Heinberg, 2009). The NHANES-III data includes only measures of \"cool\" functioning, the purely cognitive process, captured by cognitive measures; while the \"hot\" measures of affect and motivation were not collected, and therefore not included in the current analyses.  -Kjennerud, 2003;Mond, Hay, Rodgers, & Owen, 2009). On the other end of the weight spectrum is obesity, a chief concern worldwide and in the United States (Ogden, Carroll, Curtin, Lamb, & Flegal, 2010). The prevalence of overweight and obesity among young people has increased three-fold since 1980 (Eaton et al., 2010), to an estimated 33% of children (Ogden, Carroll, Kit, & Flegal, 2012). The adverse health outcomes associated with childhood obesity are well documented and include Type II diabetes and psychosocial problems (Lawrence & Kopelman, 2004;Ludwig, 2007) as well as an increased risk of cardiovascular disease in adulthood (Baker, Olsen, & Sorensen, 2007). In addition to physical health problems, neurocognitive impairments have been identified in obese adults without previously documented neurological conditions (Gunstad et al., 2007;Gustafson, Lissner, Bengtsson, Björkelund, & Skoog, 2004;Taki et al., 2007;Waldstein & Katzel, 2005). Obesity has also been shown to have a negative impact on psychosocial functioning and mental health as it has been linked to depression, ED's, and poor quality of life in children (Hill, 2009;Walker & Hill, 2009). More recently, researchers have begun to investigate the effects of obesity on cognition in children, with disparate results, depending on the ages and assessment tools used (Boeka & Lokken, 2008;Cserjési, Luminet, Poncelet, & Lénárd, 2009;Dempsey & Dyehouse, 2008;Hölcke, Marcus, Gillberg, & Fernell, 2008;Miller et al., 2009); and will be discussed in further detail below."}, {"section_title": "Measuring Adiposity", "text": "A source of variance in the research has been the way in which obesity is measured. and obese weight cutoffs in the current study, see Cole (2000) in Table1. Similarly, cutpoints for underweight, or thinness, which correspond to adult BMI's <17 were developed (Cole, 2007)."}, {"section_title": "Cognition and Weight Status", "text": "One of the biggest threats to US children is a product they are exposed to every day and one needed for their very survival -food. With french-fried potatoes being among the top vegetable consumed by US children (Lorson, Melgar-Quinonez, & Taylor, 2009), it is no wonder that more and more children are being diagnosed with Type II Diabetes, coronary heart disease, high blood pressure, and other diseases associated with obesity, typically seen in adults over 40 years of age (Finer, 2006(Finer, , 2011Lawrence & Kopelman, 2004;Rocchini, 2011). In addition to these medical consequences, psychosocial consequences of pediatric obesity have also been widely researched. Specifically, overweight and obese children and adolescents report a lower quality of life and higher rates of depression and body dissatisfaction than their normal weight peers (Eddy, 2010;Ellen S, 2012;Kim, Oh, Yoon, Choi, & Choe, 2007;Wardle & Cooke, 2005). Children exhibiting these mental health concerns and medical comorbidities associated with increased adiposity, as well as those who are underweight, have also demonstrated various cognitive and academic deficits (Aronen, Vuontela, Steenari, Salmi, & Carlson, 2005;Andrés-Perpiña et al., 2011;Carter, Dubois, & Ramsay, 2010;Cawley & Spiess, 2008;(Andrés-Perpiña et al., 2011;Fagundo et al., 2012). From a neurodevelopmental perspective, research has shown a correlation between obesity and decreased cognitive functioning in adults (Boeka & Lokken, 2008;Corley, Gow, Starr, & Deary, 2010;Pistell et al., 2010;Smith, Hay, Campbell, & Trollor, 2011), in adolescents and children (Bruehl, 2011;Gunstad et al., 2008;Li et al., 2008;Ruiz et al., 2010;Yau et al., 2010); and in underweight children and adolescents (Alaimo, Olson, & Frongillo Jr., 2001;Andrés-Perpiña et al., 2011;Bosanac et al., 2007;Cusick & Georgieff, 2012;Fagundo et al., 2012;Pollitt, Lewis, Garza, & Shulman, 1982). While the exact mechanisms that underlie the relationship between cognition and weight status are presently unknown in children, evidence suggests impairment in regions of the prefrontal cortex affecting impulse control, planning, and cognitive flexibility in adolescents (Gunstad et al., 2008;Lam & Yang, 2007;Kristine Lee Lokken et al., 2009;Verdejo-Garcia et al., 2010). Researchers have included school-aged children in their study populations (Guxens et al., 2009;Hughes, 1998;Kuhl, Clifford, & Stark, 2012;Veldwijk et al., 2011), however, results have been varied; which were likely a function of cognitive measures used as well as the covariates included or excluded from analyses. The specifics of these dissimilarities are highlighted in the review of studies investigating the relationship between weight and cognition.  (Dempsey, Dyehouse, & Schafer, 2011;Gunstad et al., 2007;Smith, Hay, Campbell, & Trollor, 2011;Volkow et al., 2009). Despite the emphasis placed on early intervention for healthy lifestyles in hopes of decreasing negative outcomes, the research on whether and how an unhealthy weight and specific macronutrients affect cognitive development in younger children remains inconclusive and warrants further investigation. Review of the research conducted across age groups will illuminate the nature of the relationship between BMI and cognitive deficits from a developmental perspective and the cumulative effects of weight gain from biological and imaging perspectives."}, {"section_title": "Global Cognitive Deficits Adult Populations", "text": "It is well documented that particular medical comorbidities are associated with poor neurocognitive outcomes. Adults with conditions such as diabetes, hypertension, and sleep apnea have demonstrated deficits in a variety of cognitive domains such as processing speed, memory, and EF (Birns & Kalra, 2009;Manschot et al., 2006;Salorio, White, Piccirillo, Duntley, & Uhles, 2002). It has recently been found that these neurocognitive deficits in adults with obesity may exist independent of such medical conditions (Gunstad et al., 2007)."}, {"section_title": "Child Populations Underweight", "text": "Low weight in school-aged children and adolescents is attributable to many things including lack of access to healthy, safe food, which has an impact on many facets of a child's life such as social-emotional and cognitive development (Andrés-Perpiña et al., 2011). The majority of research on cognitive functioning in people with BMI's in the underweight range has been conducted on clinical samples of people with diagnosed ED's, specifically AN, and is scarce (Andrés-Perpiña et al., 2011;Bosanac et al., 1997;Lena, Fiocco, & Leyenaar, 2004). AN is a psychological disorder characterized by fear of weight gain and refusal to gain weight, despite having a body weight that is below the normal weight range (American Psychiatric Association, 2013). This pathological caloric restriction may be uniquely correlated to cognitive deficits not seen in the nonclinical population with BMI's also in the underweight range. The present study explored this relationship within the general population. Research investigating populations with diagnosed AN, bulimia nervosa, and normal controls have found cognitive deficits in the areas of visuospatial processing, attention, organization, and memory (Andrés-Perpiña et al., 2011;Bosanac et al., 2007). In participants with ED's , these cognitive deficits existed both before and after regaining weight (Bosanac et al., 2007;Bradley et al., 1997). Another, smaller, study reported slower processing speed in those with an ED compared to the control group, and no difference between the ED and control groups on general cognitive functioning, memory, visual perception, and short term memory; though the small sample size of 43 people makes comparison difficult (Andrés-Perpiña et al., 2011). Additionally, it was found that nearly 33% of their population demonstrated deficits with visual memory related to higher selfratings of anxiety, which were independent of ED status. It is unknown whether this discrepancy improves over time or with intervention for anxiety. A meta-analysis conducted by Lena and colleagues (2004), which reviewed the association between EDs and cognition in large studies, case studies, and imaging studies reported several deficits in the areas of visuospatial processing, organization, motor coordination, attention, and memory. While some of the cognitive deficits remained when the ED populations gained weight, verbal abilities and memory deficits remained, suggesting that these cognitive detriments may be independent of BMI status and lower cognitive performance may exist prior to the development of an ED. Several reproaches to methodology in the studies reviewed by Lena and colleagues (2004) were raised, such as the common exclusion of control populations without diagnosed EDs, and the often synonymous use of the term cognitive deficits with 'low IQ' when the domains and functions of cognition (e.g., memory, attention) were the topics of investigation. There is a dearth of prospective studies and those including younger populations. In a small group of female adolescents with AN, Bradley and colleagues (1997) reported slower processing speed which increased marginally with weight gain, but did not reach the higher scores reached by the normal-weight control group. Exploring possible associations between cognitive profiles in people at either extreme of the weight spectrum, recent findings suggest that both people with AN and those with BMI's in the obese range had more difficulty with decision making skills, and that performance between these groups was similar (Fagundo, Rodríguez, Forcano, Frühbeck, Gómez-Ambrosi, Tinahones, Fernández-Real, 2012). From a developmental perspective, it has been suggested that children with cognitive impairments such as decision-making and other executive dysfunctions, may be at an increased risk of developing anED. This has been suggested as they are less able to use metacognitive skills to plan for and adapt to situations that arise and change as they enter adolescence (Lena, Fiocco, & Leyenaar, 2004). Research with AN populations suggests a link between an underweight status and executive dysfunction. Further investigation into the relationship between cognitive functioning and underweight should be conducted, with nonclinical population in the underweight range."}, {"section_title": "Overweight", "text": "Rates of obesity in children are on the rise, and have well-documented comorbidities such as cardiovascular and metabolic diseases. In addition to these deficits, researchers have begun to document cognitive deficits related to weight disorder. Akin to the recognized correlation between bulimia nervosa and ADHD (Biederman, 2007), cognitive dysfunctions in obese child and adolescent populations have been noted primarily in the prefrontal cortex (Cosgrove, Arroyo, Warren, & Zhang, 2009;Li, Dai, Jackson, & Zhang, 2008;Maayan, Hoogendoorn, Sweat, & Convit, 2011;Verdejo-Garcia et al., 2010), although general cognitive dysfunction has also been reported (Miller et al., 2009). To date, such studies have been conducted with adults as well as school-aged children, but not with young children. The results have been varied in these older populations, and current accounts are imprecise about the age at which the possible link between obesity and neurodevelopmental problems can be identified. Analysis of the NHANES-III data allows for inclusion of children as young as six-years-old and include a wide age range allowing age comparisons to explore developmental trajectories of cognitive functions. A relationship between obesity and attention deficit hyperactivity disorder (ADHD) has been reported (Dempsey & Dyehouse, 2008;Lam & Yang, 2007), as well as visuospatial deficits in overweight children between the ages of 8-and 16-years-old (Li et al., 2008). It is also possible that the decrease in cognitive functioning may lead to an increase in obesity, rather than obesity causing lower cognitive functioning, (Chandola, Deary, Blane, & Batty, 2006), or the relationship may be bidirectional. A key study in supporting the significant contribution of environmental factors was conducted on a Dutch birth cohort, and showed no association between obesity and cognitive functioning in school-aged children; but did report high rates of absenteeism and bullying in children who were overweight (Veldwijk et al., 2011). Missing more days of school than their normal-weight peers, coupled with the negative effects of bullying may affect the amount of exposure children who are overweight have to instruction time and negatively influence their academic performance. In previous studies of children between 4-and 7-years-old, using population-based cohorts and controlling for the requite covariates of age, gender, and SES no relationship between cognition and weight status was reported (Gunstad et al., 2008;Guxens et al., 2009;Mond, Stich, Hay, Kraemer, & Baune, 2007;Veldwijk, Scholtens, Hornstra, & Bemelmans, 2011). The measures of cognitive function in these studies varied from a full cognitive battery (Guxens, 2009;Veldjwik, 2011) using the McCarthy Scales of Children's Abilities and the KABC, respectively, to estimates of intellectual functioning with measures of unknown validity (e.g., Spot-the-Word) (Gunstad, 2008). In contrast, other investigators have reported a significant association between being overweight and cognitive functioning (Heinonen et al., 2008;Li et al., 2008;Silva, Metha, & O'Callaghan, 2006). Heinonen 2008 which has a construct reliability of 0.89 (Silva, 2006), it was reported that height and weight had a minor effect on cognition compared to social factors. A significant relationship was found between having a high BMI at 10 years of age and lower cognitive functioning than normal-weight peers were. Both of these studies illustrate the negative effect obesity has on cognition in school-age children. Silva and colleagues ' (2008) data suggests that the effects of obesity on cognition are more significant with cumulative effects over time, as the poor cognitive performance was not evident at age five but was present at age ten. The adverse effects of obesity on cognition were apparent in children as young as 56 months, and in those who were overweight at birth and continued to have an elevated BMI through age four-anda-half. Moreover, the same cognitive effects were found in underweight children (Heinonen, 2008). The inconsistencies across these studies may be due to several factors including 1different developmental stages making comparison difficult, (2) variance in measures used, that some did not control for known covariates (e.g., maternal education and SES), 4exclusion of comorbidities, and 5 Analyzing data from the NHANES-III study, Li (2008) found that school-aged children who are extremely obese showed decreased cognitive functioning using a reliable and valid measure (WISC-R; Wechsler, 1974), controlling for several confounding factors. Children in their analyses included those between 8-and 16-years-old who completed the cognitive and academic assessments of the NHANES-III data collection. Excluded were those with health impairments and those who were missing confounding variable information (e.g., iron and lead blood-level tests) (n=300), no SES information (n=264), TV viewing (n=22), and physical activity (n=129), resulting in a final sample size of 2,519 children. Using the same data as Li and colleagues' (2008), the present study hypothesized that children aged 6 to 16 years who are obese would perform worse than their normal weight peers on a measure of visuospatial organization would, but that poor reading and math performance would not be significant when SES and maternal education were controlled. The current study expanded the lower-range of the target population to six years of age, and included macronutrient intake variables. These analyses targeted development through investigation of cognitive performance across a large age-range and used a weight status criterion that adjusted for age (Cole et al., 2000)."}, {"section_title": "Executive Function Deficits", "text": "Several studies reporting decreased EF in overweight children (Azurmendi et al., 2005;Guxens et al., 2009;Lokken et al., 2009), encompassing preschool-aged children (Azurmendi et al., 2005;Guxens et al., 2009) and adolescents (Azurmendi et al., 2005), looking at the effects of obesity over several years. These studies did not adjust their analyses to incorporate confounding variables previously shown to influence the relationship between weight and cognitive functioning. One such study used highly selective exclusion procedures excluding anyone with underlying medical conditions, with nearly 500 children ages 6 to 19 assessed on the parameters of attention, working memory, set-shifting, and motor speed (Gunstad et al., 2008). The study found no differences in EF between obese and healthy children or adolescents. The reason these findings are inconsistent with other investigations may be due to the exclusion of ADHD in the Gunstad (2008) sample, reflecting the possibility that comorbidities could lead to obesity or that children with comorbid EF deficits are more likely to become obese. Imaging studies using MRI have demonstrated white matter volume reduction in the frontal lobe in adolescents who are obese and have Type II diabetes (Yau et al., 2010), as well as decreased volume in the orbitofrontal cortex (Maayan et al., 2011). These studies suggest that changes in vascular structure and fat metabolism are linked to increased disinhibition as measured through questionnaires, when controlling for IQ. In the latter case, it is important to note that effects of confounding variables were not analyzed and it is unknown whether results are better explained by such factors as SES and other environmental influences. Each of these studies used relatively small sample sizes, illustrating the need for assessment of a large sample and the ability to control for confounding factors and associations with academic performance and nutritional intake. Specifically, these studies had small sample sizes, did not consider maternal education, and one used cognitive subscale measures with low reliability (Veldwijk et al., 2011). Using the NHANES-III dataset, the current study had adequate power to adjust for several environmental variables such as SES and the macronutrients of total calories, protein, carbohydrates, fat, and fiber consumed. The current study's large number of participants in each of the weight class categories allowed for ample sample size at the extreme ends of the weight categories -a difference between researchers who reported negative correlation between cognitive function and weight status in children, and those who did not."}, {"section_title": "Genetic and Other Risk Factors", "text": "Supporting the argument that early-onset obesity can negatively affect the developing brain, research comparing Prader-Willi syndrome (PWS), a genetic disorder with associated developmental delay and learning disorders and early-onset childhood obesity (Goldstone, 2004), has found that early intervention for weight control can manifest stability, as opposed to a decline, in IQ (Crnic, Sulzbacher, Snow, & Holm, 1980). The cerebral and cerebellar volume of an age-matched cohort of children with PWS, those with early-onset morbid obesity (EMO), and their respective siblings, ages 4 to 24, were assessed for compromised development as part of a larger study by Miller and colleagues (2009). They reported that the PWS and EMO groups had smaller cerebellar volumes than the group of control siblings. In addition, the children with PWS had lower cognitive functioning scores compared to the control and EMO groups, respectively [general intellectual ability (GIA): PWS=65 ± 25; EMO=81 ± 19; Controls=112 ± 13 (p < .0001 controls vs. PWS and controls vs. EMO]. While both clinical groups had smaller cerebellar volumes relative to their normal weight siblings, a single genetic factor for the underlying cognitive deficits was touted as unlikely by the researchers. These findings support the argument that the negative relationship between cognitive functioning and being at risk for overweight or obese may start as early as preschool. Research to date has yielded a variety of results on the relationship between cognitive functioning and weight status. The majority of studies were conducted on small sample sizes, which did not allow for inclusion of many covariates known to affect the relationship (e.g., maternal education and socioeconomic status) (Gunstad et al., 2008;Miller et al., 2009). In addition, the majority of work has been concentrated on adult and adolescent populations with fewer studies investigating the association between cognition and weight in school-aged children. The present study addressed each of these factors using the NHANES-III a large, population-based dataset using children as young as six-years-old through age 16. Cognition, Academic Achievement, and Nutrition The role of environment, lifestyle choices, and behaviors in cognitive functioning begins with the fundamental component of nutrient intake, the effects of which begins during gestation and continues across the lifespan (Freeman, Klein, Kagan, & Yarbrough, 1977;Kretchmer, Beard, & Carlson, 1996). Early research in this field was conducted in rural Guatemala and reported a positive correlation between mothers who took a protein supplement prenatally and while breastfeeding and assessed children's language and memory at ages three-and four-years-old (Freeman, Klein, Kagan, & Yarbrough, 1977). Using the NHANES-III data, Alaimo and colleagues (2001) reported decreased math performance and increased rates of repeating a grade in elementary school-aged children who reported not getting enough food due to lack of resources, including money. Also using NHANES-III data, Zhang, Herbert, and Muldoon (2005), looked at the relationship between intake of the macronutrient fat, cognitive functioning, academic performance, and psychosocial development. They reported associations between high fat intake and low digit-span score and high fat and poor reading skills. The current study used the same sample looking at the role of all macronutrients in the relationship between weight status, nutrition, cognition, academics, and socioeconomic factors."}, {"section_title": "Cognition, Academic Achievement, and Weight Status", "text": "The picture of short-and long-term negative outcomes for underweight and overweight children in terms of physical, cognitive, and academic functioning has begun to take shape. An aspect that is not consistently considered is the ecological context of a child, and their functioning in the place in which they spend much of their day and prepares them for adulthood, the school. As was described in sections above, the cognitive tasks of setshifting, inhibition, and working memory defining the general EF in young children are influenced by, and themselves influence, many aspects of a child's environment -from how much they eat to their school performance (Bernier, Carlson, Deschenes, Matte-Gagne, 2012;Dagher, 2009;Lewis & Carpendale, 2009;Lu, 2011). As these functions develop throughout childhood and adolescence, we can examine their relationship to academic performance. Beginning in preschool around age four, environmental assessments of EF using questionnaires have shown negative associations between set-shifting and inhibition with math performance (Clark, Pritchard, & Woodward, 2010), and have also found that math performance and EF skills are positively correlated (Bull & Scerif, 2001;Bull, Espy, & Wiebe, 2008;Bull, Espy, Wiebe, Sheffield, & Nelson, 2011). Closer examination of cognitive correlates in five-and six-year-olds suggests that working memory has been associated with math performance, while inhibition and cognitive flexibility were unassociated with academic performance, particularly when family and social-emotional factors were controlled for (Monette, Bigras, & Guay, 2011). These studies illustrate the developmental differentiation of the self-regulation components of cognition (Calkins, & Marcovitch, 2010) that emerge in late-childhood and early adolescence, and their role in children's math and reading abilities. The current study looked at math, reading, working memory, and visuospatial organization/planning in children and adolescents. In addition, socioeconomic status a factor known to influence school achievement was controlled for using a nationally representative sample. Considering the interrelatedness of cognition, social development, physical and mental health, and nutritional needs (Cornette, 2008;Gunstad et al., 2008;Guxens et al., 2009;Veldwijk et al., 2011), it is not surprising that underweight and obesity has also been associated with poor academic performance. In 2005, Taras and Potts-Datema conducted a meta-analysis reviewing investigations on the interaction between academic achievement, cognitive ability, school attendance, and weight status. While they did not report any findings of causation, associations were found between obesity and school absenteeism. In terms of academic performance, children between 6 to 8 years of age who were overweight performed well in math, but those described as being overweight in preschool, and had subsequently lost the weight, had improved performance in math (Datar, Sturm, & Magnabosco, 2004). In a national study of US children, controlling for maternal education, SES, and race/ethnicity it was found that BMI did not significantly correlate with math or reading performance in children 8-to 16-years-old (Li et al., 2008). In another sample of 3,500 school-aged children, high levels of cholesterol and saturated fat were associated with lower working memory and reading abilities, respectively (Zhang, Hebert, & Muldoon, 2005 (Lezak, Howieson, Loring, 2004;Sattler, 1988;Wallesch, Curio, Galazky, Jost, & Synowitz, 2001). The Digit Span task requires the child to repeat a sequence of numbers spoken by an examiner, first forward and then backward. The forward exercise is generally thought to measure phonological storage capacity, while the backward portion assesses working memory (Bull et al., 2008 (Rosenthal, Riccio, Gsanger, & Jarratt, 2006), as well as overgeneralizing it for a child's profile analysis (Sattler, 1988). These WISC-R subscales have excellent reliability, internal consistency, criterion, and construct validity based on many studies (Sattler, 1988;Sattler, 1992). The WISC-R scaled scores in the NHANES-III database were standardized on age-based norms with a mean of 10 and standard deviation of three, following WISC-R norms (Sattler, 1988 (Jastak & Wilkinson, 1984;Prewett & Fowler, 1992). Arithmetic involves oral and written math problems ranging from simple addition and subtraction to calculus, and Reading assesses word-recognition and wordreading skills. Both of these subtests have good reliability and validity (Jastak & Wilkinson, 1984 and sex-based cutoffs were used to determine weight class assignment in the current study (Cole et al., 2000), see and SES. As nearly 25% of the data were missing on the level of caregiver education, a known confounder for both cognitive functioning and nutritional intake, and the variable was substantially associated with the reported poverty index, the poverty index was used as a proxy for SES. The poverty index ratio (PIR) was computed within the NHANES-III database using the reported total family income for the previous 12 months and categorized as: low (PIR < 1.30, the federal cutoff point for eligibility for the Food Stamp Program), middle (1.30 < PIR< 3.00) and high income (CDC, 1994). It was then coded as Below Poverty Level (1-0.999) or Above Poverty Level (1.00+) -the variable used in the present study. The amount of TV watched and physical activity were excluded as covariates, as they are in the causal pathway (see Discussion for further detail)."}, {"section_title": "Data Preparation Statistical Analysis", "text": "Data were analyzed using SAS software (version 9.  Descriptive statistics are presented in Table 3. Cognitive and academic variables were analyzed as continuous variables. A detailed description of the database creation and preparation process using the selected variables from NHANES-III is outlined in Appendix II."}, {"section_title": "Summary", "text": "Despite the current emphasis being placed on health and nutrition in children and adolescents, there is a surprising dearth of population-based studies exploring children's cognitive and academic performance in relation to their weight status, while controlling for the covariates often associated with deficits in these areas. The present study explored the relationship between a child's weight status, cognitive functioning, academic performance, and select macronutrient intake. It adds to the current debate on the relationship between these variables, extending the research by Li, Dai, Jackson, and Zhang (2008), which reported lower visuospatial skills in overweight and obese children, by expanding the lower age range to 6 years, and include children with ADHD, using the NHANES-III data. In addition to the cognitive and academic variables being explored, this study also evaluated the association of the amount of total calories, protein, carbohydrates, fat, and fiber consumed, cognitive functioning, and academic performance in underweight, normal weight, overweight, and obese school-aged children. Using a population-based sample with the NHANES-III data allowed for inclusion of several environmental and behavioral confounding factors that are often omitted from studies examining the association between overweight and cognitive ability in children."}, {"section_title": "CHAPTER 4", "text": ""}, {"section_title": "Results", "text": ""}, {"section_title": "Description of the Sample", "text": "The mean age of the overall sample (n=5683) was 10.56 years (+/-3.12) combining three age groups (n=1690/6-8-year-olds; n=2235/9-12-year-olds; n=1758/13-16-year-olds) ( Table 3).  (Cohen, 1988). Significant differences in performance were found between all four weight categories at each age group of 6-8 years, 9-12 years, and 13-16 years. Cognitive scores were significantly lower for both sexes in the underweight category, and for males who had BMI's in the obese range. Specific results of the contrasts and estimates are presented in Tables 4, 5, and 6, Figures 2 and 3, and described below."}, {"section_title": "Block Design", "text": "Simple effects contrast analyses (Table 5) revealed that, within the 6-8 year age range, females in the underweight category performed significantly better than females in the overweight range t (3754) = -3.38, p = .0007, and females in the obese range t (3754) = -3.28, p = .0011. For the 9-12-year-old group, the performance of males in the 9-12-year-old age group did not differ across the underweight, normal weight, overweight and obese weight categories. For the 13-to 16-year -old age group there were two patterns of results. In one pattern, Block Design performance was in the average range for females in the underweight and normal weight categories, and males in the normal weight and overweight categories. In the second pattern, low average Block Design performance was found for females in the overweight and obese categories and males in the underweight and obese ranges. Within gender, males in the normal weight and overweight categories performed significantly better than males in the obese weight range [t (3754) = 3.50, p = .0005; t (3754) = -3.30, p = .001, respectively]. Males in the overweight range had better Block Design scores than their male peers in the underweight BMI range t (3754) = 3.16, p = .002. These results reveal that males in the normal weight and overweight BMI ranges performed better than 13-16-year-old males who were in the underweight and obese categories."}, {"section_title": "Digit Span", "text": "A 3-way analysis of variance was also used to assess whether children in each of the eight weight-gender categories varied in Digit Span performance across age groups. Simple effect contrasts (Table 6, Figure 3) revealed that Digit Span scores for males between the ages of 6 and 8 years in the overweight BMI range had significantly lower Digit Span scores than males with normal weight t (3754) = 4.12, p < 0.0001 and obese weight categories t (3754) = 2.10, p = .036). Simple effects at ages 9-12 between the weight categories for both sexes were not significant, indicating that males and females in the 9-to 12-year-old age group had similar Digit Span performance across BMI ranges. In sum, Digit Span performance was lower for adolescent males in the overweight range compared to those in the normal and obese ranges. was considered a statistically significant difference and effect sizes were derived to indicate the size of differences between groups (Cohen, 1988). There were significant differences in reading performance among weight-gender categories at ages 9-12. for females in the underweight range, there were no significant differences in reading performance across age ranges. Though reading and math performance are reflections of social, economic, and cultural knowledge and are strongly influenced by SES, significant differences were found, even after controlling for these factors. Specific results of the contrasts and estimates for reading and math performance are presented in Tables 8-11and Figures 4 "}, {"section_title": "Reading Performance", "text": "Simple effects contrasts (Table 9, Figure 4) revealed that, for children ages 6 to 8 years, the reading performance of males in the underweight range was significantly better than their male peers who had BMI's in the obese range t (3754) = -2.01, p = 0.04. For children ages 9-12, females whose weight was within the normal range had significantly higher reading scores than females in the underweight range (t (3754) = 2.07, p = 0.04. Adolescent females in the 13-16 year age group, with BMI's in the normal weight range had significantly higher reading scores than their same-aged peers who had BMI's in the obese range t (3754) = 1.98, p = 0.05. Simple effects for other contrasts were not significant; indicated that reading scores were not significantly different for males and females in the normal weight range and for males in the overweight range."}, {"section_title": "Math Performance", "text": "Following significant interaction effects, an analysis of simple effects (Table 11, Figure 5) indicated that 6-to 8-year-old males in the underweight category performed significantly better in math than their male peers in the obese weight range t (3754) = -2.25, p = 0.02. Males ages 13-16 years with BMI's in the normal range had better math performance than males of the same age who had BMI's in the obese range t (3754) = 1.99, p = 0.05. Overall, significant differences in academic performance were found with reading scores higher in the adolescent age group compared to younger gender/age groups. Conversely, adolescent males who had BMI's in the underweight and obese ranges performed more poorly on math than those in the younger age groups."}, {"section_title": "Question 2a. What is the nature of the relationship between cognitive functioning and dietary macronutrient intake; and does this vary as a function of age or gender?", "text": "This question was addressed by correlating BMI, measures of cognitive function, and the macronutrient measures of total calories, total protein, total carbohydrates, fiber, and intake. Table 12 provides mean intake by weight category for key macronutrients. Based on self-reported measures of food intake, children in the overweight and obese BMI categories not meeting the recommended daily allowances (RDA), reported intake of fewer kilocalories (total calories) than children in the normal BMI range; however their difference was not significant. All groups reported adequate intake of all macronutrients except fiber. However, all four weight groups failed to meet the RDA cutoffs for fiber: 25g/day for 6-to 8-year-olds, 26g/day for 9-to 13-year-old females, 31 g/day for 9-to 13-year-old males, and 29 and 38 g/day for 14-to-16-year old females and males, respectively. School-aged children in the underweight category reported lower intake of total calories and protein than all other weight categories. Children in the normal weight category reported the highest intake levels of all macronutrients. Correlational analysis was used to examine the association between cognitive functioning and macronutrients among children who were below Recommended Daily Allowances (RDAs) within each weight class. Overall, results indicated that children who were above the RDA or AMDR cutoffs did better on both cognitive tasks; and those who were below had lower cognitive performance. Specifically, results found a positive relationship was found between children's consumption of recommended amounts of total caloric intake and performance on Block Design (Table 13) (Table 14) and children in the normal weight range who consumed fewer calories from fat than is recommended r = 0.13, p< 0.05; as well as for children in the overweight range who consumed a higher-than-recommended percentage of calories from fat r = 0.11, p< 0.05. These effect sizes suggest that, in general, children perform better on cognitive tasks the closer they are to the lower cutoff for the recommended daily allowance of any one macronutrient. In summary, children who were below the RDA's performed more poorly than those meeting the cutoff. A significant association was found between not consuming the recommended amount of calories and poorer Block Design score in children in the underweight, overweight and obese weight ranges."}, {"section_title": "Question 2b. What is the nature of the relationship between academic performance and dietary macronutrient intake; and does this vary as a function of age or gender?", "text": "This question was addressed by correlating BMI, measures of academic performance and the macronutrient measures of total calories, total protein, total carbohydrates, and fiber intake. Correlations were used to examine the association between academic performance and macronutrients among children who were below Recommended Daily Allowances  (Table 16). As with cognitive functioning, these effect sizes indicate that, in general, children perform better on academic tasks when they are consuming the recommended daily allowance of macronutrients. Overall, higher Reading scores were associated with children in the underweight and overweight groups who consumed the recommended amounts of total calories, in the overweight group who consumed the recommended amount of fat, and for children in the normal weight group who consumed the recommended amount of fiber. Higher math performance was found in children in the overweight category who consumed fewer than the RDA of total calories and fiber, and for those in the normal weight and obese ranges who met the RDA cut off for fiber. This combination of variables also significantly predicted Digit Span performance. The adjusted R squared value was 0.07. This indicates that 7% of the variance in Digit Span performance was explained by the model. According to Cohen (1988), this is a medium effect. The B weights, presented in Table 18, suggest that being White contributes most to predicting Block Design performance; and that being male, younger, overweight, and above the poverty line also contribute to this prediction. Question 3b. What is the predictive relationship of weight status, macronutrient intake, and socioeconomic variables on Reading and Math performance? Multiple regression was conducted to determine the best linear combination of gender, BMI category, age, race/ethnicity, SES, and macronutrient intake for predicting reading performance. This combination of variables significantly predicted reading performance. The adjusted R squared value was 0.14. This indicates that 14% of the variance in reading performance was explained by the model. According to Cohen (1988), this is a large effect. The B weights, presented in Table 17, suggest that being above the poverty line contributes most to predicting reading performance; and that being male, older, white, and consuming a high amounts of carbohydrates also contribute to this prediction. This combination of variables also significantly predicted math performance. The adjusted R squared value was 0.11. This indicates that 11% of the variance in math performance was explained by the model. According to Cohen (1988), this is a medium to large effect. The B weights, presented in Table 17, suggest that, as with reading, being above the poverty line contributes most to predicting math performance; and that being male, white, and consuming a high amounts of carbohydrates also contribute to this prediction."}, {"section_title": "CHAPTER 5", "text": ""}, {"section_title": "Discussion", "text": ""}, {"section_title": "Findings", "text": "The first question in this study examined whether children who are overweight or obese are characterized by lower cognitive and academic performance, and the role that age and gender played in that relationship. Results indicated that children at the extreme ends of the weight spectrum performed more poorly than their normal weight peers on tests of cognition and academics. Different profiles in academic cognitive and academic performance were found between the weight class/gender groups: older children in the underweight and obese weight categories demonstrated lower visuospatial organization/planning (Block Design) and working memory (Digit Span) scores compared to children in the younger age groups. These findings were robust when controlling for race/ethnicity and SES. Specifically, males in the 13-16-year-old age group with BMI's in the underweight and obese ranges had lower Block Design scores than their normal weight peers. Lower Digit Span scores were found for 6-8-year-old males in the overweight group compared to their normal weight peers, and for 13-16-year-old males in the obese weight group. Overweight females in the 9-12-year-old age group had significantly lower Digit Span scores compared to their normal weight peers. These findings were consistent with previous studies of children with BMI's in the obese range, which have reported reduced visuospatial performance and lower general cognitive scores compared to their peers in the normal weight range (Heinonen, 2008;Li, 2008). In contrast to results reported by Li and colleagues (2008), deficits were found in working memory skills of obese adolescent boys, ages 13-16, compared to their male peers in the normal and overweight groups. The difference in findings may be due to Li's (2008) analyses of a single age range, rather than the analysis of three separate age groups. It is interesting that generally higher reading scores were found for 13-16 year-olds compared to the children in the 6-8-year-old group, across BMI and gender groups. Despite generally higher reading scores among older children, significant differences were found on the reading task between adolescent males and females in the obese weight group and their same-age female peers in the normal weight group. The lower academic functioning seen in children with BMI's in the obese range is similar to that reported in other studies (Datar, 2006;Hollar, 2010;Kamijo, 2010). These results held true only for those children in the upper extreme of the BMI spectrum. Math performance was found to be lower for boys in the underweight category in the adolescent group compared to that of children ages 6-8. This is similar to Silva's (2008) findings that the negative effects of being at the higher end of the weight continuum may be cumulative and not readily apparent until the upper childhood and adolescent years. The current study found lower reading scores for adolescent boys in the underweight and obese categories compared to middle-childhood peers. However, the relationship between academic performance and weight status is very complex and may not be as obvious or simple as this. It may be that being at either extreme of the weight spectrum has a negative effect on many facets of children's health, such as self-esteem and unhappiness (Andrés-Perpiña et al., 2011;Wendt, 2009). These negative psychological factors can negatively affect academic performance. These mental health issues are often not collected outside of clinical settings, and were not included in the current study, but have been shown to play a role in the psychological makeup, cognitive functioning, and academic performance of such individuals."}, {"section_title": "Mean Macronutrient Intake Values", "text": "The second question was investigated the nature of the relationship between cognitive functioning and macronutrients, and the role of age and gender. It was found that children of all ages and weight categories reported adequate intake of all macronutrients, with the exception of fiber. Intake was within the acceptable range, but differed across weight groups. It was notable that children in the obese and overweight weight classes reported slightly lower levels of total caloric consumption than their normal weight peers. Children in the underweight category reported lower intake values than children in the other three weight categories. As reported by Skinner and colleagues (2012) using data from a later iteration of NHANES (2001NHANES ( -2008, differences were found in reported nutrient intake dependent on age. The current study examined macronutrient intake by BMI status, but did not parse out nutritional intake by age, a direction for future research. Skinner (2012) found that lower intake was reported in older children and adolescents who were overweight and obese. Specifically, females 7 and older, and males older than 10, in the obese weight category reported consuming fewer daily calories than their normal weight peers. This pattern of lower nutritional intake for children in the overweight and obese BMI categories compared to normal weight peers may be more frequent than commonly known. Skinner's (2012) discussion of explanations for these nutritional differences across weight status and age has implications for early identification and intervention focusing on the cognitive functioning and academic performance of older children and adolescents. Skinner 2012proposed three possible reasons for increasing BMI's in conjunction with lower nutritional intake in children as they age: (1) higher caloric consumption at a younger age leading to increased BMI; (2) which, once reached and coupled with decreased physical activity, does not require a high level of caloric intake to maintain an overweight or obese weight status; and/or (3) social desirability response bias. These reasons are not mutually exclusive and may apply to the current study. While nutritional intake was not analyzed by age in the current study, results indicated lower visuospatial organization/planning (Block Design) performance in overweight and obese adolescent females, and underweight and obese males. Lower working memory performance was also found for obese males and overweight females, compared to younger children in the same weight categories. As these effects were also seen in males who were underweight, the association may be more related to nutritional intake, rather than reflecting a hypothesis of decreased physical activity or TV viewing habits (Skinner et al., 2012). It is also possible that social desirability played a role in the reported macronutrient intake of children. While the assumption of social desirability cannot be verified in the current study, it should be considered as a possibility. Data from the current study demonstrate that children who met the RDA and AMDR cut-offs did better on cognitive and academic tasks. This is consistent with other studies of nutritional practices in the general population, which have reported better memory with higher protein consumption (Freeman, 1977), decreased visual perception, attention, and short-term memory with temporary restriction of nutritional intake (Pollitt, 1982), and decreased math scores in children who reported not having consistent access to food (Alaimo, 2001). The current study found that visuospatial organization and planning was better in children with BMI's in the underweight, overweight, and obese weight ranges who met the cutoffs, but that not meeting the recommended allowances did not adversely affect children in the normal weight category (Table 13). With the largest proportion of children in the current sample being in the normal weight category, this difference may not reflect the effects of nutritional intake on cognitive and academic performance. Higher working memory scores were found in children of normal weight who consumed lower than the recommended percentage of calories from fat, while those in the overweight range who consumed higher than the recommended level of calories from fat had higher block design scores than underweight and obese children (Table 14). Previous research using the NHANES-III data has reported an association between better working memory performance and increased consumption of polyunsaturated fatty acids, but found no association between the total fat, measured as a macronutrient, and cognitive functioning or academic performance (Zhang, 2005). These findings may suggest that there is a difference in the type of fats being consumed by children in each of the weight categories; however, the current study looked only at the macronutrient total fat, and not the various types of fats in children's diet. It may also be that these findings are attributable to the self-report nature and/or the socially desirable responses of the dietary intake values, rather than the amount of the nutrient consumed. Better reading scores were associated with children who were: (1) underweight or overweight and consuming the recommended amount of total calories, (2) normal weight and consuming recommended amounts of fiber, and (3) overweight and consuming a higher percentage of their calories from fat than is recommended. While drawing conclusions about academic performance and reported amounts of each macronutrient may be flawed for the reasons discussed above, there may be differences in these relationships if parsed by age, as discussed in Skinner's (2012) results. It may also be that consuming enough calories and fat, particularly fatty acids, which have been shown to facilitate growth and function of the nervous system (Innis, 2007), is the key to cognitive and academic performance, rather than any one of the macronutrients themselves. Research suggests that fatty acids affect not only the developing brain (Innis, 2007), but play a role in attention in young children (Sinn & Bryan, 2007) and working memory in adolescents and adults (Stonehouse, Conlon, Podd, Hill, Minihane, Haskell, & Kennedy, 2013). The third question addressed the predictive nature of the relationship between macronutrient intake, weight status, age, gender, SES, and cognitive and academic performance. In all four models, demographic and SES variables were the strongest predictors of cognitive and academic functioning. In terms of the macronutrient variables, higher total caloric intake significantly contributed only to Block Design performance; while higher intake of carbohydrates was predictive of reading and math scores. Although the current study posited that higher nutritional intake in overweight and obese children would contribute to lower cognitive functioning, it may be that the cumulative effects of being over-or under-weight contribute more to lower cognitive and academic scores, as children get older (Skinner, 2012). Assuming that a pattern of similar caloric intake in children who are overweight and obese to those of normal weight is true, we may look closer at the predictive relationship of weight status, macronutrient intake, and demographic and socioeconomic variables on cognitive functioning. The macronutrient variables, which were assumed to mediate the relationship between weight status and cognitive functioning, were not significant predictors of cognitive functioning. This may be due to the self-report of nutrients, which was largest among children in the normal weight category, a finding that does not follow common beliefs that overweight and obese children consume more calories than their peers do of normal weight. Adolescent females in the overweight and obese weight categories and adolescent males in the underweight and obese weight categories demonstrated lower Block Design scores, compared to their normal weight peers and children in younger age groups. Both underweight and overweight children may have more difficulty with planning, showing a similar level of impairment. According to the \"hot\" theory of EF (Metcalfe, 1999), the extreme eating behaviors of these children may reflect a dearth of cognitive resources to stop the \"hot\", emotional response to food. If the appetitive reward system were functioning properly, the emotional responses to food would be tempered by the \"cool, thought-based processing (Metcalfe, 1999). However, this process also appears to be functioning differently in children at either extreme of the weight spectrum. Specifically, working memory scores were lower in adolescent males compared to their normal-and over-weight peers of both genders. Working memory scores were also lower for adolescent males than for children in the 6-8-year-old age group. With these deficits, these adolescents may not employ the \"cool\" executive processes to reach the reach the goal of moderate food intake, resulting in under-or over-consumption of food compared to healthy weight children. This difficulty regulating their reward system may translate into difficulties of everyday planning at home and school. In fact, it was found that adolescent females with BMI's in the normal range had better reading scores than their female peers in the obese range. Similarly, math performance was better for adolescent females and males in the normal weight range compared to same-age males with BMI's in the obese range. These results remained robust after controlling for SES. It is unknown whether the children in the overweight range also had increased school absences, or if the girls were experiencing depressive or other socialbehavioral symptoms that have been reported previously (Datar & Sturm, 2006). If obese males are, indeed, eating less than their normal weight peers, it may be that, as Skinner (2012) postulated, the energy balance which leads to under-or over-weight status gets disrupted early. From a clinical perspective, intervening with healthy eating habits at an early age for all children may help the negative metabolic-cognitive-academic outcomes that have been shown in this and previous studies (Alaimo et al., 2001;Andrés-Perpiña et al., 2011;Datar, Sturm, & Magnabosco, 2004;Heinonen et al., 2008;Li et al., 2008)."}, {"section_title": "Limitations", "text": "The most significant limitation to the proposed study is the cross-sectional nature of the NHANES-III data, which does not allow conclusions to be drawn on the directionality of the relationships studied. Another limitation of this study design is the lack of availability of the independent variables of nutritional intake and self-reports on the 24-hour dietary recall. The large sample size, however, allowed for detection of associations between differences in weight and cognitive, academic, and selected nutritional variables. In addition, though several confounding variables were included, there is a possibility of residual confoundingor covariate imbalance. Specifically, genetic factors have been shown to contribute between 16% and 84% of variance in cognitive functioning scores (Carlier & Roubertoux, 2010), but no genetic measures were included in the current study. In an earlier analysis of NHANES-III data used in this study, Li (2008) reported nonsignificant findings related to academic functioning when SES was controlled. The differences found in the current study may be attributable to the inclusion of children in the analyses who were underweight (n=485), had unclassified health-related impairment, were in the neonatal intensive care unit for more than two weeks (n=44), who were receiving special education, or had a learning disability and/or health-related disability (n=41). In addition, Li (2008) included the intervening variables of physical activity and hours spent watching TV. In this case, it is important to distinguish between confounding variables which are correlated to the independent variables but are not the focus of the study, and intervening variables which are on the causal pathway between a risk factor (e.g., obesity) and an outcomes (e.g., cognitive functioning and academic performance). The association between cognitive functioning and academic performance with physical activity has been studied extensively, demonstrating that children who engage in physical activity or demonstrate a moderate level of physical fitness (e.g., muscle strength, flexibility, and average BMI) perform better on standardized achievement tests (Carlson, 2008;Grissom, 2005). More specifically, it was found that cardiovascular fitness was significantly associated with academic achievement in children in the 3 rd -9 th grades (roughly ages 10-15). Such research suggests a positive effect of physical activity on cognitive functioning and academic performance. Research has illustrated the negative association between reduced physical activity and hours spent watching TV and poor cognitive functioning and academic performance (Bass, Brown, Laurson, & Coleman, 2013;Chomitz, Slining, Mcgowan, et al., 2009;Wittberg, Northrup, & Cottrel, 2009). If intervening variables of physical activity and TV viewing habits are adjusted for in analyses of the relationship of weight status, cognitive functioning, and academic performance it may, erroneously, appear that weight status has no effect (Katz, 2011;Schisterman, Cole, Platt, 2009). In doing this, there would be overadjustment for the intermediate variables that are on the causal pathway between weight status and cognitive functioning. Adjusting for these variables may not be valid, as weight status is likely related to cognitive functioning and academic performance, but the effect may be moderated by physical activity and hours spent watching TV. Results of the present study demonstrated a significant association between cognitive functioning, academic performance, and weight status. The current study used RDAs and AMDRs as cutoffs for acceptable macronutrient intake, which is a more stringent limit than the Estimated Average Requirement (EAR), and may not have captured the nuanced differences of food intake among and between the BMI categories. This is particularly true for analyses of population-based studies in which highrisk populations are assumed not to be overrepresented, and need for conservative inclusion criteria are not as necessary. While the current study illustrated differences in the dietary intake between children in the various weight classes, there were limitations inherent in the collection of this information that must also be acknowledged. Using a 24-hour dietary recall has been shown to be a satisfactory method for estimating mean nutrient and food intake in large groups, particularly at the population level (Conway, Ingwersen, Vinyard, Moshfegh, 2003;Moshfegh, et al., 2008). The present research with NHANES-III was based on one, rather than multiple recalls -which is preferable to capture the intake of very high or low quantities of nutrients (Willett, 2013). Though the quantities reported were not extreme values, there is concern regarding possible reporting bias for children in the obese and overweight BMI ranges. Previous research shows that differences in reported mean intake using 24-hour dietary recall and observed intake does, in fact, differ by weight class. Specifically, those under-consuming nutrients have reported overestimates of nutritional intake, and those over-consumed have reported consumption of fewer nutrients than was true (Faggiano, Vineis, Cravanzola, Pisani, Xompero, Riboli, & Kaaks, 1992;Rothausen, Matthiessen, Groth, Brockhoff, Andersen, & Trolle, 2012). The reliance on BMI as the sole measure of weight status poses a constraint, as the use of other anthropometric measures (e.g., hip-to-waist ratio, body composition) have been correlated with differing levels of cognitive functioning (Jeong, Nam, Son, Son, & Cho, 2005)."}, {"section_title": "Future Directions", "text": "The present study found differences in cognitive functioning and academic skill profiles in children at both extremes of the BMI range, when stratified by age. Further exploration of differences as children age should be undertaken to determine the causal link in the relationship between nutritional intake, weight, cognitive functioning, and academic performance. Such research should move beyond the cross-sectional design, to assess the role of weight status on cognitive functioning and academic performance more accurately. Particular attention should be paid to the underweight population using non-clinical samples, as young children of both genders in the underweight category had significantly lower visuospatial organization/planning scores than those in other weight groups. Reading scores were also found to be lower for younger males in the underweight category than for those who were adolescents. In addition, further analyses of the nutritional profile of children in each of the weight groups should be carried out using a variety of nutritional assessment methods including multiple 24-hr dietary recalls or food records in conjunction with nutritional biomarkers which will give information on how much of a given nutrient is in a child's system (Willett, 2013)."}, {"section_title": "Conclusion", "text": "This study demonstrated that the relationship between weight status and cognitive and academic functioning varied by age and gender. Specifically it was found that adolescents, ages 13-16 years with BMI's in the underweight and obese weight groups had poorer visuospatial planning and working memory abilities than their normal weight or overweight peers. Children with reported macronutrient intake above the recommended amounts performed better on cognitive and academic tasks, which is consistent with findings from previous research. The finding of lower nutritional intake by children in the overweight and obese categories compared to the other weight categories, warrants further investigation into underlying factors related to overweight or obese status with proportionally lower energy intake than that of peers of normal weight. The poorer performance of older overweight age groups holds implications for early childhood intervention to prevent childhood overweight and obesity, with a focus on proper nutritional intake, not just restriction of nutrition. Table   1.   NHANES III, the Third National Health and Nutrition Examination Survey. a A poverty index ratio was calculated by comparing the midpoint for the family income category and the family size with the federal poverty line. A poverty index ratio <1, was classified as below poverty.                   "}, {"section_title": "Comparison", "text": ""}]