[{"section_title": "Abstract", "text": "The International Association for the study of Obesity (IASO)/International Obesity Taskforce (IOTF) analysis (2010) estimates that approximately 1.0 billion adults are currently overweight, and a further 475 million are obese in the world today [8] .\nBeing overweight or obesity are defined as having abnormal or excessive fat accumulation that presents a risk to health. The World Health Organization (WHO) defines obesity for adults based on overweight and obesity ranges determined by body mass index (BMI), a person's weight (in kilograms) divided by the square of height (in meters). An adult with a BMI under 18.5 kg/m 2 is considered underweight. An adult with a BMI between 18.5 kg/m 2 and 24.9 kg/m 2 is considered to be in the normal range. An adult with a BMI between 25 kg/m 2 and 29.9 kg/m 2 is considered overweight. An adult with a BMI of 30 kg/m 2 or higher is considered obese. Among the obese, an adult with a BMI between 30kg/m 2 and 34.9 kg/m 2 is considered to be obese class I, between 35kg/m 2 and 39.9 kg/m 2 to be obese class II, and an adult with a BMI of 40 kg/m 2 or higher to be obese class III [9]. BMI provides the most useful population-level measure of being overweight and obesity as it is the same for both sexes and for all ages of adults. However, WHO points out that it should be considered as a rough guide because it may not correspond to the same degree of fatness in different individuals. Moreover, it is well known that there is ethnic diversity in the physiology of obesity. The appropriateness of WHO criteria in non-Caucasian populations has been questioned. It was reported that South Asian, East Asian, and African-American developed diabetes at a higher rate, at an earlier age, and at lower ranges of BMI than their white counterparts [10] . In 2000, The Asia-Pacific Perspective: Redefining Obesity and Its Treatment recommended different ranges for the Asia-Pacific regions based on risk factors and morbidities. They suggested that in Asians, the cut-offs for being overweight should be 23 kg/ m 2 and obesity 25 kg/m 2 , which are lower than the WHO criteria [11].\nSubstantial differences in national and local environments with genetic variances produce the wide variation in obesity prevalence in the world. The prevalence of obesity in adults is lower in East Asia including Japan compared with the USA [12] . In East Asia, China, Japan, South Korea and Taiwan have their own criteria of overweight and obesity. In Japan, according to the Japan Society for the Study of Obesity 2011 (JASSO), the BMI values considered as being underweight or in the normal range are the same as the WHO criteria [13] . However, an adult with a BMI of 25 kg/m 2 or higher is considered obese in Japan. Among the obese, an adult with a BMI between 25 kg/m 2 and 29.9 kg/m 2 is considered to be obese grade 1, between 30kg/m 2 and 34.9 kg/m 2 to be obese grade 2, between 35kg/m 2 and 39.9 kg/m 2 to be obese grade 3, and a BMI of 40 kg/m 2 or higher to be obese grade 4 in Japan. An adult with a BMI of 35 kg/m 2 or higher is considered to have morbid obesity in Japan. In China, an adult with a BMI of 24 kg/ m 2 or higher is considered to be overweight, and an adult with a BMI of 28 kg/m 2 or higher is considered to be obese [14] . In South Korea, an adult with a BMI of 25 kg/m 2 or higher is considered to be obese [15] . In Taiwan, an adult with a BMI of 24 kg/m 2 or higher is considered to be overweight, and an adult with a BMI of 27 kg/m 2 or higher is considered to be obese [16] . Functional Brain Mapping and the Endeavor to Understand the Working Brain 302 Functional Brain Mapping and the Endeavor to Understand the Working Brain 306 Functional Brain Mapping and the Endeavor to Understand the Working Brain 324 Functional Brain Mapping and the Endeavor to Understand the Working Brain 326 Functional Brain Mapping and the Endeavor to Understand the Working Brain 328 Functional Brain Mapping and the Endeavor to Understand the Working Brain 330 Functional Brain Mapping and the Endeavor to Understand the Working Brain 336 Functional Brain Mapping and the Endeavor to Understand the Working Brain 338 Functional Brain Mapping and the Endeavor to Understand the Working Brain 340"}, {"section_title": "Introduction", "text": "Obesity is defined as a high body mass index (BMI) with a large amount of adiposity. A chronic excess energy intake above energy expenditure leads to abnormal or excessive fat accumulation. Normally, humans and other mammals have an extraordinary ability to match food intake to energy expenditure over long periods so that body weight and adiposity are maintained at near-constant levels. The precise mechanism of the natural course of obesity is yet unclear. After findings on the hypothalamus as the center of energy regulation in 1940's, the central nervous system came to the forefront of attention in the pathophysiology of obesity. Recent global epidemic of obesity is one of the largest health problems in the world. Clinical studies have revealed that obesity is comorbid with several forms of mental disorder [3] [4] [5] . Epidemiological studies show that obesity is strongly related to cognitive impairment, including Alzheimer's disease and mood disorder [6, 7] . Obesity is also positively correlated with several other forms of mental disorder in general population samples. These findings suggest that obesity can affect mental function and change neural plasticity. Also, such mental disorder might cause further progression of obesity. Moreover, there is the possibility that mental disorder acts as a trigger of the development of obesity. Understanding the bidirectional interaction of obesity and mental disorder should help prevent and treat obesity. This review is aimed at highlighting the mental functions related to obesity, from basic research including our recent works to clinical findings."}, {"section_title": "Pathophysiology of obesity", "text": ""}, {"section_title": "Mortality and complications", "text": "The BMI classification scheme for weight status is based on data obtained from large epidemiological studies that evaluate the relationship between BMI and mortality [17] . Epidemiological studies consistently suggested that lowest overall mortality in adults is associated with a BMI in the range of 20 to 23 kg/m 2 [18] . A very high degree of obesity (BMI ≧ 35 kg/m 2 ) seems likely to be linked to higher mortality rates, but the relationship between more modest degrees of being overweight and mortality is unclear [4, [18] [19] [20] [21] . On the other hand, the positive correlation between obesity and many health problems both independently and in association with other diseases are clearly observed. In adults, the health complications associated with obesity increase linearly with increasing BMI until the age of 75 years [18, 22] . Both men and women who have a BMI ≧ 30 kg/m 2 are considered obese and are generally at higher risk for adverse health events than are those who are considered to be overweight. In particular, obesity is associated with the development of type 2 diabetes mellitus, coronary heart disease, an increased incidence of certain forms of cancer (colon, breast, esophageal, uterine, ovarian, kidney, and pancreatic), respiratory complications (obstructive sleep apnea), and osteoarthritis of large and small joints [23] . Also, high prevalence of cognitive impairment and mental disorder is observed in obesity [3] [4] [5] [6] 24 ]."}, {"section_title": "Clinical aspects related to psychiatry in obesity", "text": "From the viewpoint of the endocrinologist, obesity is often comorbid with eating disorders, especially binge-eating disorder, which is thought to be present in 20-40% of obese patients [25] . Many lines of evidence suggest that obesity and depression often comorbid and might be functionally related to each other [3, [26] [27] [28] [29] [30] . High rates of obesity among individuals with binge eating disorder, bipolar disorder, major depressive disorder, anxiety disorders, schizophrenia, personality disorders, and other diagnoses were also observed [3, 5, 27, 31] . The link between such mental disorder and obesity is likely to be bidirectional: obesity can lead to mental disorder and, in turn, mental disorder can be an obstacle to treatments of obesity and attaining longterm weight-loss goals, thereby contributing to weight gain [25] . Evidence also indicates that obesity negatively impacts on prognosis of many kind of illness. These relationships appear to be especially strong for women and individuals with more severe obesity (BMI ≧35 kg/m 2 ) [5] . Associations between obesity and psychiatric illness are also documented in men but in more moderately overweight individuals [5] . Obesity is also associated with significant psychosocial impairment. Obese individuals are subject to weight-based stigmatization in a variety of settings, and generally report poorer quality of life compared with lean individuals [4, 5] .\nFrom the viewpoint of the psychiatrist, obesity is defined as eating disorder. Anorexia nervosa, bulimia nervosa, eating disorders not otherwise specified, and obesity are categorized as eating disorder according to the Diagnostic and Statistical Manual of Mental Disorders (DSM)-IV TR [32] . Most of the patients of anorexia nervosa and bulimia nervosa are women. Even with the gender specificity, eating disorders are thought to share dysregulation of common neuronal pathways with obesity [33] . Some population of obesity is characterized as mental disorder with \"compulsive food consumption\" similar to drug addiction and suggested to be included as a mental disorder in the DSM-V [5] . The pathophysiology of anorexia nervosa draws attention as it is thought to be the opposite phenotype of obesity [ Figure 1 ]. Functional magnetic resonance image (fMRI) study showed that brain reward circuits are more responsive to unexpected food stimuli and more sensitive in dopamine-related pathways in anorexia nervosa, but are less responsive and less sensitive in obese women [33] . Moreover, a recent fMRI study suggested that self starvation in anorexia nervosa may be driven by inappropriately assigned desire and pleasure associated with food restriction, somehow related to dependence [34] . They might perpetuate and reinforce the desire to not eat to change persistent stress, such as low self-esteem and social rejection into a positively experienced state [35] . Bulimia nervosa is another severe eating disorder characterized by the presence of episodic binge eating followed by extreme behaviors to avoid weight gain, such as self-induced vomiting, use of laxative or excessive exercise [32] . Individuals with bulimia nervosa present with fear of gaining weight, as well as food and body weight-related preoccupations, are at normal or often high-normal weight. While they are eating, they feel pleasure and arousal followed by guilt and remorse. These abnormal eating behaviors observed in anorexia nervosa and bulimia nervosa are also difficult to treat and contain life-long risk of relapse [36] . How about the personality of obesity? Psychological processes contribute to an individual's body shape. Body weight reflects our behaviors and lifestyle and contributes to the way we perceive ourselves and others. Personality traits are defined by cognitive, emotional, and behavioral patterns that are likely to contribute to unhealthy weight and difficulties with weight management. It is quite difficult to clarify personal traits, but there are many clinical studies on the personality of obesity using certain questionnaires [37] [38] [39] [40] [41] . Overweight individuals are prone to depressive state, have a poor body image, are evaluated negatively by others, and are ascribed traits based on their body size [42] [43] [44] [45] . From the Baltimore Longitudinal Study of Aging (BLSA), which is a longitudinal study of more than 50 years on a large number of people (n = 1,988), high neuroticism and low conscientiousness, which are related to difficulty with impulse control, were associated with weight fluctuations [40] . Low agreeableness and impulsivity-related traits predicted a greater increase in BMI across the adult life span in the same study [40] . Personality traits are reported to be a useful tool for predicting diet-induced weight loss and management, which may offer ways to achieve appropriate weight loss and management strategies for individuals [46] [47] .\nTo date, however, there is no evidence to support a direct interaction between obesity and these personality traits. It is not clear that how these mental disorders and personality traits are related to the natural course of obesity."}, {"section_title": "Brain inflammation and obesity", "text": "Adiposity causes chronic low-grade systemic inflammation, which in conjunction with a high calorie diet may contribute to diseases associated with obesity [48] [49] . A growing body of evidence implicates immune cell-mediated tissue inflammation as an important mechanism linking obesity to insulin resistance in metabolically active organs, such as the liver, skeletal muscle, and adipose tissue [48] [49] . Peripheral inflammation passes through or bypasses the blood-brain barrier [50] [51] , and stimulation of neural afferents at the site of local peripheral inflammation induces an inflammatory reaction within the central nervous system [52] [53] . The saturated free fatty acids, palmitic acids and lauric acid, have been shown to trigger inflammation in cultured macrophages [54] . Saturated long-chain fatty acids were demonstrated to activate inflammatory signaling in astrocytes [55] . Microglia, macrophage-like cells of the central nervous system that are activated by pro-inflammatory signals causing local production of specific interleukins and cytokines, play a pivotal role in brain inflammation [48-49, 53, 55-57] . Experimental studies in animals have confirmed neurologic vulnerability to obesity and a high-fat diet and further demonstrated that diet-induced metabolic dysfunction leads to increased brain inflammation, reactive gliosis, and vulnerability to injury, especially in the hypothalamus [49, 56, [58] [59] . Hypothalamic inflammation contributes to obesity pathogenesis through the development of central leptin resistance [49, 56] . Leptin resistance is a physiological condition in which high concentrations of leptin neither reduce food intake nor increase energy expenditure, as observed in obese humans and a rodent model of diet-induced obesity (DIO) [60] . Leptin resistance is considered to be a central dogma for obesity [61] . Immunerelated molecules, including proinflammatory cytokines, IL-1β, TNF-α, and IL-6, altered expression levels of many genes in the hypothalamus [49, 56, 58] . Activation of both Jnk and the inhibitor of nuclear factor kappa-B kinase subunit β(IKKβ)/ nuclear factor-κB (NF-κB) pathway as well as induction of endoplasmic reticulum stress underlie these responses and parallel the onset of reduced hypothalamic leptin sensitivity in rodent models of DIO [56, 58] . High-fat feeding increases suppressor of cytokine signaling 3 (SOCS3) and protein tyrosine phosphatase-1B (PTP1B) in the rodent hypothalamus [56, 58, 62] . Up-regulation of SOCS3, a member of a protein family originally characterized as negative feedback regulators of inflammation, inhibits insulin and leptin signaling by direct binding to their cognate receptors and targeting insulin receptor substrate (IRS) proteins for proteasomal degaradation [58] . The PTP1B is a signal termination molecule that inhibits both leptin and insulin signaling, also thought to be involved in leptin resistance [58, 62] . Diet-induced PTP1B overexpression in multiple tissues including the hypothalamus in obesity is regulated by inflammation [62] . Recent studies with animals and humans have shown that other brain structures, such as the hippocampus and orbitofrontal cortex, are also affected [53, 57, [63] [64] . These inflammatory changes induced by obesity and high-fat diet might be reversible from the results of animal studies. Resveratrol, an adenosine monophosphate-activated protein kinase (AMPK) activator and potent anti-inflammatory agent, attenuated peripheral and central inflammation in the hippocampus and improved memory deficit in mice fed a high-fat diet [57] . In another study, moderate and regular treadmill running exercise markedly decreased hypothalamic inflammation in high-fat diet fed mice [59] . Evidence of brain inflammation in human obesity has been accumulating based on biologic data and imaging studies by using MRI [46, 56] ."}, {"section_title": "Mental disorders of obesity", "text": ""}, {"section_title": "Depression and other mood disorders", "text": "Obesity is associated with an increased risk of developing depression and a higher likelihood of current depression [3, [27] [28] [29] [30] . Most obese individuals tend to have higher scores in depression, the projected increase in the rates of being overweight and obesity in future years could generate a parallel increase in obesity-related depression. According to the DSM-IV, an episode of major depressive disorder can be classified clinically as depression with melancholic features and depression with atypical features. Unlike melancholic depression, which is characterized by a loss of appetite or weight, atypical depression and seasonal depression are characterized by decreased activity and increased appetite and weight. Obesity among these groups is sometimes a result of the ingestion of \"palatable food\", which contains high amounts of fat and sugar [65] . Also, major depression in female adolescence is linked with an increased risk of obesity in adulthood [66] . To explain this mutual relationship between obesity and depression, the focus of research has been on hormones and neuropeptides, which have been implicated in both energy regulation and cognition/mood [67] . Among them, the involvement of leptin has been the subject of much attention as it has been implicated in depression associated with obesity [1] . Leptin is reported to induce an antidepressant-like activity in the hippocampus, which is considered to be an important region for regulation of the depressive state, but not in the hypothalamus of rats [68] . Decreased plasma or CSF leptin levels were observed in major depressive disorder patient group compared with controls independent of BMI [69] [70] . These findings suggested that impairment of leptin action might contribute the physiology of depression. In obese rodents and humans, a high concentration of plasma leptin is observed with a blunted effect of leptin in suppressing food intake and increasing energy expenditure, which is termed \"leptin resistance\" [61] . Based on these observations, we postulated that the development of depression associated with obesity might be due in part to impaired leptin activity in the hippocampus.\nHere we review our recent study on the central leptin action in depression associated with obesity [1] . The forced swimming test (FST) is widely accepted as a task that induces depressive behavior in depression research and has good reliability and high predictive validity for assessment of the depressive state and the detection of potential antidepressant-like activity in experimental animals. In this test, animals display \"despair\" behavior as observed as immobility and escape-oriented behaviors, in particular, by swimming [71] [72] . Normal mice fed a control diet (CD) displayed such immobility and stress-induced despair in the FST. . Icv injection of leptin did not decrease the immobility time of DIO mice in the FST [1] . Moreover, in response to leptin, DIO mice did not exhibit an increase in the number of c-Fos-immunoreactive cells in the hippocampus, whereas leptin administration in CD mice has a significantly increased number of c-Fos immunoreactive cells in the hippocampus [1] . To examine whether the increased immobility time of DIO mice in the FST can be restored by diet substitution from HFD to CD, the diet of the DIO mice was changed from HFD to CD for the next 3 weeks. This led to significant reductions in body weight and fat weight and to the normalization of plasma levels of glucose, insulin, and leptin [1] . The immobility time in the FST in mice now given CD was significantly decreased and identical to that of the CD mice [1] . Moreover, subcutaneous administration of leptin significantly decreased the immobility time of FST in mice switched to CD [1] . These results are compatible with a previous report that diet substitution from HFD to CD in DIO mice restores leptin sensitivity as an anorexigenic action [73] . Brain-derived neurotrophic factor (BDNF) in the hippocampus is considered to play an important role in control of the depressive state. Injection of BDNF into the hippocampus in experimental animals has antidepressant effects in the FST, and this antidepressant effect induced by BDNF is inhibited by K252a, an inhibitor of the BDNF receptor tyrosine kinase B (TrkB) [74] . Low BDNF levels are reported in the hippocampus of humans with depression [75] . These findings support the hypothesis that decreased BDNF/TrkB signaling may induce depression. In our study, the hippocampal BDNF concentrations in DIO mice were significantly decreased compared with those of CD mice [ Figure 2 Data points represent the mean ± SEM. Significantly different: *p < 0.05, **p < 0.01. CD mice: control mice given CE-2 as a control diet (CLEA Japan, Inc., Tokyo, Japan), DIO mice: diet-induced obese mice given a high-fat diet (HFD) (no. D12492; Research Diets, Inc., New Brunswick, NJ) containing 60% fat of total calories, predominantly in the form of lard."}, {"section_title": "Functional Brain Mapping and the Endeavor to Understand the Working Brain", "text": "Given the high comorbidity of metabolic disorders, such as diabetes and obesity, with depression, several lines of evidence suggest that insulin signaling in the brain is also an important regulator. Clinical investigations show the relationship between insulin resistance and depression, but the underlying mechanisms are still unclear [76] [77] . Ghrelin is also play a potential role in defense against the consequences of stress, including stress-induced depression and anxiety and prevent their manifestation in experimental animals [82] . These findings suggest that both leptin and ghrelin involve in mood regulation and might have antidepressant-like effect. The target differences being treated by leptin or ghrelin in human depression are not known, yet.\nWhat kind of treatment is effective on depression associated with obesity? One clinical study demonstrated the efficacy of a treatment combining behavioral weight management and cognitive behavioral therapy for obese adults with depression [81] . According to systematic review and meta-analysis on intentional weight loss and changes in symptoms of depression, obese individuals in weight loss trials experienced reduction in depression symptoms [80] . This finding is compatible with our experimental data [1] ."}, {"section_title": "Cognitive impairment and Alzheimer's disease", "text": "Epidemiologic studies have demonstrated that the incidence of cognitive impairment is higher in obese individuals than in individuals with normal body weight [6, 24] . From the study of Anstey et al., risks of cognitive impairment appeared to be highest for those with underweight and obese BMI in midlife [81] . Increasing evidence suggests that obesity is associated with impairment of certain cognitive functions, such as executive function, attention, visuomotor skills, and memory [6, 82] . A higher prevalence of attention deficit hyperactivity disorder, Alzheimer's disease and other cognitive impairment, cortical atrophy, and white matter disease is observed in obese individuals [83] [84] . The mechanisms by which obesity results in cognitive impairment, however, are uncertain. Postulated mechanisms include the effects of hyperglycemia, hyperinsulinemia, poor sleep with obstructive sleep apnea, and vascular damage to the central nervous system [7, 85] . Moreover, adiposity is thought to have a direct effect on neuronal degradation [24] . C reactive protein, as well as inflammatory markers, is increased in subjects with greater adiposity and is associated with later-life cognitive impairment [86] . White matter lesions and cerebral atrophy are more common in adults with a high BMI, and midlife measures of central obesity predict poor performance on tests measuring executive function and visuomotor skills [83] [84] 87 . In animal studies, chronic dietary fat intake, especially saturated fatty acid intake, contributes to deficits in hippocampus-and amygdala-dependent learning and memory in rodents with diet-induced obesity by changes in neuronal plasticity [2, 88] . Neural plasticity, long-term structural alterations of synapses, are regulated by several synaptic molecules including neurotrophic factors, such as BDNF, and have been demonstrated to be essential for hippocampal functions [89] .\nIn our recent study, cognitive behaviors in DIO mice in fear-conditioning test including both contextual and cued elements that preferentially depend on the hippocampus and amygdala, respectively, was significantly impaired [ Figure 3 (A); 2]. Fear-conditioning test is the method which assesses memory and learing by freezing behavior induced by electric foot shock.\nFreezing was defined as the absence of all movement except for respiration. BDNF content in the cerebral cortex and hippocampus of DIO mice was significantly lower than that in CD mice [ Figure 3 (B); 2]. Its receptor, full-length TrkB in the amygdala of DIO mice was significantly decreased compared to that in CD mice, although not in the cerebral cortex, hippocampus and hypothalamus [ Figure 3 (C); 2]. By contrast, neurotrophin-3 (NT-3), which is reported to act in the opposite direction to BDNF on neurite outgrowth and neural activities, was present at significantly higher levels in the hippocampus, amygdala and hypothalamus of DIO mice than that in CD mice [90-91, Figure 3 Several lines of electrophysiological and behavioral evidence demonstrate that leptin and insulin enhance hippocampal synaptic plasticity and improve learning and memory [7, 92] . Electrophysiological studies in genetically obese Zucker rats with leptin-receptor deficiency demonstrated that long-term potentiation (LTP) of the hippocampal CA1 region, which is closely related to learning and the formation of memory and is regulated by N-methyl-D-aspartate (NMDA) and 2-amino-3-(3-hydroxy-5-methyl-isoxazol-4-yl)propanoic acid (AMPA) receptors, is markedly impaired compared to that of lean rats [93] . Streptozotocin-treated insulin deficient rats are reported to exhibit impaired cognition in the water maze test, which is dependent on the hippocampus [94] . Therefore, it is likely that impairment of the actions of leptin or insulin might be attributable to cognitive deficits in obesity and diabetes mellitus [61, 95] ."}, {"section_title": "Dysregulation of hunger in obesity 5.1. Metabolic hunger", "text": "Food intake and energy expenditure are controlled by complex, redundant, and distributed neural systems that reflect the fundamental biologic importance of an adequate nutrient supply and energy balance. Metabolic hunger is regulated by a homeostatic metabolic status designed to preserve energy balance and maintain minimal levels of adiposity. The hypothalamus and caudal brainstem play crucial roles in this homeostatic function. The hypothalamus serves to integrate nutrition and information from orexigenic and anorexigenic peptides that are sensitive to circulating leptin and other hormones [96] [97] . The role of the hypothalamus in regulating food intake and body weight was established in 1940 by the classic experiments of Hetherington and Ranson [98] . Their destruction experiments demonstrated that the ventromedial hypothalamus resulted in hyperphagia and obesity [98] . Anand and Brobeck, in 1951 , demonstrated that lesions of the lateral hypothalamus caused loss of feeding, inanition, and even death by starvation [99] . Thus, the concept arose of the lateral hypothalamic are serving as a \"feeding center\" and the ventromedial nucleus as a \"satiety center\" [100] .\nAfter more than 60 years since the Hetherington and Ranson experiments, much more precise mechanisms and the network between peripheral signals and the brain have been elucidated [97, 101] . Input signals such as sight, smell and taste allow the brain to decide whether or not it should engage in ingestive behavior. Once put into the mouth, foods elicit taste and mechanical sensations that send neural signals via mainly vagal afferents to the Functional Brain Mapping and the Endeavor to Understand the Working Brain brainstem and/or hormonal signals through the bloodstream to the brain [97] . Gut-tobrain communication is increasingly recognized as playing an important role not just in the determination of meal size but also in overall food intake [97] . Once absorbed, macronutrients are partitioned into either storage or immediate metabolism in various tissues [97] . The information from peripheral tissue including the gastric tract is relayed to the brain, especially to the hypothalamus and the brainstem by hormones [leptin, insulin, amylin, peptide YY (PYY), ghrelin, glucagon-like peptide-1 (GLP-1), and cholecystokinin (CCK)] and nutrient signals [glucose, free fatty acid, and amino acid] [97, 101] . Leptin, insulin and amylin deliver long-term afferent signals, PYY, GLP-1, and CCK deliver short-term meal related afferent signals and work for satiation, and ghrelin stimulate feeding. Vagal afferent neurons, whose cell bodies lie in the nodose ganglia, relay information from enteroendocrine cells of the intestinal epithelium and the enteric nervous system directly to the nucleus of the solitary tract in the brainstem [102] . During periods of hunger, the hypothalamus regulates the activity of the autonomic nervous system to promote fat release from white adipose tissue and trigger glucogenesis in the liver. These changes in peripheral nutrient levels lead to a decrease in the levels of thyroid hormones, insulin and leptin, and to an increase in the level of ghrelin and corticosteroids, which increase food-seeking behavior through their effect on the brain [101] . Through these pathways, an almost stable body weight can be maintained even under unpredictable and unstable environments.\nThe ARC in the hypothalamus is the gateway of above hormones and signals in the brain [97, 101, 103] . From the ARC, the first-order neuronal network was observed of anorexigenic neuropeptides, proopiomelanocortin (POMC) and cocaine-amphetamine rerated transcript (CART), orexigenic neuropeptide, NPY and Agouti-related protein (AgRP) to other nuclei in the hypothalamus, the paraventricular hypothalamus (PVN), lateral hypothalamus (LH), and ventromedial hypothalamus (VMH) [97, 103] . These nuclei have a second-order neuronal network of output projection to other sites of the brain which regulate endocrine responses, autonomic responses, cognitive processing response plan, procurement actions, reward memory, aversive memory, social screen, competing behaviors, oro-and locomotor control, and autonomic control of peripheral tissue [97, 103] . Among these nucleus in the hypothalamus, LH works as a relaying point, connecting the hypothalamus with mesolimbic dopamine system and higher brain functions. Melanin-concentrating hormone in the LH projects to the Nucleus accumbense (NAc) and many other brain areas including the amygdala, hippocampus, and cerebral cortex, and orexin in the LH project to the ventral tegmental area (VTA) and many other brain areas including the amygdala, hippocampus, and cerebral cortex [104] . From recent studies, first order neurons, which receive peripheral information and regulate food intake, are suspected to be present in other regions of the hypothalamus and extra-hypothalamus [1, 97, 105, 106] . Many hormones and neuropeptides, which were previously thought to energy regulator, have turned to regulate other higher brain functions, too.\nIn human obesity, genetic predisposition is expressed mainly on the central melanocortin system. Downstream targets of the central melanocortin system are implicated in food intake, meal choice, satiety and energy expenditure [107] . POMC is a large precursor protein that is processed into a variety of smaller products, including alpha melanocyte stimulating hormone Functional Brain Mapping and the Endeavor to Understand the Working Brain (α-MSH), is an endogenous ligand of melanocortin 3 receptor (MC3R) and melanocortin 4 receptor (MC4R) in the brain [108] . AgRP is an inverse agonist of the brain MC3R and MC4R, completely dependent on the melanocortin receptors for its action, has an orexigenic effect on food intake and decreases energy expenditure [109] . Mutations in the MC4R in humans, the most commonly known monogenic cause of human obesity, have been associated with obesity, hyperphagia, tall -stature and hyperinsulinemia [110] [111] [112] [113] . Common variants near MC4R were reported to influence fat mass, weight and obesity risk at the population level from genomewide association data from people of European descent [114] . Mutations in MC3R have been associated with obesity, hyper leptinemia and relative hypephagia [115] . Mutations in POMC and AgRP have been also reported in human obesity [116] [117] [118] . Mutation of leptin, which target is thought to be mainly the melanocortin circuitry in the brain, leptin receptor, and prohormone convertase-I were also reported in humans with severe early-onset obesity and intense hyperphagia [118] [119] [120] [121] . The findings that HFD altered levels of POMC, AgRP and MC4R mRNA expression in the hypothalamus and changed the response to melanocortin agonist in experimental animals [122] [123] , speculate that dysregulation of melanocortin system may also happen in human obesity."}, {"section_title": "Hedonic hunger", "text": "Several lines of evidence have indicated that energy regulations are also modulated by extrahypothalamic brain areas originally related to regulation of emotion and cognition, such as the NAc, amygdala, hippocampus and cerebral cortex [124] . These findings suggest that maintaining energy homeostasis and regulating emotion and cognition share common brain regions, as well as bidirectional interaction between energy regulation and emotional/ cognitive functions. The regulation of food intake by the hypothalamus interacts with reward and motivational neurocircuity to modify eating behavior. Such a cognitive-hedonic pathway permits us to adjust our feeding behavior to environment & lifestyle, palatability, liking/ wanting/emotion, cues, availability, physical activity, and fuel availability [97] . Reward circuitry, which is mainly regulated by the midbrain dopamine system from the VTA to the NAc, is the main pathway of hedonic hunger. This system is the main pathway in drug addiction and part of the motivational system that regulates responses to natural reinforcers such as drink, sex, social interaction and food [125] . This dopamine neuron express κopioid receptors and receive projection of γ-aminobutyric acid (GABA) and dynorphin from the NAc [125] . Dopamine signaling within mesolimbic neurons mediates the willingness to engage in rewarding behaviors or \"wanting\", whereas the pleasure associated with a particular reward or \"liking\" is attributed to mesolimbic opioid action [126] . Memory and learning, mood, Top/ Down inhibition, interoception, gustatory integration, and salience attribution interact with the reward circuitry [ Figure 4 ; 105]. Top/Down inhibition of feeding depends heavily on the prefrontal cortex, including orbitofrontal cortex and cingulate gyrus [105] . The amygdala ascribes emotional attributes including fear, together with memory and learning circuitry, and generates conditioned responses [2] . The hippocampus is also involved in emotion, memory and learning circuitry [2, 105] . . Schematic diagram potential interactions between metabolic hunger and hedonic hunger which regulate food intake. Food intake is controlled by complex neural system that reflects the fundamental biological importance of adequate nutrient supply and balance. Metabolic hunger regulated by homeostatic metabolic status designed to preserve energy balance and protect minimal levels adiposity. The hypothalamus plays crucial roles in the metabolic hunger. Reward circuit which is mainly regulated by the midbrain dopamine system from the VTA to NAc, is the main pathway of hedonic hunger. Memory and learning and mood interact with reward circuits. Circulating signals of energy availability, leptin, ghrelin, glucose, and insulin are thought to regulate food intake mainly via the hypothalamus, but recent studies show that they also regulate food intake via many extra-hypothalamic regions. VTA: ventral tegmental area, NAc: nucleus accumbense.\nChronic excessive consumption of palatable foods predisposes some individuals to obesity via an increased likelihood and reinforcement of overeating. Excessive activity of hedonic hunger in obesity might lead to the ingestion of more food, independent of metabolic hunger. Several recent models have emphasized the role of the dysregulation of hedonic hunger in the development and maintenance of obesity. Such \"compulsive food consumption\" was recently explained by an analogy to drug addiction as previously described [ Figure 5 ]. Drug addiction is defined as the loss of control over drug use, or the compulsive seeking and taking of drugs despite adverse consequences [125] . Once formed, an addiction can be a life-long condition in which individuals show intense drug craving and increased risk for relapse after years and even decades of abstinence [125] . This means that addiction involves extremely stable changes in the brain that are responsible for these long-lived behavioral abnormalities [125] . The hypothesis of obesity treating as an analogy of drug addiction is supported by evidence for a food addiction diagnosis according to the Yale Food Addiction Scales [127] [128] [129] and fMRI in humans [92] . There are several questionnaires for the assessment of food addiction. Such questionnaires include the \"3Cs\" of addiction, compulsive use, attempts to cut down, continued use despite consequences, among others [127] . The most common symptoms were (1) persistent desire or repeated unsuccessful attempts to cut down, (2) continued use despite problems, and (3) much time spent to obtain food, eat, or recover from eating [127] . Meule et al reported that prevalence of food addiction diagnoses differed between weight classes such that overweight and obese participants had higher prevalence than normal weight participants [ Figure 6 ; 128]. These \"compulsive food consumption\" is difficult to modify, and even if weight loss is achieved, the neural plasticity \"fixed\" by palatable food leads individuals to crave palatable food and thus substantially regain weight. \"Fear of hunger\" which accelerates \"hedonic eating of palatable food\" might cause compulsive food consumption in obesity [35] . Moreover, a weakened Top/Down inhibition signal for food cravings and inadequate sensing of ingested nutrients resulting in hyperphagia of obesity has been detected in fMRI studies [105] . Also, from the finding that obese patients have been shown to have decreased D2 receptor level in striatum by positron emission tomography (PET) imaging, obesity has been described as a reward deficiency syndrome, where deficiency of dopamine signaling results in compensatory over eating [105, 125] . fMRI studies demonstrated that obese patients have an increased \"motivation\" or \"wanting\" for food intake, actual food intake is associated with decreased \"liking\" [130] . It is not known that these functional changes are the results of obesity or the cause of obesity. Stress is reported to modulate the reward circuit. Stress affects feeding behavior in humans in both directions, with some individuals increasing their food intake while others eat less [131] . An overall increased consumption of caloric dense and highly palatable foods following stress compared to non-stressed controls is reported, independent of stress-induced hyperphagia or hypephagia [131] . Susceptibility to stress and stress-induced hyperphagia are observed in obese individuals [132] . Depression, other mood disorders, and cognitive impairment also affect the feeding behavior of obese individuals. Direct interaction between stress-mediated mood and reward circuits in rodent was reported by Vialou et al [133] ."}, {"section_title": "Hormones and neurotransmitter in metabolic hunger and hedonic hunger", "text": ""}, {"section_title": "Leptin", "text": "Leptin is one of the most important adipocyte-derived hormones and circulate in proportion to body fat mass, enter the brain, and act on neurocircuit that govern food intake and energy expenditure [124] . The long form of the leptin receptor (Ob-Rb) expresses in numerous regions including the hypothalamus, VTA, and NAc. Through both direct and indirect actions, leptin diminishes perception of food reward (the palatability of food) while enhancing the response to satiety signals generated during food consumption that inhibit feeding and lead to meal termination [124] . Administrations of leptin in the VTA directly regulate mesolimbic dopamine system [134] [135] . Centrally administered leptin diminishes both sucrose preference and the effect of fasting to increase the rewarding properties of electrical pleasure-center stimulation [136] [137] . The effect of weight loss to lower leptin levels and hence to reduce leptin signaling Functional Brain Mapping and the Endeavor to Understand the Working Brain increases rewarding properties of food while diminishing satiety, a combination that potently increases food intake [124] ."}, {"section_title": "Ghrelin", "text": "Ghrelin is recognized as the only known orexigenic peptide hormone and synthesized mainly by a distinct group of endocrine cells located within the gastric oxyntic mucosa [136] . The mechanisms by which ghrelin promotes food intake are multifaceted and include not only stimulating intake of food via homeostatic mechanisms but also enhancing the rewarding properties of pleasurable food [139] [140] . Ghrelin shifts food preference toward palatable sweet and fatty food [139] . Ghrelin can directly affect dopaminergic VTA neuronal activity and increase motivational aspect of reward [139] . Intra-VTA administration of ghrelin modulates intake of freely available regular chow, food preference, motivated food reward behavior, and increases body weight [139] . Orexin signaling is required in these ghrelin's action on food reward [140] . Ghrelin also reported to mediates stress-induced food-reward behavior in mice [141] ."}, {"section_title": "Insulin", "text": "Insulin is produced by pancreatic β-cells, controls plasma glucose levels, increases in proportion to fat mass, consequently relay information about peripheral fat stores to central effectors in the hypothalamus to modify food intake and energy expenditure. Neurons in the ARC of the hypothalamus express insulin receptors and regulate energy homeostasis. The receptors for insulin are also present in brain reward circuitry, which are thought to be projected from LH in the hypothalamus [126, [142] [143] . Insulin works as satiety hormone similar to leptin, and also attenuates food reward similar to leptin, substantially suppresses food intake [126, 144] . Insulin signaling and dopamine signaling via dopamine 2 receptor (D2R) work in tandem to regulate dopamine transporter plasma membrane expression and function [145] . Brain insulin resistance which is often accompanied with obesity also exists in brain regions regulating appetite and reward [146] . Dysregulation of brain insulin signaling might alter dopamine reward pathways resulting in changing motivation for food since these pathways are insulin sensitive [145] . Jastreboff et al demonstrated a fMRI study that in obese individuals, food craving, insulin, and HOMA-IR levels correlated positively with neural activity in corticolimbic-striatal brain regions including the striatum, insula, and thalamus during favorite-food and stress cues [147] . These findings strongly suggest that the relationship between insulin resistance and food craving in obese individuals mediated by activity in motivation-reward regions [147] . Centrally administered insulin also diminishes both sucrose preference and the effect of fasting to increase the rewarding properties of electrical pleasure-center stimulation similar to leptin [136] [137] ."}, {"section_title": "GLP-1", "text": "GLP-1 is secreted from the L cells of intestinal tract in response to nutrients. GLP-1 is also produced in the NTS of the brainstem, resulting in the activation of GLP-1receptor (GLP-1R) expressed on both dendritic terminals of vagal afferent fibers innervating the organs of the peritoneal cavity, as well as the pancreaticβ-cells [148] [149] . Activation of the GLP-1R promotes glucose dependent insulin secretion, slowing of gastric emptying, and glucose-dependent inhibition of glucagon secretion, together facilitating the rapid clearance, storage, and normalization of blood glucose [149] . GLP-1 has anorectic effects, and regulation of short and longterm food intake and body weight [148] . GLP-1Rs are expressed especially in the NTS and in the hypothalamic nuclei [155] . GLP-1 neurons in the NTS are characterized to project to the PVN and the DMH in the hypothalamus [150] . Peripheral GLP-1 regulates long-term energy balance interacting with leptin [150] . Central GLP-1 is a critical downstream mediator of leptin action [155] . Cells in both the VTA and the NAc clearly express the GLP-1R [147] [148] . They receive GLP-1-positive fibers which are likely coming from the NTS and potentially contribute to the regulation of reward behavior [151] [152] . Peripheral and central administration of a longacting GLP-1 receptor agonists, liraglutide and Exendin-4, suppress food reward and motivation in rats, resulting in reduce appetite and body weight [148] ."}, {"section_title": "Weight management strategy in obesity", "text": "On the basis of the observation that a 10% loss of body weight frequently produces substantial beneficial change in health risk factors, even in the very obese, a 10% weight loss has been offered as a clinical definition of weight loss success [153] . Long-term success in voluntary weight loss is clearly possible but quite difficult. Lifestyle modification sometimes with cognitive behavioral therapy (CBT) is essential part of the strategy of weight management in obesity. Medications and bariatric surgery are supportive therapy. Recent new findings from successful bariatric surgery might help us to get new strategy."}, {"section_title": "Lifestyle modification", "text": "The health and psychosocial benefits of sustained weight loss are well established, even tough, these natural incentives are not sufficient to motivate long-term behavior change [153] . There is a lifestyle patterns associated with lean or obese population. From the study done by University of Minnesota, 5 meaningful lifestyle and weight control behavioral factors were identified [154] . Current lesser BMI and greater % weight loss are associated with good habits: regularity of meals, not watching television with meal or snuck, having intentional strategies for weight control, not eating away from home, greater fruit and vegetable intake [154] . These results strongly suggested that lifestyle modification is essential for weight loss and weight control. Lifestyle modification includes 3 primary components: diet, exercise, and behavior therapy. About dietary interventions, there are 4 well-known diets: low-carbohydrate, low-fat (including balanced calorie-restricted), Mediterranean, and low-glycemic load regimens [155] . Numerous trials have examined these diets. In summary, caloric restriction rather than macronutrient composition is the key determinant of weight loss [155] . The optimal dietary macronutrient composition for improving specific comorbid complication will be determined by further researches. About exercise, physical activity is associated with improvements in body composition and metabolic conditions independent of weight loss. For weight loss, physical activity alone is of limited benefit and much better with diet restrictions. However, physical activity appears to be critical for long-term weight loss and prevention of weight regain [156] . Moderate-intensity physical activity between 150 and 250 min/week alone will provide only modest weight loss and prevent weight gain. Greater amount of physical activity over 250 min/week have been associated with clinically significant weight loss [156] . Resistance training increase fat-free mass and increase loss of fat mass but does not enhance weight loss [156] . For weight control, multiple short bouts of activity, as brief as 10 min, throughout the day are as effective as 1 long bout (>40 min) [157] . Behavior therapy is a set of principles and techniques for helping obese individuals modify eating, activity, and thinking habits that contribute to their excess weight [156, 158] . Setting specific goal and self-monitoring are the most important components of behavioral treatment [156] . Self-monitoring contains, daily monitoring of food intake and physical activity by use of paper or electronic diaries, weekly monitoring of weight, structured curriculum of behavior change, and regular feedback from an interventionist [156] . Frequent self-monitoring is a consistent predictor of both short-and long-term weight losses [159] . Frequency and duration of treatment contact is another important component of lifestyle modification [156] . Among many lifestyle modification programs, the LEARN program developed by Dr. Kelly Brownell of Yale University, is often recommended by health professionals in the USA and UK. It is designed to produce permanent change in five areas of life (lifestyle, exercise, attitudes, relationships and nutrition) for living and maintaining a healthy body weight. It also includes a master list of various lifestyle techniques, personal charts and forms, a fast food guide, calorie guide, a Weight Loss Readiness Test, and a comprehensive index [153, 158] ."}, {"section_title": "Cognitive behavioral therapy", "text": "Cooper et al developed a new CBT for obese women based on the evidence of their CBT for bulimia nervosa [112] . It targets patients' overeating, low level of activity, and focuses on processes hypothesized to hinder successful weight maintenance [160] . CBT was successful at achieving change in participants' acceptance of body shape. The great majority of the participants lost weight while taking CBT but within the observation period regain it. It seems that sustained behavior change in people with obesity is remarkably difficult to achieve, unlike the situation with people with eating disorders. However, CBT is still valuable for its validity and safety and there is still room for improvement."}, {"section_title": "Medication", "text": "After Orlistat (pancreatic lipase inhibitor) was approved 13 years ago, on 1999, safety concerns or lack of efficacy have doomed past applications. Fenfluramine, serotonin re-uptake inhibitor and increases the release of serotonin, is withdrawn by US Food and Drug Administration (FDA) with side effects of hallucinations, valvulopathy, pulmonary hypertension. Sibutramine, noradrenalin and serotonin re-uptake inhibitor is withdrawn by FDA with side effects of increased risk of heart attack and stroke in patients with high risk of cardiovascular disorders. Rimonabant (SR141716; CB 1 receptor antagonist/inverse agonist) is withdrawn by European Medicines Agency with side effects of risk of suicide [101] . In this year, Belviq (lorcaserin; selective 5-HT 2C receptor agonist, [161] [162] [163] ) and Qsymia (a combination drug of phentermine; a sympathomimetic amine anorectic, and topiramate extended-release; an antiepileptic drug, [164] [165] [166] ) were approved by FDA as new weight-loss drugs. Contrave, a combination of two well-established drugs, naltrexone and bupropion, in a sustained release formulation (SR), is also under-consideration [167] . The average body weight loss is around 10%, which is not so large even with instructed diet and exercise, and they are effective only while taking them. Orlistat 30-360 mg/day can reduce nearly 10% of body weight from baseline compared with 5-6% of those in the placebo-treated groups [168] . Belviq in conjunction with a lifestyle modification program can reduce body weight from baseline, -2.7%, -4.6%, -5.6% for placebo, 10mg BID, and 10 mg QD, respectively [161] . Qsymia, controlled-release phentermine/topiramate, in conjunction with a lifestyle modification program reduced body weight from baseline, -1.8%, -9.3%, and -10.5% for placebo, 7.5 mg phentermine/46 mg controlled release topiramate, and 15 mg phentermine/92 mg controlled release topiramate, respectively [164] . Contrave can reduce body weight from baseline, -1.3%, -5.0%, and -6.1% for placebo, 16 mg naltrexone plus 360 mg bupropion, and 32 mg naltrexone plus 360 mg bupropion, respectively [167] .\nBesides Orlistat, most pharmacotherapies for obesity have been to target pathways that promote satiety. Dietrich and Horvath raised the interesting hypothesis that hunger promotes a healthier and longer life, and compounds that target satiety pathways will ultimately promote the homeostatic mechanisms that are related to metabolic overload and therefore chronic disorders [101] . Also, it seems almost impossible to alter only feeding behavior and energy expenditure without affecting on many other brain functions. New targets of antiobesity drugs are needed with much safety and efficacy. Recently, from the observation of type 2 diabetes treated by GLP-1 analogs, liraglutide and Exendin-4, which reduce appetite and body weight, has drawn attention as anti-obesity drug. A randomised, double-blind, placebocontrolled study of liraglutide showed that treatment with liraglutide, in addition to an energydeficit diet and exercise program, led to a sustained, clinically relevant, dose-dependent weight loss that was significantly greater than that with placebo and orlistat [169] . In this study, 76% of individuals treated with high-dose liraglutide, 3.0 mg/day, lost more than 5% weight, and almost 30% of individuals treated with liraglutide 3.0 mg/day lost more than 10% weight after 20 weeks of treatment [169] . Further study on the same patients group done by the same group, high-dose liraglutide (2.4/3.0 mg/day) with a diet and exercise program was successfully sustained weight loss for 2 years [170] . Moreover, Simmons et al reported that Exendin-4 resulted in considerable reduction of body weight in a patient with severe hypothalamic obesity from hypothalamic germ cell tumor [171] "}, {"section_title": "Surgery", "text": "On the other hand, use of bariatric surgery for severe obesity has increased dramatically. The most common operations are adjustable gastric banding, Roux-en-Y gastric bypass and sleevegastrectomy. Bariatric surgery demonstrated significant and durable weight loss as well as improvement in obesity-related comorbities [172] . Although, there is no large, adequately powered, long-term randomized controlled trials of clinical efficacy and safety of bariatric surgery compared with standard care, diet and exercise, yet. The American Association of Clinical Endocrinologists (AACE)/ The Obesity Society (TOS)/ the American Society for Metabolic & Bariatric Surgery (ASMBS) Guidelines reported weight loss as percentage of excess body weight after bariatric surgery are, gastric banding; 29-87% for 1-2 follow-up years, 45-72% for 3-6 follow-up years, 14-60% for 7-10 follow-up years, Roux-en gastric bypass; 48-85% for 1-2 follow-up years, 53-77% for 3-6 follow-up years, 25-68% for 7-10 follow-up years, sleeve gastrectomy; 33-58% for 1-2 follow-up years, 66% for 3-6 follow-up years [173] . Selected criteria for bariatric surgery are certified by AACE/TOS/ASMBS Guidelines [173] . Patients with uncontrolled, severe psychiatric illness are excluded. As already discussed above, psychiatric and personality disorders are frequent in obese patients, particularly in morbidly obese patients before bariatric surgery. The procedure needs comprehension of risks, benefits, expected outcomes, alternatives, and lifestyle changes required with bariatric surgery. A psychological assessment is surely required before proposing such intervention. Literature reviews and numerous empirical studies have described significant improvements in psychosocial functioning after bariatric surgery [174] [175] [176] [177] [178] . Patients typically report decreases in symptoms of anxiety and depression and significant improvements in health-related quality of life [179] [180] [181] [182] [183] . Patients also typically report improvements in body image as well as marital and sexual functioning [184] [185] [186] . On the other hand, a negative psychological response to bariatric surgery also has been reported [29, [187] [188] . For some patients, improvements in psychosocial status dissipate 2-3 years postoperatively [196, 197] . Other studies have documented suicides postoperatively [189] [190] . Postoperative eating behavior is also documented. Some patients struggle to adhere to the recommended postoperative eating plan [173] . Among psychological factors improving after surgery, eating disorders have inconsistently been reported to disappear or not, consecutively to bariatric surgery [178, [192] [193] [194] . Bariatric surgery may lead to a physical impossibility of consuming unusually large amounts of food as required by binge eating disorders diagnosis criteria. However, loss of control on eating or grazing (frequently eating relatively small amounts of food) can appear or re-appear after surgery [178] . For that reason, eating behavior should not only be screened before, but also periodically after surgery [195] . Psychological factors assessed in patients before surgery did not have an impact on weight loss 2 years after surgery [178] . Increased caloric consumption above patients' postoperative caloric demands may contribute to suboptimal weight loss or even weight regain, which may begin as early as the second postoperative year [187, 190, [196] [197] . To maintain long-term weight reduction after surgery, combination of the programs focusing on lifestyle modification as for non-bariatric obese patients is important [178, 195] . The changes in energy intake and energy expenditure after bariatric surgery may be affected by alternations in gut and adipocyte hormones [130, 198] . The reduced appetite seen after bariatric surgery has been attributed to changes in gut hormones, such as PYY, ghrelin, and GLP-1 [130] . But it is not clear how these hormonal changes affecting on mental status and the substantial outcome of weight control. A decrease in preference for both of sweet taste and high calorie foods has been demonstrated in animal models. The effect of bariatric surgery on the hedonic system in humans has been consistent with decreased activation of the hedonic system being demonstrated by fMRI and decreased preference for intake of high energy foods also being observed post-surgery [130] . The effect of bariatric surgery on dopamine signaling, which is involved in the hedonic system, is still not clear. Various studies utilizing questionnaires have demonstrated increased satiety and decreased hunger after bariatric surgery [130] . Understanding of the precise physiology of bariatric surgery could pave the way for the design of newer therapies to combat the epidemic of obesity [199] ."}, {"section_title": "Conclusion and future perspectives", "text": "Mental disorder is a critical dimension of obesity. It causes obesity, affects the development of obesity, and results of obesity. It varies among individuals, and does not simply parallel BMI. Evidence suggests a pathophysiologic relevance between obesity and mental disorder. We hypothesize that there is also common vulnerability towards metabolic dysregulation and mental disorder [ Figure 7 ]. Although clinical findings continue to be accumulated, the precise mechanisms remain unclear. A better understanding of how mental function is modulated in the development of obesity, weight reduction, and weight regain should contribute to the development of effective treatments for obesity. In our laboratory, we are going to obtain new findings of \"hunger\" from animal experiments, which will promote new strategy for treatment of obesity and mental disorder complicated with obesity. Figure 7 . Schematic mutual interaction of obesity and mental disorder. The prevalence of cognitive impairment, schizophrenia, depression, and eating disorder increases in obesity. The prevalence of metabolic dysregulation, such as insulin resistance, hypertension, and dyslipidemia, in other words, metabolic syndrome and obesity are often comorbid in mental disorder. These findings speculate that there are mutual interaction between obesity and mental disorder, common vulnerability and treatment possibility towards obesity and mental disorder. "}, {"section_title": "Author details", "text": ""}]