[{"section_title": "Abstract", "text": ", and structural atrophy (imaged by MRI). Recently we published the initial subset of imaging findings for specific regions in a cohort of individuals with autosomal dominant Alzheimer's disease. We now extend this work to include a larger cohort, wholebrain analyses integrating all three imaging modalities, and longitudinal data to examine regional differences in imaging biomarker dynamics. The anatomical distribution of imaging biomarkers is described in relation to estimated years from symptom onset. Autosomal dominant Alzheimer's disease mutation carrier individuals have elevated PiB levels in nearly every cortical region 15 y before the estimated age of onset. Reduced cortical glucose metabolism and cortical thinning in the medial and lateral parietal lobe appeared 10 and 5 y, respectively, before estimated age of onset. Importantly, however, a divergent pattern was observed subcortically. All subcortical gray-matter regions exhibited elevated PiB uptake, but despite this, only the hippocampus showed reduced glucose metabolism. Similarly, atrophy was not observed in the caudate and pallidum despite marked amyloid accumulation. Finally, before hypometabolism, a hypermetabolic phase was identified for some cortical regions, including the precuneus and posterior cingulate. Additional analyses of individuals in which longitudinal data were available suggested that an accelerated appearance of volumetric declines approximately coincides with the onset of the symptomatic phase of the disease.\nneuroimaging | aging | dementia | neurodegeneration | DIAN T he pathological mechanisms underlying nondominantly inherited late onset Alzheimer's disease (LOAD) remain an active area of investigation (1). According to the amyloid cascade hypothesis, the precipitating event in LOAD is an alteration of the balance between production and clearance of the metabolites of amyloid precursor protein (APP) (2). Abnormalities in APP metabolism then lead to β-amyloid (Aβ) deposition in the cerebral cortex, the formation of neurofibrillary tangles (NFTs) containing hyperphosphorylated tau protein, neuronal dysfunction, cell loss, and, ultimately, dementia. In vivo biomarkers of LOAD include cerebrospinal fluid (CSF) Aβ 42 , CSF tau, amyloid deposition imaged with Pittsburgh compound B PET (PiB PET) and other amyloid tracers, altered glucose metabolism imaged with fluro-deoxyglucose PET (FDG PET), and structural atrophy assessed by volumetric MRI. A theoretical model of biomarker changes has been proposed by Jack et al. (3) that links these Significance Beta-amyloid plaque accumulation, glucose hypometabolism, and neuronal atrophy are hallmarks of Alzheimer's disease. However, the regional ordering of these biomarkers prior to dementia remains untested. In a cohort with Alzheimer's disease mutations, we performed an integrated whole-brain analysis of three major imaging techniques: amyloid PET, [\n18 F] fluro-deoxyglucose PET, and structural MRI. We found that most gray-matter structures with amyloid plaques later have hypometabolism followed by atrophy. Critically, however, not all regions lose metabolic function, and not all regions atrophy, even when there is significant amyloid deposition. These regional disparities have important implications for clinical trials of disease-modifying therapies."}, {"section_title": "", "text": "F]fluro-deoxyglucose PET), and structural atrophy (imaged by MRI). Recently we published the initial subset of imaging findings for specific regions in a cohort of individuals with autosomal dominant Alzheimer's disease. We now extend this work to include a larger cohort, wholebrain analyses integrating all three imaging modalities, and longitudinal data to examine regional differences in imaging biomarker dynamics. The anatomical distribution of imaging biomarkers is described in relation to estimated years from symptom onset. Autosomal dominant Alzheimer's disease mutation carrier individuals have elevated PiB levels in nearly every cortical region 15 y before the estimated age of onset. Reduced cortical glucose metabolism and cortical thinning in the medial and lateral parietal lobe appeared 10 and 5 y, respectively, before estimated age of onset. Importantly, however, a divergent pattern was observed subcortically. All subcortical gray-matter regions exhibited elevated PiB uptake, but despite this, only the hippocampus showed reduced glucose metabolism. Similarly, atrophy was not observed in the caudate and pallidum despite marked amyloid accumulation. Finally, before hypometabolism, a hypermetabolic phase was identified for some cortical regions, including the precuneus and posterior cingulate. Additional analyses of individuals in which longitudinal data were available suggested that an accelerated appearance of volumetric declines approximately coincides with the onset of the symptomatic phase of the disease.\nneuroimaging | aging | dementia | neurodegeneration | DIAN T he pathological mechanisms underlying nondominantly inherited late onset Alzheimer's disease (LOAD) remain an active area of investigation (1) . According to the amyloid cascade hypothesis, the precipitating event in LOAD is an alteration of the balance between production and clearance of the metabolites of amyloid precursor protein (APP) (2) . Abnormalities in APP metabolism then lead to β-amyloid (Aβ) deposition in the cerebral cortex, the formation of neurofibrillary tangles (NFTs) containing hyperphosphorylated tau protein, neuronal dysfunction, cell loss, and, ultimately, dementia. In vivo biomarkers of LOAD include cerebrospinal fluid (CSF) Aβ 42 , CSF tau, amyloid deposition imaged with Pittsburgh compound B PET (PiB PET) and other amyloid tracers, altered glucose metabolism imaged with fluro-deoxyglucose PET (FDG PET), and structural atrophy assessed by volumetric MRI. A theoretical model of biomarker changes has been proposed by Jack et al. (3) that links these Significance Beta-amyloid plaque accumulation, glucose hypometabolism, and neuronal atrophy are hallmarks of Alzheimer's disease. However, the regional ordering of these biomarkers prior to dementia remains untested. In a cohort with Alzheimer's disease mutations, we performed an integrated whole-brain analysis of three major imaging techniques: amyloid PET, [ 18 F] fluro-deoxyglucose PET, and structural MRI. We found that most gray-matter structures with amyloid plaques later have hypometabolism followed by atrophy. Critically, however, not all regions lose metabolic function, and not all regions atrophy, even when there is significant amyloid deposition. These regional disparities have important implications for clinical trials of disease-modifying therapies.\nbiomarkers in relation to the amyloid cascade hypothesis. This model has two main predictions. First, each biomarker should exhibit a sigmoidal trajectory characterized by an initial period of little change, then rapid progression and finally a plateau. Second, amyloid markers (CSF Aβ 42 and PiB PET) are predicted to become abnormal first, followed by neurodegenerative markers such as elevated levels of CSF tau and decreased FDG PET, and finally concurrently brain atrophy (volumetric MRI). Cognitive symptoms become evident relatively late in the disease course. Based on this model, the National Institutes of Health (National Institute on Aging) and the Alzheimer's Association have developed guidelines for incorporation of biomarkers into practice and research to support the clinical diagnosis of symptomatic Alzheimer's disease (AD) (defined here as mild cognitive impairment due to AD and AD dementia).\nThere has been relatively little in vivo work examining the temporal order of multiple AD biomarkers within a single cohort (4) (5) (6) . Accurate determination of the temporal order of biomarker changes in LOAD requires long-term longitudinal studies with a large cohort of individuals. In the absence of such data, it is impossible to predict whether an individual will develop symptomatic AD, let alone where they are on a theoretical biomarker timeline. In contrast, autosomal dominant AD (ADAD) caused by mutations in the APP (7), presenilin 1 (PSEN1) (8) , and presenilin 2 (PSEN2) (9) genes has virtually complete penetrance with a predictable age of onset (4) . Within early-onset ADAD families, the parental age of onset tends to be conserved between family members (5, 6, 10) . The preserved age of onset within families is one of the key advantages of studying ADAD, because it allows approximation of how far from symptom onset an individual is at the time of study.\nThe Dominantly Inherited Alzheimer Network (DIAN) has established a large cohort of individuals from families with ADAD mutations (11) . In an initial report from DIAN, Bateman et al. (12) took advantage of the correlation between the parental and actual age of onset within the cohort to estimate the timing and order of all of the major AD biomarkers, including specific examination of PiB and FDG in the precuneus and hippocampal volume in the first 128 participants. Overall, the results are largely consistent with the model proposed by Jack et al. (3) but were limited to testing specific regions in a smaller cohort. Now we greatly expand upon the Bateman et al. (12) report in two distinct ways. First, we examine biomarker trajectories across the entire brain and compare our findings to proposed models of AD. Second, we analyze a subset of participants with longitudinal imaging to gain insight into intraindividual biomarker changes. This study directly integrates the spatial dynamics of all three major imaging biomarkers. To do this, we used the known age of onset within each DIAN family group to estimate where and when pathological changes in amyloid accumulation, glucose metabolism, and atrophy occur across the whole brain."}, {"section_title": "Results", "text": "Biomarker Changes in the Cerebral Cortex. A sample of 229 participants with MRI [noncarriers (NC) = 92, mutation carriers (MC) = 137, from the fourth DIAN Data Freeze] was analyzed (Table 1) , with a subset having PiB (NC = 86, MC = 121) and FDG (NC = 84, MC = 116) imaging. For each vertex on the cortical surface, MCs and NCs were tested for differences in PiB, FDG, and cortical thickness at 5-y estimated years from symptom onset (EYO) intervals from −25 to +10 y (Methods). Differences that were P < 0.01 after correction for multiple comparisons across the brain using a false discovery rate (FDR) (13) of 0.05 were considered statistically significant. The difference in PiB uptake between MCs and NCs reached statistical significance at least 15 y before the estimated age of onset (EAO) (Fig. 1A) . At EAO = −15, amyloid deposition was widespread in MCs throughout the cerebral cortex, with relative initial sparing of entorhinal, precentral, and postcentral cortices that reached statistical significance at approximately EYO = −10 y. Movie S1 shows PiB accumulation from EYO = −25 to EYO = 10.\nUsing FDG PET, differences in regional hypometabolism between carriers and noncarriers were significant (FDR corrected, P < 0.01) 10 y before the onset of symptoms in the precuneus/posterior cingulate and lateral parietal cortex (Fig.  1B) . By EYO = 5, hypometabolism was significant in the middle temporal gyrus and the lateral prefrontal cortex as well. Similar effects appeared in the occipital and medial prefrontal cortices concurrently with the onset of symptoms (i.e., at EYO = 0). Unexpectedly, we found that MCs ∼25 y from their EAO had statistically significantly higher levels of glucose uptake than NCs. Regional hypermetabolism was found in many of the same regions (e.g., lateral parietal cortex precuneus/posterior cingulate) that were hypometabolic later on in the disease ( Fig. S1 and Movie S2). This finding should be interpreted with caution, however, because only 11 subjects with EYO values less than or equal to −25 were analyzed. Furthermore, our analysis assumes both that the brainstem is a stable reference region and that the relationship between EYO and glucose metabolism is approximately linear.\nSignificant (FDR corrected, P < 0.01) cerebral cortical atrophy was not detected until ∼5 y before EAO (Fig. 1C) . Although most extensive in the precuneus, decreased cortical thickness was also found in entorhinal, lateral temporal, and lateral parietal cortices. We also found that at EYO = −5, MCs have greater cortical thickness than NCs in the anterior cingulate cortex (ACC) (Fig. 1C) . Unlike the hypermetabolism found at EYO = −25, these increases in thickness were not transient (Movie S3).\nBiomarker Dissociations in Subcortical Gray Matter. A similar analysis of each biomarker was also performed within subcortical regions of interest (ROIs). Owing to the smaller number of subcortical regions, an FDR corrected P value of 0.05 was considered significant for subcortical regional analysis. MCs showed statistically significant PiB binding in every subcortical region of interest 15 y before the EAO ( Fig. 2A) . However, in contrast to cerebral cortex, subcortical gray matter generally did not exhibit decreased glucose metabolism. Glucose hypometabolism was observed only in the hippocampus, and then not until EYO = 0 (Fig. 2B ). However, MCs showed volume loss in multiple subcortical structures well before symptom onset. Atrophy of accumbens, amygdala, hippocampus, putamen, and thalamus were all statistically significant compared with NCs by EYO = −10 ( Fig. 2C ). However, caudate and pallidum did not exhibit significant volume loss, despite marked PiB uptake.\nRegional Variability in Cross-Sectional Biomarkers. The results presented so far concern the cross-sectional sequence of biomarker changes. We now address regional differences in each biomarker with respect to EYO. To estimate such differences, a linear mixed model compared each regional cross-sectional slope against every other region. Matrices showing FDR corrected P values (thresholded at P < 0.01) for each regional comparison are presented in Figs. S2-S4. For visualization purposes, first-degree locally weighted regression method (LOESS) curves were fit to select cortical and subcortical regions (Fig. 3) . Within ADAD MCs, we observed considerable regional variability in the cross-sectionally estimated slopes of amyloid accumulation ( Fig. 3A and Fig. S2 ). Across all ROIs, the largest PiB slopes were observed in nucleus accumbens, caudate, rostral middle frontal gyrus, and precuneus. The greatest glucose hypometabolism was found in the inferior parietal and supramarginal cortices ( Fig. 3C and Fig. S3 ). Atrophy also was spatially heterogeneous. The greatest cortical thinning was observed in the precuneus ( Fig. 3E and Fig. S4 ); volume loss in subcortical gray matter was significantly greater in both the accumbens and hippocampus in comparison with the thalamus (P < 0.01).\nInitial Estimates of Longitudinal Change. Longitudinal imaging was examined on a subset (MRI = 51, PiB = 31, FDG = 40) of the sample with the goal of examining intraindividual biomarker changes (Table S1 ). For longitudinal analysis participants were placed into one of three groups: NCs, asymptomatic MCs [clinical dementia rating (CDR) 0, indicating cognitive normality], and symptomatic MCs (CDR > 0, indicating cognitive impairment).\nVisually, the cross-sectional trajectories seemed to underestimate individual changes, particularly after the age of onset (Fig. 4 B-D) . Quantitatively, precuneus PiB binding was not statistically significant between noncarriers, asymptomatic carriers (CDR < 0), and symptomatic carriers (CDR > 0), probably because of limited statistical power (Table S2 ). However, we did find that declines in glucose metabolism in the precuneus, precuneus thickness, and hippocampal volume were significantly greater in symptomatic carriers than in noncarriers (P < 0.05, uncorrected). Using an alpha value of 0.05, no statistically significant differences were found between asymptomatic and Fig. 1 . Statistical significance (P value) maps on medial and lateral left cortical gray surface showing differences between carriers and noncarriers in PiB (A), FDG (B), and cortical thickness (C) at −15, −10, −5, and 0 y before predicted symptom onset. Regions with significant (P < 0.01 after correction for multiple comparisons) increases are shown in red/yellow and decreases in blue/cyan. The medial wall was not analyzed. Significant increases in amyloid PiB PET were detected at least 15 y before the estimated age of symptom onset in across the cerebral cortex. Decreased glucose metabolism was detected 10 y before predicted symptom onset using FDG PET, primarly involving the precuenus, posterior cingulate, and lateral parietal lobes. Cortical thinning on MRI was detected ∼5 y before the estimated onset of symptoms, initially in the precuneus and posterior cingulate as well as portions of the occipital lobe and anterior temporal lobe. Results were consistent for both hemispheres for all modalities. , and volume (C) between carriers and noncarriers in subcortical gray matter. Significant increases (FDR corrected P < 0.05) are indicated in red/orange and decreases in blue/cyan. Elevated PiB uptake was detected by EYO = −15 in all of the subcortical gray matter structures. Excluding the pallidum and caudate, all subcortical structures exhibited volumetric decline ten years before the expected age of onset. Metabolic decreases were only seen in the hippocampus, and only after the estimated onset of symptoms. symptomatic carriers. However, declines in hippocampal volume and precuneus thickness were statistically greater in symptomatic carriers than in asymptomatic carriers using a more liberal threshold of threshold of P < 0.10. This result is consistent with the acceleration of changes observed in the qualitative longitudinal analysis."}, {"section_title": "Discussion", "text": "Consistent with the amyloid hypothesis predicted for LOAD, ADAD MCs exhibited increased amyloid deposition, followed by decreased glucose metabolism, and finally atrophy, across many cortical regions. Furthermore, as predicted by Jack et al. (3), we found clear regional effects in biomarker trajectories. For example, hypometabolism was significant first in the posterior cingulate/precuneus and lateral parietal regions before progressing to include the frontal and temporal cortices. This result suggests that there may be a greater temporal lag between amyloid accumulation and metabolic decline in frontal/temporal regions than in parietal regions. It is interesting to note that we found very few regional differences in the timing of amyloid accumulation in this cohort, although total amyloid burden did vary by region. This is consistent with a recent cross-sectional report in another large ADAD cohort (14) . One of the surprising results of our previous work was the finding that volumetric and metabolic changes appeared at approximately the same time in ADAD mutation carriers (12) . This, along with other work, prompted a recent revision to the predominant AD biomarker model to propose that FDG PET and volumetric MRI changes appear concurrently in AD (15) . Critically, our previous study failed to analyze metabolic and volumetric changes within the same region, as was done here. When each biomarker was examined within the same region, the majority of regions followed the predicted path (amyloid accumulation → hypometabolism → atrophy).\nRegional exceptions to the general model (amyloid accumulation → hypometabolism → atrophy) were noted, however. Specifically, in the hippocampus, amyloid accumulation (detected at EYO = −15) was followed first by volume loss (EYO = −10) and then hypometabolism (EYO = 0) (Fig. 2) . We also identified regions that seem to skip one or more of the biomarker stages. For instance, the palladium and caudate did not show either metabolic or volumetric declines, despite markedly elevated PiB uptake (Fig. 2) . Similarly, we did not detect decreases in the thickness of frontal cortical regions, even though MCs had significant levels of amyloid accumulation and hypometabolism in these regions compared with NCs (Fig. 1) . These results indicate that the standard biomarker ordering does not hold in all brain regions. Why some regions with high PiB loads are resistant to metabolic and volumetric decline is unclear. One possibility is that the PiB signal in these regions does not represent plaques with typical neurotoxic effects. For example, neuropathological examinations of the globus pallidus in ADAD cases have reported findings consistent with amyloid angiopathy (16, 17) . Correlations between pathology and imaging are needed to resolve these discrepancies.\nThe regional variability of biomarker trajectories found in this report is consistent with previous neuroimaging results that have identified distinct spatial patterns of amyloid accumulation, hypometabolism, and atrophy (18) , where biomarker effects vary across brain regions (19) . As previously reported (18) , the most commonly affected areas across modalities bear a striking resemblance to the default mode network (20) Furthermore, studies in LOAD have found spreading patterns of atrophy (21, 22) , hypometabolism (23) , and amyloid deposition (24) as a correlate of increasing disease severity. Our results are also consistent with the neuropathological studies that have found differential temporal ordering of the formation of amyloid plaques and neurofibrillary tangles (25, 26) .\nSeveral of our results were unexpected. Our finding of hypermetabolism on FDG PET ∼25 y before symptom onset does not have, to our knowledge, a direct precedent in the neuroimaging literature. Previous studies in presymptomatic AD typically have reported decreased glucose metabolism (27) . However, there have been reports in normal aging (28) and mild cognitive impairment (29) of an association between early PiB uptake and hypermetabolism, albeit of variable focality, as determined by FDG PET. This association has been attributed to compensation for AD pathology (29) . Alternatively, this association has been understood as reflecting the fact that metabolism and Aβ deposition both are driven by neuronal activity (30) . Our data are more consistent with the latter hypothesis, because the hypermetabolic phase occurred before amyloid deposition or atrophy.\nWithout further replication, however, this result should be considered provisional. The small number of participants with FDG imaging and EYO values less or equal to −25 (n = 11) prevent drawing strong conclusions. Future study of even younger individuals with ADAD mutations clearly is needed to determine whether or not this abnormality truly precedes fibrillar Aβ deposition (31) . Furthermore, our decision to use a linear function to model metabolic change may have also affected our results. Given the evident scatter in the data, we chose to use linear models in all our analyses to limit the number of free parameters, despite recent evidence that biomarker trajectories are nonlinear with respect to EYO (32) (33) (34) (35) (36) (37) . Artificial imposition of linearity could have created the appearance of increased glucose metabolism 25 y before EYO. If true, this result would be eliminated by appropriate flattening of the initial portion of the curve, in accordance with extant biomarker models. It is theoretically possible to estimate voxelwise nonlinear biomarker trajectories. However, this would require imposing some form of spatial regularization and the rules by which this should be done are presently unclear. Finally it is possible that changes in the metabolism of our reference region (the brainstem) may be responsible for the apparent hypermetabolic phase in MCs. To adequately address this possibility would require fully quantitative metabolic data, which would necessitate arterial blood sampling and estimation of the arterial input function (AIF). This, however, is an invasive procedure that would be difficult to implement in a multisite study such as DIAN. We are currently investigating noninvasive, MRI-based methods of obtaining the AIF and quantitative PET data (38) .\nWe also cannot currently explain the anomalously high cortical thickness estimates in the anterior cingulate at EYO = 0 (Fig.  1C) . Previous studies have reported alterations in image contrast properties in both aging (39) and AD (40) . Decreases in white matter contrast could create the appearance of an increase in cortical thickness. However, we found had no detectable differences between MCs and NCs in gray, white, or gray/white contrast in the anterior cingulate. We also visually examined the structural images and the FreeSurfer segmentations and did not observe a consistent artifact or segmentation error that could explain this finding. It should be noted that previous studies in aging have reported a positive correlation between age and cortical thickness in the anterior cingulate cortex (41) (42) (43) . Similarly, studies using voxel-based morphometry (44) and manual segmentation (45) have found a preservation of the anterior cingulate in normal aging. One intriguing possibility for these findings is that the ACC is involved in a compensatory response to AD pathology. In support of this hypothesis, recent studies using resting-state functional MRI have reported an increase in functional connectivity between the ACC and other nodes of the salience network (46, 47) . Whether these findings truly represent a compensatory response or are instead reflective of the instinct resistance to AD pathology of the cell types within the ACC is a matter for future work.\nOur study has several limitations. First, the majority of our data are cross-sectional; inferences depend on the assumption that biomarker trajectories are similar across participants. We partially compensated for this limitation by including the available longitudinal data. Additional longitudinal studies are needed to fully describe intraindividual biomarker change. Second, our analysis assumes that the parental age of onset is an accurate estimate of symptomatic onset in the affected offspring. We observed a significant correlation between the actual and parental age of onset in the symptomatic participants but there were several outliers. A predictable effect of uncertainty in EYO would be blunting of features in biomarker trajectory curves, as suggested by the results shown in Fig. 4 . However, the temporal ordering of biomarker differences is less likely to be affected by inaccuracies in EYO, because all of the participants used in this study were drawn from the same cohort. Our results may also be influenced by the inclusion of multiple mutation subtypes. This design has the possible advantage of increasing applicability to ADAD as a whole, but it may well also increase the heterogeneity of our sample. Additional research is needed to assess how biomarker trajectories differ between mutation subtypes.\nThe spatial resolution of PET imaging (∼8 mm isotropic in this study) is an inherent limitation in any study attempting to characterize regional PiB and FDG changes in AD. One of the well-known effects of limited spatial resolution is spillover of the PET signal from nearby tissue types. We chose to use a regionalspread function (RSF)-based approach to partial volume correction (PVC) to minimize such effects. Although this method has been reported to be accurate (48) , it is biased from misregistrations between the PET and MRI data (49) and by inaccurate segmentation of the MRI data (50). Although we did not observe any registration or segmentation errors by visual inspections, it is possible that some still occurred. Regardless of inaccuracies in registration and segmentation, PVC also propagates the noise inherent in the PET image (48) . Therefore, the dissociations we report between amyloid deposition, metabolic dysfunction, and atrophy may be influenced by a PVC-induced decrease in signal-to-noise ratio. To address this possibility, we have included uncorrected versions of Figs. 2-4 in Supporting Information (Figs. S6-S8) . The results were largely the same with and without PVC. The only major difference between two analyses was the presence of significant metabolic declines in the thalamus and caudate without PVC. It is unclear whether these declines are truly biological or are artifacts introduced by partial volume effects.\nIn contrast to prior publications (51, 52), we did not detect caudate atrophy in our ADAD cohort. This discrepancy is possibly attributable to differences in segmentation technique. However, FreeSurfer's segmentation of the caudate has been shown to have a high correspondence with manual tracing (53) , and studies in ADAD cohorts have found caudate atrophy using FreeSurfer (51) . An alternative possibility is that caudate atrophy is not a consistent feature of ADAD, but rather is specific to mutation subtype.\nFinally it is unclear to what extent ADAD and LOAD are pathologically similar entities. PiB binding in the striatum in ADAD is notably greater than that typically seen in LOAD (54) . Similarly, our finding of increased PiB in occipital cortex is not typical of LOAD (17) . However, the neuroimaging literature suggests that otherwise ADAD and LOAD are substantially similar. ADAD and sAD are both associated with elevated cortical PiB uptake, especially in the in the precuneus/posterior cingulate and prefrontal cortex (54) (55) (56) . Reductions in glucose metabolism in the temporal and parietal lobes have also been observed in both diseases (57) (58) (59) (60) . Finally, both LOAD and ADAD have been shown to result in cortical (51, (61) (62) (63) (64) (65) and hippocampal (63, (65) (66) (67) (68) atrophy. Further comparisons of LOAD and ADAD are ongoing as part of the DIAN study.\nOur results still have important implications. Biomarker imaging is increasingly important in clinical trials of potential AD therapeutic agents. These trials will most likely be using imaging and methodical methods similar to those we have used in this study. Published trials of antiamyloid treatments have already used global measures of amyloid deposition as a primary outcome measure (69) . Whereas global measures likely capture a large portion of intraindividual amyloid change, our results suggest that there is potentially useful information in local changes in amyloid deposition. For instance, measuring changes in already affected regions may be a less important disease marker than determining whether or not pathology has spread to later-affected structures. Our results are also consistent with recent studies reporting that combining multiple biomarkers is more informative than examining a single biomarker alone (51, (70) (71) (72) (73) . From a clinical perspective, therapeutically induced decreases in global amyloid load may mean little if metabolic and volumetric declines still are occurring. Conversely, monitoring changes in amyloid PET uptake in regions that do not show any other signs of pathology, such as the palladium and anterior cingulate cortex in this study, may be relatively uninformative. These issues will become increasingly relevant as large-scale, multimodal studies including longitudinal follow-up become more common."}, {"section_title": "Methods", "text": "Participants. Individuals from families with known ADAD mutations were recruited at 11 separate sites as part of the DIAN initiative. All participants with MRI, genetic, and clinical data that passed quality control procedures from the fourth semiannual data cutoff were included in the analysis. Of these participants, 13 with available MRI data were excluded owing to processing failures (n = 9) or excessive pathology (n = 4). After exclusions, a total of 92 NCs and 137 MCs were analyzed (Table 1) . A subset of these participants had analyzable PiB (NC = 84, MC = 116) and FDG (NC = 86, MC = 121) scans (13 PiB and 4 FDG scans were excluded for technical failures). A small number of participants also had serial MRI and PET imaging (Table S1 ). The institutional review board at Washington University provided supervisory review and human studies approval for all study procedures. Each participating institution also obtained local human studies approval. Approvals were obtained from Brown University, Butler Hospital, Columbia University, Edith Cowan University, University of Western Australia, Partners Human Research Committee, Indiana University, University of California Los Angeles, University of Melbourne, Melbourne Health, University of Pittsburgh, University of New South Wales, Neuroscience Research Australia, and University College of London. All participants or their caregivers provided written informed consent approved by their local institutional review board.\nClinical Assessment. Each participant underwent an extensive clinical assessment including a medical history, family history of AD, and physical and neurological examinations. Dementia status was assessed using the CDR (74) . EYO was calculated as the difference between the participant's age at evaluation and the age at which parental cognitive decline began (12) . For the symptomatic MCs in this report, the parental and actual age of onsets were correlated (Pearson correlation coefficient = 0.65, P < 1.4·10\n−07 ). The presence or absence of an ADAD mutation was determined using PCR-based amplification of the appropriate exon followed by Sanger sequencing (12) . Each participant's apolipoprotein E4 (APOE4) genotype was determined using methods described elsewhere (75) . Clinical evaluators were blind to participant mutation status. Unless medically indicated, research data were not shared with the participants.\nMRI. Structural MRI acquisition was performed using the Alzheimer's Disease Neuroimaging Initiative (ADNI) protocol (76, 77) . All participating sites used a 3T scanner and were required to pass initial and regular follow-up quality control assessments to ensure acquisition uniformity. Scans acquired in each participant included accelerated 3D, sagittal T1-weighted images of the head (1.1-× 1.1-× 1.2-mm voxels, approximate scan time 5-6 min). These images were screened for artifacts and protocol compliance by the ADNI Imaging Core before further analysis. Volumetric segmentation and cortical surface reconstruction was performed using FreeSurfer 5.1 (78) . This procedure automatically segments subcortical and cortical structures using a probabilistic atlas. Each voxel in the brain was assigned an anatomical label (53, 79) . Segmented volumes were corrected for intracranial volume using an analysis of covariance approach (80) . For each vertex on the cortical surface, thickness was calculated as the shortest distance from the gray/white boundary to the gray/CSF boundary (81) . To facilitate group analyses, cortical thickness maps were registered to an average cortical surface and geodesically smoothed with a Gaussian 10-mm FWHM kernel. A trained rater visually verified segmentations and surfaces for accuracy. Manual edits were performed when necessary according to the FreeSurfer manual (http://surfer.nmr.mgh.harvard. edu/fswiki/). Each participant's PET data were motion-corrected and registered to his or her MRI (82, 83) . Differences owing to image resolution across scanners were minimized by smoothing PET images to a common resolution of 8 mm isotropic (84) . Using FreeSurfer ROIs, standardized uptake value ratios (SUVRs) were calculated using the brainstem as a reference region. The brainstem was used as the reference tissue as histological studies have found amyloid plaques in the cerebellar cortex of ADAD mutation carriers (85, 86) . The brainstem has been shown to be a reliable reference region for PiB (87) and FDG PET (88) . To minimize the impact of partial volume effects on the PET signal, an RSF-based approach (48) for partial volume correction was used for all regional PET measurements. Versions of Figs. 2-4 without PVC can be found in Supporting Information (Figs. 6S-S8 ). For vertex-wise group analyses, uncorrected SUVR images were sampled halfway between the pial and white surface, transformed to the average cortical surface, and smoothed with a surfaced-based Gaussian 5-mm FWHM kernel.\nStatistical Analysis. Statistical analysis of all cross-sectional ROI and vertexwise measures was performed using the nlme package (89) in R (www. r-project.org) (90) . Carriers and noncarriers were tested for differences as a function of EYO to estimate regional differences in biomarker trajectories using a general linear mixed effects model. Histograms of the EYO distribution for each marker are shown in Fig. S5 . The statistical model included linear terms for mutation status, EYO, and the interaction between mutation status and EYO. Because some participants were recruited from the same family, a random effect of family was added to allow for possible correlations between family members. An analogous model consisting of fixed effects for region, EYO, and the interaction between EYO and region was used to estimate carrier differences in cross-sectional rates of change across brain regions. To account for baseline differences between regions, all regional values were first divided by the noncarrier mean for that region. A random effect for participant nested within family affiliation was used to account for possible correlations within participant as well as within family group. Both models included covariates for age, sex, education, and the presence of absence of an APOE4 allele. All analyses were corrected for multiple comparisons across space using the FDR.\nTo estimate the trajectory of biomarker changes, curves were fit to the cross-sectional data using LOESS regression (91) . Movies of biomarker change as a function of EYO were also computed by fitting a LOESS curve for each vertex on the cortical surface (Movies S1-S3). For all surface-based analyses, a given participant's data were included only if they had a defined (nonzero) value at that vertex. Because there was a small amount of coverage loss throughout the study, a vertex was never analyzed with less than 96% of the available participants. The PySurfer library was used for visualization of all surface-based analyses (http://pysurfer.github.io/) (92) . All other visualizations were created using the ggplot2 package in R (93) .\nThe quantity of longitudinal data precluded a full analysis across the full EYO range. Thus, participants were stratified into one of three groups based on their mutation and cognitive status. Any carrier with a CDR score greater than 0 at their first longitudinal visit was placed into the mutation positive, symptomatic group (MC/S). The remaining carriers were classified as asymptomatic (MC/AS). Finally, all of the noncarriers were grouped together as a control group (NC). To quantify and statistically evaluate the within participant imaging biomarker rate of change over time, general linear mixed models with random intercepts/slopes (94) at the subject level and random intercepts at the family level were used. All general linear mixed models in the longitudinal analysis were estimated using restricted maximum likelihood estimation, with the approximate F-test denominator degrees of freedom based on the method of Kenward and Roger (95) . The model included fixed effects for group membership, time from baseline assessment, and the interaction between group and time. In addition, an unstructured covariance model was used to allow the covariance in each biomarker to vary between MCs and NCs. All longitudinal analysis was performed using SAS version 9.3 (SAS Institute, Inc.)."}]