[{"section_title": "", "text": " 1995-1998 and 1999-2001 "}, {"section_title": "Executive Summary", "text": "The discovery of antimicrobials is one of the most significant achievements of modern medicine and has substantially contributed to a reduction in the burden of common infectious diseases of humans and livestock globally.\nHowever, the widespread use of antimicrobials in human medicine and in agriculture has created selection pressure and fostered the emergence and spread of antimicrobial resistant pathogens worldwide. Resistant microbes and resistance genes can circulate between human, animals, food, water and the environment. Since many antimicrobials commonly used in livestock are the same as or similar to antimicrobials used in human medicine, there is global concern that drug-resistant organisms may pass from animals to humans and present a serious threat to public health.\nIt is of the utmost importance to preserve the efficacy of antimicrobials for future use. It is therefore crucial to fill information gaps about current use and its effects. One major gap relates to data on antimicrobial use in the livestock sector. In food producing animals, antimicrobials are typically used for three purposes: therapeutic reasons (cure a disease), prophylactic reasons (prevent a disease) and as growth promoters (administration of subtherapeutic quantities of antimicrobials to increase animal growth rates and to improve feed efficiency). While some countries have banned the use of antimicrobials as growth promoters others however are still allowing their use. A major goal of the European ban on antimicrobial growth promoters (AGPs) in 2006 was to reduce antibiotic resistance in the pathogens and normal flora of farm animals, thus reducing the risk of transmission of antibiotic resistant bacteria to humans This report focuses on the specific issues of the economic value of (AGPs) to producers and consumers. While the costs of antimicrobial resistance and the potential links between antimicrobial use in livestock and human health consequences are crucial issues for policymakers, this report does not address these issues because of resource and data limitations.\nAssessing the productivity gains of AGPs at a global scale is a tremendous challenge because of the poor quality of data on antimicrobial use outside of a few high-income countries, as well as large uncertainties regarding the impact of AGPs on animal productivity. This report has two objectives. First we estimate and map order of magnitude estimates of the volume of antimicrobials used in the animal industry worldwide in 2010 and the projected values for 2030. A secondary objective is to estimate (at a high level) the economic value of antimicrobial consumption in the livestock industry."}, {"section_title": "The growth response to Antimicrobial Growth Promoters (AGPs) is small in optimised production systems", "text": "In spite of 50 years of antimicrobial use as growth promoters, recent and reliable data on the effect of AGP use on productivity are lacking. There is considerable variability in the growth response to sub-therapeutic antimicrobials, according to the species, the age of animals, their genetic potential, and the specific hygiene and management conditions. While studies conducted before the 1980s reported improvement in the growth rate and feed efficiency of pig, poultry and cattle fed sub-therapeutic antimicrobials as high as 5-15%, studies conducted in the United States, Denmark and Sweden after the 2000s point to more limited effects; less than 1% improvement or not statistically significant improvement, except for nursery pigs in which a 5% improvement in growth rate has been reported recently (Dritz, 2002) . A common explanation is that the growth response to antimicrobials is less important when nutrition, hygiene practices, the genetic potential of animals and health status of the animal herd or flock are optimal. With drastic changes in the animal industry over the last 30 years in the OECD countries, all of these key parameters have changed, potentially explaining the decrease in the efficacy of AGPs."}, {"section_title": "With no major changes in policy, global consumption of antimicrobials is projected to rise by two-thirds by 2030", "text": "In the absence of data on global antimicrobial use in livestock, indirect means were used to estimate consumption for cattle, pigs and chickens raised in both extensive and intensive farming systems in 228 countries. Coefficients of antimicrobial use per kilogram of animal for each type of livestock and for each system were estimated based on data from the European Surveillance of Veterinary Antimicrobial Consumption (ESVAC) and were subsequently applied to high-resolution maps of livestock population densities to predict the geographic distribution of antimicrobial consumption in food producing animals for the years 2010 and 2030. While this approach has its limitations, it nevertheless is helpful in placing an order of magnitude on likely changes in antimicrobial consumption at the global level. Global consumption of antimicrobials in food animal production was estimated at 63,151 (±1,560) tonnes in 2010 and is projected to rise by 67%, to 105,596 (±3,605) tonnes by 2030, with hotspots like India where areas of high consumption (30 kg per km 2 ) for industrial poultry production are expected to grow 312% by 2030."}, {"section_title": "Projected effects of restricting sub-therapeutic antimicrobial use on livestock production globally vary widely", "text": "This report estimated the potential loss of production and meat value following a ban on AGPs 1 for each country in two scenarios: a scenario where the growth response to AGPs is still high (based on growth response data from the 1980s), and a scenario with a low growth response to AGP (based on data from the 2000's). It is projected that the cumulative loss of global meat production resulting from a worldwide ban on AGPs would result in a decrease by 1.3% to 3% from its current level (1980s vs 2000's scenarios), corresponding to a global loss in meat production value between USD 13.5 and USD 44.1 billion in the two scenarios respectively."}, {"section_title": "Introduction", "text": "The discovery of antimicrobials is one of the most significant achievements of modern medicine. During the 20 th century, antimicrobials contributed substantially to a reduction in the burden of common infectious diseases of humans and livestock globally. Antimicrobials contribute indirectly to food security, and protect the livelihood of millions of producers that rely on livestock for subsistence. Antimicrobials are used in various applications including human and animal medicine, food production, plant agriculture and industrial applications. In food producing animals they are typically used for three purposes: therapeutic reasons (cure a disease), prophylactic reasons (prevent a disease) and as growth promoters (sub-therapeutic quantities of antimicrobials increase animal growth rates and improve feed efficiency).\nThe widespread use of antimicrobials in human medicine and in agriculture has created selection pressure and fostered the emergence and spread of antimicrobial resistant pathogens worldwide. Resistant microbes and resistance genes can circulate among humans, animals, food, water and the environment and there is greater awareness of the deep connections between animal and human health. Moreover, trade, travel and migration are carrying resistant organisms globally at an unprecedented pace, and highlight the need for cooperation between countries and sectors for controlling the spread of antimicrobial resistance (WHO, 2014a) . At the Ministerial Conference on Antibiotic Resistance that took place in the Netherlands in June 2014, a global call was made to take action on antimicrobial resistance, acknowledging it as a global threat to effective prevention and treatment of infections (WHO, 2014b) .\nAntibiotics have been used in livestock in sub-therapeutic concentrations (for growth promotion and disease prevention) and in therapeutic concentrations (to treat sick animals). Since many antibiotics commonly used in sub-therapeutic concentrations are the same as or similar to antibiotics used in human medicine, there is global concern that drug-resistant organisms may pass from animals to humans and present a serious threat to public health. The European Commission's Impact Assessment, which accompanied the proposal on veterinary medicinal products on 10 September 2014, 2 stated that \"Indications exist that antimicrobial resistance in animals is transmitted to humans. The importance of animals and of food of animal origin to the emergence, spread and persistence of antimicrobial resistance in humans has not yet been completely established\". This report focuses on the specific issues of the economic value of antimicrobial growth promoters (AGPs) to producers and consumers. If productivity gains from AGPs are large, it would place a higher burden of proof on linking AGPs with antimicrobial resistance in humans. If, however, productivity gains are relatively small, then policy decisions to scale back AGPs could be easier to implement. While productivity gains are relatively small and thus policy decisions to scale back AGPs should not face strong opposition on economic grounds, public and animal health reasons are sufficient reasons alone to reduce AGP use.\nAssessing the productivity gains of AGPs at a global scale is a tremendous challenge because of the poor quality of data on antimicrobial use outside of a few high-income countries, as well as large uncertainties in the impact of AGPs on animal productivity.\nIt is of the utmost importance to preserve the efficacy of antimicrobials for future use. It is therefore crucial to fill information gaps about current use and its effects. One major gap relates to data on antimicrobial use in the livestock sector.\nThe study builds on previous work on mapping livestock and livestock production systems to quantify, at the regional and where possible at the national level, the potential economic benefits of antimicrobials in global farm animal production. Because of data and resource limitations, this paper does not address the costs of antimicrobial resistance or of potential links between antimicrobial use in livestock and human health consequences. These issues are nonetheless crucial for policy makers and should be taken up in future work. The study will enable an evaluation of the potential consequences of scaling back antimicrobial use on farm sector productivity.\nAntimicrobials are used primarily in swine and poultry production in the United States, with limited use in dairy cows, sheep and companion animals. Antimicrobials are also widely used in feedlots cattle: more than 73% of all feedlots administered at least one antimicrobial to cattle in feed for prophylaxis or growth promotion according to a 2011 USDA survey (USDA, 2013). However, the intensive feedlot cattle systems are mainly restricted to the United States, Argentina and Brazil (Millen et al., 2011) . In the rest of the world, intensive livestock operations -where most antibiotics are used for prophylaxis and growth promotionare essentially restricted to pigs and chickens. When looking at the evolution of the meat quantity produced by head by year from the Food and Agricultural Organization's database (FAOSTAT), it appears that use in cattle has not intensified as much as in pigs and chickens from 1961 through 2009 (Figure 1 ).\nBecause very few estimates of antimicrobial use in egg and dairy production could be found in the existing literature these categories of livestock were not treated separately in the present study. All dairy cattle and laying hens were assimilated to meat animals to generate estimates of antimicrobial consumption. A wide range of antimicrobials is used in livestock worldwide. Twenty-seven different antimicrobial classes are used in animals, most of which have human antimicrobial counterparts. Nine of these classes are exclusively used in animals (Page and Gautier, 2012) . The top three antimicrobial classes by sales for animal use in 2009 were: macrolides (USD 0.6 billion), penicillins (USD 0.6 billion) and tetracyclines (USD 0.5 billion), three classes of antimicrobials considered as critically important in human medicine by the WHO Relative increase in the ratio output/input (reference year=1961)"}, {"section_title": "Cattle", "text": "Chicken Pig\nOutput/Input = kg meat produced/number of head (WHO, 2011) . 3 In this report, we will use the term \"antimicrobials\" to refer to a wide range of agents used in animals.\nOur report has two parts. In the first part we estimate and map order of magnitude estimates of the volume of antimicrobials used in the animal industry worldwide. In order to estimate global densities of livestock, we use the Gridded Livestock of the World (GLW) dataset, recently revised for the year 2010 (Wint and Robinson, 2007) , which provides estimates of global population densities of cattle, chicken, ducks and pigs in pixels of 5 km resolution (note that other animals such as fish, turkeys, sheep, goats, etc. are not included in the analysis). The Food and Agriculture Organization of the United Nations (FAO), the International Livestock Research Institute (ILRI) and the Environmental Research Group Oxford (ERGO) developed the dataset over the past decade. The dataset is a grouping of geographic information system (GIS) maps produced in ESRI grid format (raster data storage format). The dataset comprises both observed livestock density maps, collated through accessible sub-national global livestock statistics, and predicted livestock densities, modelled using available administrative-level livestock data and calculated using statistical relationships among various environmental variables of the amount of land suitable for livestock production.\nThe next step is to extrapolate trends in antimicrobial use in agriculture by 2030. We employ a methodology similar to that used by Robinson and Pozzi, (2011) . The increase in demand for livestock products through 2030 extrapolated by estimating food balance sheets for a base year and projecting demand for each commodity using exogenous assumptions of GDP and population growth. Using the projections of the increasing demand for livestock products, we then use the data on estimated antimicrobial usage to map out the trends in antimicrobial use in agriculture through 2030 for different farming management scenarios.\nA secondary objective is to estimate (at a high level) the economic value of antimicrobial consumption in the livestock industry. Multiple studies aimed at estimating the externality associated with the use of antimicrobials suggest that the benefits of increasing hygiene measures for humans and reducing the progressive emergence of resistance associated with inappropriately used or overused antimicrobials outweigh the costs (Kaier and Frank, 2010; Tansarli et al., 2013) . The results of these studies recommend limiting the use of antimicrobials in both human health and animal health, where similar effects are likely to be observed. Previous work also suggests that the loss of production efficiency associated with eliminating the use of AGPs for livestock can be minimal in systems where hygiene, feed and production practices are optimised. Eliminating the use of AGPs is likely to be compensated by improving animal management practices and bio-security (Aarestrup et al., 2001 (Aarestrup et al., , 2010 . Furthermore, improving animal management practices also entail a cost that will be accounted for and weighted against the benefits but these costs will not be part of the current study."}, {"section_title": "3.", "text": "In (WHO, 2012) , tetracycline have been re-categorized as \"highly important\" except in areas of the world where Brucella species are still likely to be transmitted from food production animals, tetracyclines should continue to be classified as \"critically important.\"\nIn this paper a model is developed to estimate the benefits of antimicrobials in terms of increased livestock production (poultry, pig and cattle), with the data on estimated antimicrobial usage. The potential costs associated with antimicrobial resistance will not be discussed at this stage and will be restricted to the monetary costs of AGPs. Benefits and costs will be expressed in 2014 US dollars. Estimating the benefits of increased livestock production due to use of antimicrobials in animal feed is challenging because there are few recent studies that show that antimicrobials add productive value. Moreover, the benefits of antimicrobials for growth promotion and disease prevention have diminished over time with the introduction of modern higher performance, lower disease livestock rearing practices in many parts of the world. We will rely on the limited literature including studies from Denmark on the impact of bans on use of antimicrobials that had previously been authorised will be used to estimate the effect on production costs of withdrawal of sub-therapeutic use."}, {"section_title": "Context for antimicrobial use in agriculture", "text": "The discovery of the beneficial effect of antimicrobials fed in sub-therapeutic concentrations 4 to livestock on hastening their growth was serendipitous (Jukes, 1950; . As early as 1946, Moore et al. showed that inclusion of antimicrobials in the feed of chickens caused increased weight gain . The effect of subtherapeutic levels of antimicrobial feed additives on growth rate and feed efficiency (the rate at which animals convert feed into weight gain) was then reported in many other species such as pigs and cattle (Jukes, 1950; Salinas-Chavira et al., 2009 ).\nThis discovery arrived during the post-war period in the 1950s when farmers in the United States and Europe were struggling to keep pace with an increasing demand for food and animal protein. Antimicrobial use for disease prevention and growth promotion soon became an integral part of a new agricultural production model and feeding programmes. Despite early warnings of the risk of development of resistance (see for example (Starr and Reynolds, 1951) ), the beneficial effect of antimicrobials on livestock productivity-and its potential contribution to the decrease in meat prices in the 1950s (Figure 2 ) -overshadowed the potential risks that were noted. Antimicrobials became a component of a food production system, that was undergoing drastic changes, such as improvement in animal genetics, nutrition, housing, slaughter and processing.\nThe United States Food and Drug Administration (FDA) approved the use of antimicrobials as feed additives without veterinary prescription in 1951 (Jones and Ricke, 2003) . In the 1950s and 1960s, each European state approved the use of antimicrobials in animal feed in its own national regulations. In 1970, the Council directive 70/524 harmonized European regulations concerning additives in feeding stuffs. The directive specifies that if a Member State had detailed grounds for establishing that the use of one of the additives authorised at the Community scale constituted a danger to animal or human health or the environment, it could temporarily suspend the authorisation to use that additive in its territory. Sweden was the first state to prohibit the use in feeding stuffs of antibiotic additives in 1986. Avoparcin was banned in Denmark in 1995 and Germany in 1996 arguing that this glycopeptide antibiotic produces resistance to glycopeptides used in human medicine (Castanon, 2007) . These different national restrictions led to the EU Regulation No. 1831/2003 on additives for use in animal nutrition which stated that \"antibiotics, other than coccidiostats and histomonostats 5 , might be marketed and used as feed additives only until 31 December 2005; as from 1 January 2006, those substances shall be deleted from the Register\" (European Union, 2003) . In the United States, the use of AGPs was not banned, but the FDA recently issued voluntary guidelines for the industry to withdraw the use as growth promoters of medically important antibiotics (US Food and Drug Administration, 2013) . In 2014, the Canadian government published a strategy mimicking the voluntary FDA approach on phasing out AGPs. Some OECD countries have a ban on AGPs (Mexico, South Korea, New Zealand), while AGPs are authorised in other countries (for instance Japan) ( Table 1) . AGPs are not banned in most of the non-OECD countries which are major meat (poultry, pig and cattle) producers, such as China, Brazil, Russia Federation, Argentina, India, Indonesia, Philippines, and South Africa. "}, {"section_title": "5.", "text": "Coccidiostats are substances used to prevent and treat coccidiosis in poultry, a disease caused by protozoa that can cause serious damage to the intestine of the animal. Histomonostats are substances used to prevent and treat histomoniasis, another parasitic infection of chickens and turkeys. Coccidiostats and histomonostats are considered as not inducing resistance to antibiotics used in humans. It was estimated that approximately 1 000 tonnes of antimicrobials were being used annually in animal feeds in 1963 in the United States (Figure 3 ), increasing to over 3 000 tonnes/year in the mid-1980s (Cromwell, 2002) . These figures should however be taken with caution as the data are very weak. In the absence of a surveillance system with a mandatory reporting of quantity used by producers, there is disagreement on the quantity of antimicrobials used in livestock rearing in the United States. The FDA has released aggregated numbers on the annual sales and distribution data obtained from antimicrobial drug sponsors for the years 2009 to 2012. It was estimated that 10 000 tonnes of antimicrobials were sold for use in animals 6 in 2012 in the United States 7 (FDA, 2014). The total quantity of antimicrobial active ingredients sold or distributed for use in food-producing animals increased by 16% between 2009 and 2012. In comparison, 3 290 tonnes of 6.\nFDA data on antimicrobials sold or distributed for use in animals include use in food-producing animals and companion animals.\n7. This figure excludes the sales of ionophores (4 600 tonnes in 2012), a class of antimicrobials used only in veterinary medicine which are not of direct importance to human medicine.\nantimicrobials were sold during 2011 for human use, according to FDA estimates (FDA, 2012).\nA major limitation in the current FDA estimates of antimicrobials sold for use in foodanimals is the absence of stratification by species. In addition, the FDA surveys drug sponsors, and reports their sales and distribution data in the United States. However, sales by drug sponsors to wholesale distributors -who then may export part of the antimicrobials -are counted as sales for animal use in the United States. Sales of veterinary antimicrobial agents in Europe have been monitored according to a standardised protocol since 2010 through the European Surveillance of Veterinary Antimicrobial Consumption (ESVAC). The fourth ESVAC report included 26 EU countriescovering approximately 95% of the food-producing animal population in the EU/EEA areaand reported a total sale of veterinary antimicrobials of 8 000 tonnes. 8 The intensity of antibiotic use in animals (sales data normalised for the animal population) fell overall by 15% between 2010 and 2012 in Europe (ESVAC, 2014) . EU countries within the ESVAC network have different methods to collect data on antimicrobial use in animals: 16 countries obtain data from wholesalers, six from marketing-authorisation holders, and two from pharmacies (ESVAC, 2014) . The next step in the ESVAC project is to collect data on the consumption of antimicrobial agents by species. Four different methods for data collection are considered depending on the existing data collection systems in the various countries: stratification of 8.\nTotal sales of antimicrobials in tonnes of active ingredient, including 64 tonnes of tablets, used in companion animals. 1951 1952 1953 1954 1955 1956 1957 1958 1959 1960 1961 1962 1963 1964 1965 1966 1967 1968 1969 1970 Sales of antibiotics (Million kg) Meat production (Million lbs) Total beef production Total pork production Total poultry production Sales of antibiotic feed additives overall national sales, cross-sectional studies, prospective studies and continuous automated data collection (as it is already the case in Denmark, the Netherlands, and is being developed in Belgium, Finland, Germany and Norway).\nAntimicrobials are used primarily in intensive swine, poultry and feedlot cattle systems, with limited use in dairy cows, sheep and companion animals. Antimicrobial use in plant agriculture accounts for 0.5% of total antimicrobial use in the United States. and is primarily used for controlling a bacterial disease in pome fruits (e.g. apples and pears) (Rezzonico et al., 2009) . Furthermore, the use of antimicrobials in aquaculture in the United States was estimated (with a high degree of uncertainty because of the lack of surveillance) in the range of 92 to 196 tonnes in the mid-1990s (Benbrook, 2002) .\nHowever, the use of AGPs may be declining in some parts of the livestock sector in the United States, driven in part by consumer preferences. Several major companies (including McDonald's, the fast food chain) have mandated the removal of AGPs from broiler production (MacDonald and Wang, 2011) . However, it should be mentioned that the removal of AGPs can be accompanied by an increase use of antimicrobials as prophylaxis (administration of antimicrobial to prevent disease in a group of animals considered to be at risk) or metaphylaxis (mass treatment of animals experiencing any level of disease).In September 2014, Perdue Foods, the third-largest broiler company in the United States 9 , announced that it has removed all antimicrobials from its chicken hatcheries, after phasing-out the use of AGPs in its chicken production in 2007 (Perdue Foods, 2014) . Some estimates indicate that 44% of US broiler production no longer used AGPs in 2006, compared to 2% in 1995 (Chapman and Johnson, 2002; MacDonald and Wang, 2011) . Data from the USDA Agricultural and Resource Management Survey (ARMS) suggest that the use of AGPs in hog production declined between 2004 and 2009. Among farrow-to-finish operations, the use of antimicrobials fed to finishing hogs for growth promotion dropped from 60 to 40% of market hog production between 2004 and 2009, and from 53 to 40% for nursery pigs (Key and McBride, 2014) ."}, {"section_title": "Evidence on growth response to antimicrobial use", "text": "The productivity of major inputs used in food animal production -feed, labour, and capital -can be improved on some operations by feeding antimicrobials. AGP use can have a positive influence on farm productivity through at least two mechanisms -by enhancing the growth rate and feed efficiency of animals (Dibner and Richards, 2005; Hays, 1977; Zimmerman, 1986) and by potentially increasing labour or capital productivity by substituting antimicrobial use for hygiene-management practices in animal housing or transportation (Key and McBride, 2014; MacDonald and Wang, 2011) . Using AGPs could also reduce the variability of products (weight and size), avoiding financial penalties at market for animals outside of range used in mechanised processing (Liu et al., 2003) . It should be noted that countries which banned AGPs assumed that animal health, animal well-being and human health concerns outweighed these growth gains.\nDespite the roughly 60-year history of using AGPs in livestock, the mechanisms for antimicrobial-mediated growth enhancement are not well understood. Possible modes by which antimicrobials improve growth in livestock include: reducing microbial use of nutrients, enhancing uptake and use of nutrients through the thinner intestinal wall associated with antimicrobial-fed animals, preventing disease by inhibiting sub-clinical infections, and reducing growth-depressing microbial metabolites in animals (Dibner and Richards, 2005; Gaskins et al., 2002) . In addition, it has been suggested that AGPs may decrease immunologic stress in the intestinal mucosa (Reti et al., 2013) ."}, {"section_title": "Growth response to the use of sub-therapeutic antibiotics: evidence from animal-level experiments", "text": "The effect of sub-therapeutic levels of antimicrobial feed additives on growth rate and feed efficiency have been reported in many species such as cattle, swine and poultry for over 50 years (Jukes, 1950; Salinas-Chavira et al., 2009) , with important variability in effect sizes among operations. Growth and feed efficiency responses to various antimicrobial additives do not occur in every herd or in every situation within a herd. These variations in response to AGPs between locations and studies were observed early after AGP use started (Braude et al., 1953) . These early observations were confirmed by (Rosen, 1995) who analysed a massive database of more than 4 000 published reports from 55 countries and found coefficients of variation for the effects on weight gain and feed conversion in broilers and pigs of 110-199%, and coefficients of variation up to 705% for the effects on feed consumption.\nIn addition, not all antibiotics results in improved productivity. For instance, chloramphenicol was found to have no growth promoting effect in turkeys and chicks (Branion and Hill, 1951; Whitehill et al., 1950) . Most of the animal-level experimental research on the growth promoting effect of AGPs has been performed within the manufacturing and feed industries, whereas a relatively limited part was performed by independent research bodies (Thomke, 1998) . In addition, most of this research has been conducted before the 2000s, with a very limited number of studies on the growth response to antibiotics in more recent settings. Several reviews on the effect of AGPs in different species have been published over time (Cromwell, 2002; Hays, 1977; Rosen, 1995) , and a summary of the reported effects size of AGP use on growth performance is provided in Table 2 .\nHistorical experiments have demonstrated that production responses to the use of AGPs are reduced when production conditions are optimised (good housing and hygiene, optimal nutrition and health) (Hays, 1970) . Early in the industry of antimicrobials as feed additives, it was noted that the degree of response to AGPs was inversely related to the general well-being of the experimental animals (Coates et al., 1951; Hill et al., 1953; Speer et al., 1950) .Greater antimicrobial responses were demonstrated in \"dirty\" (defined as animals with a high disease load) than in \"clean\" environments, indicating that the growth promoting effect is at least partially the result of the bacteriostatic and bactericidal activity (Zimmerman, 1986) . Greater responses were also shown if the AGPs were included in an inadequate diet (Burroughs, 1959) . Nutritional stress, but also stress associated with relocation (such as movement of feeder pigs) has been associated with greater responses to antimicrobials (Hays, 1970) . Gropp and Schuhmacher, 1998 Source: (Barug et al., 2006; Cromwell, 2002; Dritz et al., 2002; Engster et al., 2002; Gropp and Schuhmacher, 1997; Rogers et al., 1995; Thomke, 1998) . NSS: non statistically significant.\nA meta-analysis of more than 1 000 growth experiments performed in swine between 1950 and 1985 demonstrated that AGPs improved the daily gain (kg) in starter pigs (weighting 7 to 25 kg) by an average of 16.4% and the feed efficiency by 6.9% (Cromwell, 2002) . Antimicrobials were most effective in improving growth in young pigs, but were still effective for older growing and finishing pigs (Table 5) . A hypothesis is that weanling and starter pigs are more susceptible to stress and sub-clinical disease and consequently show a greater response to AGPs (Hays, 1977) .\nAs early as 1977, (Hays, 1977) concluded that \"the magnitude of the response to antibacterial agents varies with stage of life cycle, stage of production and the environmental conditions to which animals are exposed. The response is greater in young animals than in more mature animals. The response is greater during critical stages of production such as weaning, breeding, farrowing or immediately post hatching in chicks and turkeys. Environmental stresses such as inadequate nutrition, crowding, moving and mixing of animals, poor sanitation and high or low temperatures also contribute to increased responses\".\nIn addition to the effects on feed efficiency, inclusion of antimicrobials in swine feed has been found to reduce mortality rate by 50% in young pigs (2.0 vs 4.3%) in trials conducted between 1960 and 1982 (Cromwell, 2002 . AGP use has been associated with reducing time to market in estimates based on experiments from the 1950-1980s, with a gain of 5.1 days (30.3 days with AGP vs 35.9 without) during the starting period (6 to 20 kg) and 5.2 days (121.5 days with AGP vs 126.7 without) during the grow-finish period (20 to 115 kg). From weaning to market, savings in days, feed and reduced mortality have been found to amount to USD 3.69 per pig, which corresponds to an additional net return of USD 2.99 per pig (after subtracting antimicrobial costs of USD 0.70 per pig) (Cromwell, 2002) ."}, {"section_title": "Change in effect size over time", "text": "There has been question about changes in effect size (the standardised difference between two means) over time, especially in a context of increasing levels of resistance among foodanimals. A review comparing results of animal-level experimental studies led between 1950-1977 and 1978-1985 concluded that the overall effectiveness of AGPs did not diminish between the 1950s and the mid-1980s (Zimmerman, 1986 ).\nThere are very few animal level experimental studies conducted after 2000, but the magnitude of the growth response in the published studies is much lower than the changes observed before the 2000s (Table 2) . (Dritz et al., 2002) found that feeding AGP increased growth rate of nursery pigs by 5%, but had no effect on the growth rate and feed efficiency of finishing pigs. (Van Lunen, 2003) found no difference in the daily gain and feed efficiency for pigs supplemented or not with tylosin phosphate. Similar results were recently obtained for broilers. In an experimental study on seven million broilers on two US farms, (Engster et al., 2002) found very limited effects of withdrawing AGPs, with a decrease in average daily gains (ADG) of 0.8% for broilers without AGP compared to broilers supplemented AGP, and an increase in the feed conversion ratio of less than 1%.\nBesides animal level experimental research, interesting information on the growth response to AGPs can be found in animal level and farm level observational research (research based on agricultural surveys), as well as in observational research comparing data before and after a ban on AGPs. Recent studies analysing data from the USDA agricultural resource management survey for broilers (MacDonald and Wang, 2011) and hogs (Key and McBride, 2014) estimated the potential impact of phasing-out AGPs on production by comparing the productivity of operations using AGPs to those that do not. In contrast with animal level experimental research focusing on narrow productivity indicators such as ADG Feed Conversion Ratio or (FCR), these observational studies account for how other facets of production might change in response to AGP restrictions. These studies account for many inputs, reflecting the fact that producers make a number of production decisions regarding various input levels as well as management techniques. When controlling for input levels, operator and farm characteristics, farm production practices and location, AGP use improved output by 1.0% for feeder-to-finish hog producers, a small and statistically insignificant improvement (Key and McBride, 2014) . Similar results were found for broilers, for which suspending AGPs had no statistically significant impact on production given other inputs (MacDonald and Wang, 2011) .\nWhen considering studies conducted after 2000, the literature globally suggests that productivity gains from AGP use in hog production are lower compared with earlier research conducted before 2000 (Figure 4 ). For instance, (Miller, 2003) estimated that AGP use increased average daily weight by 0.5% and feed efficiency by 1.1% -much less than the twodigit improvements reported in the 1980s (Cromwell, 2002) . Recent studies tend to show a small significant growth response to AGPs for nursery pigs, and small response not statistically different from zero in finishing pigs (Dritz et al., 2002; Key and McBride, 2014; McBride et al., 2008) . These findings are primarily based on evidence for feeding and growout stages of hog and poultry production. Evidence for earlier stages is sparse.\nThere are relatively few recent studies on the productivity benefits of AGP use in the poultry industry. Table 3 provides a comparison of three studies on the effects of AGPs on broiler production: one animal-level experimental study of the removal of AGP in two US broiler farms (Engster et al., 2002) , one farm-level observational study based on USDA poultry national survey (MacDonald and Wang, 2011) , and one observational study with data from before and after the ban on AGPs in Denmark . Similarly to what is observed in recent studies on the growth response to AGP in hogs, recent results in poultry suggest limited effect of withdrawing AGP on growth performance (Table 3) .\nFor the broiler industry in Denmark, productivity (defined as kgs of broilers produced/m 2 per grow out) over the 1995-1999 period has not been affected by the ban on AGPs, nor has the mortality rate or the average weight gain ). There was a minor increase in the feed conversion ratio from 1995 to 1999, by 0.016 kg/kg, which represents a less than 1% increase in the feed conversion ratio. An increase of less than 1% of the feed conversion ratio was also observed in the recent study of the effect of withdrawing AGP in two US broiler farms (Engster et al., 2002) (Table 3 ).\nIn the United States, MacDonald and Wang (2011) demonstrated that suspending AGPs has no statistically significant impact on production in broiler grow-out operations, when controlling for other factors that may affect production (labour, capital and other inputs). However, they also demonstrate that growers who do not use AGPs receive statistically significantly higher contract fees compared to AGP users (+2.1%), suggesting higher production costs for growers who do not use AGPs and implement higher cost alternative management practices. Another possible explanation is that a premium price is paid for animal products raised without AGPs.\nIn Denmark, the use of AGPs was banned in finishing pigs in 1998 and in weaning pigs in 2000. The termination of AGPs had no major effect on productivity or feed efficiency in finishers, but resulted in some loss of productivity in weaners (WHO, 2002) (Table 4) . From 1992 to 2008, antimicrobial consumption per kg of pig produced in Denmark decreased by 50% (in spite of an increase in the consumption of therapeutic antimicrobials), while the total production of weaning pigs increased by 47%. Long-term swine productivity improved markedly during the same period, suggesting that the ban on AGP did not negatively impact long term productivity (Aarestrup et al., 2010) . The 2.6% reduction in growth rate of weaners stands in contrast with historical data on increase in growth rate in response to AGPs. According to WHO: \"One possibility was that Danish pig producers reacted to the termination of antimicrobial growth promoters by making other management changes to improve pig health. It is likely that many producers adopted non-antimicrobial production enhancers and/or they altered production systems with such changes as adoption of other feed ingredients, tightening biosecurity, improving sanitation, increasing weaning weights, adopting all-in-all-out pig flow, reducing stocking density, or others\" (WHO, 2002) . Phasingout AGPs does not mean stopping using antimicrobials, as prophylactic and metaphylactic use of antimicrobials can increase in response to a ban on AGPs. Following the ban on AGPs, there was a gradual increase in the therapeutic use of antimicrobials in the Danish swine industry. This led the Danish government to create a new regulation, called the \"yellow card system\", where pig farmers who have the highest consumption of antibiotics per pig produced receive warning letters and financial penalties if they do not decrease their farm's level of antimicrobial consumption. This led to a reduction in antibiotic use for therapy in Denmark of almost 25% between 2010 and 2011 (Aarestrup, 2012) . The data label precise the name of author and date of publication, and the X axis refers to the period when the experiments were conducted. Data at the point X=1953 refer to studies conducted between 1950 and 1956, X=1961 to 1957-1966, X=1972 to 1967-1977, X= 1981 to 1978-1985 . Hays, 1978 Hays, 1978 Hays, 1978 Zimmerman, 1986 Dritz, 2002 Hays, 1978 Hays, 1978 Hays, 1978 Zimmerman, 1986 Miller, 2003 Miller % improvement FCR, Nursery pigs % improvement FCR, Growing-finishing pigs Linear (% improvement FCR, Growing-finishing pigs) Hays, 1978 Hays, 1978 Hays, 1978 Zimmerman, 1986 Dritz, 2002 Hays, 1978 Hays, 1978 Hays, 1978 Zimmerman, 1986 Miller, 2003 Miller, 2005 Dritz, 2002 Van Growers using no AGPs and with HACCP receive 2.1% more fees per kg than growers using AGPs, suggesting higher costs of production in the absence of AGPs. Non-AGP premium that would be paid to growers by integrators: $22.5 million.\nCalculations suggested that savings in the cost of AGPs almost exactly offset the cost of the decreased feed efficiency. Potential substantial costs associated with modifications to the production systems (not evaluated).\nNote: * the baseline value of feed conversion ratio and average weight were not provided in (Engster et al., 2002) . We hypothesised that baseline feed conversion ratio=1.95 and average market live weight=2.27 kg to calculate the percent change in feed conversion ratio and average weight.\nSource: Engster et al., 2002; Graham et al., 2007; MacDonald and Wang, 2011) ; HACCP: Hazard Analysis and Critical Control Point plan.\nThe effect of AGP termination on poultry production in Denmark appears to be small and limited to decreased feed efficiency that is offset, at least in part, by savings of not using AGPs (WHO, 2002) (Table 4) . As producers are likely to change other production practices when they can no longer use AGPs, changes in animal level outcomes before and after the ban on AGPs (as described in Table 4 ) may be attributable both to change in AGP use and other changes in production practices. Source: (Aarestrup et al., 2010; Emborg et al., 2001; WHO, 2002) ."}, {"section_title": "Why could the growth response to antibiotics have diminished over time?", "text": "There are several potential reasons why the magnitude of the growth response to antimicrobials has decreased over the last 30 years."}, {"section_title": "Optimisation of production conditions", "text": "As previously shown, the growth response to antimicrobials is less important when nutrition, hygiene practices, the genetic potential of animals and health status of animal herd and flock are optimal. This optimisation of production conditions include for instance fully enclosed and more tightly constructed housing, improved in-house climate control, expanded biosecurity protocols aimed at wildlife and rodent access, changing clothes and washing for workers, and limited access for outsiders, all-in, all-out production 10 , and feed formulations targeted at stage of production. With drastic changes in the animal industry over the last 30 years in the OECD countries, all of these key parameters have changed, potentially explaining the decrease in the efficacy of antimicrobial feed additives."}, {"section_title": "Increase in the baseline weight gain of animals", "text": "Early experiments concluded that the relative improvement in growth rate resulting from supplementing the diet of pigs with antimicrobials was inversely related to the growth rate of control animals (Braude et al., 1953) . (Melliere et al., 1973) evaluated the relationship between control performance and treatment response in 369 replicates involving 4 890 healthy pigs fed ad lib and corroborated the trend observed by Braude et al. (1953b) twenty years earlier ( Figure 5 ).\nThese high levels of baseline performance are mentioned in recent studies that found limited growth response to AGP (Dritz et al., 2002; Van Lunen, 2003) . (Dritz et al., 2002) concluded that the limited growth response they observed in starting and finishing pigs are thus not necessarily generalizable to the entire US swine population but may be applicable to production units with similar baseline pig performance. The increase in baseline weight over time is illustrated Table 3. 10.\nIn contrast to traditional continuous flow production systems, in all in all out systems, pigs are commingled only with pigs of similar age and weight in order to break the pattern of disease transmission through a herd over time. Facilities are normally cleaned and disinfected thoroughly between groups of animals."}, {"section_title": "THE ECONOMIC COSTS OF WITHDRAWING ANTIMICROBIAL GROWTH PROMOTERS FROM THE LIVESTOCK SECTOR -21", "text": "OECD FOOD, AGRICULTURE AND FISHERIES PAPER N°78 © OECD 2015"}, {"section_title": "Figure 5. Impact of control performance on magnitude of treatment effect", "text": "Source: (Melliere et al., 1973) . (Hays, 1970) , (Zimmerman, 1986) , (Cromwell, 2002) Effect in modern production system, adapted from (Dritz et "}, {"section_title": "-THE ECONOMIC COSTS OF WITHDRAWING ANTIMICROBIAL GROWTH PROMOTERS FROM THE LIVESTOCK SECTOR OECD FOOD, AGRICULTURE AND FISHERIES PAPER N°78 © OECD 2015", "text": "As mentioned by (Barug et al., 2006 ) \"The dependence of response to AGP supplementation on the performance of control animals accounts for the integration of myriad sources of variation associated with nutrition, genotype, environment, management, hygiene and disease exposure. A qualitative description of the impact of changes in control animals is illustrated in Figure 6 . As an example of response types I and II, (Nelson and Scott, 1953) observed that antibiotics failed to stimulate the growth of chicks in the presence of a severe vitamin deficiency, but significantly increased growth when vitamin intake was adequate or marginally suboptimal. Examples of response types IV and V are described in reports by Dritz et al. (2002) , Emborg et al. (2001) and Engster et al. (2002) \". Marginal growth is frequently due to unavailability or poor quality of nutrients, for example in grazing animals during drought. Supplementation with deficient nutrients allows growth to head towards genetic potential."}, {"section_title": "II: Low growth rate of control animals and high level of response to AGPs", "text": "Low growth rates may be associated with low energy or protein content of diet or presence of acute or chronic disease, combined with adverse environmental conditions. Offsetting nutrient deficiency and controlling disease, AGPs allows large responses III: Average growth and efficiency of control animals with large responses to AGPs Good quality diet available, but nutrient demands of flock or herd are not yet optimal for all individuals. Other constraints to production (management, disease and environment) may also be present. Responses to AGPs high when nutrients available improved or disease controlled.\nIV: High performing flocks and herds with significant but diminishing relative improvement with AGP supplements Nutritional needs of maintenance and production are available and disease prevalence is low, however, AGPs enable improved efficiency of nutrient utilization, provide protection from the effects of changes in feed intake and reduce the impact of residual disease."}, {"section_title": "V: Near maximum performance by control animals with little further mass improvement by AGPs", "text": "Rations are closely and continuously matched to individual animal requirements, environmental conditions are optimal and stable and even sub-clinical disease is not present. AGP supplementation may still provide benefits, particularly on an individual animal basis, less at a flock or herd level.\nSource: Barug et al. (2006) ."}, {"section_title": "Increasing level of resistance", "text": "It is also possible that increasing levels of antibiotic resistant bacteria in animals are diminishing the overall effectiveness of AGPs, even if data are still lacking to evaluate this hypothesis. In a study based on the 1995 USDA national swine study, it was found that adding sub-therapeutic doses of chlortetracycline decreased feed efficiency compared with controls (Losinger, 1998) . One proposed explanation was the reported increasing levels of resistance to chlortetracycline in pigs (Langlois et al., 1984) . Increasing levels of resistance among bacteria isolated from food-producing animals and retail meat sources have been reported both by the National Antimicrobial Resistance Monitoring System (NARMS) in the United States (FDA, 2013) and by the EFSA and the ECDC in the European Union (EFSA and ECDC, 2014) . The FDA reported that resistance to third-generation cephalosporins rose among isolates from retail ground turkey between 2008 and 2011 and among certain Salmonella serotypes in cattle between (FDA, 2013 . In the European Union, microbiological resistance to ampicillin, tetracyclines and sulfonamides was commonly detected in Salmonella and Escherichia coli isolates from fowl, pigs, cattle and meat thereof, while microbiological resistance to third-generation cephalosporins was generally low (EFSA and ECDC, 2014) . There is however no study that establishes a link between these increasing levels of resistance and a decrease in the growth response to AGP.\nThe recommended dosage of sub-therapeutic antimicrobials increased over time, from 10-20 g/tonne in the early 1950s to 40-50 g/tonne in the 1970s, and 30-110 g/tonne today (Hays, 1977; Thaler 2010) , but there is no demonstrated relationship with increased resistance levels."}, {"section_title": "Potential switch in the type of molecules used", "text": "Another part of the explanation for the decrease efficacy of AGP over time may be a switch in the type of antimicrobials used as growth promoters. Some authors mention the use of more potent preparations of therapeutical type early in the history of AGP use compared with less potent ones in more recent times (Thomke, 1998) . To the authors' knowledge there is no more recent research on this topic."}, {"section_title": "Global mapping and projections of antimicrobial use in food animals", "text": "This section is based on Van Boeckel et al. (in press ). In the absence of direct measures of antimicrobial consumption for AGP, we use indirect means to estimate consumption (in milligrams of active ingredient per kilogram of animal) for cattle, pigs and chickens raised in both extensive and intensive farming systems in 228 countries. Here we refer to intensive production as high input-high output systems that, compared with extensive systems (backyard production), achieve greater economies of scale and efficiency while also possibly employing mechanised labour, operating with high animal densities, and using specialised breeds with rapid weight gain and high feed conversion ratios. We calculated coefficients of antibiotic use per kilogram of animal for each type of livestock and for each system. These coefficients were subsequently applied to high-resolution maps of livestock population densities to predict the geographic distribution of antimicrobial consumption in food producing animals for the years 2010 and 2030. Two modelling choices have been made and detailed in the following methodology section. First we assumed -for simplicity and reproducibility across countries -that animal production is carried out as extensive or intensive production. This dichotomy is relatively well documented for poultry and pig production in Asia ( Van Boeckel et al., 2011; Gilbert et al., in press ). We further assumed that antibiotic consumption in extensive settings was inferior to intensive production by a factor 0.5 to 0.05. The resulting antibiotic consumption was subjected to a Monte Carlo Simulation to evaluate its sensitivity. The second modelling choice stated in the methodology section (paragraph 53) is that the proportion of animals raised in intensive farms was projected based on the gross domestic product (GDP) at purchasing power parity (PPP) per capita because these two variables have been shown to be strongly associated (Gilbert et al., in press )."}, {"section_title": "Methodology", "text": "Data on antimicrobial consumption in food animals were obtained from government veterinary agencies, agricultural ministries, scientific reports and publications and personal communication with academic researchers (see Annex I, Van Boeckel, in press ). We assumed that antimicrobial consumption in chickens, cattle and pigs represents the majority of antimicrobial consumption in food-producing animals. When data could not be obtained for the reference year 2010, the antimicrobial estimates obtained for another year were adjusted using the ratio of overall antimicrobial consumption between 2010 and the corresponding year. Estimates of total antimicrobial consumption could be obtained for 32 countries, including 28 member states and one candidate-OECD countries (Latvia) as well as for Cyprus 11 , Lithuania and Bulgaria.\nTo calculate estimates of antimicrobial consumption per population correction unit (PCU) 12 that could be applied at the pixel level to generate total antimicrobial consumption maps, we estimated national PCUs as a function of the number of living animals and the number of yearly production cycle for each animal. All source data were extracted from FAOSTAT.\nAntimicrobial consumption per PCU for each type of livestock in both extensive and intensive systems was estimated for each species. To calculate estimates of antimicrobial consumption per PCU that could be applied at the pixel level to generate total antimicrobial consumption maps, we estimated national PCUs as a function of the number of living animals. Thus, total PCUs in a country or a pixel for livestock type in the production system were defined as follows:\nwhere is the number of living animals, , is the number of production cycles in each production system (extensive or intensive), Y is the quantity of meat per animal (carcass weight) obtained for each country from FAOSTAT, and is the killing-out percentage (or dressing percentage) -that is, the ratio of carcass weight to live weight -obtained from 11."}, {"section_title": "Note by Turkey:", "text": "The information in this document with reference to \"Cyprus\" relates to the southern part of the Island. There is no single authority representing both Turkish and Greek Cypriot people on the Island. Turkey recognises the Turkish Republic of Northern Cyprus (TRNC). Until a lasting and equitable solution is found within the context of the United Nations, Turkey shall preserve its position concerning the \"Cyprus issue.\""}, {"section_title": "Note by all the European Union Member States of the OECD and the European Union:", "text": "The Republic of Cyprus is recognised by all members of the United Nations with the exception of Turkey. The information in this document relates to the area under the effective control of the Government of the Republic of Cyprus."}, {"section_title": "12.", "text": "PCUs are used to compare population and production of different types of livestock across countries and correspond to one kilogram of living or slaughtered animal. It should be noted that the PCU used in this model does not exactly correspond to the PCU used in the ESVAC reports.\nliterature estimates (Warriss, 2010) . The last term of this equation can be interpreted as the animal weight reconstructed from country-specific productivity figures. To reflect differences in productivity, distinct values were used for the number of production cycles in extensive ( , ) and intensive production systems ( , ). Working under the assumption that extensive farming represents the bulk of livestock production in low-income countries, , was estimated from the median number of production cycles in the quartile of countries characterized by the lowest GDP per capita (World Bank estimates). This value was considered identical in all countries on the basis that backyard productivity displays little variability across low-income countries (the ratio of standard deviation to the mean in the lower GDP per capita quartile was 0.65 for cattle, 0.44 for chickens and 0.91 for pigs). The number of production cycles in intensive systems was calculated by imputation as\n, where is the total number of animal slaughtered in 2010.\nA Bayesian linear regression model was fitted to the total consumption of antimicrobials to estimate consumption per PCU for each type of livestock in intensive production systems in 37 countries (all OECD countries except the United States and the four candidate-OECD countries). In order to yield conservative estimates of antimicrobial consumption, the United States was excluded from the training set since it is known to have uncharacteristically high consumption rates of antimicrobials compared to other OECD countries. The ESVAC data used do not included ionophores. Details of the statistical procedure can be found in Van Boeckel et al. (in press ). Predictions were subsequently mapped at the pixel level and projected for the year 2030 using spatially explicit projection for future consumption trends from Robinson and Pozzi (2011) . The respective proportions of animals raised in extensive and intensive production systems was estimated based on GDP per capita projections from the IMF (Gilbert et al., in press)."}, {"section_title": "Results", "text": "Global consumption of antimicrobials in food animal production was estimated at 63 151 (±1 560) tonnes in 2010 and is projected to rise by 67%, to 105 596 (±3,605) tonnes, by 2030. Two thirds (66%) of the global increase in antimicrobial consumption is due to the growing number of animals raised for food production. However, the remaining third, (34%) of this increase is imputable to a shift in farming practices with a larger proportion of animals projected to be raised in intensive farming systems by 2030. In Asia alone, as much as 46% of the increase in antimicrobial consumption by 2030 is imputable to shifts in production systems. By 2030, antimicrobial consumption in Asia is projected to be 51 851 tonnes, representing 82% of the current global antimicrobial consumption in 2010.\nIn 2010, the five countries with the largest shares of global antimicrobial consumption in food animal production were China (23%), the United States (13%), Brazil (9%), India (3%) and Germany (3%). By 2030, this ranking is projected to be China (30%), the United States (10%), Brazil (8%), India (4%) and Mexico (2%). Among the 50 countries with the largest amounts of antimicrobials used in livestock in 2010, the five countries with the greatest projected percentage increases in antimicrobial consumption by 2030 will be Myanmar (205%), Indonesia (202%), Nigeria (163%), Peru (160%) and Viet Nam (157%). Together, the BRICS will experience a 99% growth in antimicrobial consumption by 2030, whereas their human population is only expected to grow by 13% over the same period (World Bank).\nThe posterior distribution for the coefficients of antimicrobial use per PCU (see Methodology) in intensive production systems used to generate these global estimates is presented in Van Boeckel et al. (in press ). The mean of the posterior for antimicrobial consumption in cattle was generally lower (45 mg/PCU) than for chickens (148 mg/PCU) and pigs (172 mg/PCU) -a result consistent with previous literature indicating that chicken and pig production systems tend to use more antibiotics than cattle production (Silbergeld et al., 2008) .\nHotspots of antimicrobial consumption were found in regions associated with industrial pig and poultry production. In South and East Asia, these geographical hotspots include the southeast coast, Guangdong and Sichuan provinces in China, the Red River delta in Viet Nam, the northern suburbs of Bangkok, and the south coast of India and the cities of Mumbai and Delhi. In the Americas, the highest consumption of antimicrobials was observed in the south of Brazil, the suburbs of Mexico City, and mid-western and southern United States. In Asia, we estimated the geographic expansion of antimicrobial consumption by 2030 for chickens and pigs. Both sectors will experience major growth in antimicrobial consumption -129% and 124%, respectively by 2030 -throughout the entire Asian continent. However, the total acreage of areas where antimicrobial consumption is currently greater than 30 kg per km 2 will grow by 4% for pork and 143% for chicken. This has potentially important logistical implications for surveillance programs to track the emergence of antimicrobialresistant bacteria over larger portions of land. The extreme growth in consumption in the poultry industry is primarily the result of the expansion of this sector in India alone, where areas of high consumption (30 kg per km 2 ) are expected to grow 312% by 2030. These results show that excessive antimicrobial consumption will become a more global, if not uniform, problem in the coming years and consequently a concern for all.\nTaking into account that the risk of AMR grows in proportion to the amount and frequency of antimicrobial use, these findings support the need to intensify international collaboration to address AMR health threat."}, {"section_title": "Projected effect of restricting sub-therapeutic antimicrobial use on livestock production globally", "text": "For each type of livestock we hypothesize that animals raised with or without AGPs were slaughtered after an identical number of days but that animals raised without AGPs reached a comparatively smaller market weight. Under that assumption, the differential in average daily growth (ADG) between animals raised with or without AGPs represents a valid approximation of the fraction of the meat lost over the life duration of an animal compared to an animal raised with AGPs. Estimates of the cumulative PCU (see previous section) were revised to reflect a global ban on AGPs according to this ratio. Estimate of cumulative PCU over the course of a year were left unchanged in countries currently subject to a ban on AGP. We used two sets of species-specific values of ADG to project these estimates: on one hand a set of values obtained from the 1980 literature (Table 2) which provide an upper bound on the estimate of the loss associated with a global AGP ban. On the other hand we also extrapolated relative ADG values for chickens, cattle and pigs, from the more recent but more seldom literature from the 2000 on antibiotic efficacy. The two sets of values used are summarised in Table 6 . For the pig sector this recent literature includes estimates for relative ADG of 5% for nursery pigs, and no statistically significant effect for finishing pigs (Dritz et al., 2002; McBride et al., 2008) . Recent estimates indicate that antimicrobials increase hog output by about 1% in feeder pig-to-finish operations (Key and McBride, 2014) .\nFor cattle, the relative ADG values of 4.6% were taken from (Rogers et al., 1995) . For chickens, this is to the authors' knowledge the only recent animal level study of the effects of sub-therapeutic antibiotics on growth performance (Engster, 2002) . This study reported on a series of controlled trials that compared production outcome in 158 paired houses in two farms in the United States. There was a slight decrease in the average weight of birds in the AGP-free group compared with the AGP group. The study reported only differences in means between the two groups, but did not provide data on the final weight of animals. We used estimates from Graham, 2007 to calculate the percent change in ADG. Considering an average market live weight of 2.27 kg/chicken, the ADG decreased by 0.8% in the AGP-free group compared with the AGP group. These recent values of relative ADG represent a conservative and in all likelihood more realistic estimate of the effect of a ban on AGPs for OECD member states where the added value of AGPs to productivity been shown to provide marginal gains given the modern nature of other production factors such as improved hygiene measure, access to efficient breeds, improved feeds etc. Table 7 presents the estimates of the potential loss of production and meat value for each country in the high growth response scenario (1980s data) and the low growth response scenario (data from the 2000s). In this model, we do not consider any price adjustment to the change in supply. We project that the cumulative loss of global PCU resulting from a worldwide ban on AGPs would result in a decrease by 3% to 1.3% from its current level (1980s vs 2000s scenarios). Under the 1980s scenario projecting these values to the global annual meat production, we estimate a loss of 9.52 million tonnes of meat, a figure comparable to the annual meat production of Germany or the Russian Federation. Under the more realistic scenario using literature data from the 2000s which best characterise production associated with AGPs in developed countries, this global figure shrinks to 2.68 million tonnes, a value comparable with the meat production of a single country such as Poland or Australia. Along with evaluating the loss in production resulting from a potential withdrawal of AGPs, we have carried out a valuation of its potential cost using national producers' price. Meat prices in tonnes per live weight were obtained from FAOSTAT for the year 2012. Prices were respectively available in 64 countries for cattle, in 59 countries for chickens and in 59 countries for pigs. The median value of these distributions was used when producer's price could not be obtained from FAOSTAT.\nUsing ADG values corresponding to the scenarios of the 2000s and 1980s, we estimate the value associated with the global loss in meat production to range between USD 13.5 and USD 44.1 billion respectively. "}, {"section_title": "Economic value of antimicrobial consumption in the livestock industry", "text": "Food animal producers have different types of incentives to use AGPs, including improved animal performance and overall health, improved profits and reduced production risks. Table 8 summarises the potential economic effects (costs and benefits) of withdrawing AGPs at the animal, farm and market levels.\nRecent estimates of the potential economic impact of a ban on AGPs are limited and restricted to a few countries (United States, some EU countries).\nSeveral studies have sought to estimate the potential economic impact of a ban on AGPs in the US swine industry, with large differences in the estimations of increased costs per pig: USD 0.59/pig, a 9% decrease in net profits (Miller, 2003) , USD 1.37/pig (Miller et al., 2005) , USD 2.33/pig, a 2% increase in production costs (B. Wade Brorsen, 2002) , USD 4.50/pig in the first year, a 4.5% increase in production costs (Hayes and Jensen, 2003) .\nIn Denmark, the economic impact of the AGP termination on the pig producer has been highly variable. Some of the costs (e.g. increased therapeutic antimicrobials, reduced growth rate) have been measured and were not large, but others, especially some costs associated with modifications of the production system, are difficult to measure and have not been included in the economic calculations, although they may have been substantial for some producers (Kjeldsen and Callesen, 2006; WHO, 2002 ). An evaluation conducted by a WHO panel on the impacts of AGP termination in Denmark, which has an export-oriented, marketdriven and intensive production system, estimated the net increase in costs associated with removing AGPs at EUR 1.04 per pig produced and zero for poultry (WHO, 2002) . The details of the evaluated costs are provided in Table 9 .\nThis translates into an increase in pig production costs of just over 1%. Results from using a general equilibrium model of the Danish economy suggest that, as a result of this change in costs, pig production would be around 1.4% per annum lower than might be expected and poultry production 0.4% per annum higher 13 due to termination of AGPs. There was no obvious effect of the AGP ban on pig meat prices in Denmark in the years following the ban (WHO, 2002). "}, {"section_title": "13.", "text": "This result is because poultry production is a competitor to pig production both for inputs and consumption and so indirectly benefits from lower pig production."}, {"section_title": "Potential costs Potential benefits", "text": "Potential animal-level effects (Sneeringer, 2014) . Source: Adapted from (Kjeldsen and Callesen, 2006) .\nIn an economic analysis based on the Engster data, (Graham et al., 2007) estimated that the net effect of using AGPs was a loss of USD 0.0093 per chicken, the savings in the costs of AGPs more than compensating the decrease in production. It should however be noted that this economic analysis does not include potential veterinary cost changes or costs related to the increased variability in the weight of broiler chickens. Additionally, the added production was valued according to the fees paid to growers, which underestimates of the value of birds to the integrator.\nRecent estimates of the market-level effects of a ban on AGPs in the US hog and broiler production by the USDA also indicate limited effects (Sneeringer, 2014) . The USDA estimated that the quantity produced would, at most, decrease by 1.12% in the broiler industry and by 1.08% in the hog industry (in a scenario with a 3% reduction in supply from limiting AGPs). The consequent increase in wholesale price would range from less than 1% to at most 2.6%. The total value of production would increase (+0.54% for hogs and +1.45% for broilers under the 3% reduction in supply scenario), with a gain in value of production for producers not using AGPs before the ban, and a potential loss or gain for producers using AGPs before the ban, depending on assumptions. Since farmers receive about one-third of the retail value of pork, consumers would likely see even smaller changes in price. These results are longterm effects, thus there could be some negative short-term effects as was the case in Denmark after the ban.\nIn the Danish case study of the effects of a ban on AGPs, as well as in the recent estimates from the USDA, it appears that phasing out AGPs would result in very small market effects. In the Danish case, there was some short term decrease in productivity in young pigs, but the long term productivity and profitability of the livestock industry actually increased after the ban.\nHowever, such limited economic effects of phasing out AGPs may not be applicable in every country or every operation within a country. As described by several authors (McBride, 2008, MacDonald and Wang, 2011) , a ban on AGPs in the United States would impact producers differentially, according to location, farm size, contracting arrangements, production practices, etc. The differential effect of a ban according to different management variables and health and sanitation practices has also been highlighted in studies describing the Swedish experience of the AGP ban in 1986 (Wierup, 2001) . It is likely that the recent results showing limited productivity and economic effects are applicable to operations which already have good hygiene and production practices, but not to operations with lower standards. One of the major current benefits from AGP use may be its effect on maintaining animal health in older facilities where animals are more densely crowded and hygiene management is less efficient. It was recently demonstrated that farms that produce broilers with AGPs in the United States tend to have older houses, with less modern equipment, and are less likely to follow an HACCP plan 14 (management of food safety hazards) (MacDonald and Wang, 2011) . (Laanen et al., 2013) demonstrated that improved biosecurity in pig herds might help in reducing the amount of antimicrobials used prophylactically and is positively associated with daily weight gain.\nTo our knowledge, there are no published estimates of the potential cost of investing in more biosecurity measures and production systems with optimised hygiene conditions. Neither are there estimates of the potential benefits of investing in such systems, which are likely to decrease the transmission of all diseases, including diseases which are not prevented by antimicrobials (e.g. viral diseases, respiratory tracts infections). Such investment costs and benefits from moving towards systems with better hygiene management are potentially significant (WHO, 2002; Wierup, 2001) .\nIt is likely that countries which have modern production systems applying good hygiene and production practices would also see limited productivity and economic effect of phasing out AGPs (scenario \"2000-low growth response\" in part 5). However, countries with less optimized production systems could observe larger productivity effects (scenario \"1980s-high growth response\") and as a consequence larger economic effects."}, {"section_title": "Discussion", "text": "In spite of 50 years of AGP use, definitive conclusions on their effects on productivity are still lacking. There is considerable variability in the growth response to sub-therapeutic antibiotics, according to the species, the age of animals, their genetic potential, and the specific hygiene and management conditions. Phasing out AGPs in the United States and elsewhere would probably have very different effects among different producers, as it was observed in Sweden after the ban of AGPs which mainly affected producers with lower hygiene standards (Wierup, 2001 ).\nThere are several important limitations in the estimates we produced of the global loss of productivity following AGP withdrawal. In the values we used for the improvement of average daily growth with AGPs, we were not able to apply different values for the different stages of pig production (starting, growing, and growing-finishing phases). We used data from the intermediate stage (growing pigs) as a proxy for the average daily gain (ADG) in pork production. Our estimates of the loss of production in the absence of AGPs only take into account the effect on the average daily growth, but we did not take into account the potential reduction in mortality rates associated with AGP use. We also did not consider the effect of AGPs on the improvement of feed efficiency an economically important parameter -because our simple model did not allow evaluating the effects of AGP removal on feed markets. We hypothesised that the market weight of animals would decrease, when in fact the most likely response by farmer would be a longer time to market. Finally, in an attempt to determine the upper and lower bounds of potential effects on global production loss, we applied data on the growth response to AGPs from the 1980s to the intensive production systems in all countries (upper bound) and recent data showing more limited growth response to AGPs (lower bound). Data consistently show that the growth response to antibiotics is higher when production conditions and hygiene practices are not optimised. It would then probably be more appropriate to apply lower growth response coefficients to countries with more optimized production systems, like the United States or Canada, and to apply higher growth response coefficients to countries with intensive production systems which have not yet been optimised (e.g. China, India, etc.).\nBased on the Danish case study and recent studies in the US livestock industry, it seems possible to maintain production results in the absence of AGPs in both the swine and poultry industries conditional on other disease prevention measures being implemented while AGPs are being phased out. An array of strategies can be used in animal production to prevent and control disease: vaccination, segregation of herds or flocks by age, sanitary protocols and ventilation systems, adjustment in feed rations and physical biosecurity measures.\nThe use of antibiotics should principally be the last resort rather than a substitute for these methods (Wierup, 2001 ). Antibiotics are not needed to promote growth, but they are essential to treat infectious disease and maintain animal health. In a context where it is probable that antibiotic classes placed on the market in the future will not reach veterinary medicine, it is in the best interest of food animal producers to preserve the effectiveness of existing veterinary antibiotics through antibiotic stewardship (Bengtsson and Greko, 2014) .\nThe implementation of such management and hygiene practices will incur costs, which could lead to an increase in production costs that would likely impact wholesale meat prices. However, the final impact on prices for consumers would -in the United States at least -be minimal considering wholesale price is only a portion of retail price. Such investment costs are difficult to evaluate, as well as the potential indirect benefits on the prevention of a wide range of infectious diseases (e.g. viral respiratory tract infections) and long term improvement of the overall health status of the animals.\nFurther studies should focus on the potential benefits related to a ban on AGPs, including benefits that arise from improved livestock management. Identification of measures to reduce the scale of antimicrobial consumption at the global level and evaluation of the effectiveness of these measures in reducing global antimicrobial consumption could be considered as a topic for future analysis."}]