[{"section_title": "Abstract", "text": "Data on the relationship between empirical dietary patterns and metabolic syndrome (MetS) and its components in prospective study designs are limited. In addition, demographic and lifestyle determinants of MetS may modify the association between dietary patterns and the syndrome. We prospectively examined the relationship between empirically derived patterns and MetS and MetS components among 1146 women in the Framingham Offspring/Spouse cohort. They were aged 25-77 y with BMI $18.5 kg/m 2 and free of cardiovascular disease, diabetes, cancer, and MetS at baseline, and followed for a mean of 7 y. Five dietary patterns, Heart Healthier, Lighter Eating, Wine and Moderate Eating, Higher Fat, and Empty Calorie, were previously identified using cluster analysis from food intake collected using a FFQ. After adjusting for Moderate Eating patterns showed an inverse association with abdominal obesity; certain foods might be targeted in these habitual patterns to achieve optimal dietary patterns for MetS prevention."}, {"section_title": "Introduction", "text": "The prevalence of metabolic syndrome (MetS) 12 , a multiplex of cardiometabolic risk factors that includes abdominal obesity, elevated blood pressure, hyperglycemia, low HDL-cholesterol, and hypertriglyceridemia, increased among U.S. women by 9% from 23% in 1988-1994 to 32% in 2003-2006 (1-3) . MetS significantly increases the risk for cardiovascular disease (CVD) and type 2 diabetes mellitus (T2DM) (1, 4, 5) . Among women in the Framingham Offspring-Spouse Study, the syndrome has been associated with a 2-fold risk for CVD and a 7-fold risk for T2DM over an 8-y period (6) .\nPreventive guidelines for MetS primarily target individual MetS risk factors (7) (8) (9) . Several foods/nutrients have been shown to influence more than one component of MetS. For instance, soft drinks may increase the risk for abdominal obesity, hypertension, hyperglycemia, low HDL-cholesterol, and hypertriglyceridemia (10) ; and fiber has an inverse association with abdominal obesity, hypertension, and hyperglycemia (11) . MUFA and PUFA have been shown to improve HDL-cholesterol and hypertriglyceridemia (12) . The dietary pattern approach, which may better inform the holistic effect of diet on health outcomes, is thus suitable for examining associations between diet and overall MetS (13) .\nDietary quality indices in both cross-sectional (14) (15) (16) and prospective (17) (18) (19) (20) studies have shown an association with MetS and its components. In a variety of populations, including Framingham, higher diet quality characterized by greater intake of low-glycemic index foods, vegetables, fruits, nuts, fish, poultry, and vegetable oil as well as moderate alcohol consumption have been shown to confer lower risk for MetS (14) (15) (16) (17) (18) and MetS components (17, 18) . The association between empirical patterns and MetS and its risk factors has also been examined, mainly in cross-sectional studies. A Healthy/Prudent pattern that is comparable in intake with higher diet quality similarly lowers risk for MetS (21) (22) (23) (24) and its components (24) (25) (26) . By contrast, dietary patterns characterized by high intakes of refined grains, processed and red meats, trans fat, sweetened beverages, and soft drinks such as the Western and similar patterns increase the risk for MetS (21, 22) and its components (21) (22) (23) (24) (25) (26) . In the Framingham Nutrition Studies (FNS), the Empty Calorie pattern was associated with a higher prevalence of MetS (27) . However, in another recent population-based prospective study, the Prudent pattern, which is similar to the Heart Healthier pattern in the FNS, was not significantly associated with the syndrome (28) .\nIn our previous analyses of the FNS cohort, cigarette smoking modified the association of womenÕs dietary patterns and carotid atherosclerosis (29) . Former smoking status likewise modified the relationship between diet quality and weight change in FNS women (30) . However, to our knowledge, no data on cigarette smoking as a potential effect modifier on the association of dietary patterns and MetS are available.\nIn the present study, we prospectively assessed the relationship between dietary patterns and MetS and MetS risk factors among FNS women over a mean follow-up duration of 7 y. We hypothesized that the Heart Healthier pattern would have a lower risk for MetS and/or MetS components and the association would be stronger among nonsmokers."}, {"section_title": "Participants and Methods", "text": ""}, {"section_title": "Study population", "text": "Design and recruitment strategies for the offspring cohort of the Framingham Heart Study (FHS) have been described elsewhere. Since 1948, the FHS has investigated risk factors for CVD and, more recently, other health problems among residents of Framingham, Massachusetts (31) . In 1971, a second-generation cohort, the Framingham OffspringSpouse Study (FOS), was recruited and comprised 5124 FHS offspring and their spouses (2483 men and 2641 women) (32) .\nAbout every 4 y, FOS cohort members participate in standardized medical assessments including a complete physical exam, laboratory tests, noninvasive diagnostic testing, and updating of clinical information (32) . At FOS exam 3 (1984-1987) , the cohortÕs dietary intake was comprehensively examined and characterized as the FNS. These participants completed both the Framingham FFQ and a single, 24-h recall; 70% also completed the 3-d dietary records (33, 34) . Of the 1828 women participants with complete FFQ data, 1666 (91%) aged 25-77 y with BMI $18.5 kg/ m 2 attended exam 4 (1987-1990) . Some 1591 of these women (95%) additionally attended exams 5 and 6 (1996-1997) . The study sample for the present study was comprised of 1146 women (72%) who had complete covariate data; were free of CVD, diabetes mellitus, cancer, and MetS; and attended exams 4 through 6.\nBoston University Medical CenterÕs Human Participants Institutional Review Board approved the study protocol and all participants provided written informed consent."}, {"section_title": "Dietary patterns", "text": "Identification of the FNS womenÕs dietary patterns, their validation, and the cluster analysis technique were previously published (33) (34) (35) . In brief, the 145 FFQ items were classified into 42 nutrient-based categories that were consistent with the subgroups of foods found in the American Dietetic Association Exchange List for Meal Planning such as lower fat (3-6 g of fat/28 g) and higher fat ($7 g of fat/28 g) meats and substitutes. Food items in a specific food category were similar in nutrient content; for instance, all vitamin A-rich vegetables ($2500 mg/serving) were grouped into one category (33, 34) . Next, the 42 food groups were clustered based on similarities in their reported pattern of consumption using SAS procedure PROC VARCLUS (36) . This resulted in 13 food group clusters; each cluster contained groupings of foods that were consumed with similar frequency (i.e., the number of daily servings). Finally, WardÕs (37) clustering method was used to separate women into 5 nonoverlapping, distinct, dietary pattern subgroups. The dietary patterns, including Heart Healthier, Lighter Eating, Wine and Moderate Eating, Higher Fat, and Empty Calorie, were based on similarities in the frequency of their consumption of the 13 food groupings (33, 34) ."}, {"section_title": "Framingham Nutritional Risk Score and nutrient intake", "text": "The Framingham Nutritional Risk Score (FNRS) was previously described (33, 34) . It is a validated index for assessing diet quality and comprises 19 CVD-related nutrients. Nutrient intake levels in all FOS women with 3-d dietary records were ranked from lowest to highest. A desirable intake level (e.g., lower fat or higher vitamin intake) was assigned a lower rank and a less desirable intake level (e.g., higher fat or lower vitamin intake) a higher rank. A higher intake of MUFA received a higher rating, because it was derived mainly from animal sources (e.g., beef fat) rather than vegetable sources (e.g., olive oil) in FNS participants. The FNRS was computed from the sum of the mean ranks of the 19 nutrients.\nLifestyle and health data Socio-demographic, lifestyle, and clinical factors were measured at each FHS exam cycle according to published protocols (38) . Age, menopausal status, smoking status, physical activity, hypertension medication, and lipid-lowering medication were self-reported by the participant (38) . Physical activity was evaluated using a physical activity index (scores range from 24 to 120) based on the number of hours in a typical 24-h day that participants spent doing specific activities that are categorized as sedentary, slight, moderate, or heavy (39) . Current smokers were defined as participants who reported smoking $1 cigarettes/d prior to exam 4; nonsmokers were defined as participants who reported not having smoked before or at exam 4 and those who previously smoked prior to exam 4. Participants were weighed using a calibrated scale and height was measured using a stadiometer. BMI [weight (kg)/height (m 2 )] was calculated using height and weight (40) . Waist circumference (WC) was measured with an anthropometric tape at the level of the umbilicus on standing participants (41) . Blood pressure was determined using the mean of duplicate measurements on the participantÕs left arm using a mercury sphygmomanometer with the participant in a sitting position (42) . Plasma glucose was measured with a hexokinase reagent kit (A-Gent Glucose Test; Abbott) (43) . HDL-cholesterol and TG were measured with automated enzymatic methods (44, 45) . Energy intake was estimated from 24-h recalls (data were comparable with those collected from 3-d dietary records) (34) . Abdominal obesity, hypertension, hyperglycemia, low HDL-cholesterol, and hypertriglyceridemia cutoffs were based on the criteria of the Joint Scientific Statement for MetS definition. Per these criteria, abdominal obesity was defined using both the AHA/National Heart, Lung, and Blood Institute cutoff (WC $88 cm) and the International Diabetes Federation cutpoint for Europids (WC $80 cm); hypertension was defined as blood pressure $130/$85 mm Hg; hyperglycemia was defined as glucose $100 mg/dL ($5.6 mmol/L); low HDL-cholesterol was defined as HDL-cholesterol <50 mg/dL (<1.3 mmol/L); and hypertriglyceridemia was defined as TG $150 mg/dL ($1.7 mmol/L) (1). All covariates were measured at exam 4 except energy intake, which was assessed at exam 3. "}, {"section_title": "Definition of MetS and components", "text": ""}, {"section_title": "Statistical analyses", "text": "Food and nutrient intake and characteristics at baseline. ANCOVA was used to calculate age-adjusted least-squares means of food and"}, {"section_title": "Dietary patterns and metabolic syndrome 1721", "text": "by guest on October 14, 2017 jn.nutrition.org nutrient intake for each dietary pattern and, where indicated, to compute post hoc pair-wise mean differences between the clusters using TukeyÕs honestly significant difference test. The SAS procedure PROC GLM was used to fit ANCOVA models (46) . Results were summarized as means 6 SE for nutrient intake and means and 95% CI for food intake.\nBaseline participant characteristics analyzed include age, physical activity index, BMI, WC, systolic and diastolic blood pressure, glucose, HDL-cholesterol, and TG in their continuous form. Postmenopausal status (yes/no), hypertension medication (yes/no), lipid-lowering medication (yes/no), elevated WC (yes/no), elevated blood pressure (yes/no), elevated glucose (yes/no), low HDL-cholesterol (yes/no), elevated TG, and smoking status (current smokers/nonsmokers) were analyzed as categorical variables. ANCOVA was used to calculate age-adjusted leastsquares means of continuous variables by dietary pattern and to identify pair-wise mean differences between the clusters (46) . Logistic regression, using SAS procedure PROC LOGISTIC, was used to compute ageadjusted proportions of categorical variables and SAS procedure PROC GLIMMIX was used to identify any pairwise differences in proportions between clusters (36) . Data are presented as means 6 SE for continuous measures and percentages for categorical variables.\nMetS as the outcome. The OR and 95% CI for MetS for each cluster were computed using logistic regression models with the Empty Calorie cluster, which has the highest prevalence of MetS, as the referent (27) . Three hierarchical models were fitted: model 1, adjusted only for baseline age; model 2, additionally adjusted for physical activity, smoking status, energy intake, and menopausal status; and model 3, additionally adjusted for baseline BMI. We also stratified the analysis by the number of MetS components (none, 1, and 2) at baseline and then fitted similar logistic regression models to examine dietary patterns and MetS.\nMetS components as outcomes. The OR and 95% CI for MetS components for each cluster were computed using logistic regression models, with the Empty Calorie pattern as the referent group. Three hierarchical models were fitted: model 1, adjusted for baseline age; model 2, adjusted for baseline age, physical activity, smoking status, energy intake (for elevated blood pressure, hyperglycemia, low HDLcholesterol, and hypertriglyceridemia), and menopausal status, baseline level of the specific MetS component, and other MetS components; and model 3, adjusted for baseline BMI in addition to the covariates in model 2.\nWe tested for effect modification of baseline smoking status and age on the association between dietary patterns and MetS. Incidence (and 95% CI) of MetS and MetS components within each cluster were calculated as a percentage by dividing the number of participants with an elevated trait by the number of cluster-specific sample. CI were calculated under a binomial distribution (47) . In secondary analyses, abdominal obesity was analyzed with energy adjustment (models 2 and 3). Analyses were likewise conducted with the Heart Healthier cluster as the referent category. We also analyzed MetS and its components at exam 5 (1991-1995 All analyses were performed using SAS (version 9.2, 2008, SAS Institute) (36) . P < 0.05 was considered significant. All statistical tests were 2-sided."}, {"section_title": "Results", "text": "Food and nutrient intake. At baseline, women in the Heart Healthier cluster had significantly greater intakes of vegetables, fruits, low-fat milk, and legumes than those in other clusters; they also had greater intakes of other lower fat foods (e.g., fish, whole grains, low-fat dairy milk) than women in the Higher Fat and Empty Calorie clusters. The Lighter Eating cluster was associated with greater intakes of fattier poultry and beer compared with the Heart Healthier and Higher Fat clusters. Women in the Wine and Moderate Eating cluster consumed greater amounts of wine, organ meats, and eggs relative to those in the Lighter Eating and Empty Calorie clusters as well as greater quantities of high-fat dairy and snack foods than those in the Higher Fat cluster. Women in the Higher Fat cluster had greater intakes of sweets and animal fats compared with those in other clusters, greater intakes of refined grains, soft margarine, and oils relative to women in Lighter Eating and Empty Calorie clusters, and greater intakes of diet beverages and firm vegetable fats than those in Wine and Moderate Eating, Lighter Eating, and Heart Healthier clusters. Women in the Empty Calorie cluster consumed greater amounts of sweetened beverages compared with those in other clusters as well as greater intakes of meats and mixed dishes than women in the Heart Healthier and Lighter Eating clusters. The Higher Fat and Empty Calorie clusters were associated with greater intakes of desserts relative to other clusters ( Table 1) .\nWomen in the Heart Healthier cluster had significantly greater intakes of fiber and vitamin C than those in other Table 1 ).\nLifestyle and health characteristics at baseline. Women in the Heart Healthier cluster were significantly older than those in the Lighter Eating, Higher Fat, and Empty Calorie clusters and were less likely to be smokers relative to women in the Lighter Eating and Higher Fat clusters. The mean physical activity index was greater in the Heart Healthier cluster than in the Lighter Eating cluster as was prevalence of hypertension treatment compared with the Higher Fat cluster. Women in the Wine and Moderate Eating cluster had a greater mean glucose concentration than those in other clusters, a greater mean HDL-cholesterol concentration than women in the Heart Healthier and Higher Fat clusters, and greater hypertension prevalence relative to women in the Higher Fat cluster ( Table 2) .\nMetS and MetS components as outcomes. Almost onethird (31%) of FNS women developed MetS during a 7-y mean follow-up. However, the incidence of MetS did not significantly differ across the clusters. In both age-adjusted (P = 0.46) and multivariable-adjusted logistic regression analyses (without BMI: P = 0.18; with BMI: P = 0.41), none of the clusters was associated with MetS ( Table 3) . Incident abdominal obesity (50.2%, n = 1023) was the most common MetS component observed in this sample followed by hypertriglyceridemia (31.1%, n = 1147), hyperglycemia (30.7%, n = 1185), hypertension (28.7%, n = 844), and low HDL-cholesterol (18.9%, n = 854). In multivariable-adjusted models, the Higher Fat [OR = 0. 48 Table 4) . Adjusting for energy intake did not materially alter the primary findings (data not shown).\nThe association of the diet clusters and MetS did not appear to differ by smoking status and age. 1 Values are mean 6 SE or percent. All values are from baseline unless otherwise noted. Age-adjusted ANCOVA was used to compute least squares means of continuous variables and to calculate pair-wise mean differences in the clusters. Logistic regression was used to compute age-adjusted proportions of categorical variables and to calculate pair-wise differences in proportions between clusters. Means and percentages in a row without a common letter differ, P , 0.05. FOS, Framingham Offspring/Spouse Study; WC, waist circumference. 2 To convert glucose to SI units, multiply by 0.0555. 3 To convert cholesterol to SI units, multiply by 0.0259. 4 To convert triglycerides to SI units multiply by 0.0113.\nSeparate analyses among women with none, 1, or 2 MetS components at baseline also did not show any relationship between the dietary clusters and incident MetS and its components (data not shown). Similarly, no relationships were observed in short-term and long-term analyses (data not shown). In multivariable-adjusted analyses with the Heart Healthier cluster as the referent, the clusters were not associated with MetS "}, {"section_title": "Discussion", "text": "Contrary to our hypothesis, the Heart Healthier pattern was not associated with a lower risk for MetS or its components over a mean follow-up of 7 y. The Higher Fat and Wine and Moderate Eating patterns were inversely associated with abdominal obesity, a finding that was somewhat attenuated by baseline BMI. None of the clusters was associated with MetS or other MetS components. Smoking status and age did not modify the relationship between the clusters and MetS and its risk factors.\nA search of the literature in the past decade, since the National Cholesterol Education Program Adult Treatment Panel III proposed a working definition for the syndrome (48), showed only one study that prospectively examined the relationship of empirical dietary patterns and MetS. Of the 2 patterns identified in the Atherosclerosis Risk in Communities study cohort, the Prudent pattern was not associated with MetS during 9 y of follow-up. However, the Western pattern was adversely related to the syndrome [HR = 1.18 (95% CI: 1.03, 1.37)], comparing the highest quintile with the lowest (28) . MetS components were not examined in that study.\nAmong studies that prospectively evaluated the relationship of dietary patterns and individual CVD risk factors independently, the Healthy cluster in the Baltimore Longitudinal Study of Aging was associated with the smallest changes in WC compared with the White bread cluster (P < 0.05) (49), followed by the Reduced-fat dairy products pattern (50) . The Healthy cluster and Reduced-fat dairy products pattern are comparable to the Heart Healthier cluster in the FNS. By contrast, neither of the 2 patterns [Fruits and Vegetables; Traditional (high in vegetables, meat, sauce, potatoes, poultry)] in the European Prospective Investigation into Cancer and Nutrition (Potsdam) study was associated with hypertension during 2-4 y of follow-up (51).\nThe findings of our Wine and Moderate Eating pattern need to be interpreted with caution given the small sample size of the cluster. However, the main foods contributing to this cluster (alcohol and organ meat) as well as the Higher Fat pattern (meat and dairy foods) of FOS women have also been inversely associated with abdominal obesity in studies that prospectively examined the relationship between individual nutrients/foods and MetS and its components (52) (53) (54) as well as the association of nutrients/foods and abdominal obesity independently (55) (56) (57) . Moderate alcohol intake in the Tromsø study (52) as well as moderate wine consumption and higher intakes of high-fat dairy foods and red meat in the Danish Diet, Cancer and Health Study conferred lower risk for abdominal obesity in women (55, 56) . Higher total dairy and cheese intake in the Data from the Epidemiological Study on the Insulin Resistance Syndrome cohort (53) and higher intakes of low-fat dairy products among college students in the United States (57) similarly protected against abdominal obesity as did higher consumption of dairy products (high-fat and low-fat) in overweight and obese participants of the Coronary Artery Risk Development in Young Adults study (54) . The data on dairy products suggest that dairy foods as a whole are beneficial; alternatively, observed inconsistencies may reflect confounding in single-food analyses that do not consider the total diet, as well as interactions of foods and other metabolic factors.\nOur findings support the emerging consensus that the overall quality of the diet is important to consider when examining dietdisease relationships and when devising strategies to lower disease risk. Our findings further support that habitual dietary patterns can be maintained as long as diet quality can be improved with targeted food choices.\nNotably, only abdominal obesity of the MetS components was associated with dietary patterns, which underscores its importance as a key underlying factor of MetS (7, 8, 48) . Visceral hypertrophied adipocytes produce FFA and proinflammatory cytokines; fatty acids promote insulin resistance, inflammation, and oxidative stress. Insulin resistance exacerbates obesity by further increasing FFA production via enhanced lipolysis and additionally contributes to the development of hypertension, hyperglycemia, low HDL-cholesterol, and hypertriglyceridemia. Dietary factors including animal fat and refined carbohydrates are postulated to produce oxidative stress that stimulates inflammation in obesity; other nutrients and foods such as vitamin E, alcohol, fiber, fruits, and vegetables are antiinflammatory and suppress oxidative stress (7, 8) . Alcohol also reduces fasting insulin and improves insulin sensitivity (58) . Phytochemicals in wine may likewise reduce adi- pocyte size (59) . Dietary calcium and bioactive peptides in dairy foods, primarily in whey protein, are thought to act synergistically and suppress inflammatory and oxidative stress (60) . Because some of the MetS components may respond to lifestyle changes within months (61, 62) , participants may change their diet during follow-up and hence may have curtailed our ability to detect an association. However, available data within FNS suggest that the majority of the cohort members minimally changed their diet quality during a duration of 8 y (63) .\nMetS has utility in identifying individuals at high risk of developing CVD and T2DM, but it is a controversial heterogeneous construct whose pathophysiology is ill understood (4, 5, 8) ; this needs to be considered in interpreting our findings for the syndrome. Effect modification is often not reproducible, which may explain the lack of significant interactions in the present study (64) . Additionally, the small sample sizes of some clusters limited the statistical power; we determined that with an incidence of 31% in the referent category cluster of Empty Calorie, for clusters with $226 participants, we had at least 80% power at the 0.05 significance level to detect an OR of 1.5. However, there was insufficient power, <50%, to detect and the OR was 1.2. The smallest cluster of Wine and Moderate Eating (n = 42) had <22% power to detect either an OR of 1.2 or 1.5. In a previous FNS study, the Heart Healthier dietary pattern, compared with the Empty Calorie pattern, had lower odds for overweight and obesity (age-adjusted analysis) over 12 y of follow-up (65) . The mean FNRS scores were also higher in women who consumed a Heart Healthier diet (33, 34) . Higher diet quality, as assessed by the FNRS, was similarly associated with lower weight gain (30) and a lower risk for overweight and obesity during a 16-y period (66) . In our previous study, we showed that women with higher diet quality (based on the FNRS) were likewise less likely to develop MetS and abdominal obesity than those with lower diet quality over 12 y of follow-up (17) . Therefore, although higher diet quality regardless of habitual dietary pattern is associated with MetS and abdominal obesity, it is less clear that the Heart Healthier pattern confers sufficient protective benefits unless the nutrient quality of the intake is relatively high. This would suggest that interventions to improve empirical eating patterns by focusing on diet quality indices might offer promise in terms of MetS prevention. This is supported by our previous cross-sectional study, which indicated that the habitual Empty Calorie pattern of women is associated with MetS and its components (27) .\nThe strengths of this study include a well-characterized cohort, follow-up of women of a broad age range over an extended period, and assessment of a comprehensive set of dietary patterns. The main limitation was the single measure of dietary intake; the lack of follow-up data on food intake may account for the observed negative findings. The small sample sizes of some clusters might also explain our inability to detect relationships between the dietary patterns and MetS. Additionally, random dietary self-report errors as well as survival and response bias may have affected our findings. The FNS cohort is exclusively white, but the findings may be generalizable to other racial/ ethnic populations; some of the clusters identified among FOS women, such as the Heart Healthier and Alcohol patterns, have been reproduced in other populations (13, 67) .\nIn conclusion, the Higher Fat and Wine and Moderate Eating dietary patterns had an inverse association with abdominal obesity. These clusters reflect habitual eating patterns and may not be optimal in terms of dietary quality. To inform individual or population-based intervention strategies and nutrition policies for MetS, it is important not only to consider the populationÕs eating practices but also to enhance the overall diet quality with targeted approaches. Future studies need to consider multiple dietary assessments as well the stability of population-specific dietary patterns and their relationship with MetS over time."}]