[{"section_title": "Background", "text": "Successful completion of the Japanese Alzheimer's Disease Neuroimaging Initiative (J-ADNI) project yielded a data set comprising 537 individuals, including 154 cognitively normal individuals, 234 individuals with late mild cognitive impairment (LMCI), and 149 individuals with mild Alzheimer's disease (AD). Previous publication has reported that the Japanese data set is generally comparable to the North American (NA)-ADNI data set, supporting the feasibility of a clinical trial bridging the prodromal stage of AD between Eastern and Western countries [1] . Moreover, the J-ADNI is the most comprehensive data set of this size, reflecting cognitive changes in older individuals from a Japanese (or Asian) population.\nIt is known that the incidence of AD does not seem to be affected by sex [2] , whereas women have a higher life-time risk of AD owing to their longer life span than men [3] . In general, there is a lower incidence of AD among highly educated individuals compared with less educated individuals, suggesting that educational achievement confers some resistance to the development of the disease [4, 5] . Nonetheless, highly educated subjects are thought to decline more quickly after they are diagnosed [6] . However, there has been almost no research into these factors among the elderly in the Japanese population. Therefore, we believe it is important to conduct an analysis of cognitive and functional changes in particular subgroups of Japanese people to explore the factors influencing them.\nAfter publishing the initial analysis of the J-ADNI data set [1] , we performed subanalyses with the aim of determining the effects of sex and education level on longitudinal decline in individuals with LMCI and AD. We analyzed various cognitive scales after stratifying them by sex and education level. Subsequently, we further analyzed the data according to amyloid positivity and other clinical and laboratory factors obtained in the study. Finally, we compared the data from the J-ADNI and NA-ADNI cohorts to investigate whether our findings are unique to the J-ADNI data set."}, {"section_title": "Methods", "text": ""}, {"section_title": "Sample", "text": "We obtained the J-ADNI data set from the National Bioscience Database Center with approval from its data access committee (https://humandbs.biosciencedbc.jp/en/ hum0043-v1). The inclusion criteria for J-ADNI were identical to those for NA-ADNI [7] . The follow-up period was 3 years for NC and LMCI and 2 years for AD. The antidementia drug prescription history of participants was obtained from the J-ADNI database (in preparation for publicization). We obtained the NA-ADNI data sets from ADNI1, AD-NIGO (Grand Opportunities), and ADNI2 from the Laboratory of Neuro Imaging with their approval. The data used in the preparation of this article were obtained from the ADNI database (adni.loni.usc.edu) (downloaded on June 15, 2017). The ADNI was launched in 2003 as a public-private partnership, led by Principal Investigator Michael W. Weiner, MD. The primary goal of ADNI has been to test whether serial magnetic resonance imaging, positron emission tomography (PET), other biological markers, and clinical and neuropsychological assessment can be combined to measure the progression of mild cognitive impairment (MCI) and early AD."}, {"section_title": "Assessments and clinical variables", "text": "From the several neuropsychological tests used in the J-ADNI cohort, we chose the Clinical Dementia Rating Sum of Boxes (CDR-SOB), Alzheimer's Disease Assessment Scale-cognitive subscale 13 (ADAS-cog13), Mini-Mental State Examination (MMSE), and Functional Activities Questionnaire (FAQ) to assess the longitudinal cognitive and functional status of participants. The clinical and laboratory data used for analysis included participants' sex, age, family history of dementia, marital status, smoking habits, Geriatric Depression Scale scores, fasting blood sugar level, low-density lipoprotein cholesterol level, highdensity lipoprotein cholesterol level, glomerular filtration rate (GFR) calculated from serum creatinine, Fazekas periventricular hyperintensity (PVH) score, and deep and subcortical white matter hyperintensity scores from the screening magnetic resonance imaging scan (scored by a trained radiologist blind to clinical information), apolipoprotein E (APOE) ε4 allele status, and amyloid positivity. Amyloid positivity was clinically defined by visual inspection of amyloid PET images with Pittsburgh compound B as a ligand by trained radiologists who were blinded to any clinical information [8] and/or a cerebrospinal fluid amyloid-beta 42 (Ab 42 ) value 333 pg/mL at baseline, using the cutoff value determined in a previous report [1] . When both data were available, we defined \"positive\" as at least one test having met \"positive\" criteria. When calculating the GFR, we used estimated glomerular filtration rate (eGFR) for J-ADNI participants [9] and GFR-EPI (epidemiology collaboration) for the NA-ADNI participants [10] . These formulas are well established and validated in both the regions [9, 10] ."}, {"section_title": "Statistical analyses", "text": "Data were analyzed using the JMP program (SAS Institute Inc, Cary, NC) or Prism 6.0c (GraphPad, La Jolla, CA). We assessed differences with chi-squared tests when analyzing demographic data, whereas longitudinal changes were analyzed using linear mixed-effects models. The interactive effect of group (high education vs. moderate education vs. low education, men vs. women, G1 vs. G2) and time (months) on cognition and function was examined. Age at baseline and APOE ε4 carriage were included as covariates because they are known to be associated with cognition. Individuals were included as a random effect in the analyses. All P values shown in the figures were generated for the interactive effect between group and time. Differences with a P value of ,.05 were considered significant."}, {"section_title": "Ethics", "text": "The study protocol was approved by the University of Tokyo Ethics Committee (11628). Table 1 presents detailed demographic data for the participants included in this study. In the included cohort, 49.6% of those with LMCI and 43.0% of those with AD were men. The mean 6 standard deviation for the length of education was 13.0 6 2.8 years in those with LMCI and 12.4 6 3.1 years in those with AD, and there was no significant difference between the groups. We divided participants into three groups: (1) low education level (0-9 years), (2) moderate education level (10-15 years), and (3) high education level (16 years) . Regarding the subtypes of MCI, 2 out of 116 of the men and 4 out of 118 of the women had nonamnestic features. During the 3-year follow-up period, 50% of male and 54.7% of female LMCI subjects completed the study. For AD, 64.1% of male and 63.4% of female subjects completed the 2-year follow-up. Amyloid data were obtained from amyloid PET in 74 subjects with MCI and 57 with AD, from cerebrospinal fluid data in 88 with MCI and 55 with AD, and for both in 45 with MCI and 24 with AD. The positivity rate was 65.8% for MCI and 89.8% for AD. There were no sex differences in terms of average age, family history of dementia, amyloid positivity, or APOE ε4 frequency. However, we observed that significantly more men than women were highly educated in both the LMCI and AD groups."}, {"section_title": "Results", "text": ""}, {"section_title": "Sample characteristics", "text": ""}, {"section_title": "Effects of sex and educational achievement on cognitive and functional decline", "text": "To evaluate the effect of sex on rates of cognitive and functional decline, we analyzed longitudinal changes in the CDR-SOB, ADAS-cog13, MMSE, and FAQ. As shown in Fig. 1A , ratings on all of these scales declined significantly more quickly in women with LMCI. There were no significant differences in longitudinal changes between the sexes for any of the scales in people with AD. These results imply that in the J-ADNI data set, women with LMCI experienced a faster rate of decline than men in terms of both cognition and function.\nWe next examined the effect of educational achievement on cognitive and functional changes. We observed significant differences in the rates of decline between the groups with different educational levels for all of the scales evaluated in those with LMCI (Fig. 1B) . Specifically, the low and moderately educated groups showed similar trends, whereas the highly educated group showed a slower rate of decline in cognition and function. Again, there were no significant differences in longitudinal changes between the groups with different educational levels for any of the scales in those with AD, with the exception of slight differences in the ADAS-cog13 scores. Given that there were significantly more highly educated men than women with LMCI (Table 1) , sex differences in cognition and function may simply reflect educational differences between the sexes. To assess this issue, we further stratified the MCI group by educational level and sex. As shown in Fig. 1C , the trend for women to have a faster rate of decline remained for all scales, regardless of educational level. Highly educated women showed a significantly faster rate of decline in all scales than less educated women. Similarly, women with a low level of education showed a faster rate of decline in the CDR-SOB and ADAS-cog13 scales. Further analyses stratifying men and women by educational level revealed that in men, the CDR, MMSE, and FAQ showed a significant effect of educational level (P , .0001). However, none of the scales showed a significant effect of educational level in women (data not shown). This indicates that differences in the effects of educational achievement are not necessarily the reason for women showing a faster rate of decline than men."}, {"section_title": "Influence of amyloid positivity and APOE ε4 status", "text": "Subsequently, we aimed to understand the mechanisms underlying the differences between the sexes by examining whether amyloid positivity or the presence of the APOE ε4 allele affected the rates of cognitive and functional decline.\nAmong the participants with LMCI, 117 had amyloid data obtained using either amyloid PET or via cerebrospinal fluid Ab 42 . The rates of amyloid positivity were 62.9% and 69.1% in men and women, respectively, and these values were not significantly different between the groups (Table 1) . Data regarding the presence of the APOE genotype were available for 232 participants with LMCI. We observed that 50.0% of men and 54.2% of women were APOE ε4 carriers, and these proportions did not differ significantly between the groups (Table 1) . We further analyzed amyloid pathology and APOE ε4 positivity by educational level and observed no significant differences between the groups (Table 2) .\nTo directly explore the effect of amyloid pathology and the presence of the APOE ε4 allele on the rate of cognitive decline, we stratified participants with LMCI according to these two components and compared longitudinal changes in cognition between the sexes. As shown in Fig. 2A , women still showed a significantly faster rate of decline in the CDR-SOB scale than men, regardless of amyloid positivity. Amyloid-negative women also showed a faster rate of decline than men in the ADAS-cog13 and MMSE scales. Moreover, women with LMCI showed a significantly faster rate of decline than men in all the scales, except the FAQ, regardless of their APOE ε4 status (Fig. 2B) .\nWe observed that statistical significance was not maintained for several scales after further stratification. However, we speculate that this is due to the relatively small number of participants in each group resulting from stratification because the trend toward significance for women to show a faster rate of decline remained for all scales, regardless of amyloid positivity or APOE ε4 status. Thus, we concluded that there was a rationale to seek further reasons for this trend. Kaplan-Meyer plot of MCI to AD conversion stratified by sex, educational level, and CKD grades. Statistically significant differences were assessed using the log-rank test for sex and education; the log-rank test showed a trend toward significance for education level. The overall conversion rate is shown below the graphs. Abbreviations: LMCI, late mild cognitive impairment; AD, Alzheimer's disease; CKD, chronic kidney disease; APOE, apolipoprotein E."}, {"section_title": "Further factors leading to faster functional and cognitive decline", "text": "To elucidate the factors leading to faster functional and cognitive decline in women with LMCI, we divided female participants into quartiles according to the rate of decline in the CDR-SOB, ADAS-cog13, MMSE, or FAQ scores. Subsequently, we compared the age, years of education, family history, smoking history, body weight, body height, body mass index, blood test results (fasting blood sugar, creatinine, total cholesterol, low-density lipoprotein cholesterol, high-density lipoprotein cholesterol, triglyceride, C-reactive protein, homocysteine, vitamin B12, and folic acid), amyloid positivity, APOE ε4 status, and chronic kidney disease (CKD) grade between the top and bottom quartiles.\nThe rate of decline was determined for each score from the baseline visit and last visit (this period was not necessarily 36 months for early dropouts, but all participants completed at least two visits). The results of this analysis suggested that individuals showing a fast rate of decline tended to have a lower CKD grade than participants showing a slower rate of decline. There were no other significant findings (data not shown).\nBecause there were few participants with a CKD grade above G3a (Table 3) , we combined the CKD grades into a single group of G2 (eGFR , 90 mL/min/1.73 m 2 ) and analyzed patterns of declining cognition and function. As shown in Fig. 2C , female participants with a CKD G2 tended to show a faster rate of decline than those with a CKD of G1 for all the scales.\nWe then tested if sex, educational level, and CKD grade affected the MCI to AD conversion. As shown in Fig. 2D , sex and educational level had significant effects on conversion, whereas the effect of CKD grade was not significant."}, {"section_title": "Comparisons of J-ADNI and NA-ADNI", "text": "Finally, we investigated if similar findings could be observed in the NA-ADNI data set of 562 participants with LMCI (women, n 5 344; men, n 5 218).\nAs shown in Fig. 3A , we did not observe a trend for women who were amyloid negative to perform worse within the 3-year follow-up period than male participants, although it has been reported that \"overall,\" women with MCI declined faster in NA-ADNI population in the 8-year follow-up [11] .\nWe observed a significant difference between the education level groups with regard to the scores for the CDR-SOB and ADAS-cog13 (Fig. 3B ). Female participants with CKD G2 (according to the GFR-EPI formula) scored consistently worse on the ADAS-cog13 and MMSE scales than those with a CKD of G1, but there was no significant difference in the rate of decline (Fig. 3C) .\nThese results indicate that educational achievement influenced cognition and function in individuals with LMCI from both the J-ADNI and NA-ADNI data sets, but the effects occurred in a slightly different manner. In addition, higher CKD grade was related to a faster rate of cognitive decline in female participants from both the cohorts. However, there was a more prominent difference in the rate of decline in the J-ADNI population.\nTherefore, it remains to be determined what underlies these patterns. We speculate that a low eGFR could reflect chronic high blood pressure. Because the subjects' comprehensive past medical history was not available from the J-ADNI database, we attempted to determine whether there was any relationship between the Fazekas score obtained at the baseline magnetic resonance imaging scan and CKD grade. As shown in Fig. 3D , participants with a higher Fazekas PVH score had a lower eGFR, but this was only observed in women."}, {"section_title": "Discussion", "text": "Our findings from subanalyses of the J-ADNI data set suggest that women with LMCI showed a faster rate of decline than men with LMCI. Educational achievement also affected the speed of cognitive decline, and women with an eGFR of 90 mL/min/1.73 m 2 or less also showed a faster rate of decline. We did not observe the same differences in participants from the J-ADNI with AD, and these findings were only partially present in the NA-ADNI data set.\nAccording to a previous systematic review, there are no sex differences in rates of cognitive decline in the normal aging process [12] . In contrast, the incidence of MCI is reported to be higher in men, although this is still controversial [13, 14] . The precise pathological mechanisms underlying these patterns remain unknown. However, pathophysiological changes mediated by endocrine transition states, such as the menopause, which is both female-specific and age-related, may play a role [15] . Several previous reports have suggested that women with MCI tend to decline more quickly than do men across both a 1-year follow-up period [16] and a longer follow-up period of 8 years [11] . Our current results corroborate these previous findings in a Japanese population. Several previous studies have investigated the relationship between educational level and risk of dementia. In general, lower educational achievement is related to a higher incidence of dementia, and risk decreases with each year increase in education [17, 18] . In terms of cognitive decline among individuals with MCI, there are also several reports from cross-sectional studies indicating that higher education levels are associated with higher scores on cognitive scales [19, 20] . In contrast, there have been very few reports regarding the longitudinal rate of cognitive decline and educational level in MCI populations [5] . Our current findings show that education level appears to affect the rate of cognitive decline in LMCI in both the J-ADNI and NA-ADNI cohorts. One thing we should discuss here is that the protective effect of education was only positive in male LMCI subjects. The exact reason for this remains to be elucidated, but one explanation could be that highly educated women lack the protection that comes from occupational complexity. Indeed, among the 13 female subjects with an educational history of 16 years or more, seven subjects spent most of their lives as housewives.\nIt should be noted that in the J-ADNI data set, the rate of amyloid positivity was 66.7%, 70.7%, and 58.3%, in low, moderate, and highly educated individuals, respectively. There were fewer participants who were amyloid positive in the highly educated group, although this was not statistically significant. This could affect the progression rate of LMCI among those in the highly educated group, regardless of their educational achievement. We attempted to account for this in our evaluation of cognitive decline; however, the number of participants was insufficient to perform statistical analyses. In addition, the number of participants with low education levels was very small in the NA-ADNI cohort. The percentages of low, moderate, and highly educated participants were 2.3%, 31.9%, and 65.8%, respectively, among those with LMCI, and 3.2%, 41.2%, and 55.6%, respectively, in those with AD. As such, the NA-ADNI cohort includes significantly more highly educated participants and fewer participants with a low level of education compared with the J-ADNI cohort. This limits comparisons between the two cohorts. Even in the J-ADNI cohort, which included more participants with a low level of education than the NA-ADNI cohort, the percentages of participants in each educational group were not equal ( Table 1) .\nAccording to the Japanese government census, the maleto-female ratio of people over 65 years of age is 1:1.35, and the average years of education of people aged 65 to 85 years is approximately 10.9 years in men and 10.2 years in women [21] . Therefore, in J-ADNI cohort, the average age of participants was still higher than in the general population; compared to NA-ADNI cohort, it was much closer to that of the general population. Thus, further study is needed to evaluate the progression of LMCI in the general population in both the regions.\nOur findings also suggest that women with LMCI show a faster rate of decline regardless of their amyloid or APOE ε4 status, indicating that there could be an independent factor affecting female cognitive decline other than amyloid pathology. Further analysis revealed that in women with LMCI, a CKD stage of G2 or higher was related to a faster rate of decline. This is of interest because a CKD stage of G2 reflects an eGFR lower than 90 mL/min/1.73 m 2 , which does not necessarily indicate that these participants had CKD or even impaired renal function [22] . Indeed, only 7 women and 16 men fulfilled the criteria for CKD in the entire cohort of participants with LMCI. This indicates that even a subtle decline in eGFR is related to faster cognitive decline in Japanese women with LMCI. Because the serum creatinine levels used for the eGFR calculation could reflect low muscular volume, we tested the effects of differences in body height, body weight, and body mass index among women with CKD grade G1 and G2 in the J-ADNI cohort but found no statistical difference between the two groups (body weight [mean 6 standard deviation]: G1, 49.5 6 7.9 kg and G2, 48.1 6 6.5 kg; body height: G1, 150.8 6 5.1 cm and G2, 150.7 6 5.8 cm; body mass index: G1, 21.9 6 3.7 and G2, 21.2 6 3.1). Another explanation was that there were fewer APOE ε4 carriers in the female G1 group than in other groups, but our analysis did not support this hypothesis (G1, 50.0% and G2, 55.1%). Thus, eGFR seems to be related to cognitive decline in women with LMCI, independent of amyloid pathology. Because antidementia drugs, such as donepezil, galantamine, rivastigmine, or memantine, could be prescribed to MCI subjects even before conversion to AD, we tested if prescription of those drugs affected the rate of cognitive decline. As shown in Table S1 , the prescription rates, stratified by sex, educational level, or CKD grade, were not significantly different.\nThese findings were not replicated in the NA-ADNI data set. When analyzing the J-ADNI data set, we used eGFR to evaluate renal function [9] and GFR-EPI for the NA-ADNI data set [10] . These two GFR evaluation methods are widely used in each region. However, they gave completely different values when the data used for calculations were transposed. Nonetheless, even when we evaluated J-ADNI subjects with GFR-EPI and NA-ADNI subjects with eGFR, the results did not change.\nIn cross-sectional studies, CKD has been shown to be associated with cognitive decline [23] [24] [25] and cerebral cortical thinning [26] . Longitudinal studies of mild to moderate CKD found that an elevated serum creatinine level increased the risk of dementia [27] . We tried to explain this phenomenon by relating low eGFR to brain small vessel disease and found that in women with MCI only, participants with a high Fazekas PVH score had a significantly lower eGFR. The effect of high CKD grade on Fazekas PVH score was small, so other factors may underlie this finding, such as increased levels of inflammatory cytokines, oxidative stress, and alterations in lipid and homocysteine metabolism [27] . Alternatively, the simple Fazekas grading may not be precise enough to evaluate white matter disease, and precise volumetric measurements may be needed. It can be questioned why only women are affected by a low eGFR. One explanation could be that women with hypertension tend to have a lower GFR than men [28] , or women may be more vulnerable to inflammatory cytokines or oxidative stress. There are sex differences in cardiovascular pathology. Plaque morphology of coronary arteries differs between men and women [29] . It has been reported that smoking and diabetes have a greater impact on atherosclerosis in women than in men [30] . Thus, this sex difference in atherosclerosis could also underlie this finding.\nMoreover, it can be questioned why these relationships were only observed in Japanese women. At this point, it is not possible to answer this question satisfactorily. Further study is needed to determine whether the current results can be replicated in other cohorts.\nOur study has several limitations that should be borne in mind. First, the number of participants with amyloid data was insufficient to further analyze the effects of this factor on cognitive decline in LMCI and AD cases. Second, the education level of participants was higher than that in the general population, which may make it difficult to generalize the findings. Third, we evaluated eGFR with serum creatinine levels only. Future studies could improve the evaluation by also incorporating serum cystatin C [31] . In participants with LMCI in the J-ADNI cohort, there was no information about the disease duration in the database, and this could also be a limitation of our findings regarding differences in progression rate.\nIn this study, we successfully performed subanalyses of the J-ADNI data set. Our findings provide basic knowledge about Japanese individuals with MCI, which should provide a basis for future drug development in Alzheimer's disease and other dementias."}]