[{"section_title": "Abstract", "text": "Objective: To determine whether a high prevalence (55%) of Ab deposition in a cohort of individuals remaining dementia-free into their 9th and 10th decades is associated with cognitive decline prior to imaging.\nMethods: A total of 194 participants (mean age 85.5 years, range 82-95) who completed the Ginkgo Evaluation of Memory Study (GEMS) and remained dementia-free subsequently completed Pittsburgh compound B-PET imaging. We examined cross-sectional associations between Ab status and performance on a broad neuropsychological test battery completed at GEMS entry 7-9 years prior to neuroimaging. We also longitudinally examined cognition over annual evaluations using linear mixed models.\nResults: At GEMS screening (2000-2002, participants who were Ab-positive in 2009 had lower performance on the Stroop test (p , 0.01) and Raven's Progressive Matrices (p 5 0.05), with trend level difference for Block Design (p 5 0.07). Longitudinal analyses showed significant slope differences for immediate and delayed recall of the Rey-Osterrieth figure, semantic fluency, and Trail-Making Test parts A and B, indicating greater performance decline prior to neuroimaging for Ab-positive relative to Ab-negative participants (ps , 0.05).\nHighly prevalent Ab deposition in oldest-older adults is associated with cognitive decline in visual memory, semantic fluency, and psychomotor speed beginning 7-9 years prior to neuroimaging. Mean differences in nonmemory domains, primarily executive functions, between Ab-status groups may be detectable 7-9 years before neuroimaging. Neurology â 2013;80:1378-1384 GLOSSARY AD 5 Alzheimer disease; BNT 5 Boston Naming Test; CDR 5 Clinical Dementia Rating; CES-D 5 Center for Epidemiologic Studies Depression scale; CI 5 confidence interval; CVLT 5 California Verbal Learning Test; GEMS 5 Ginkgo Evaluation of Memory Study; MCI 5 mild cognitive impairment; PiB 5 Pittsburgh compound B; R-O 5 Rey-Osterrieth; ROI 5 regions of interest; SUV 5 standardized uptake value; SUVR 5 SUV ratio; WAIS-R 5 Wechsler Adult Intelligence Scale-Revised."}, {"section_title": "", "text": "It has long been observed that a significant number of older adults without dementia show Ab plaques and neurofibrillary tangles at autopsy. 1 This proportion increases with age, 2 with up to 40% of 801-year-olds showing neuropathologic Alzheimer disease (AD). 3 Such high proportions provoke questions about the clinical significance of the pathology in this advanced age group.\nIn vivo Ab imaging studies indicate a 20%-30% prevalence of Ab deposition in asymptomatic older adults. [4] [5] [6] Supporting the premise that Ab in asymptomatic older adults signifies preclinical AD, several studies reported cognitive decline in healthy Ab-positive individuals followed longitudinally (typically preimaging, as prospective follow-up studies are still ongoing). [7] [8] [9] Others reported AD-like features include reduced cortical thickness, 10 reduced hippocampal volume, 7 and increased risk for eventual progression to AD. 11 The reports above primarily studied participants aged 65-80 years. Recently, we reported 55% of a sample without dementia with mean age 85.5 years showing Ab deposition on imaging with Pittsburgh compound B (PiB) PET, 12 including 51% of those assessed as cognitively normal. This is the highest proportion of PiB-positive scans reported to date in a normal sample. Unknown is whether Ab pathology among people 80 and older is normative of the aging process and more likely to be cognitively benign. The present study reports on cognitive trajectories from detailed evaluations of these participants beginning 9 years preceding neuroimaging. The question framing these analyses was whether this high prevalence of Ab is associated with detectable cognitive sequelae among individuals remaining dementia-free well into their 80s and entering their 90s. METHODS "}, {"section_title": "Participants. The Ginkgo Evaluation of Memory", "text": "Study (GEMS; 2000-2008) was a multisite, placebo-controlled, double-blind, randomized clinical trial of 240 mg daily dose of Ginkgo biloba in 3,069 community-dwelling participants 72-96 years old. Exclusion criteria were reported in detail elsewhere 13 but included prevalent dementia, use of cholinesterase inhibitors or other psychotropic medication, recent hospitalization for depression, Parkinson disease, abnormal blood/serum tests at screening, or disease-limited life expectancy of ,5 years. Median follow-up time from randomization was 6.1 years. Study visits occurred at 6-month intervals; cognitive, genetic (including APOE genotyping), functional, and informantreported variables were collected. 14 Incident dementia was a study endpoint. Overall, mortality was 12.3%; lost to follow-up 6.3%; progression to dementia was 17.0%. The primary study outcome of dementia incidence was negative for a treatment effect, 13 as were secondary outcomes of cognitive decline across multiple cognitive domains 15 and cardiovascular events. 16 In 2009, 197 participants from the Pittsburgh site were recruited into the GEMS Imaging Sub-Study. Inclusion criterion was completion of the GEMS protocol. Exclusion criteria were 1) dementia at GEMS closeout; and 2) contraindications for neuroimaging. Compared to all 671 Pittsburgh site participants who completed the GEMS protocol and did not reach a dementia endpoint, the Imaging Sub-Study participants were younger (84.0 [SD 2.8] vs 84.4 [SD 3.0] years at 2008 closeout, p 5 0.03) but comparable in sex, race, education, APOE e4 status, estimated premorbid IQ, and estimated income by zip code (p . 0.05). Compared to all 966 Pittsburgh site participants at GEMS baseline, they were younger, had higher estimated premorbid IQ (p , 0.05), but did not differ by sex, race, education, APOE e4 status, or estimated income (p . 0.05). Three participants were subsequently excluded for technical difficulties with PET scanning; thus 194 were entered into the present study. 20 Two tests were administered during GEMS screening only: the National Adult Reading Test-American version, estimating premorbid verbal IQ, and Raven's Progressive Matrices, a measure of nonverbal inductive reasoning. (All standard neuropsychological tests described and cited in reference 21 .) In the GEMS Imaging Sub-Study, all tests from the GEMS core neuropsychologic battery were repeated except Block Design, Digit Span, BNT, and the Stroop Test.\nAdjudication of cognitive status and course. The GEMS Cognitive Diagnostic Center 14 completed adjudication in the Imaging Sub-Study, blind to PiB-PET results, taking into account historical serial cognitive assessments from the parent GEM study. Criteria for mild cognitive impairment (MCI) included 1-3 tests impaired at cutoffs of 1.5 SD below age-and education-adjusted means. Cognitive course for participants with normal cognition was adjudicated as \"normal-stable\" (consistently normal throughout the parent GEM Study), \"normal-reverted\" (MCI to normal), or \"normal-unstable\" (normal to MCI to normal). For MCI, cognitive course was adjudicated as \"MCI-stable\" (consistently MCI), \"MCI-progressed\" (normal to MCI), or \"MCI-unstable\" (MCI to normal to MCI). Of note, \"normal\" vs \"MCI\" status refers to final classification at the time of imaging (2009).\nClinical Dementia Rating scale. The Clinical Dementia Rating (CDR), 22 a structured interview of cognitively driven decline based on proxy report, was administered every 6 months during each GEMS visit but not at the 2009 Imaging Sub-Study."}, {"section_title": "Neuroimaging. A structural 1.5 T MRI (GE Signa) was acquired", "text": "prior to PET imaging. PET data were acquired for 20 minutes (4 3 5 minute frames) beginning 50 minutes after injection of 15 6 1.5 mCi of PiB on a Siemens/CTI ECAT HR1 scanner in 3D imaging mode (63 planes with slice width 2.4 mm). PET data were reconstructed using filtered back-projection (Fourier rebinning and 2D backprojection with Hann filter kernel full width at half maximum 5 3 mm). Postinjection transmission scans were acquired using 68 Ge/ 68 Ga rods. PiB-PET data were corrected for photon attenuation, scatter, and radioactive decay. The final reconstructed PET image resolution was about 6 mm (transverse and axial).\nImage coregistration and automated regional sampling of the PiB-PET data were performed, as recently described. 23 Regions of interest (ROI) were hand-drawn on a template that was a high-resolution MRI of a single elderly subject with MCI. The ROI included 5 primary cortical areas (anterior cingulate, frontal, lateral temporal, parietal, and precuneus), which comprised a global composite region, and the cerebellum. The PiB tissue uptake was measured over the 50-70 minute scan interval and scaled to injected dose and body mass to generate standardized uptake value (SUV) images. The SUV images were then normalized to the SUV of the cerebellum reference region to generate images of the SUV ratio (SUVR) measure of PiB retention. The ROI were automatically applied to sample each individual's PiB SUVR image that had been spatially normalized to the MCI template. A correction for atrophy-related CSF dilution was applied.\nUsing an iterative mild outlier cutoff method based on an independent sample of 62 controls, 5 we defined Ab-negative and Ab-positive status by a global cortical cutoff of SUVR 5 1.57.\nStandard protocol approvals, registrations, and patient consents. The University of Pittsburgh institutional review board approved the use of human subjects for this study. All participants provided informed, written consent."}, {"section_title": "Data analysis. Cognitive decline in neuropsychological test scores", "text": "throughout the parent GEM study until the Imaging Sub-Study was analyzed with linear mixed models. All 194 participants were included. Predictors were Ab status and time in years from GEMS screening. Number of study visits was limited to a maximum of 6 for each participant (n 5 190; n 5 4 completed 5 visits). The Ab status 3 time interaction term was of interest, estimating the average annual difference in slopes between Ab-positive and Ab-negative groups. In addition to linear models, we used mixed models with time as a class variable to derive individual estimates of test performance for each group at each timepoint. Change in CDR sum-of-box score over time was analyzed with linear mixed models.\nClinically adjudicated cognitive course was analyzed with logistic and multinomial regression models, with Ab status as a predictor. Due to small ns, the normal cognitive course categories \"normal-reverted\" (n 5 7) and \"normal-unstable\" (n 5 28) were collapsed to \"ever-MCI.\"\nAll models were run with and without adjustment for age, sex, education, and race, and with further adjustment for CES-D depression score. Models were not adjusted for APOE e4 status because, conceptually, APOE and Ab are expected to share downstream effects on behavior along the same biologic pathway; statistically, we considered the strongly shared variance between APOE e4 and Ab status as meaningful rather than confounding. We examined the effect of APOE e4 status separately on cognitive outcomes. Statistical analyses were performed in SAS (version 9.2) and SPSS (version 18)."}, {"section_title": "RESULTS", "text": "Of the total 194 participants, 107 (55.2%) were classified as Ab-positive. The Ab-status groups did not differ on demographic factors, but the Ab-positive group had a higher proportion of APOE e4 carriers (table 1) . At the time of PiB-PET imaging, 152 participants were clinically adjudicated as cognitive scores consistent with normal cognition, 38 had scores consistent with MCI, 3 had scores consistent with dementia, and 1 participant could not be adjudicated due to sensory impairment. Ab-positive participants had worse mean scores (p # 0.05) on semantic fluency and Trails A, while 3 other mean score differences approached significance: Trails B (p 5 0.06), CVLT learning trials (p 5 0.07), and Rey figure recall (p 5 0.08). Detailed PiB-PET imaging results and associations with concurrent cognitive variables and APOE e4 status have been previously reported. 12 Cognitive and clinical status at GEM study baseline. Table 1 summarizes GEM baseline clinical and cognitive variables from 7 to 9 years prior to PiB-PET imaging (mean 7.6, SD 0.6 years). Of note, estimated premorbid verbal IQ did not differ between Ab-status groups; however, Ab-positive participants reported a higher number of depressive symptoms 7-9 years prior to neuroimaging. With regard to cognitive test performance at baseline, Ab-positive participants had lower performance on the Stroop test, Raven's Progressive Matrices, and trend level for Block Design. Adjusting for demographics did not change results. In models with further adjustment for depression score, only Stroop remained significant, with a trend (p , 0.10) difference for the Matrices.\nChange over time in neuropsychological test scores. Table 2 presents linear mixed model results of annual change in neuropsychological test performance. Mean annual change in raw test score units is presented for each Ab-status group, with 95% confidence intervals (CIs). Of note, if the CI includes 0, there is no significant linear slope (i.e., annual change over time) for that test. Of interest was the Ab status 3 time interaction term to address the hypothesis of greater decline in Ab-positive relative to Ab-negative participants. A significant difference in slopes was observed for immediate and delayed recall of the R-O figure, semantic fluency, and Trail-Making Test parts A and B, in the direction of greater performance decline in Ab-positive relative to Ab-negative participants. A main effect for Ab status was significant for the following models: Stroop (p , 0.01) and Block Design (p 5 0.03) (not shown in table). Main results did not differ when models were adjusted for demographics with and without depression score. Results also did not differ with the removal of 3 participants with cognitive scores consistent with dementia at the time of neuroimaging and one with sensory impairment precluding cognitive adjudication. Figure 1 and figure e-1 on the Neurology ® Web site at www.neurology.org show change over time in neuropsychological test performance by estimates of mean scores for each group at each timepoint. These graphical results are descriptive and unadjusted for covariates; they convey varying trajectories of different cognitive test scores by Ab status in the years preceding neuroimaging (time 0). Of note, some tests show overall decline over time (e. g., figure e-1, Trails A and B), whereas others show improvement reflecting practice effects (e.g., figure 1 , letter fluency). With regard to the time course of Abstatus differences, memory tests (figure 1, CVLT, and figure e-1, R-O recalls) and semantic fluency (figure 1) began to differ between groups approximately 2.5 years prior to neuroimaging, whereas differences in executive/ psychomotor scores (Trails A and B) were apparent around 4.5 years prior. Stroop performance (figure 1), reflecting executive inhibitory control, differed between groups an average of 8 years prior to neuroimaging and remained so, with both groups declining at similar rates.\nResults of linear mixed models using APOE e4 carrier status as the group predictor yielded results similar to Ab status (group 3 time interaction term, table 2), with the following exceptions: significant slope differences (p , 0.05) additionally included CVLT delayed recall and Stroop, while these terms were not significant for Trails B and semantic fluency.\nAdjudication of clinical course. Tables 3 and 4 show the distribution of Ab status by adjudicated course of cognition. Table 3 refers to 152 participants adjudicated as normal cognition at the time of neuroimaging, by course subtypes \"never MCI\" (consistently normal cognition throughout the parent GEM study) vs \"ever-MCI\" (at least one past evaluation with scores consistent with MCI), and no difference in the proportions of Ab-positive status between them. Table 4 shows course subtypes for 38 MCI participants, with the largest proportion of Ab-positive cases in the MCI-unstable group, the lowest proportion in the small MCI-stable group, and the MCI-progressed group falling in the middle. These differences were not significant in unadjusted models and adjusted models (ps . 0.10). Results were the same for APOE e4 status as the grouping variable.\nChange in CDR sum-of-box score. Linear mixed models yielded no significant change over time in CDR sum-of-box scores for Ab-negative (p . 0.30) or for Ab-positive groups (p . 0.50), and no Ab status Table 2 Annual rates (695% CI) of change in Ab groups on neuropsychological tests over 7-9 years prior to PiB-PET imaging a 3 time interaction (p . 0.20). Results did not differ when models were adjusted for demographics with and without additional adjustment for depression. Results were the same for APOE e4 status as the grouping variable. DISCUSSION We have shown in older adults who remain dementia-free into their 80s and 90s that presence of Ab is associated with cognitive decline throughout a range of 7-9 years prior to imaging. We have also shown subtle differences in nonmemory domains, primarily executive functions, between Ab-status groups detectable 7-9 years before neuroimaging. Different cognitive trajectories over time were observed depending on the cognitive task. Some tests showed greater annual decline in Ab-positive than Ab-negative participants, for instance, tests of psychomotor speed and working memory, visual memory, and semantic fluency. A task tapping inhibitory control showed parallel rates of decline but poorer performance in Ab-positive participants throughout the observed time period. In descriptive analyses, verbal declarative memory showed practice effects until approximately 2.5 years before imaging, with a subsequent decline in the Ab-positive group, a later decline than those observed in nonmemory measures. In our study, the observation that nonmemory domains appeared as earlier cognitive correlates of Ab deposition than did memory is likely strongly influenced by the selection of participants who were regularly screened over time for dementia. 13 The natural history of pathologic Ab accumulation, individual variability in rates of fibrillar Ab deposition, as well as differences in cognitive tolerance of Ab 24 are factors not yet understood. While the single PiB-PET imaging design in 2009 of the present study precludes conclusion about causality of cognitive effects in 2000-2002, it is consistent with accumulating evidence that even early prefibrillar forms of Ab can affect synaptic loss, 25 cortical neuronal dysfunction, 26 and cognitive changes. 27 Of note, similar effects on cognitive decline were observed according to APOE e4 carriage, independent of Ab status, although APOE and Ab are confounded in this sample as very few e4 carriers were Ab-negative (5/37).\nOur findings are consistent with previous reports in cognitively screened younger-old participants. [7] [8] [9] One study 7 similarly found greater longitudinal decline on tests of visuospatial ability and working memory in Ab-positive compared to Ab-negative individuals with CDR 5 0 and mean age of 75; decline in episodic memory did not differ between groups. Another report 8 observed greater decline in mental status, executive functions (Trails B), and verbal memory (CVLT) associated with higher PiB retention in individuals without dementia with mean age of 78 years from the Baltimore Longitudinal Study of Aging. The CVLT finding may be related to the longer assessment period (range of 8-12.5 years), or to the younger age distribution of the sample (range 62-92). Consistent among reports of older individuals screened for dementia, however, is that the rates of longitudinal cognitive decline are small, as expected, and that the effect sizes of Ab on differences in annual rates of decline are correspondingly very small, representing fractions of performance points. Such small effects require sufficient power in study design to detect, and they pose clinical challenges for detection of subtle individual cognitive decline over time as an identifiable risk factor.\nThe concept of within-person variability as a potential risk factor for dementia or subsequent cognitive decline has some support. 28, 29 In the current study, within-person across-occasion variability was considered on a clinical-adjudication basis. Adjudicated cognitive trajectories (course) may be useful to take into account for MCI. MCI with history of change (\"unstable\" or \"progressive\" MCI) may be more likely associated with Ab pathology than stable MCI; however, confirmation of this distinction with larger samples is needed. Adjudicated cognitive course in participants with normal cognition (never-MCI vs ever-MCI) was not associated with Ab pathology, suggestive that current cognitive status is a stronger predictive of the presence of Ab than is retrospective course, at least with regard to clinical diagnosis.\nDepressive symptoms were also a correlate of Ab deposition. While clinical depression was not assessed this study, the finding of Ab-status differences on the level of mean depressive symptom count is notable in light of growing evidence for an association between history of depression and risk for AD, 30 and between latelife depression and presence of AD-like Ab deposition. 31 We have shown that Ab deposition among oldest-old dementia-free survivors is associated with greater longitudinal cognitive decline. AD-like Ab deposition, measurable in about half of the population without dementia in the 9th and 10th decades of life, has demonstrable, if subtle, cognitive and behavioral correlates. Further work is needed to develop more sensitive cognitive measures predictive of early presence of AD pathology in anticipation of targeted Ab interventions."}, {"section_title": "AUTHOR CONTRIBUTIONS", "text": "Dr. Snitz: study concept and design, data review and interpretation, drafting of manuscript, drafting figures, manuscript revisions, clinical adjudication of cognitive outcomes. Dr. Weissfeld: data analysis and interpretation. Dr. Lopez: study concept and design, clinical adjudication of cognitive outcomes, data interpretation, critical review of manuscript. Dr. Kuller: study supervision, data collection, data interpretation, critical review of manuscript. Dr. Saxton: data interpretation, clinical adjudication of cognitive outcomes, critical review of manuscript. Ms. Singhabahu: data analysis and interpretation. Dr. Klunk: data collection, data interpretation, critical review of manuscript. Dr. Mathis: data collection, data interpretation, critical review of manuscript. Dr. Price: data collection, review of imaging data and study supervision, critical review of manuscript. Ms. Ives: study supervision, data collection, administrative support, clinical adjudication of cognitive outcomes, critical review of manuscript. Dr. Cohen: review of imaging data, critical review of manuscript. Dr. McDade: data interpretation, critical review of manuscript. Dr. DeKosky: study concept and design, funding, data interpretation, critical review of manuscript. "}]