[{"section_title": "Abstract", "text": "Breast-conserving therapy, that is, local tumor excision followed by external beam radiation to the whole breast (whole-breast irradiation [WBI]), is a standard of care for patients with earlystage breast cancer based on extensive evidence from randomized trials (1-6). Accelerated partial breast irradiation (APBI) is a novel technique that delivers radiation locally to tissue at the highest risk of recurrence with external beam radiation, intraoperative radiotherapy, brachytherapy using multiple interstitial catheters, or intracavitary brachytherapy using a balloon catheter. Advantages of APBI over WBI include decreased overall treatment time and lower radiation dose to uninvolved portions of the breast and normal tissues (7-9).\nThere are also potential disadvantages of APBI, including the possibility that occult foci of cancer elsewhere in the breast will not be treated, which could lead to an increased recurrence rate in the treated breast. Recent analyses suggest that a particular modality of APBI, APBI using brachytherapy (APBIb), is more expensive and less cost effective than external beam radiation (10,11). Prospective, phase III randomized clinical trials investigating the effectiveness and safety of APBI compared with WBI are ongoing, but longterm results are not yet available (12) (13) (14) . To date, phase II studies of APBIb include series with relatively small patient numbers and limited follow-up (14-24).\nBecause of the potential limitations of APBI, lack of definitive evidence establishing long-term efficacy and safety, and the growing popularity of the approach (25), the American Society for Radiation Oncology (ASTRO) convened a task force of breast cancer experts who developed consensus guidelines on patient selection for APBI application outside of a clinical trial (26). These guidelines (ASTRO-G), published in 2009, proposed three groups of APBI appropriateness: \"suitable,\" \"cautionary,\" and \"unsuitable,\" based on patient characteristics and clinical factors."}, {"section_title": "", "text": "Breast-conserving therapy, that is, local tumor excision followed by external beam radiation to the whole breast (whole-breast irradiation [WBI] ), is a standard of care for patients with earlystage breast cancer based on extensive evidence from randomized trials (1) (2) (3) (4) (5) (6) . Accelerated partial breast irradiation (APBI) is a novel technique that delivers radiation locally to tissue at the highest risk of recurrence with external beam radiation, intraoperative radiotherapy, brachytherapy using multiple interstitial catheters, or intracavitary brachytherapy using a balloon catheter. Advantages of APBI over WBI include decreased overall treatment time and lower radiation dose to uninvolved portions of the breast and normal tissues (7) (8) (9) .\nThere are also potential disadvantages of APBI, including the possibility that occult foci of cancer elsewhere in the breast will not be treated, which could lead to an increased recurrence rate in the treated breast. Recent analyses suggest that a particular modality of APBI, APBI using brachytherapy (APBIb), is more expensive and less cost effective than external beam radiation (10, 11) . Prospective, phase III randomized clinical trials investigating the effectiveness and safety of APBI compared with WBI are ongoing, but longterm results are not yet available (12) (13) (14) . To date, phase II studies of APBIb include series with relatively small patient numbers and limited follow-up (14) (15) (16) (17) (18) (19) (20) (21) (22) (23) (24) .\nBecause of the potential limitations of APBI, lack of definitive evidence establishing long-term efficacy and safety, and the growing popularity of the approach (25) , the American Society for Radiation Oncology (ASTRO) convened a task force of breast cancer experts who developed consensus guidelines on patient selection for APBI application outside of a clinical trial (26) . These guidelines (ASTRO-G), published in 2009, proposed three groups of APBI appropriateness: \"suitable,\" \"cautionary,\" and \"unsuitable,\" based on patient characteristics and clinical factors."}, {"section_title": "ARTICLE Accelerated Partial Breast Irradiation Using Brachytherapy for Breast Cancer: Patterns in Utilization and Guideline Concordance", "text": "Recommendations were based on a systematic review of the available APBI literature and expert opinions. To date, two studies have documented use of accelerated partial breast irradiation with brachytherapy (APBIb) in the United States, but they did not analyze patterns of use according to ASTRO-G criteria because of limited availability of clinical data (27, 28) .\nBecause of the growing popularity of APBIb and potential financial incentives for physicians to overuse it, it is important to evaluate patterns of care with respect to appropriateness of use. Because the ASTRO-G guidelines were published in 2009, examination of their penetrance into practice would require waiting several years. However, the data used to derive these guidelines were available to providers making ABPIb treatment decisions. Furthermore, examining patterns of care leading up to the ASTRO-G release will establish a baseline for future studies.\nTherefore, we evaluated patterns of APBIb use compared with external beam WBI in a large population-based cohort. Moreover, we studied whether APBIb treatment was concordant with ASTRO-G, identifying factors associated with suitable, cautionary, and unsuitable APBIb use."}, {"section_title": "Methods", "text": ""}, {"section_title": "Data Source and Cohort Selection", "text": "Data were obtained from the Surveillance, Epidemiology, and End Results (SEER) database (29) , which has included 17 tumor registries since 2000. The SEER program captures approximately 97% of incident cancers, and the 17 tumor registries cover approximately 26% of the US population (30, 31) . Registries collect information on tumor characteristics, date of diagnosis, demographic information, surgical treatment, radiation therapy, vital status, follow-up, and cause of death. In this study, we linked SEER data to 2003 rural-urban continuum codes, a classification scheme developed by the US Department of Agriculture that distinguishes metropolitan counties by the population size of their metropolitan area and classifies nonmetropolitan counties by their degree of urbanization and adjacency to a metropolitan area or areas (32) . We also linked SEER data for patients in this study to county-level sociodemographic information from the 2000 United States census.\nWe identified 139 008 women who were diagnosed with breast cancer from January 1, 2000, to December 31, 2007 . MammoSite (Hologic Inc., Bedford, MA), the first intracavitary balloon brachytherapy device, was cleared by the US Food and Drug Administration (FDA) on May 6, 2002 (33) . Thus, the date range was chosen to include both the most recent years for which data are available since balloon brachytherapy became clinically accessible and a baseline period from 2000 to 2002 when APBI with interstitial brachytherapy was being used (14) . Patients in this SEER cohort met the following inclusion criteria for analysis: localized, unilateral, and pathologically confirmed breast cancer [2002 American Joint Committee on Cancer [AJCC] stage 0, I, II, or III (34)] as their first and only cancer diagnosis; diagnosis not obtained through death certificate or autopsy; and receipt of breast-conserving surgery and radiation therapy. Patients with metastatic disease, those who received mastectomy, and those with incomplete radiation therapy information were excluded. An additional 80 patients with a diagnosis of lobular carcinoma in situ only were also excluded (35) . Because none of the patients in the Alaskan Natives registry received brachytherapy, these 113 patients were excluded, and the analysis was restricted to the remaining 16 registries, leaving 138 815 patients in our final sample. This study was determined to be exempt from review by the Institutional Review Board of the Dana-Farber Cancer Institute."}, {"section_title": "Outcome Variable and Covariates", "text": "The outcome variable was either WBI or APBIb radiation therapy. Patients who received external beam radiation or external beam radiation combined with a brachytherapy boost were grouped into the WBI group. Only 792 (0.6%) of the 138 815 patients received both external beam radiation and brachytherapy. Patients who received radioisotopes or radioactive implants only comprised the APBIb alone group. Other clinical covariates included tumor multicentricity, extensive intraductal component (EIC, defined as >25%), estrogen receptor (ER) status, progesterone receptor (PR) status, tumor size (none found, ≤2 cm, 2.1-3 cm, or >3 cm including inflammatory breast cancer), number of positive axillary lymph nodes, type"}, {"section_title": "CONT E X T A N D C A V E A T S", "text": "Prior knowledge Accelerated partial breast irradiation using brachytherapy (APBIb) is an alternative to standard whole-breast irradiation in some patients after breast cancer surgery, although there is no definitive evidence that the two techniques are equivalent in safety and efficacy. It was not yet known whether APBIb is being used in accordance with 2009 ASTRO consensus guidelines (ASTRO-G)."}, {"section_title": "Study design", "text": "The authors identified 138 815 women from Surveillance, Epidemiology, and End Results data who received APBIb or wholebreast irradiation in 2000-2007. Each patient was classified as suitable, cautionary, or unsuitable for APBIb by ASTRO-G criteria."}, {"section_title": "Contribution", "text": "Use of APBIb has increased from 0.4% in 2000 to 6.6% in 2007 in the United States, especially among white women with lowergrade tumors who reside in cities. Although 32% of women who received APBIb were considered suitable, 29.6% were considered cautionary and 36.2% were considered unsuitable by ASTRO-G criteria."}, {"section_title": "Implications", "text": "The data suggest that treatment using APBIb has been rapidly increasing in the United States, even among patients who may not be suitable for this treatment. Women living in certain geographic regions were more likely to receive APBIb after controlling for other clinical or demographic factors."}, {"section_title": "Limitations", "text": "The ASTRO-G were published in 2009, after the study period (2000) (2001) (2002) (2003) (2004) (2005) (2006) (2007) . Several kinds of clinical data that are included in the guidelines were missing from SEER data, so the number of patients in the cautionary and unsuitable categories may be underestimated. The long-term effects of treating women who may be unsuitable for APBIb are not yet known. "}, {"section_title": "From the Editors", "text": ""}, {"section_title": "Subgroup Classification", "text": "Patients were classified into three appropriateness categories according to the ASTRO-G for APBI (26) . Patients were considered suitable if they met all of the following criteria: age 60 years and older; tumor 2 cm in diameter or less; T1 stage; ER positive; unicentric tumor; invasive ductal, tubular, or mucinous histology; no pure DCIS; no EIC; pN0; and nodal surgery of either sentinel lymph node biopsy or axillary lymph node dissection. Patients were considered cautionary if they met any of the following criteria: age 50-59 years; tumor size 2.1-3 cm; T0 or T2 stage; ER negative; invasive lobular histology; pure DCIS ≤ 3 cm; or EIC ≤ 3 cm. Patients were considered unsuitable for APBI if any of the following criteria were present: age < 50 years; tumor size > 3 cm; T3 or T4 stage; multicentric disease; pure DCIS >3 cm; EIC > 3 cm; pN1, N2, or N3; or no nodal surgery performed. Patients were classified based on their worst risk factor; if a patient met one cautionary and one unsuitable criterion, she was placed in the unsuitable category. Information on BRCA1 or BRCA2 mutation status, margin status, lymphovascular space invasion, multifocality, and neoadjuvant chemotherapy were not available in the SEER database but are included in the ASTRO-G (26) . Overall, 2488 (0.8%) of the 138 815 patients were unable to be classified into one of the three groups because of missing data and were thus not included in the analysis."}, {"section_title": "Statistical Analysis", "text": "Univariable analyses were performed to identify predictors of ABPIb vs WBI. Continuous variables were compared using the Kruskal-Wallis test, nominal categorical variables were compared using Fisher exact test, and ordered categorical variables were analyzed using the Mantel-Haenszel x 2 test. Because DCIS and invasive breast cancer are distinct diseases, with differences in pathological assessment and tumor characteristics, we hypothesized that different factors might influence treatment choices among DCIS patients compared with invasive breast cancer patients. Thus, separate multivariable models were created for both of these groups. Each model used multivariable logistic regression with backward selection to identify factors independently associated with APBIb use. Categorization of variables was consistent across the two cohorts, and reference groups were chosen a priori for categorical variables. Hawaii was chosen as the referent SEER registry for ease of interpretation because it had the lowest use of brachytherapy. For the DCIS cohort, histology was not entered into the model because all patients had DCIS, and EIC was not entered because of redundancy.\nWe similarly conducted multivariable logistic regression modeling in each of the three ASTRO-G appropriateness categories: suitable, cautionary, and unsuitable. For these models, DCIS and invasive breast cancer patients were combined to adhere to ASTRO-G categorization. Because DCIS and invasive breast cancer patients were grouped together, a generic histology variable (DCIS vs invasive breast cancer) was used in these models. Because age younger than 60 years, age 60 years or older, and categorical tumor size were used as criteria for classification, age and tumor size were entered as continuous variables in all three models to avoid redundancy. For the suitable category model, pure DCIS, EIC, ER status, PR status, multicentricity, and lymph node status (positive, negative, unknown) were all excluded because these variables were used for defining this cohort within the classification rules of ASTRO-G. Similarly, ER status, lymph node status, and multicentricity were excluded from the cautionary model, and multicentricity was excluded from the unsuitable model. In the model for unsuitable patients, the ER and PR status variables were collinear, thus PR status was excluded.\nFor each of the multivariable models, only variables that were statistically significant on univariable analyses at an a level of .05 were included as candidates for the final model, other than the exclusions described above. Missing value categories were removed for variables for which there were too few observations to avoid unstable estimates of effects. Overall type 3 analyses of effects, individual effects for each variable that remained in the model, and odds ratios with associated 95% confidence intervals were generated. We used the Hosmer-Lemeshow test to assess goodness of fit, and it was satisfactory in all models presented. All statistical analyses used two-sided tests and were conducted using SAS software, version 9.2 (SAS Institute, Cary, NC)."}, {"section_title": "Results", "text": ""}, {"section_title": "Descriptive Statistics and Univariable Analyses", "text": "In this study sample, 3576 (2.6%) of 138 815 patients received APBIb. A comparison between treatment groups (Table 1) shows that the APBIb group was older (median age 63 vs 58 years, P < .001) than the WBI group. There was a statistically significant increase in APBIb use with year of diagnosis (from 0.4% in 2000 to 6.6% in 2007, P < .001). Treatment varied by ASTRO-G category: 5% of suitable patients, 3.4% of cautionary patients, and 1.6% of unsuitable patients received APBIb (P < .001) ( Table 2 ). Use of APBIb increased among all three groups of patients and most rapidly among suitable patients ( Figure 1 ). The majority of patients who received APBIb were || Alaskan patients are shown in Table 1 because they were included in the univariable analysis by SEER Registry. However, they were not included in any of the other univariable or multivariable analyses. "}, {"section_title": "Variation in APBIb Use by Geographic Location", "text": "Use of APBIb varied widely by SEER registry, from 0% in Alaska and 0.4% in Hawaii to 5% in Louisiana and 7% in Atlanta, Georgia (Table 1) . This geographic variability in utilization patterns is shown graphically in Figure 2 ."}, {"section_title": "Overall Multivariable Analysis in DCIS and Invasive Breast Cancer Patients", "text": "Among patients with pure DCIS (n = 13 438), women who were Hispanic (odds ratio [OR] = 0.58, 95% confidence interval [CI] = 0.35 to 0.98, P = .04) or \"other\" (mostly Asian) race (OR = 0.40, 95% CI = 0.20 to 0.78, P = .008) were less likely to receive APBIb than non-Hispanic and white women, respectively (Table 3) . Patients who were aged 60 years or older were more likely to receive APBIb than patients younger than 50 years of age (OR = 1.8, 95% CI = 1.32 "}, {"section_title": "Multivariable Analyses by Guideline Category", "text": "Other race patients were less likely to receive APBIb than white women, no matter whether they were categorized as suitable (OR = 0.51, 95% CI = 0.34 to 0.75, P < .001), cautionary (OR = 0.57, 95% CI = 0.41 to 0.79, P < .001), or unsuitable (OR = 0.46, 95% CI = 0.34 to 0.64, P < .001) ( Table 4) . Compared with white women, APBIb was less likely to be used by black women who were categorized as cautionary (OR = 0.76, 95% CI = 0.60 to 0.97, P = .027) or unsuitable (OR = 0.77, 95% CI = 0.63 to 0.93, P = .008). Hispanic women who were categorized as cautionary were less likely to receive APBIb than cautionary non-Hispanic women (OR = 0.75, 95% CI = 0.58 to 0.98, P = .036).\nUse of APBIb varied considerably with geographic location among suitable patients (OR = 2.60-8.62, P < .001), cautionary patients (OR = 3.10-10.2, P < .001), and unsuitable patients (OR = 3.33-21.6, P < .001) (Table 4) . Also, the odds of APBIb use in particular locations increased as appropriateness decreased. For example, in Atlanta, Georgia, the odds ratio increased from 8.6 (95% CI = 3.59 to 20.7) among suitable patients to 10.2 (95% CI = 4.01 to 26.0) among cautionary patients and 21.6 (95% CI = 6.76 to 69.1) among unsuitable patients, although confidence intervals were wide. The same trend was seen for several other SEER sites including Greater California, Michigan, Utah, Rural Georgia, Louisiana, and Kentucky.\nThe odds of APBIb use increased in more recent years of diagnosis (2006-2007 vs 2000-2002) , among suitable (OR = 20.3, 95% CI = 13.4 to 30.6, P < .001), cautionary (OR = 17.6, 95% CI = 11.3 to 27.3, P < .001), and unsuitable (OR = 12.7, 95% CI = 9.61 to 16.7, P < .001) patients. Women categorized as cautionary who resided in counties not adjacent to metropolitan areas were less likely to receive APBIb than similar city women (OR = 0.53, 95% CI = 0.32 to 0.87, P = .012). Patients with tumors of higher histological grade (grade 2 or 3 vs grade 1) were less likely to receive APBIb among suitable, cautionary, and unsuitable categories (Table 4) .\nWomen who underwent axillary dissections were less likely to receive APBIb across all ASTRO-G groups. Among unsuitable patients, ER-negative status (OR = 0.75, 95% CI = 0.62 to 0.90, P = .002) and positive lymph nodes (OR = 0.50, 95% CI = 0.42 to 0.60, P < .001) were associated with lower APBIb use. Age at diagnosis, analyzed as a continuous variable, was associated with a small but statistically significant increase in APBIb use among suitable and unsuitable patients (Table 4) . Tumor size, also analyzed continuously, did not meet statistical entry criteria for these multivariable regression models."}, {"section_title": "Discussion", "text": "Although results from prospective randomized phase III trials comparing WBI and APBI are not anticipated for several years, APBIb is already being used after breast-conserving surgery (27, 28) . In this large population-based study of women with nonmetastatic breast cancer who received breast-conserving therapy, we found that APBIb treatment generally followed guidelines: 5% of suitable patients received APBIb, 3.4% of cautionary patients, and 1.6% of unsuitable patients. However, we have shown that use of APBIb has increased dramatically since 2000, even among patients who may not be suitable for APBIb. We found wide geographic disparity in use of APBIb after adjusting for other demographic and clinical factors.\nThere was a dramatic increase in overall APBIb use over time, from 0. We found a wide range of utilization patterns across the United States with specific geographic regions having higher APBIb use despite other patient and clinical factors. This geographic variation appears to be consistent with prior reports (28) . Odds of APBIb were inversely correlated with treatment suitability in certain geographic areas. That is, the odds of APBIb were higher among unsuitable (than suitable or cautionary) patients in many SEER sites. However, confidence intervals were wide, and the different models do not allow direct comparison of these odds. Formal statistical modeling of APBIb use with interaction terms between SEER registry and unsuitable risk factors was not possible because of small numbers. Nevertheless, there does appear to be heterogeneity across regions in terms of APBIb treatment selection criteria. The explanation for this phenomenon is unclear. There may be practitioner preferences or biases in these areas. Financial incentives like compensation or reimbursement may drive utilization; a study of chemotherapy practices found that providers who were more generously reimbursed prescribed costlier regimens to metastatic cancer patients (38) . Although the ASTRO-G had not yet been published during the study period, all of the evidence on which the guidelines were based were published from 1990 to 2007, and therefore available to providers making treatment decisions. Regardless of why the geographic variation in practice patterns exists, it is nevertheless of concern that APBIb use is growing among patients who may not be suitable candidates for this radiation technique.\nWe also found substantial racial and ethnic disparities with respect to APBIb use. Other race patients were half as likely to receive APBIb compared with white patients regardless of appropriateness for this technique and regardless of whether they had DCIS or invasive breast cancer. Although black and white patients had equivalent rates of APBI utilization, multivariable modeling by ASTRO-G category showed that white women were more likely than black women to receive APBIb among patients classified as cautionary or unsuitable. Hispanics were less likely to receive APBIb than non-Hispanics, among those with DCIS, invasive breast cancer, and among cautionary patients. This pattern of racial and ethnic variation in treatment delivered may reflect access to newer radiation centers where APBIb is a potential treatment option. In a recent Medicare claims study, white patients were more likely than black and other race patients to receive radiation after breast-conserving surgery (39) . Another recent study of over 3 million patients showed that Hispanics were less likely than nonHispanics to use high-technology hospitals (40) . These disparities may also reflect different preferences among racial and ethnic groups for standard or more nonstandard treatments.\nDistance from metropolitan location was associated with use of APBIb. Among patients with invasive breast cancer, location outside of a metropolitan area decreased the odds of receiving APBIb. Cautionary patients living in counties not adjacent to metropolitan areas were almost half as likely to receive APBIb as those in metropolitan areas. One of the advantages of APBIb is the decreased overall treatment time (5-6 weeks for WBI vs 1-2 weeks for APBIb), which may be attractive to patients who live farther away from radiation facilities. Certainly, distance from a radiation facility can affect treatment choice. In a SEER study, women living 15 miles or farther from a radiation facility were more likely to receive mastectomy even when breast-conserving surgery was feasible (41) . However, in this study, even though patients living farther from metropolitan locations may benefit from the decreased travel time associated with APBIb, their location may be an impediment to access more modern radiation facilities that would offer this treatment.\nOlder age was an important predictor of APBIb among all patients, which is consistent with a prior report (28) . Women aged 60 years or older were twice as likely to receive APBIb compared with those younger than 50 years, and this is consistent with the ASTRO guidelines, which suggest that patients 60 years or older may be suitable for APBIb off-protocol. The median age of patients treated with APBIb in reported clinical studies has been 60 years or older, and few patients aged 50-59 years or younger than 50 years have been treated with APBIb in prospective trials (14, 26) . Because older patients may be less likely to receive radiation after breast-conserving surgery (42), they may be more likely to receive APBIb off-protocol because of the convenience of this technique. Only 1.3% of patients younger than 50 years received APBIb in this study, which may be due to extrapolation from literature showing that younger age is an independent risk factor for ipsilateral breast tumor recurrence after breast-conserving therapy with WBI (43,44). Several clinical and pathological characteristics were associated with APBIb, which have not previously been reported. Patients with ILC were almost half as likely to receive APBIb compared with those with IDC, which is concordant with the ASTRO-G guidelines and may reflect data showing higher risk of ipsilateral breast tumor recurrence among patients with lobular histology treated with APBIb (45, 46) . Larger tumor size (2.1-3 cm or >3 cm) was associated with progressively lower odds of APBIb, also concordant with ASTRO-G. Only 1.5% of patients with 2.1-3 cm tumors and 0.7% of patients with tumors larger than 3 cm received APBIb. Patients with multicentric tumors (foci of cancer in different quadrants of the breast) are unsuitable for APBIb per the guidelines because the extent of disease cannot be accurately treated with partial breast techniques. These patients were 20% less likely to receive APBIb in this study. Because histological grade has not routinely been considered among eligibility criteria for prospective APBIb studies, it was not included in the ASTRO-G. Our data show that higher grade is associated with progressively lower odds of APBIb among invasive breast cancer patients and within each guideline category. This pattern may reflect data extrapolated from invasive breast cancer patients treated with WBI, showing that higher-grade disease is associated with increased risk of ipsilateral breast tumor recurrence and lower disease-free survival (47, 48) .\nPatients with pure DCIS are cautionary (for tumors ≤3 cm) or unsuitable (tumors >3 cm) in the ASTRO-G because of a lack of long-term data when the guidelines were written (most of the prospective APBIb trials excluded DCIS patients) (26) . We found that 2.5% of patients with DCIS were treated with APBIb, which is only slightly less than the 2.7% of those with IDC who received APBIb. Among DCIS patients, a more recent year of diagnosis was the most statistically significant predictor for APBIb; those diagnosed in 2006-2007 were over 28 times more likely to receive APBIb than those diagnosed in 2000-2002. Thus, it appears that utilization of APBIb among DCIS patients is rapidly increasing. EIC is similarly considered to be a cautionary (for tumors ≤3 cm) or unsuitable (tumors >3 cm) risk factor, and it was associated with a 25% decreased likelihood of APBIb. Recently published series of patients with DCIS treated with APBIb report ipsilateral breast tumor recurrence rates of 2%-11% at 4 years (49) (50) (51) (52) , and one of these series found a potential correlation between DCIS and increased risk of local failure (52) . Future studies on APBIb practice patterns among DCIS patients will be interesting as the literature on this subset of patients matures.\nComplete pathological nodal evaluation with either sentinel lymph node biopsy or axillary lymph node dissection is required for suitable categorization, and no nodal surgery designates patients as unsuitable for APBIb per the ASTRO guidelines. Of patients who did not undergo nodal surgery, 2.2% received APBIb. Patients with node-positive disease are considered unsuitable per the guidelines, and most of the single-arm prospective clinical trials on APBIb include node-negative patients only. Only 0.8% of patients with node-positive disease were treated with APBIb, which is concordant with the guidelines. Compared with node-negative patients, node-positive patients were 50%-60% less likely to receive APBIb.\nER-positive tumors are suitable for APBI per ASTRO-G, and those with ER-negative tumors are considered cautionary because most patients treated in prospective trials were ER positive. Among unsuitable patients, ER-negative patients had 25% lower odds of receiving APBIb as ER-positive patients, which is concordant with the published literature. ER and PR status were not statistically significant predictors in the overall models of invasive cancer and DCIS patients, which may be because 15% of patients had unknown or undetermined receptor status.\nAlthough this cohort is generalizable to the US population of women with nonmetastatic breast cancer, this study is subject to all of the biases and limitations associated with large database studies. In addition, we were missing several clinical variables that are included in the guidelines: BRCA1 or BRCA2 gene mutation status, margin status, lymph-vascular space invasion, multifocality, and neoadjuvant chemotherapy. This may have resulted in miscategorization of patients as presence of an adverse risk factor relating to these variables would move patients otherwise classified as suitable to the cautionary or unsuitable categories. Thus, our study underestimates the number of patients in the cautionary and unsuitable categories and overestimates the number of suitable patients. This misclassification would bias our results to a more conservative estimate of guideline concordance or to the null hypothesis. Despite this bias, we found that the majority of patients (65.8%) treated with APBIb were cautionary or unsuitable by our definition. Also, in terms of geographic comparisons, the unique patient population of Hawaii and cultural and logistical differences in access to cancer care there may also influence differences seen in APBIb use between Hawaii and other registries (53) .\nIt may be several years before we have definitive evidence from phase III randomized clinical trials as to whether APBIb and WBI are equivalent in terms of disease control, toxicity, and cosmetic results. Patients who elect to receive APBIb even though they are not suitable candidates for APBIb should be encouraged to enroll on randomized trials. The ASTRO-G guidelines were published to help physicians decide which patients may be appropriately treated with APBIb offprotocol. Recent single-institution and registry series looking at patients treated with APBIb stratified by ASTRO-G category have shown no statistically significant difference in ipsilateral breast tumor recurrence rates between suitable, cautionary, and unsuitable patients, although follow-up is short, patient numbers are limited, and treatment is not randomized (21, 52, 54) . Nevertheless, the ASTRO-G may not accurately distinguish low-and high-risk patients for APBI.\nTo our knowledge, ours is the most rigorous study to explore whether APBIb practice patterns in nonclinical trial settings in the United States have been concordant with ASTRO-G. The wide geographic disparity in use of APBIb suggests that unwarranted variation (55)-practice variation not explained by illness, patient preference, or evidence-based medicine-may be present, which can have a profound impact on health-care costs and patient outcomes (56, 57) . Future studies of APBIb use will help elucidate whether patterns change as ASTRO-G diffuse into practice and whether regional and temporal changes in APBIb cost, reimbursement, and insurance coverage affect utilization."}]