[{"section_title": "Abstract", "text": "Abstract. Meat goat enterprise efficiency was estimated using an input distance function (IDF) by applying stochastic production frontier techniques for the southeastern U.S. region. We found increasing returns to scale and scope economies for southeastern U.S. meat goat enterprises. Mean technical efficiency was 0.81. Our results suggest southeastern U.S. meat goat enterprises can be scale efficient if their size of operation is >ß60 goats or >40 breeding does. Cost and IDF analyses show input expenses decreased substantially with increasing scale of operations in southeastern U.S. meat goat production. Empirical Monte Carlo simulation techniques show consistency of small-sample properties for the IDF."}, {"section_title": "Introduction", "text": "Goat meat is the most heavily consumed red meat in the world (Barkley et al., 2014) , and much of the rural population in developing countries depends on meat goat production as an important income source and food. Though developing countries produced approximately 97% of the world's total goat meat in 2008 (FAOSTAT, 2014) , the industry has rapidly expanded in the United States in Meat Goat Enterprise Efficiency 53 recent years. Expansion of the industry has occurred alongside (1) the formation of the American Meat Goat Association in 1992 and the American Boer Goat Association in 1993, with Boer goats displacing a significant portion of the Spanish goats that were previously the bulk of the meat goat population; (2) the repeal of the Wool Act of 1954 in 1993, which caused Angora goat producers to switch to meat goat production; and (3) the financial settlements of the U.S. tobacco industry, which caused former tobacco farmers to search for alternative farm enterprises (Spencer, 2008) . Furthermore, diversification of U.S. population demographics with immigration from goat meat-consuming countries has led to increased demand for goat meat. The number of meat goats produced in the United States increased from 1.23 million to 2.05 million over the period 1997 to 2012 (U.S. Department of Agriculture, National Agricultural Statistics Service [USDA-NASS], 2014).\nThe majority of U.S. meat goat production is scattered throughout the southeastern United States, with Texas dominating the production of meat goats among all U.S. states. The strong interest of Texas in meat goat production has been largely due to its dry climate and suitable forage species (Shurley and Craddock, 2014) . The Southeast region is well suited to producing meat goats because of ample acreage suitable for grazing and extended grazing periods for goat production. Southeastern meat goat producers have the opportunity to pasture goats year-round, decreasing their dependence on concentrated feedstuffs and adding value to goats with less expensive inputs compared with other regions. Other regions must depend on the use of conserved or stockpiled forages during a few months of the year. The advantage of southeastern U.S. meat goat production is the region's more amenable weather, considerably longer grazing season, lower need for supplemental feed, and simpler and cheaper goat housing (Singh-Knights and Knights, 2005) .\nAs a relatively new livestock industry in the United States, the meat goat industry has not been studied extensively compared with other livestock industries such as beef cattle or swine. Therefore, comparatively little information exists regarding U.S. meat goat production, specifically the factors that can positively impact meat goat production efficiency. Much of the meat goat economics research in the United States has focused on goat meat marketing and consumer preferences for goat meat (Ibrahim, 2011; Knight et al., 2006; Worley et al., 2004) . Studies on goat farm production efficiency, productivity, and profitability are limited; those that have focused on production efficiency have addressed the industry in other countries (Alex, Cheemani, and Thomas, 2013; Ogunniyi, 2010; Zaibet et al., 2004) . The 2012 Census of Agriculture (USDA-NASS, 2014) estimated that approximately 77% and 78% of all goats in the United States were raised for meat in 2002 and 2012, respectively. Meat goat farm numbers and operation sizes increased, respectively, by 34.6% and 5.9% from 2002 to 2012, showing increased meat goat production.\nThe objectives of this study are to determine the factors influencing meat goat production technical efficiency (TE) and to quantify scale and scope economies\nfor meat goat production in the southeastern United States. An input distance function (IDF) using stochastic production frontier (SPF) techniques is estimated for southeastern U.S. meat goat production. The costs of production for different sizes of operations for southeastern U.S. meat goat production are estimated, and results are compared with the IDF analysis. Empirical Monte Carlo (MC) simulation techniques are employed to show the consistency of small-sample properties for the IDF analysis."}, {"section_title": "Estimating an Input Distance Function for Southeastern Meat Goat Farms", "text": "To estimate the efficiency of southeastern U.S. meat goat production, a parametric SPF technique is used, which reveals the nature of the production technology, allows for statistical inferences, and measures the firm-specific efficiency characteristics. In general, the SPF model is specified as follows:\nwhere y is the production level, x is a vector of input quantities, v is a vector of unobserved farmer heterogeneity, and u is the vector representing technical inefficiency. The random error v is independently and identically distributed as N(0, σ 2 v ) and is independent of u; error u ≥ 0 is independently and identically distributed as half-normal, u|N(0, σ 2 u )|. Using the SPF, we estimate an IDF to determine the economic performance of southeastern U.S. meat goat farms. The IDF is specified as D I (X, Y ) for this study, where X and Y denote vectors of inputs and outputs, respectively.\nA translog functional form is used to approximate the IDF for empirical implementation to limit a priori restrictions on the relationship among inputs. Applying homogeneity of degree 1 in inputs and symmetry restrictions of the parameters, the IDF can be specified as follows:\nwhere i denotes farms; k and l denote the outputs; m and n denote the inputs; and X * = X X 1 with X 1 specified as a normalization factor in inputs. The term ln D I i (X, Y ) is the distance from the frontier, and it characterizes the technical inefficiency error, −u i . Technical inefficiency is a function of farm-and farmerspecific characteristics.\nDividing all inputs and the distance term, D I i (X, Y ), by an input, qualityadjusted land, specified as X 1 = X LAND to be consistent with much of the Meat Goat Enterprise Efficiency 55 literature on farm production, is the same as imposing the homogeneity restrictions. The IDF is specified on a per acre basis. Equation (2) can be rewritten as follows:\nTE is obtained as the expectation of the term −u i conditional on the composed error term ε i = ν i − u i and is measured as TE = exp −u i . The following specific IDF is estimated using an SPF for southeastern U.S. meat goat production enterprises:\nThe output variables are defined ( Ball et al. (2008) to account for land heterogeneity.\n2 Total variable expenses include feed expenses, marketing charges, seed and plant expenses, fertilizer and chemical expenses, purchased livestock expenses, bedding and litter expenses, medical supplies including veterinary and custom services, fuel and oil expenses, electricity expenses, all other utility expenses, farm supplies and marketing containers including hand tools, maintenance and repair including parts and accessories expenses, total labor expenses, machine hire and custom work expenses, other livestock related expenses, and other variable expenses.\n3 Total fixed expenses include depreciation, insurance, interest and fees paid on debts, property taxes, and rental and lease payment expenses. The random error ν i is independently and identically distributed asN(0, σ 2 v ), and independent of u i . u i ≥ 0 is a one-sided error term independently distributed with truncation at zero of theN( \nwhere i represents unobservable independently distributed random variables. The southeastern U.S. meat goat enterprise efficiency variables (Table 1) include the following: F College is a dummy variable indicating the farmer held a bachelor's degree or higher (the base category is a less than a college degree). F F emale is a dummy variable indicating the meat goat operator was a female (the base category is a male operator). F Age is a categorical variable in years (15-year increments) indicating the age of the farmer. F Mf arm and F Lf arm are dummy variables for operation sizes with 20 to 100 and >100 meat goats, respectively (a small operation with <20 meat goats is the base). F %Gincome is the percentage of annual net farm income from the meat goat enterprise, a measure of farm specialization. F Offfj ob is a dummy variable for the operator holding an off-farm job. F SS is subregional dummy variable for the Southern Seaboard farm resource region, as defined by USDA Economic Research Service (ERS) (F OR is the Other Region, which includes Eastern Uplands, Mississippi Portal, and Fruitful Rim farm resource regions and is considered as the base level).\nF P astrot is the number of breeding-aged goats in a pastured and rotated production system. F Drylot is the number of breeding-aged goats in a dry lot production system (F Extrangpast is the number of breeding-aged goats in extensiverange or pasture/woods and pastured but not rotated production systems, serving as the base). The variable F Breedshow refers to the percentage of meat goat sales for breeding stock or show, with the percentage of meat goat sales for slaughter/other purposes being the base.\nOutput and input variables may have zero values in the data. The zero value observations lead to biased estimation of the parameters of the translog function. Therefore, it is problematic for the production function (Battese, 1997) . However, the coefficients of the variables with zero values can be estimated using dummy variables to avoid biased estimation (Battese, 1997) : Past studies have used two-step estimation of stochastic frontier models and TE measures (Alex, Cheemani, and Thomas, 2013; Featherstone, Langemeier, and Ismet, 1997; Rakipova, Gillespie, and Franke, 2003) . We also use the two-step maximum likelihood method to estimate the parameters of the IDF using SPF techniques and a Tobit model to determine the relationship between the efficiency measures and farm/farmer characteristics due to relatively small sample size in this study. However, a single-step maximum likelihood method estimation procedure is recommended (Schmidt, 2011; Wang and Schmidt, 2002) . For comparison analysis, we use a single-step maximum likelihood method 4 to estimate the parameters of the IDF and the technical inefficiency jointly using SPF techniques. The results of the single-step maximum likelihood method were very close to the two-step maximum likelihood method and confirmed consistency of estimations."}, {"section_title": "Data", "text": "We conducted a nationwide mail survey of U.S. commercial meat goat producers during January 2013, collecting cost and returns data from those farms for 2011. The cost and returns survey was a follow-up to an earlier mail survey of late summer 2012, which addressed U.S. commercial meat goat production technology, marketing, farmer attitudes, and farm and farmer characteristics. Dillman's (2007) tailored design method was used to design the survey. At the end of the first survey, meat goat producers were asked whether they would be willing to complete a follow-up survey on costs and returns of meat goat production. A total of 435 meat goat producers indicated their willingness to complete the follow-up questionnaire. Two contacts were made, both with copies of the questionnaire on cost and returns of meat goat production. For the follow-up questionnaire, we received a total of 124 completed responses. After adjusting for undeliverable surveys, producers who did not produce meat goats, and incomplete surveys, the effective return rate was 30%.\nIn this study, we use 69 farms as a subsample population for southeastern U.S. meat goat production efficiency. The Southeast includes parts of the following farm resource regions as designated by USDA-ERS (2000): Eastern Uplands, Fruitful Rim, Mississippi Portal, and Southern Seaboard. The southeastern states include Alabama, Arkansas, Florida, Georgia, Kentucky, Louisiana, Mississippi, Missouri, North Carolina, Oklahoma, South Carolina, Tennessee, Texas, Virginia, and West Virginia. Parts of Oklahoma and Texas are included, divided on a line corresponding to north-south Interstate 35, with the eastern halves of these states being included in the Southeast region. The southernmost counties of Missouri were also included in the Southeast region.\nMissing information is a common issue for survey data; missing data may result in biased estimates and reduce regression estimate efficiency (Rubin, 1987) . Various methods exist to handle missing data issues. The multiple imputation method (Rubin, 1987) was used to handle missing data in this study. We employed the truncated regression imputation method to estimate missing values of continuous variables."}, {"section_title": "Monte Carlo Simulation", "text": "There is often the concern that a small sample size may result in a lack of statistical representation of the population causing a concern over consistency of estimates. MC simulation is used in this study to investigate small-sample properties of the data given that our sample size is not large. Hypothetical (based on artificial data) and empirical (based on our data) MC simulations were conducted to determine consistency: that the sampling distributions of the estimators approach very closely their true parameter values as the sample size increases. The idea behind the MC simulation experiment is to model the data generation process (DGP). The MC simulation technique is designed to elucidate the finite-sample properties of competing estimators for a given estimation problem (Kennedy, 2003) . The MC simulation method provides valid statistical inferences of small-sample distributions through the repeated sample. The reader is referred to Davidson and MacKinnon (1992, 2004) , Kiviet (2012), Kennedy (2003) , and Cameron and Trivedi (2009) for greater detail on the MC procedure.\nOur hypothetical MC simulation and the estimation results 5 showed that there was no significant bias and the asymptotic distribution approximated the smallsample distribution well for the DGP with samples of sizes 250, 500, and 1,000. For the empirical MC simulation, the SPF was specified as a normal-exponential model, and the following DGP was considered:\nwhere\nBoth idiosyncratic and inefficiency error scale parameters were a function of a constant term and of an exogenous covariate (zv i and zu i ) drawn from a\nstandard normal random variable of [rnormal (0, 1)]. The y and x variables are outputs and inputs, respectively, in the DGP equation (equation 7). In other words, equation (7) is the same as equation (4). The difference is that we assigned arbitrary numerical values for each of the variables in the DGP equation (equation 7) as \"true\" values (or population values) to see how closely our parameter estimates approach those \"true\" values with increasing sample size (or with increasing numbers of replications in the MC simulation). We used the DGP equation (equation 7) to conduct MC simulations for the SPF model.\nWe performed 250, 500, and 1,000 simulations and for each simulation, and we obtained parameter estimates, standard errors, and test sizes. The average of β j over the N estimates, β j = (1/N ) N n=1 β n , represents the simulation estimates of E( β j ), where N is the number of simulations and j is the number of parameters. The variance of β j over the N estimates, s\nrepresents the simulation estimates of σ 2 β j = V ar( β j ), the variance of β j . The test size is the probability of rejecting the null hypothesis when it is true. Because the DGP sets β j as the \"true\" value, we consider a two-sided test of the null hypothesis (H 0 : β j = the \"true\" value) against the alternative hypothesis (H 1 : β j ࣔ the \"true\" value). \"True\" values are the DGP values of equation (7). The nominal size of the test α = 0.05, and we use the t-test. The proportion of simulations that lead to a rejection of H 0 is known as the rejection rate, and this proportion is the simulation estimate of the true test size. Empirical MC simulation results for the southeastern U.S. meat goat enterprise are presented in Appendix A. Results indicate that the means of the parameter estimates approach very closely the true values of the DGP, and the standard deviations (SDs) of the parameter estimates become close to the means of the standard errors with increasing numbers of simulations. The rejection rates of the parameters become less than the nominal size of 0.05 or 5% with increasing numbers of simulations. We estimated 95% confidence intervals for the MC simulation averages. 7 The results for the parameter estimates and the rejection rates indicate that there are no significant biases and that the asymptotic distribution approximated the finite-sample distribution well for the DGP with samples of sizes 250, 500, and 1,000 (number of replications). The confidence intervals for the standard errors include the sample SDs for the parameter estimates, another indication that large-sample theory provides a good approximation to the finite-sample distribution. "}, {"section_title": "Meat Goat Enterprise Efficiency 61", "text": ""}, {"section_title": "Results", "text": "Data from first and follow-up surveys were used for this study; therefore, there was concern as to whether there were differences between the survey sample means. We conducted t-tests were conducted to determine statistically significant differences between the survey subsample means for southeastern U.S. meat goat production ( Table 2 ). The null hypothesis is defined as H 0 :x f s =x ss , and the alternative hypothesis as H 1 :x f s =x ss , wherex f s is the mean for the first survey subsample variables andx ss is the mean for the follow-up survey subsample variables. The t-test results failed to reject the null hypothesis, concluding that there is not sufficient evidence to suggest the subsample means differ at P ≤ 0.10 levels ( Table 2) . We conducted a number of tests on the structural form of the translog model by incorporating restrictions on the parameters. The likelihood ratio test was used to test the restrictions on the parameters. Test results showed that the explanatory variables in the model for inefficiency effects contributed significantly to the explanation of technical inefficiency effects. Test results 8 showed that the translog functional form described better the underlining production technology of southeastern U.S. meat goat enterprises relative to the alternative Cobb-Douglas production functional form."}, {"section_title": "Comparing Meat Goat Cost of Production by Operation Size", "text": "We compared costs for three different tertiles of southeastern U.S. meat goat farms. The sample population of this study, 69 southeastern U.S. farms, was divided into three equal operation sizes (23 farms each) based on goat production land, number of goat breeding does, and number of meat goats. A comparison of southeastern U.S. meat goat enterprise expenses per acre of goat production land by operation size (small, medium, and large) is shown in Table 3 . The meat goat enterprise total and variable expenses per acre for medium-and large-sized farms were lower than for small-sized farms. The fixed expense per acre for Note: Superscripts (a, b, c) indicate significant differences (P < 0.10) in means across columns with a = small farms, b = medium farms, and c = large farms.\nmedium-sized farms was lower than for small-sized farms. The fixed expense per acre for large-sized farms was lower than for small-and medium-sized farms. The comparison of southeastern U.S. meat goat enterprise expenses per breeding doe based on three different sizes of operations (small, medium, and large) is shown in Table 3 . The meat goat enterprise total, variable, and fixed expenses per breeding doe for medium-and large-sized farms were lower than for small-sized farms.\nThe comparison of southeastern U.S. meat goat enterprise expenses per meat goat produced based on three operation sizes (small, medium, and large farms) is also shown in Table 3 . The meat goat enterprise total, variable, and fixed expenses per meat goat in medium-and large-sized farms were lower than for small-sized farms. All three of the meat goat enterprise cost analyses show that scale of operation is important: with increasing meat goat enterprise scale, input expenses (variable, fixed, and total expenses) decrease significantly."}, {"section_title": "Input Distance Function Analysis Results", "text": "The maximum likelihood parameter estimates for the IDF are presented in Table 4 . The main effect parameter estimates for both outputs and two inputs are statistically significant. The cross-input variable parameter for total variable at https:/www.cambridge.org/core/terms. https://doi.org/10.1017/aae.2016.1 and fixed expenses is significant and positive, suggesting that these inputs are complementary. The output variable parameters have the expected signs and are statistically significant. The statistically significant meat goat production for slaughter/goat meat and meat goat breeding stock production variables suggest that increases in slaughter meat goat and meat goat breeding stock production increase the productive contribution of the land. The output interaction of slaughter meat goat production and meat goat breeding stock production is positive and statistically significant, implying their complementarity in production. This also suggests that an increase in meat goat breeding stock production enhanced the contribution of meat goat production in the goat enterprise. Interaction between outputs and inputs, ε XY k X m = ∂ε X,Y k ∂lnX m < 0, indicates the increase in Y k from an increase in X m or output-input jointness (complementarity). The parameter estimates for the interactions between the value of meat goat production for slaughter/goat meat and total variable expenses and the value of meat goat breeding stock production and total fixed expenses are also statistically significant."}, {"section_title": "Meat Goat Enterprise Efficiency 63", "text": "Estimated inefficiency model parameter estimates are also presented in Table 4 . We find that operation size, college education, percentage of annual net farm income from the goat operation, Southern Seaboard farm resource region, female operator, operator age, a pastured and rotated production system, percentage of goat sales for breeding stock or show, and operator off-farm job are positive efficiency drivers for southeastern U.S. meat goat production. These meat goat farm and farmer characteristics are statistically significant and increase meat goat production TE.\nFarmers with college degrees have generally been more technically efficient as a result of superior managerial ability. Pruitt et al. (2012) found that farmers with college degrees were more likely to adopt new technologies in U.S. cow-calf production. Rakipova, Gillespie, and Franke (2003) found that Louisiana beef cattle producers with college degrees were more technically efficient. We have also found that meat goat farmers with college degrees were more technically efficient than those without college degrees. Large-sized farms have generally been more efficient than small-sized farms. Paul et al. (2004) found that small family farm corn producers in the United States were generally less efficient in terms of both their scale of operations and technical aspects of production than large farms. Our study results show that large-sized and medium-sized meat goat operations were more technically efficient than small-sized operations. The U.S. regions have different forage availability, grazing periods, and weather conditions such as heat and humidity and require different housing for goat production. Therefore, the U.S. regions may have different impacts on meat goat production efficiency. We found that Southern Seaboard meat goat farmers were more technically efficient than those in the other regions of the southeastern United States. Higher percentages of income from meat goat production (degree of specialization) increased TE.\nFor the impact of off-farm jobs on production efficiency, studies have found mixed results. On the one hand, farmers holding off-farm employment generally spend less time on the farm with their animals, potentially resulting in lower output. On the other hand, off-farm employment allows farmers to use off-farm income to invest in farm production. Nehring, Peel, and Nulph (2009) found that for U.S. corn and cow-calf producers, off-farm employment or off-farm income boosted small operations' scale and TE. In this study, meat goat farmers holding off-farm jobs were more technically efficient than farmers who did not hold off-farm jobs. The TE of production for older farmers might be different from that of younger farmers as a result of experience. Studies have found mixed results for the impact of farmer age on production efficiency (Amara et al., 1999; Featherstone, Langemeier, and Ismet, 1997; Nehring et al., 2006) . Meat goat farms operated by older farmers were more technically efficient than farms run by younger operators. Female farmers operated more technically efficient farms than male farmers.\nProducers in the pastured and rotated production system are generally more heavily involved with their goats on a daily basis. This system requires more inputs of labor and capital but less usage of land. As an intensive production system, producers have the potential to more extensively incorporate new technologies and management practices to improve meat goat efficiency. Extensive-range or pasture/woods and pastured but not rotated systems allow goats to browse freely on pasture or rangeland and generally use less labor, Meat Goat Enterprise Efficiency 65 fertilizer, and capital inputs. These production systems also require less producer participation in farm production on a daily basis, and few capital and other inputs are required compared with intensive production systems. Meat goat farms using pastured and rotated production systems were more technically efficient than those using extensive-range or pasture/woods and pastured but not rotated systems. Raising goats for breeding stock or for show is likely to result in higher cost, but also higher revenue. Goat farms selling higher percentages of meat goats for breeding stock or show were more technically efficient than those selling goats for slaughter/other purposes. The distribution of the estimated input-oriented TE scores is presented in Table 5 . Past studies have found different average TE measures for agricultural farms. Featherstone, Langemeier, and Ismet (1997) found an average TE of 0.78 for Kansas beef cow farms. However, other studies have found relatively higher levels of TE. Louisiana beef cattle producers had an average TE of 0.92 (Rakipova, Gillespie, and Franke, 2003) . U.S. agricultural farms with corn as a major component of their output had an average TE of 0.89 (Paul et al., 2004) . Surprisingly, goat producers in developing countries also had relatively higher average TE. Alex, Cheemani, and Thomas (2013) found an average TE of 0.88 for goat producers in India. This study found an average TE of 0.81, which implies that the average southeastern U.S. meat goat farm could reduce approximately 19% in inputs to produce the same output as an efficient farm on the production frontier. Differences in average TE by study can generally be attributed to method of estimation (i.e., parametric or nonparametric; Paul et al., 2004) , specification of inputs and outputs, and stage of industry development. For example, Gillespie, Schupp, and Taylor (1997) found relatively low TE scores in a new alternative enterprise, ratites. The table also shows that approximately 78% of the farmers achieved TE levels of 70% or higher.\nThe marginal productive contributions (MPCs) of outputs and inputs can be estimated from the IDF, respectively, as Note: Asterisks ( * , * * , and * * * ) indicate significance at the 10%, 5%, and 1% level, respectively.\nAll MPCs have the hypothesized signs, negative for inputs and positive for outputs, as shown in Table 6 , and are significant. MPCs for outputs, ln Y Mgoat and ln Y Gbstock , indicate that an increase in all inputs results in an increase in output and are positive, like an output elasticity or marginal cost. MPCs for inputs indicate the shadow values of inputs, ln X * F eed , ln X * F ixed , and ln X * V ar , relative to land, X Land , and are negative, like the slope of a isoquant. The largest MPC in absolute value for inputs is land expense, followed by feed expense, total fixed expenses, and total other variable expenses. The MPC for meat goat breeding stock production output has the largest input share-approximately 47% on average.\nOverall economic performance indicators for southeastern U.S. meat goat enterprises are presented in Table 6 . The estimated returns to scale (RTS) parameter for the southeastern U.S. meat goat enterprises shows that a 1% increase in all outputs increased overall input use by 0.79%. This means an increasing RTS economy exists in southeastern U.S. meat goat production. A measure of scope economies was estimated from the IDF by taking the second cross partial output derivative, ∂ 2 ln D I (X, Y )/∂ln Y k ∂ln Y l > 0. Denny and Pinto (1978) also show that scope economies exist in the translog function if −β k β l < β kl and can be determined by testing the −β k β l = β kl constraint. It was statistically significant, implying that scope economies exist in southeastern U.S. meat goat production. A coefficient of 0.11 suggests that joint production of meat goat breeding stock and meat goat for slaughter and/or goat meat decreased average total cost by 11% relative to the separate production of these two outputs on southeastern U.S. meat goat farms.\nScale efficiency is the potential productivity gain from moving to the optimal farm size ( Table 6 ). The method for estimating scale efficiency was introduced Ray (1998) for a frontier production function, and Balk (2001) , Ray (2003) , and Nahn and Vu (2013) extended the scale efficiency measure for multiple-output multiple-input and multiple-input multiple-output distance Meat Goat Enterprise Efficiency 71 Appendix A "}]