[{"section_title": "Abstract", "text": "The Australian region seasonal tropical cyclone count (TCC) maintained a robust statistical relationship with El Niño-Southern Oscillation (ENSO), with skillful forecasts of above (below) average TCC during La Niña (El Niño) years from 1969 until about 1998, weakening thereafter. The current study identifies an additional climate driver that mitigates the loss of predictive skill for Australian TCC after about 1998. It is found that the seasonal Australian TCC is strongly modulated by a southwest-tonortheast-oriented dipole in Indian Ocean sea surface temperature anomalies (SSTAs), referred to here as the transverse Indian Ocean dipole (TIOD). The TIOD emerges as the leading mode of detrended Indian Ocean SSTAs in the Southern Hemisphere during late winter and spring. Active (inactive) TC seasons are linked to positive (negative) TIOD phases, most notably during August-October immediately preceding the TC season, when SSTAs northwest of Australia, in the northeast pole of the TIOD, are positive (negative).\nTo provide a physical interpretation of the TIOD-TCC relationship, 850-hPa zonal winds, 850-hPa relative vorticity, and 600-hPa relative humidity are composited for positive and negative TIOD phases, providing results consistent with observed TCC modulation. Correlations between ENSO and TCC weaken from 1998 onward, becoming statistically insignificant, whereas the TIOD-TCC correlation remains statistically significant until 2003. Overall, TIOD outperforms Niño-4 SSTA as a TCC predictor (46% skill increase since about 1998), when used individually or with Niño-4. The combination of TIOD and Niño 4 provide a skill increase (up to 33%) over climatology, demonstrating reliably accurate seasonal predictions of Australian region TCC."}, {"section_title": "Introduction", "text": "Tropical cyclones (TCs) pose an annual threat to Australia and the surrounding Indo-Pacific islands. The strong winds and associated storm surges are a major cause of economic loss in the region. Collectively, TCs Madge (1973) , Tracy (1974) , and Yasi (2011) brought about an estimated loss of AUD$6.9 billion (normalized to 2011 Australian dollars) and individually were ranked among the 10 most costly natural catastrophes in Australia, according to the Insurance Council of Australia (2016; http:// www.insurancecouncil.com.au/issue-submissions/issues/ catastrophe-events). The Australian TC region (908-1608E, south of the equator) has an annual average of over 10 TCs each year and a standard deviation of 3.5 TCs, with a range from 3 TCs (2015/16) to 18 TCs (1973 TCs ( /74, 1983 in the postsatellite era (1969/70 to present) .\nHistorically, the phase of El Niño-Southern Oscillation (ENSO) was considered a temporally consistent and robust modulator of the interannual variability of TC counts (TCCs) in the Australian region (Nicholls 1979) . Anomalously low pressure over Darwin, occurring during a La Niña phase, was regarded as a precursor to an above average seasonal TCC, whereas anomalously high pressure accompanying an El Niño phase was associated with below average counts. Many studies of the statistical and physical relationships between ENSO and Australian TCC have supported this ENSO modulation (e.g., Solow and Nicholls 1990; Hastings 1990; Evans and Allan 1992; Ramsay et al. 2008; Goebbert and Leslie 2010; Werner and Holbrook 2011; Liu and Chan 2012; Ramsay et al. 2012; Chand et al. 2013; Ramsay et al. 2014) , with some offering explicit seasonal prediction schemes (e.g., Werner and Holbrook 2011; Liu and Chan 2012) .\nHowever, over the past two decades, the previously reliable link between Australian TCC and ENSO has weakened noticeably (e.g., Dowdy 2014) . For example, the La Niña events of 2010/11 and 2011/12 resulted in 10 TCs (near average) and 7 TCs (below average) forming in the region, respectively, contrary to the observation of anomalously above average TCC (typically 14 TCs or more) during previous La Niña events. As statistical prediction schemes for seasonal TCCs were constructed with the expectation of an immutable ENSO-TCC association (with different expected values for TCC for El Niño versus La Niña), nonstationarity in this likelihood function poses a major challenge for seasonal forecasts in the region.\nDespite numerous studies of the connection between Indian Ocean sea surface temperature anomalies (SSTAs) and Australian rainfall (e.g., Nicholls 1989; Risbey et al. 2009; England et al. 2006; Cai et al. 2009; Ummenhoffer et al. 2009; Cai et al. 2011) , the influence of the Indian Ocean on Australian TC activity has received considerably less attention. Liu and Chan (2012) suggested that the Indian Ocean dipole (IOD) (Saji et al. 1999 ) and ENSO both were important for determining TCC in the Australian region. They found that the ENSO phase, as measured by Niño-3.4 SSTA, had a prominent modulating influence on the TCC in the western Australian region (408S-08, 908-1358E8) but had much less effect on the TCC in the eastern Australian region (408S-08, 1358-1608E8). Furthermore, they concluded that the phase of the IOD had no significant influence on TCCs in the western region, whereas a negative IOD resulted in above normal TCCs in the eastern Australian region (408S-08, 1358-1608E) given that a La Niña also was present. In contrast, Werner et al. (2012) found that the inclusion of the Indian Ocean Dipole Mode Index (DMI) did not improve upon a single ENSO-based predictor (Niño-4 SSTA) for Australian TCC. Wijnands et al. (2015) , using support vector regression (SVR), found that the DMI was the most frequently occurring predictor in the four top models of TCC for the Australian region.\nThe current study evaluates the relationship between Australian TCC, ENSO, and the Indian Ocean, with focus on SSTA variability in the Indian Ocean during the austral spring and its connection with the ENSO-TCC relationship. The remainder of this paper is organized as follows: section 2 describes the data and methods, the results are given in section 3, and conclusions are presented in section 4."}, {"section_title": "Data and methods", "text": ""}, {"section_title": "a. Tropical cyclone data", "text": "TC data were obtained from the International Best Track Archive for Climate Stewardship (IBTrACS-WMO; v03r07; Knapp et al. 2010) for the 45-yr period from 1 July 1969 to 30 June 2014. Assignment to a TC season was made only for storms forming within the Australian region between 1 November and 30 June of the following calendar year. As the official Australian TC season spans two calendar years, the first year is used to define a season (e.g., season 1969 is from 1 November 1969 to 30 June 1970) . For the present study, a TC was selected from the IBTrACS dataset if either 1) the 10-min maximum sustained wind (MSW) speed exceeded 17 m s 21 or 2) the minimum central pressure was less than or equal to 1000 hPa. Using a minimum central pressure threshold of 1000 hPa arose from the approximately linear relationship between pressure and MSW; it was used to define TCs mainly prior to the 1984/85 season, owing to missing or incomplete wind data in the Australian best-track data (Schreck et al. 2014) .\nTo test the robustness of results presented herein, several alternative TCC time series were derived that differed in their criteria for TC selection, such as 1) expanding the TC season to include months prior to November (i.e., 1 July-30 June), 2) including TCs that formed outside the region 908-1608E but that subsequently moved into it, and 3) using a slightly lower minimum central pressure threshold of 995 hPa rather than 1000 hPa. For criteria 1 and 2, TC best-track data were obtained from the Australian Bureau of Meteorology's Tropical Cyclone database (available at http://www.bom.gov.au/cyclone/history/ index.shtml). This database, which forms part of the IBTrACS, includes any TC that occurred in the Australian region regardless of genesis location.\nb. Sea surface temperature data and principal component analysis\nMonthly SST data are obtained from the Hadley Centre Sea Ice and Sea Surface Temperature dataset (HadISST; Rayner et al. 2003) for the 45-yr period 1969 to 2013, and anomalies are computed with the respect to the 1981-2010 climatology. Each time series is linearly detrended by subtracting a least squares best-fit line from the data points and retaining the residuals (unless stated otherwise). The SSTA data in the Pacific (208N-408S, 1208-3008E) and Indian (208N-408S, 308-1208E) Oceans were organized into two data matrices with rows representing time (monthly averages) and columns representing grid points for an S-mode analysis (Richman 1986) . Data from each ocean basin were used to form individual covariance matrices that were decomposed into sets of eigenvectors and eigenvalues. The eigenvectors were postmultiplied by the square root of the corresponding eigenvalue to form principal component (PC) loadings that, when plotted on a map, represent spatial modes of variability (Wilks 2011, 528-538) . The corresponding time series (or PC scores) close the PC equation, if all modes are retained. Such PC modes have several mathematical properties or constraints (e.g., column orthogonality of the loadings, sampling errors that vary as a function of eigenvalue magnitude closeness, and domain dependence) that are not expected in a physical system (Richman 1986 ). The number of modes that were extracted exclude noise eigenvalues in the covariance matrix. This set of patterns was postprocessed with a varimax orthogonal transformation (Kaiser 1958 (Kaiser , 1959 to seek a spatial localization of the SSTA (Compagnucci and Richman 2008) . The varimax algorithm seeks to satisfy a simple structure solution (Richman 1986 ) that localizes the variability, resulting in near-zero loadings over as much of the domain and larger magnitude loadings outside the hyperplane (Richman and Gong 1999) in other regions of the domain, as the data permit. The varimax rotated PC (RPC) loadings were tested for robustness by comparing their morphology to the covariance patterns, as outlined in Richman and Lamb (1985) . From these comparisons, the leading varimax RPC pattern was retained in the Indian Ocean. The Pacific Ocean domain supported retention of the leading three RPCs. The varimax RPC loadings are not column orthogonal; however, the scores corresponding to the RPC loadings (hereafter referred to as RPC scores) are column orthogonal and uncorrelated."}, {"section_title": "c. Atmospheric data", "text": "Atmospheric composites of 850-hPa wind, 850-hPa relative vorticity, the magnitude of the vector difference between the 850-and 200-hPa winds, and 600-hPa relative humidity are constructed using data from the Japan Meteorological Agency's 55-Year Reanalysis project (JRA-55; Kobayashi et al. 2015) at a horizontal resolution of 1.258. The advantage of using the JRA-55 reanalysis for the current study is that it provides a relatively long data period (commencing in 1958) overlapping the postsatellite TC data from IBTrACS."}, {"section_title": "d. Statistical significance and regression analysis", "text": "The statistical significance of the correlation between TCC and SSTA is assessed using bias-corrected and accelerated (BCa) bootstrap confidence intervals (CIs) (Efron and Tibshirani 1993) , with the number of bootstrap replicates set to 10 000, unless specified otherwise. Finally, the potential for seasonal prediction of TCC, given the links between TCC and the SSTA regions highlighted in section 3, is explored using a series of generalized linear regression models. Out-of-sample model skill is assessed using a leave-one-out cross validation (LOOCV) (Wilks 2011, 252-254) ."}, {"section_title": "Results and discussion", "text": "The spatial patterns of correlation between seasonal TCC and August-October (ASO) SSTAs (Figs. 1a,b) reveal three distinct regions of moderate-to-high correlations (jrj . 0.3): 1) negative correlations in the central equatorial Pacific, including the Niño-4 and Niño-3.4 regions; 2) a region of positive correlations immediately to the north of Australia that extends westward to south of Sumatra and southeastward to New Zealand and the South Pacific Ocean; and 3) negative correlations in the tropical to subtropical south Indian Ocean (158-308S, 608-858E). The association between the raw (i.e., not detrended) time series of seasonal TCC and ASO SSTA form areas of large, coherent, and statistically significant negative correlations in the south Indian Ocean and tropical Pacific regions, but only moderate (0.3 , jrj , 0.5) positive correlations are present in the region north of Australia, with patchy statistical significance (Fig. 1a) . To isolate the interannual variability and to account for long-term trends, a similar correlation map is produced for linearly detrended time series of both SSTA and TCC (Fig. 1b) . The detrended correlations reveal the same broad tripole pattern across the Indo-Pacific region, but the magnitude of the correlations to the north of Australia are much larger and emerge as statistically significant ( p , 0.05). The larger magnitudes and spatial extent of these positive correlations in Fig. 1b (relative to correlations from the unadjusted time series, Fig. 1a ) can be explained by opposing trends in TCC and SSTA for 1969-2013. The Australian seasonal TCC decreased notably since the 1970s, whereas the mean SST in the main development region for TCs (i.e., 58-208S, 908-1608E) (e.g., Ramsay et al. 2008 ) increased by about 0.358C (not shown). Such multidecadal trends confound and weaken the interannual relationship between seasonal TCC and SSTA. The spatial pattern of covariance between detrended TCC and detrended SSTA (Fig. 1c) is similar to the correlation pattern over much of Indo-Pacific region but differs over the tropical equatorial Pacific where the largest (negative) covariance is confined between 58N and 58S, including the Niño-3, Niño-3.4, and Niño-4 regions, and extends farther east toward South America."}, {"section_title": "a. Principal component analysis", "text": "Interpretation of the covariance pattern ( Fig. 1c) is strengthened by plotting the leading RPC loading modes of ASO detrended SSTA in the Indian and Pacific Ocean domains. The Indian Ocean domain supports one (leading) RPC, obtained from a solution from two RPCs (the second RPC was discarded as it has insufficient overlap with the patterns of variability in the covariance matrix). This leading Indian Ocean RPC loading pattern (Fig. 2a) , which explains 23.1% of the variance, is characterized by a southwest-to-northeastoriented dipole, with large negative loadings extending from about 208S, 608E to 358S, 908E and positive loadings in the tropical eastern Indian Ocean extending from south of Sumatra to the northwest coast of Australia. Although this pattern bears some similarities to the IOD, particularly during some negative IOD events between 1950 and 2004 (e.g., Ihara et al. 2008, their Fig. 6 ), it is not interpreted as the canonical IOD, which is defined most readily by the Dipole Mode Index (Saji et al. 1999) . The western pole of the IOD is notably absent over the tropical western Indian Ocean in Fig. 2a , where RPC loadings approach zero; however, the eastern pole of the IOD is geographically consistent with the region of maximum positive loadings in Fig. 2a .\nThe Indian Ocean subtropical dipole (IOSD) (e.g., Behera and Yamagata 2001; Suzuki et al. 2004; England et al. 2006 ) has received less attention than the IOD; it differs in both seasonality and spatial structure from the IOD. Its peak phase is locked to the austral summer of December-February (DJF), and its spatial structure is characterized by a southwest pole in the region 428-308S, 508-808E and a northeast pole in the region 298-178S, 758-1058E (Suzuki et al. 2004 ). The IOSD emerges as the second RPC (of a two-RPC solution) using SSTA data restricted only to DJF over the same domain as in Fig. 2a . However, such a mode is not present in our analysis during the austral winter or spring, consistent with earlier studies (e.g., Behera and Yamagata 2001; Suzuki et al. 2004) . Therefore, we cannot interpret the leading Indian Ocean RPC loading pattern in ASO (Fig. 2a) as the IOSD. To distinguish this pattern from both the IOD and the IOSD, as well as to emphasize its diagonal southwest-to-northeast spatial structure, it is referred to herein as the ''transverse Indian Ocean dipole'' (TIOD). The TIOD spatial structure is very similar to the composite SSTA patterns produced for wet and dry years over southwestern Western Australia (England et al. 2006, their Fig. 5 ) and the correlation pattern between Indian Ocean SSTA and Australian rainfall obtained by Nicholls (1989) .\nThe TIOD SSTA pattern is similar to the spatial correlation pattern between SSTA and TCC in the Indian Ocean (jrj 5 0.94) shown in Fig. 1b , and its time series (Figs. 3a and 4a) is highly statistically significantly correlated (jrj 5 0.67; p , 0.01) with Australian TCC. When the SSTAs at the southwest (northeast) pole are warm (cold), the seasonal TCC is below average in the Australian region. Notably, this pattern of SSTA in the Indian Ocean has the largest correlation with Australian seasonal TCC relative to all other spatial modes represented in Fig. 2 , exceeding the correlations for the traditional relationship between ENSO and Australian TCC . When an alternative TCC time series is used that includes TCs forming prior to 1 November (i.e., the TC season spanning 1 July-30 June), the correlation between the TIOD and TCC is nearly unchanged (jrj 5 0.70). When TCC is defined as any TC that occurred in the Australian region between 1 November and 30 June, regardless of whether genesis occurred in the region, again the correlation is nearly unchanged (jrj 5 0.66).\nThere are three Pacific Ocean RPCs . The dominant mode is the canonical ENSO pattern (Fig. 2b) , which, in its positive phase, manifests itself as anomalously warm SSTs extending from Peru/ Ecuador toward the date line. The 1997/98 El Niño event during ASO projects strongly (1997 RPC 1 score 5 13.69) onto this spatial pattern (Fig. 3b) . Despite explaining 42% of the SSTA variance for ASO, the RPC1 time series is weakly correlated with Australian TCC (jrj 5 0.16), whereas the RPC 2 and RPC 3 (Figs. 2c,d ), both variants of ENSO, have time series (Fig. 2c) resembles the correlation pattern between SSTA and TCC (jrj 5 0.89), shown in Fig. 1b , whereas the spatial pattern of RPC 3 (Fig. 2d) projects very strongly onto the covariance pattern between TCC and Pacific SSTA (jrj 5 0.94) shown in Fig. 1c . Using alternative criteria to define TCC makes little difference (change in jrj # 0.1) to the correlations reported in Figs. 2b-d. For instance, expanding the TC season to include all months 1 July to 30 June results in TCC being correlated with Pacific RPC 3 at jrj 5 0.57. When TCC is modified to include any TC that occurred in the Australian region between 1 November and 30 June (regardless of location of formation), this correlation reduces slightly to jrj 5 0.55 for RPC 2 and 3. The only correlation exhibiting sensitivity to the definition of TCC is for RPC 1 and TCC, as it increases from jrj 5 0.16 to jrj 5 0.23 when TCC is defined by occurrence in the Australian region rather than formation.\nThe RPC loading patterns in Fig. 2 are consistent with the morphology of the correlation and, particularly with the covariance, the patterns shown in Fig. 1 . If those regions of larger magnitude loadings are isoplethed, they form near-rectangular areas of variability. Bounding the regions of coherent large-magnitude correlations between TCC and SSTA to create a binary field with weights of 1 within the rectangle and zero outside the rectangle ensures only the SSTA in a given rectangular region or regions are analyzed. This binary rectangular region is used to define an index of the difference between the SSTAs in the tropical eastern Indian Ocean (58-208S, 908-1208E) and the tropical-to-subtropical south central Indian Ocean (158-308S, 608-858E), hereafter referred to as the TIOD Index (TIOD-I). The TIOD-I is defined mathematically as the northeast pole of the TIOD (TIOD-E) minus the southwest pole of the TIOD (TIOD-W). For the 3-monthly periods JuneAugust (JJA), July-September (JAS), and ASO, the TIOD-I is correlated with the TIOD RPC time series at jrj 5 0.89 (p , 0.01), jrj 5 0.94 ( p , 0.01), and jrj 5 0.95 ( p , 0.01), respectively, noting that the RPCs were constructed using data from ASO. Figure 4a indicates the close relationship between seasonal TCC, RPC 1 in the Indian Ocean, and the TIOD-I. This relationship is evident on an interannual time scale and at longer time scales, as indicated by the magnitude of the TCC (active/inactive decades). A reduction of interannual variability in all three time series occurs after about 1998. In the Pacific Ocean, the existing Niño SSTA regions were used as proxies for the Pacific Ocean RPCs rather than to binarize these regions, as the Niño regions are used extensively in existing TCC seasonal forecast models and therefore serve as a type of benchmark. The Pacific RPC 1 (canonical ENSO) is discarded as a predictor owing to its low correlation with TCC. The Niño-4 SSTA is correlated with Pacific RPC 2 at jrj 5 0.67 ( p , 0.01) (Fig. 4b) , and the time series of RPC 3 is correlated with the Niño-3.4 SSTA at jrj 5 0.62 (p , 0.01) (Fig. 4c) . The statistical relationship between Indo-Pacific SSTAs and Australian TCC is shown in Fig. 4d , which is constructed from 35 overlapping 11-yr windows of correlation between 1) RPC 1 in the Indian Ocean and RPC 3 in the Pacific Ocean and 2) seasonal TCC and SSTAs in the TIOD-I, Niño-4, and Niño-3.4 regions. The choice of an 11-yr period for the correlations was a compromise between obtaining relatively stable correlations from window to window and obtaining a sufficient number of data points for assessing trends. It is important to note that the windows are indexed to the first year of the period (e.g., the 1998 window gives the correlation for data during 1998-2008). Prior to the window commencing at 1998, there were consistently strong and mostly statistically significant correlations between Australian TCC and both the TIOD-I and Niño 4. During the 30-yr period 1969/70 to 1998/99, the correlation between the TIOD-I and TCC exceeded the correlation between Niño 4 and TCC (on 27 of 30 instances), emphasizing the potential importance of the TIOD-I for seasonal TCC prediction. There also was a strong linear relationship between Indian Ocean RPC 1 (i.e., the TIOD) and ENSO, as represented by RPC 3 in the Pacific (Fig. 2d) . The monotonic weakening of the relationship between Australian TCC and ENSO-related SSTA, particularly the Niño-4 region, commencing in the mid-1990s, is consistent with the findings of Dowdy (2014) and coincides with a rapid decrease in the magnitude of the correlation between ENSO and the TIOD. The correlation between the TIOD-I and TCC decreases and is statistically insignificant in the final 11-yr window (Fig. 4d ). An analysis of the TIOD-TCC correlation in Fig. 4d shows a statistically significant correlation until 2003. Part of the decrease can be explained by the 2013/14 TC season (Fig. 4a) when the southwest pole of the TIOD was anomalously warm in the austral spring; however, a near average 10 TCs formed between November and June (when the statistical relationship would have predicted a below average TCC season)."}, {"section_title": "b. Physical interpretation of the TIOD-TCC linkages", "text": "To investigate possible physical mechanisms responsible for the strong statistical relationship between the TIOD and Australian TCC (Figs. 1, 2a, 4a) , composites of SSTA and atmospheric variables were formed that are known to modulate seasonal TCC. Composites for the positive and negative TIOD phases were constructed of the Indian Ocean RPC time series values (Fig. 3a) that exceeded 6 1 standard deviation, with the additional constraint that the spatial correlation between SSTA and the Indian Ocean RPC loading pattern (Fig. 2a) exceeds jrj 5 0.50. This process yields five seasons in the positive TIOD composite (1970, 1973, 1996, 1998, 2005) and seven seasons in the negative TIOD composite (1977, 1978, 1979, 1982, 1986, 1987, 1994) . Three of the five positive TIOD seasons (1970, 1973, 1998) were La Niñas according to the NOAA Climate Prediction Center (http://www.cpc.ncep.noaa. gov/products/analysis_monitoring/ensostuff/ensoyears. shtml), and four of the seven negative TIOD seasons were El Niños (1977, 1982, 1986, 1987) , underscoring the need to move beyond ENSO. Figure 5 shows standardized SSTAs for the positive and negative TIOD composites during ASO (pre-TC season) and November-January (NDJ; first three months of the TC season). The SSTA pattern for the Indian Ocean during ASO (Figs. 5a,b) resembles the Indian Ocean RPC 1 pattern (Fig. 2a) . By NDJ, SSTAs at the northeast pole of the TIOD are substantially reduced, suggesting that, with the onset of austral summer, increased (decreased) surface winds/evaporation and/or cloud cover may be acting to cool (warm) the local SSTAs in the region. This change in sign of SSTA to the north and northwest of Australia has been shown to depend on the seasonal cycle of ENSO and the Australian monsoon (e.g., McBride and Nicholls 1983; Hendon et al. 2012; Meehl et al. 2012) .\nThe atmospheric response to the phase of the TIOD during the early TC season (i.e., NDJ) is shown in Fig. 6 . The positive phase is characterized by an anomalously strong circulation around the Mascarene high, with stronger than average 850-hPa westerly winds south of ;308S and anomalously strong easterly trade winds in the zone between 158 and 308S (Fig. 6a) . In addition, Table 1. monsoonal westerlies are strengthened in a large region between about 808 and 1308E, such that the combined effects of the subtropical and tropical circulations result in stronger than average 850-hPa cyclonic relative vorticity (Fig. 6c ). In the negative TIOD phase, the low-level circulation anomalies are partially reversed, but the influence of the Mascarene high is less obvious with weaker easterlies extending well into the subtropics (Fig. 6b) . The magnitude of the 850-and 200-hPa vertical wind shear has little effect in modulating Australian region TCC, as the observed locations of TC genesis in each phase occur close to the zero anomaly line (Figs. 6e, f) .\nConversely, anomalies of midtropospheric relative humidity (Figs. 6g,h ) are consistent with observed seasonal TCC anomalies as an anomalously humid (dry) midtroposphere in the Australian TC region enhances (suppresses) TC formation. Figure 4d shows that the relationship between ENSO and Australian TCC has weakened noticeably since about 1998, coinciding with a breakdown in a teleconnection between ENSO and the TIOD. Ham et al. (2017) showed a similar weakening between ENSO (specifically, the Niño-3.4 Index) and the IOD since about 1999, arguing that the weakened IOD relationship with ENSO during the period 1999-2014 was associated with different spatial patterns in ENSO evolution (relative to the period 1979-1998) during the boreal spring and summer. The exact forcing of the TIOD teleconnection to ENSO is unknown, but several plausible mechanisms have been suggested (at least in relation to TIOD-like variability of the Indian Ocean), including, for instance, changes in the strength and location of the Mascarene high and associated wind-driven surface heat flux anomalies (e.g., England et al. 2006) , and changes in cross-equatorial flow and convection over the Maritime Continent forced by precipitation anomalies over the off-equatorial northwest Pacific (e.g., Ham et al. 2017) . Interestingly, the timing of the sudden decrease in correlation between ENSO and the TIOD is consistent with a sign change in the interdecadal Pacific oscillation (IPO) around 1999 (e.g., Henley et al. 2015) , raising the possibility that predictability of TCC on an interannual time scale could be modulated on an interdecadal time scale by the IPO."}, {"section_title": "c. Sensitivity analysis of the TIOD-TCC relationship", "text": "To investigate the regional or subseasonal differences in the TCC response between TIOD phases, the response of TCC to each TIOD phase is investigated for the entire Australian region (908-1608E) and for its three subregions, the western (908-1258E), northern (1258-142.58E), and eastern (142.58-1608E) areas, which are roughly the same geographical areas as used by the Australian Bureau of Meteorology for seasonal outlooks and real-time warnings. Excluding the TC outlier that formed in the month of June (TC Epi, June 2003), each geographical region is divided into three time windows: the full season (1 November-31 May), early season (1 November-15 February), and late season (16) (17) (18) (19) (20) (21) (22) (23) (24) (25) (26) (27) (28) (29) (30) (31) . Note that the definition of the full season here is one month longer than the official 1 November-30 April season used by the Australian Bureau of Meteorology, but this is justified by the roughly symmetrical climatological monthly distribution of TCC for November to May (not shown).\nThe entire Australian region, as well as its western and eastern subregions, is significantly influenced by the TIOD (Table 1) . With respect to climatological TCC, a positive (negative) TIOD is associated with a 47% increase (28% decrease) in the Australian region, a 51% increase (31% decrease) in the western region, and a 92% increase (36% decrease) in the eastern region. The percentage changes in TCC between the two phases suggest that the TIOD has a greater influence on active seasons than it does on inactive seasons. The northern subregion shows no significant change in TCC with respect to its climatology. The very active seasons during the positive TIOD phase are largely the result of enhanced TC activity in the early part of the TC season (1 November-15 February), with increases of 73%, 68%, and 180% for the Australian region and the western and eastern regions subregions, respectively. The eastern subregion should be interpreted with caution because there are climatologically very few TCs during the months of November and December (from 1981 to 2010 a total of only six storms formed in those months). During the latter half of the TC season (16 February-31 May), the positive TIOD phase has no significant impact on TCC in the whole Australian region or in any of its three subregions. However, the negative TIOD phase is accompanied by significantly fewer TCs in the Australian region and in the western and eastern subregions."}, {"section_title": "d. Regression analysis", "text": "The role of the TIOD for seasonal TCC prediction is assessed by comparing the skill of a series of regression models with the skill of TCC climatology (Table 2) . To gauge each model's skill on independent data, a leaveone-out cross validation is performed. Statistical significance is measured by improvement over the baseline (climatology) models. Predictors used are the TIOD-I and the Niño-4 region, as well as several combinations of these regions. The TIOD-I and Niño-4 region are assessed because of their large correlations with TCC in Fig. 4d , and the Niño-4 region is a commonly used predictor for Australian TCC (e.g., Werner and Holbrook 2011; Liu and Chan 2012) . Four sets of generalized (1970, 1973, 1996, 1998, 2005) , and the negative TIOD phase (''2 TIOD'') comprises seven seasons (1977, 1978, 1979, 1982, 1986, 1987, 1994 linear regression models are developed using SSTA data for the 3-monthly periods JAS and ASO: the first two are Poisson regressions using unadjusted (i.e., not detrended) data, and the second two are generalized linear (Gaussian) models based on detrended data. Models incorporating the Niño-4 region provide statistically insignificant improvement over climatology, with a reduction in the mean absolute error (MAE) ranging from 13% to 19% depending on whether unadjusted or detrended data are used ( Table 2 ). The most accurate Poisson model utilizes both the Niño-4 region and the southwestern pole of the TIOD (TIOD-W), yielding a 30% and 33% reduction in MAE from climatology for the periods JAS and ASO, respectively. The second most accurate model, using the Niño-4 region and the TIOD-I, leads to a 28% reduction in the MAE over climatology for both prediction periods.\nModels using deviations from the long-term linear trend, as a predictor, were created because SSTA regions that have historical trends in the opposite direction from the longterm trend in TCC (e.g., the northeastern pole of the TIOD), and that are positively correlated with TCC on an interannual time scale, should be superior. When detrended data are used (Table 2) , the most accurate model for the JAS prediction period is the model based on the predictors Niño-4 and TIOD-I (28% decrease in MAE over climatology). For the ASO prediction period, a single predictor model using TIOD-I provides the best model having the lowest MAE of 1.69 TCC (a 32% decrease in MAE over climatology) of all prediction models. Additionally, interpretation of Table 2 shows that models using detrended data consistently have lower MAE values compared to models with unadjusted data.\nWhen the LOOCV MAE values from the detrended models are subdivided into two epochs, 1969-1998 and 1999-2013 , the TIOD-I model performs substantially better than the Niño-4 model during the latter period (Table 3) , with an MAE of 0.93 TCs compared with 1.72 TCs (i.e., a 46% decrease) for the ASO prediction period. The climatology model (i.e., the linear trend itself) for the 1999-2013 period yields an MAE of 1.13 TCs and is more accurate than the Niño-4 model but is still less accurate than the TIOD-I model. During the first 30-yr period , the Niño-4 and TIOD-I models using ASO STTA have MAEs of 2.41 TCs and 2.07 TCs, respectively, whereas the climatology model has a much larger MAE (3.18 TCs). The improvement of the climatology model in the latter period is explained by the decrease in variance of TCC after 2000 (Figs. 4a-c) ."}, {"section_title": "Conclusions", "text": "The Australian region seasonal tropical cyclone count (TCC) had a skillful relationship with El Niño-Southern Oscillation (ENSO) of above (below) average TCC during La Niña (El Niño) years, as documented by Nicholls (1979) , from 1970 until about 1998. After approximately 1998, little predictive skill remained for any of the ENSO regions (Dowdy 2014) . For example, the strong La Niña event of 2010/11 and the moderate La Niña event 2011/12 resulted in 10 TCs (near average) and 7 TCs (below average), respectively, despite the anomalously above average TCC (.13 TCs) typically observed during previous La Niña events. The recent nonstationarity of the correlation between Niño-4 (or Niño-3.4) and Australian TCC is shown to be associated with a rapid weakening of the in-phase relationship between noncanonical (central Pacific) ENSO events and the leading mode of detrended SSTA in the Indian Ocean during austral late winter and spring, although this coincident timing is just one of a range of possible causal factors behind the weakened ENSO-TCC relationship. The relationship between the central tropical Pacific and Indian Oceans beyond about 1998 is shown to be nearly in quadrature. Therefore, an Indian Ocean climate driver has been identified to mitigate the loss of predictive skill for Australian TCC beyond 1998, referred to as the transverse Indian Ocean dipole (TIOD). The implication for seasonal forecasts is that, in addition to the already established relationship between ENSO and TCC, active TC seasons in the Australian region more likely occur with a positive TIOD (i.e., an anomalously cool subtropical south Indian Ocean with an above average tropical eastern Indian Ocean SST near Australia) and, conversely, that inactive seasons are associated with a negative TIOD. Traditionally, seasonal Australian region TCC forecasts used only ENSO SSTA, which may explain the lack of skill in seasonal forecasts of 2010/11 and 2011/12 TCC, when the SSTAs in the subtropical south Indian Ocean were of opposite sign to the anomalously negative SSTAs associated with the ongoing La Niña in the tropical Pacific (Figs. 4a,b) . The TIOD during ASO plays a key role in modulating Australian seasonal TCC, particularly during the first half of the TC season (1 November-15 February), in addition to the influence of ENSO. The phase relationship between the TIOD and ENSO has an important implication for the prediction of seasonal TCC in the Australian region: anomalously high (low) TCCs are likely when there is both a La Niña (El Niño) and a positive (negative) TIOD during the austral winter/spring.\nThe importance of the Indian Ocean for seasonal prediction of Australian region TCC is confirmed by a substantial increase in forecast skill when TIOD is used individually (a 22%-32% decrease in MAE over climatology) or together with the Niño-4 region (a 28%-30% decrease in MAE over climatology) as a predictor in SSTA-based regression models. Models based only on the Niño-4 SSTA have considerably larger MAE, with no significant improvement over climatology. These results suggest that more accurate seasonal forecasts of TCC in the Australian region benefit from SST indices related to both the TIOD and ENSO. Research is underway to extend these findings by including additional Pacific Ocean and Indian Ocean predictors. "}]