[{"section_title": "Abstract", "text": "Item response theory (IRT) plays an important role in psychological and educational measurement. Unlike the classical testing theory, IRT models aggregate the item level information, yielding more accurate measurements. Most IRT models rely on the so-called local independence assumption, which may not be satisfied in practice, especially for a large number of items. Results in the literature and simulation studies in this paper reveal that misspecifying the local independence assumption may result in inaccurate measurements and differential item functioning.\nTo provide more robust measurements, we propose a Fused Latent and Graphical IRT (FLaG-IRT) model that can offset the effect of unknown local dependence.\nThe new model contains a confirmatory latent variable component, which measures the targeted latent traits, and a graphical component, which captures the local dependence. An efficient proximal algorithm is proposed for the parameter estimation and structure learning of the local dependence. The proposed approach can substantially reduce the local dependence induced measurement bias. The model can be applied to measure both a unidimentional latent trait and multidimensional latent traits."}, {"section_title": "Introduction", "text": "Item response theory models (IRT; Rasch, 1960; Lord and Novick, 1968) play an important role in measurement theory. Unlike classical testing theory, IRT models integrate item level information for measurement and are regarded as being a superior measurement tool to classical test theory (Embretson and Reise, 2000) . IRT models have become the preferred method for developing scales, especially when high-stake decisions are demanded. In particular, IRT models are used in National Assessment of Education Progress (NAEP), Scholastic Aptitude Test (SAT), and Graduate Record Examination (GRE). Popular IRT models include the single factor models, such as the Rasch model (Rasch, 1960) , the two-parameter logistic model, and the three-parameter logistic model (Birnbaum, 1968) , and multiple factor models, such as the multidimensional two-parameter logistic (M2PL) model (McKinley and Reckase, 1982; Reckase, 2009 ).\nWe consider the multidimensional two-parameter logistic model as a building block.\nThere are N individuals responding to J test items and the responses from an individual are recorded by a vector X = (X 1 , ..., X J ) . To simplify the presentation, we only consider binary items, i.e. X j ∈ {0, 1}, but emphasize that the proposed approach is flexible enough to be generalized to analyzing polytomous items (Chen, 2016) . Associated with each response vector is an unobserved continuous latent vector θ ∈ R K , representing the latent characteristics that are measured. The conditional distribution of each response given the latent vector follows a logistic model f j (θ) P (X j = 1|θ) = e a j θ+b j 1 + e a j θ+b j , where f j (θ) is known as the item response function and a j = (a j1 , ..., a jK ) are known as the factor loading parameters. When used in a confirmatory manner, the model imposes constraints on the factor loading parameters, that is, parameter a jk is set to be 0, if item j is not designed to measure the kth latent trait. Specifically, such design information is characterized by a J × K item-trait relationship matrix, which we refer to as the Λ-matrix, Λ = (λ jk ) J×K = (1 {a jk =0} ) J×K . The Λ-matrix is usually provided by the item designers and is often assumed to be known. When information about the Λ-matrix is vague, data-driven approaches for learning the Λ-matrix are proposed (Liu et al., 2012 (Liu et al., , 2013 Chen et al., 2015; Sun et al., 2016) .\nOne common assumption of standard IRT models, including the M2PL model, is the so-called local independence assumption, saying that X 1 , X 2 , ..., X J are conditionally independent, given the value of θ. That is P (X 1 = x 1 , ..., X J = x J |θ) = P (X 1 = x 1 |θ)P (X 2 = x 2 |θ) · · · P (X J = x J |θ),\nfor each x = (x 1 , ..., x J ) ∈ {0, 1} J . The local independence assumption implies that, although the items may be highly intercorrelated in the test as a whole, it is only caused by items' sharing the common latent traits measured by the test. When the trait levels are controlled, local independence implies that no relationship remains between the items (Embretson and Reise, 2000) .\nIn recent years, computer-based and mobile-app-based instruments are becoming prevalent in educational and psychological studies, where a large number of responses with complex dependence structure are observed. For these tests, a small number of latent traits may not adequately capture the dependence structure among the responses.\nIt is known that there are many possible causes for local dependence, including order effect where responses to early items affect the responses to subsequent items, and shared content effect where additional dependence is caused by a common stimuli from shared content (Hoskens and De Boeck, 1997; Knowles and Condon, 2000; Schwarz, 1999; Yen, 1993) . Generally speaking, the item response process could be complicated, and affected by many external and internal factors. Consequently, a low-dimensional latent factor model may not be adequate to capture all the dependence structure within a test, which may explain the frequently observed phenomenon of model lack of fit in empirical studies (Reise et al., 2011; Yen, 1984 Yen, , 1993 Ferrara et al., 1999) .\nDifferential item functioning (DIF) refers to a test item functioning differently for different groups, in the sense that the probability of a correct response is associated with group membership for examinees of comparable ability (Holland and Thayer, 1988) .\nControlling DIF is an important aspect in test development that is to ensure test fairness.\nDIF may be caused by the presence of additional traits in some items (e.g. Camilli, 1992) , and thus is closely related to local dependence. That is, the nuisance traits that cause DIF also induce the local dependence structure. Thus, DIF could be reduced if the local dependence structure can be adjusted in the measurement model.\nIn this paper, we propose a Fused and Latent Graphical IRT (FLaG-IRT) model to incorporate local dependence as well as to include the test-design information in the Λ-matrix as a priori. The model extends the Fused and Latent Graphical (FLaG) model proposed in Chen et al. (2016) by incorporating the loading structure information.\nThe proposed model adds a sparse graphical component upon a multidimensional item response theory (MIRT) model to capture the local dependence. The idea is that for a well designed test, the common dependence among responses has been well explained by the latent traits and the remaining dependence can be characterized by a sparse graphical structure.\nIn psychometrics, there is an existing literature on modeling the local dependence structure, including the bi-factor and testlet models (Gibbons and Hedeker, 1992; Gibbons et al., 2007; Reise et al., 2007; Bradlow et al., 1999; Wainer et al., 2000; Li et al., 2006; Cai et al., 2011) , copula based approaches (Braeken et al., 2007; Braeken, 2011) , and models with fixed interaction parameters (Hoskens and De Boeck, 1997; Ip, 2002; Ip et al., 2004; Ip, 2010) . Most of these approaches require prior information on the local dependence structure, such as knowing the item clusters and assuming the local independence between items clusters.\nThe rest of the paper is organized as follows. In Section 2, the FLaG-IRT model is introduced and then in Section 3, the statistical analysis based on the model, including parameter estimation and model selection, is presented. Results of simulation studies are reported in Section 4. Section 5 contains an application to a real data example. A summary, along with discussions, is given in Section 6.\n2 FLaG-IRT Model"}, {"section_title": "Two Basic Models", "text": "We first describe the fused and latent graphical IRT model, which is built upon the multidimensional 2-parameter logistic (M2PL) model and the Ising model (Ising, 1925) .\nTo begin with, we describe these two building-block models."}, {"section_title": "MIRT Model", "text": "The M2PL model is one of the most popular multidimensional IRT models for binary responses. The item response function of the M2PL model is given by\nThe item-trait relationship is incorporated by constraints contained in a pre-specified matrix Λ = (λ jk ) J×K , λ jk ∈ {0, 1}. λ jk = 0 means that item j is not associated with latent trait k and the corresponding loading a jk is constrained to be 0. The item response function can be further written as\nThe notation \"∝\" above is typically used to define probability density or mass functions, which means that the left-hand side and the right-hand side are different by a normalizing constant that depends only on the parameters and is free of the value of the random variable/vector. The constant can be obtained by summing or integrating out the random variable/vector. Such a constant sometimes can be difficult to obtain.\nUnder the M2PL model, the joint distribution of the responses X = (X 1 , ..., X J )\ngiven θ can be further written as, due to the local independence assumption,\nwhere A = (a jk ) J×K is known as the factor loading matrix and b = (b 1 , ..., b J ) . In particular, when K = 1, the model is known as the two-parameter logistic model (2PL; Birnbaum, 1968) ."}, {"section_title": "Ising Model", "text": "We now present the Ising model that is used to characterize the local dependence structure on top of the M2PL model. The Ising model is an undirected graphical model (e.g. Koller and Friedman, 2009) . It encodes the conditional independence relationships among X j 's through the topological structure of a graph that can greatly facilitate the interpretation and understanding of the dependence structure. The Ising model is originated in statistical physics (Ising, 1925) .\nSpecification of the Ising model consists of an undirected graph G = (V, E), where V and E are the sets of vertices and edges respectively. The vertex set V = {1, 2, ..., J}, corresponds to the random variables, X 1 , ..., X J . The graph is said to be undirected in the sense that (i, j) ∈ E, if and only if (j, i) ∈ E. The Ising model associated with an Figure 1 : The set C separates A from B. All paths from A to B pass through C.\nundirected graph G = (V, E) is specified as\nwhere S = (s ij ) J×J is a symmetric matrix such that s ij = 0 if and only if (i, j) ∈ E.\nThe conditional independence relationship in the Ising model is encoded by the topological structure of the graph. More precisely, let A, B and C be nonoverlapping subsets of V and A ∪ B ∪ C = V . We further let X A , X B , and X C be the random vectors associated with the sets A, B, and C, respectively, i.e., X A = (X i : i ∈ A) and so on.\nWe say A and B are separated by C, if every path from a vertex in A to a vertex in B includes at least one vertex in C, as illustrated by an example in Figure 1 . In Figure 1 , A = {1, 2}, B = {4, 5}, and C = {3}, and all paths from A to B pass through C. For example, the path (1 → 3 → 4) that connects vertices 1 and 4, passes through vertex 3.\nIn particular, (i, j) / ∈ E implies X i and X j are independent given others. When C is an empty set, the separation between A and B implies their independence."}, {"section_title": "FLaG-IRT Model", "text": "The FLaG-IRT model combines the M2PL model (2) and the Ising model (3) to construct a joint item response function. More precisely, the conditional distribution of X given θ is\nWe make two technical remarks on the conditional model (4). First, we remove the term b x, because it is absorbed into the diagonal terms of S. That is, x j ∈ {0, 1} and thus x j = x 2 j . Consequently, the squared terms become linear\ns jj x j . Second, the conditional model (4) is an Ising model with parameter matrix S(θ), where s ij (θ) = s ij for i = j and s jj (θ) = a j θ + s jj . In addition, the graph of model (4) Under the conditional independence assumption (1) of the MIRT model, there exists a latent vector θ. If we include θ in the graph, then there is no edge among X j s as in the middle panel. The concern is that this conditional independence structure may be oversimplified and there is additional dependence not attributable to the latent traits.\nThe FLaG-IRT model (right panel) is a natural extension of the MIRT model (middle panel), allowing edges among X j s even if θ is included. The additional edges capture the dependence among X j s not explained by θ. Due to the presence of the latent variables, it is likely that we only need a small number of additional edges to capture the local dependence. Furthermore, the loading structure in Λ is reflected by the edges between θ k s and the responses X j s in the middle and right panels.\nWe consider the following joint distribution of (X, θ), \nNote that under this joint distribution, the joint item response function, i.e., the conditional distribution of X given θ, is consistent with (4). Under this joint distribution, a specific prior distribution of θ is implicitly assumed and the posterior distribution of θ becomes Guassian, an assumption discussed in Holland (1990) . As will be described in the sequel, this prior distribution of θ brings technical convenience in the data analysis.\nWe refer the readers to Holland (1990) for more justifications for this prior. Moreover, the posterior variance of θ becomes Σ and the posterior mean of θ is given by\na weighted sum of the responses. Once A and Σ are estimated from the data, it is reasonable to score each individual byΣÂ x.\nIn the specification (5), A, Σ, S, and the graph E induced by S (equivalently, the nonzero pattern of matrix S) can be be estimated from the data. Similar to the M2PL model, we pre-specify a binary matrix Λ = (λ jk ) J×K for the confirmatory structure and impose constraint that a jk = 0 if λ jk = 0. The latent vector θ is not directly observable.\nThe estimation is based on the marginal likelihood,\nwhere f (x, θ|A, S, Σ) is given in (5).\nUnder the above model specification, the marginal distribution of X still follows an\nIsing model, that is\nThis is a second-order generalized log-linear model (Holland, 1990; Laird, 1991) ."}, {"section_title": "Bi-factor Model as a Special Case", "text": "The bi-factor model is one of the most popular models that takes local dependence into account. This model is a special case of the M2PL model, assuming that there is a unidimensional general factor θ g associated with all items and is the target of measurement. Besides the general factor, there exist nuisance factors θ 1 , ..., θ M associated with M nonoverlapping item clusters C 1 , C 2 , ..., C M , where each item cluster has no less than two items and there may be items not belonging to any of these item clusters. As we will discuss in the sequel, the FLaG-IRT model is able to capture such a structure. One of the advantages of the FLaG-IRT model is that there is no need to specify a priori item clusters and they are learned from the data.\nThe bi-factor model based on a logistic link (e.g. Cai et al., 2011) can be viewed as a special M2PL model with\nwhere b = (b 1 , ..., b J ) and A = (a g , a 1 , ..., a K ). In particular, the jth element of a k is Figure 3 : Graphical representation of a bi-factor model, the corresponding FLaG-IRT model, and the local dependence graph.\nzero if item j is not in the kth item cluster, i.e., j / ∈ C k . If we use the specific prior of θ in the FLaG-IRT model and further assume Σ to be an identity matrix,\nwhere s jj = 2b j , and s ij = s ji = 0 when items i and j do not belong to the same item cluster and s ij = s ji = a ik a jk when both items belong to the kth cluster, which admits the same form as the marginal FLaG-IRT model in (7). In other words, the graphical model component of the FLaG-IRT model can take the place of the specific factors in the bi-factor model. The corresponding graph encoded by the S matrix in (8) is sparse, when each item cluster has only a small number of items. For example, if each item cluster has only two items, then the sparsity level of the graph, defined as the ratio of the number of edges in the graph and the total number of item pairs, is 1/(J − 1), which can be as small as 3% with J = 30 items. Figure 3 presents an example of the a bi-factor model, the corresponding FLaG-IRT model, and the local dependence graph. In other words, when the specific prior for θ is assumed, the bi-factor model becomes a special case of the FLaG-IRT model with one latent trait and a sparse local dependence graph.\n3 FLaG-IRT Analysis"}, {"section_title": "Regularized Pseudo-likelihood Estimation", "text": "In this section, we discuss estimation and dimension reduction of the FLaG-IRT model.\nThe most natural approach would be the maximum marginal likelihood function of responses given in (7). Unfortunately, the evaluation of (7) involves computing the normalizing constant,\nwhich requires a summation over 2 J all possible response patterns and thus is computationally infeasible for even a relatively small J. To bypass this, we propose a pseudolikelihood as a surrogate (Besag, 1974) , which is based on the conditional distribution of X j given the rest X −j = (X 1 , ..., X j−1 , X j+1 , ..., X J ),\nwhere L = (l ij ) J×J = AΣA . Note that the above conditional distribution takes a logis-\nwhere x i is the responses from individual i.\nTo incorporate the knowledge of the test items, the factor loading matrix A is constrained such that a jk = 0 when λ jk = 0. Therefore, the unknown parameters in A are {a jk : λ jk = 1}. Since A and Σ appear in the pseudo-likelihood function in the form of AΣA , additional constraints are needed to ensure their identifiability. This is because, for example, scaling A by a constant ω can be offset by the corresponding scaling of Σ by ω −2 . To identify the scale of latent factors, we impose constraints Σ kk = 1, k = 1, ..., K, which means that the posterior variance must be 1. To avoid the rotational indeterminacy, we assume that with appropriate column swapping, the Λ matrix contains a K × K identity submatrix.. It means that for each latent factor, there is at least one item that only measures that factor.\nWhen the graph for local dependence is known, we estimate A, S, and Σ using a maximum pseudo-likelihood function\nand Σ is positive semidefinite,\nwhere E is the set of edges of the known graph.\nWhen the graph for local dependence is unknown, which is typically the case in practice, we impose an assumption that the graph is sparse, that is, the number of edges in E = {(i, j) : s ij = 0} is relatively small. The rationale is that most of the dependence among responses has been captured by the common latent traits, leaving the local dependence structure sparse. This assumption is incorporated in the analysis through selecting a sparse graphical model component based on the data. We'd like to point out that even a sparse local dependence structure (i.e. a local dependence graph with a relatively small number of edges), if ignored in the measurement, can result in measurement bias, as illustrated by simulated examples. In addition, the sparse local dependence graph, once learned from the data, facilitates the understanding of the measurement and may be used to improve the test design. For example, patterns (e.g. item clusters) identified from the graph may help the test designers to review the items and improve the wording.\nWe propose to use the regularized pseudo-likelihood for simultaneous estimation and\nwhere γ is the tuning parameter that controls the sparsity level of the estimated grapĥ\nAt one extreme, when γ is sufficiently large, the estimated graph becomes degenerate, i.e., no edge, and the responses are conditionally independent given the latent variables that are measured. The graph becomes more and more dense as γ decreases.\nThe optimization problem (11) is nonconvex and nonsmooth, and thus is computationally nontrivial. An efficient and stable algorithm is developed, which alternates between minimizing A, S, and Σ. In particular, an proximal gradient based method (Parikh et al., 2014 ) is used in updating S, which avoids the issues due to the nonsmoothness of the function that may occur in standard gradient based optimization approaches. Details of the algorithm are provided in the appendix. We emphasize that this algorithm is scalable to very large data sets with a large number of items (e.g. thousands) and a large number of latent factors (tens or larger), and thus is suitable for large scale data analysis."}, {"section_title": "Choice of Tuning Parameters", "text": "In the estimation, we construct a solution path of (Â γ ,Ŝ γ ,Σ γ ) for a sequence of γ values.\nWe then choose γ based on the Bayes information criterion (BIC; Schwarz, 1978) , which takes a general form\nwhere M is the model under consideration, L(β(M)) is the maximal likelihood for model M, and |M| is the number of free parameters. In this study, we replace the likelihood function with the pseudo-likelihood function. Specifically, let\nand Σ is positive semidefinite, σ kk = 1, k = 1, ..., K} be the model selected by tuning parameter γ, containing all models having the same support asŜ γ . We select the tuning parameter γ, such that the corresponding model minimizes the pseudo-likelihood-based BIC\nwhere the number of parameters in M γ is\nHere, j,k λ jk counts the number of free parameters in the loading matrix A, J and i<j 1 {ŝ γ ij =0} are the numbers of diagonal and off-diagonal parameters inŜ γ , and K(K − 1)/2 is the number of parameters in Σ.\nThe tuning parameter is finally selected bŷ\nIn addition, the corresponding maximal pseudo-likelihood estimates of A, S, and Σ are used as the final estimate of A, S, and Σ:"}, {"section_title": "Summary", "text": "We summarize the procedure of FLaG-IRT analysis, when the graph for local dependence is unknown.\n1. Select a sequence of γ values, denoted by Γ.\n2. Obtain a sequence of models indexed by γ ∈ Γ, based on the regularized estimates\n3. Among the sequence of models above, select the best fitted model in terms of BIC value, using (13).\n4. Report (Â,Ŝ,Σ) from the selected model given by (14), as well as the local dependence graph given byÊ = {(i, j) :ŝ ij = 0}.\nIt is well known that mental processes are complex and there are always factors not perfectly explained by a measurement model. Standard latent factor models may result in model lack of fit, thereby having a negative effect on the test validity. In this paper, we propose the FLaG-IRT model for robust measurement. The key idea behind the proposed model is that, given the loading structure of a well-designed test, the local dependence structure can be well incorporated through a sparse graphical component. This is done without requiring any prior information about the structure of local dependence. Our analysis shows that the method greatly reduces the measurement bias and increases the measurement accuracy. In particular, when significant local dependence is observed and when test fairness is of a concern, the FLaG-IRT model can be a good choice for scoring individuals. Finally, we remark that our algorithm for FLaG-IRT analysis is very efficient and stable, although the optimization problem is nonconvex and nonsmooth. The FLaG-IRT analysis is thus scalable to analyzing large scale data. if x t is not the an optimal solution. Thus, one can always search for a step size λ, such that the objective function decreases. When function g has a special form, the proximal gradient descent update (16) may have a closed form solution, which is indeed the case in our algorithm below."}, {"section_title": "Simulation Studies", "text": "In this section, we report two simulation studies. First, we provide an illustrative example that ignoring local dependence results in measurement bias (differential item functioning). Second, we evaluate the FLaG-IRT analysis under various simulation settings."}, {"section_title": "Simulation Study 1", "text": "Data generation. We generate a data set from a bi-factor model, with N = 3000, J = 15, and only one item cluster C 1 = {1, 2, 3, 4, 5}. Note that the general factor θ g and Table 2 : The results of study 1.\nthe nuisance factor θ 1 are assumed to be independent and follow the standard normal distribution. The model parameters are shown in Table 1 , where b j s are sampled from uniform distribution over interval [−2, 2] . This data set is generated to mimic a test that aims at measuring the general factor θ g , thus every item is designed to be associated with this dimension. In addition, θ 1 is a nuisance dimension that is only associated with five items and is not included in the design (so that people may not be aware of), but has an effect on the responses. The results are summarized in Table 2 .\nUnidimensional 2PL model. We first analyze the data using the unidimensional 2PL model, where the unidimensional latent trait is assumed to have a Gaussian prior, following the standard IRT setting. We consider measuring individuals using a two-stage procedure. In the first stage, the item parameters are estimated, denoted byâ andb.\nIn the second stage,â andb are plugged into the posterior mean of θ i and the resulting estimate is denoted byθ i . The two plots in panel (a) of Figure 4 show θ i1 (x-axis) versuŝ θ i (y-axis) and θ i,g (x-axis) versusθ i (y-axis), respectively. In both plots, the regression lines are plotted to show the trend. In addition, the Kendall's tau correlation coefficient (e.g. Kendall and Gibbons, 1990) between θ i1 andθ i is 0.183 and that between θ i,g and θ i is 0.512. Kendall's tau is a nonparametric measure of correlation based on ordering that does not require any parametric, such as the Gaussian, model assumption. For two vectors (y 1 , ..., y N ) and (z 1 , ..., z N ) , the Kendall's tau is defined as\nwhere sgn(x) is the sign function, taking value 1 if x > 0, 0 if x = 0, and −1 otherwise. If y i and z i are independent samples from two populations, τ is asymptotically 0, as the sample size N grows. Asθ i is intended to measure θ i,g , it is expected that if θ i,g > θ j,g , thenθ i >θ j and vise versa, for each pair of individuals i and j. Thus, the larger the τ is, the better the measurement. On the other hand, since θ 1 is a nuisance factor independent of θ g , it is expected thatθ i is independent of θ i1 , so that Kendall's tau is close to 0. Consequently, the measurement validity under this misspecified model is low, due to the high Kendall's tau correlation between the nuisance factor θ i1 andθ i . In other words, the latent trait being measured under the 2PL model deviates from what is designed to measure. This could lead to the issue of test fairness that could especially be of concern in educational testing. That is, for two examinees with the same θ g value, the one with a higher nuisance trait level tends to be scored higher. This phenomenon is known as differential item functioning (Holland and Wainer, 2012) . Bi-factor model with known nuisance factor. If the presence of the nuisance factor θ 1 is known, as well as its loading structure, we fit the true model. The latent traits θ i s are estimated using the two-stage procedure based on the posterior mean as above. Again, we plot θ i1 (x-axis) versusθ i,g (y-axis) and θ i,g (x-axis) versusθ i,g (y-axis) in panel (b) of Figure 4 . In addition, the Kendall's tau correlation coefficient between θ i1 andθ i,g is 0.046 and that between θ i,g andθ i,g is 0.539. Thus, with the nuisance factor adjusted in the measurement model, the test validity improves; that is,θ i,g tends to be less correlated with θ i1 , andθ i,g is more correlated with θ i,g .\nFLaG-IRT with known conditional graph. According to the discussion in Section 2.3, when knowing the item cluster C 1 , we can also fit a unidimensional FLaG-IRT model with a known graph satisfying only the first five items connected to each other, i.e., E = {(i, j) : i, j ≤ 5}. WithÂ andŜ from (10) Table 3 , we see that the values ofâ j s are much smaller for items 1 to 5 than those for items 6 to 15, while all the loadings on the general factor are the same in the true model. In other words, due to the positive local dependence among items 1 to 5, the weights of items 1 to 5 are discounted when computing the scoreθ i = J j=1â j x ij . This is expected, because in the presence of the nuisance factor, the responses to items 1 to 5 are highly correlated and thus provide less information about the general factor than the rest of the items. Consequently, the FLaG-IRT model discounts the weights of these items when computing the score.\nFLaG-IRT with unknown conditional graph. Finally, we consider the more realistic situation, in which that the presence of the nuisance factor and its relationship with the items are unknown. The FLaG-IRT analysis described in Section 3 is applied, for which the graph of local dependence graph is unknown. The selected local dependence graph is shown in Figure 5 (2, 9), (5, 15), and (10, 15). These results show that the measurement is very close to that with the true model or with the FLaG-IRT model with a correctly specified local dependence graph. They also show that the differential item functioning caused by the nuisance factor can be substantially reduced to a negligible level. "}, {"section_title": "Simulation Study 2", "text": "In this study, we evaluate the performance of the FLaG-IRT analysis presented in Section 3 under different settings. For each setting, 100 independent data sets are generated.\nIn the FLaG-IRT analysis, the local dependence structure is completely unspecified and learned from data. The settings are listed below. S1. The same setting as in Study 1, where K is set to be 1 in the FLaG-IRT analysis.\nS2. The same as setting S1, except that sample size N = 1500. S3. Generate data from a bi-factor model, with J = 20, N = 3000, and two item clusters, C 1 = {1, 2, 3, 4, 5}, C 2 = {6, 7, 8, 9, 10}. K is set to be 1 in the FLaG-IRT analysis.\nS4. The same as setting S3, except that sample size N = 1500. S5. Generate data from the FLaG-IRT model, with J = 45, N = 3000, K = 3 and local dependence graph E = {(1, 2), (2, 3), (3, 4) , ..., (44, 45)}. For the loading structure, items 1-15 measure the first latent trait, items 16-30 measure the second latent trait, and items 31-45 measure the third latent trait. If particular, we set a jk = 0.5 for q jk = 0, s jj = −6.5, j = 1, ..., J, s ij = 1 for (i, j) ∈ E, and σ kk = 1, k = 1, ..., K and σ kl = 0.1, k = l. R3. The true positive rate of graph estimation, defined as\nwhere for bi-factor models, we say (i, j) ∈ E if i and j belong to the same item\nR4. The false positive rate of graph estimation, defined as\nFor settings S3 and S4, we evaluate the FLaG-IRT analysis through R1, R3, and R4, but not R2 because now there are two nuisance factors. In addition, the results are compared with those of the 2PL model and the true model. For settings S5 and S6, the evaluation is based on R 3 , R 4 and R5. The estimation accuracy of the nonzero loading parameters and the diagonal entries of S.\nR6. The estimation accuracy of the off-diagonal entries of Σ.\nWe include R5 and R6, because data are generated from the FLaG-IRT model and thus the true parameters are known.\nThe results are summarized in Table 4 Figure 6: The difference between estimated and true nonzero factor loading parameterŝ a jk − a jk (a jk = 0.5), the difference between the estimated and true diagonal entries of S matrix,ŝ jj − s jj (s jj = −6.5) and the difference between the estimated and true off-diagonal entries of Σ matrix,σ kl − σ kl (σ kl = 0.1) under setting S5. The difference between estimated and true nonzero factor loading parameterŝ a jk − a jk (a jk = 0.5), the difference between the estimated and true diagonal entries of S matrix,ŝ jj − s jj (s jj = −6.5) and the difference between the estimated and true off-diagonal entries of Σ matrix,σ kl − σ kl (σ kl = 0.1) under setting S6."}, {"section_title": "Real Data Analysis", "text": "We illustrate the use of FLaG-IRT analysis by an application to the Extroversion short scale of the Eysencks Personality Questionnaire-Revised (EPQ-R; Eysenck et al., 1985; Eysenck and Barrett, 2013) . The data set contains the responses to 12 items from 824 females in the United Kingdom. All these items are designed to measure a single personality factor Extroversion, characterized by personality patterns such as sociability, talkativeness, and assertiveness. The items are shown in Table 5 , and the data are preprocessed so that the responses to the reversely worded items are flipped.\nWe start with fitting the unidimensional 2PL model whose unidimensional latent trait follows a standard Gaussian distribution and then check the model fit. The estimated 2PL parameters are shown in Table 6 . Under the fitted model, the expected two-by-two tables for item pairs can be evaluated by\nwhere φ(θ) is the density function of a standard normal distribution. We first check the fit of item pairs by comparing the expected two-by-two tables with the observed ones, using the X 2 local dependence index (Chen and Thissen, 1997) as a descriptive statistic.\nFor each item pair i and j, the X 2 statistic is defined as\nwhere O x i x j is the observed number of (x i , x j ) pairs. A large value of X 2 ij indicates a lack of fit. In addition, based on simulation studies, Chen and Thissen (1997) suggest that the marginal distribution of each X 2 ij is roughly a chi-square distribution with one degree of freedom when data are generated from the 2PL model. We visualize (X 2 ij ) J×J using a heat map in the left panel of Figure 8 . For a better visualization, we plot a monotone transformation of X 2 ij ,\nwhere Q Chi 1,95% is the 95% quantile of the chi-square distribution with one degree of freedom. Thus, T ij > 1/2 suggests that item pair (i, j) is not fitted well. In the heat map, the value of T ij is presented according to the color key above the heat map. The top five item pairs with highest levels of T ij are shown in Table 7 , where items within a pair tend to share common content/stimuli. To further assess the over-all fit of the 2PL model and to compare it with that of the selected FLaG-IRT model, we consider a parametric bootstrap test, using the total sum of the X 2 statistics as the test statistic\nThat is, we generate 500 bootstrap data sets, each of which has 824 samples drawn from the estimated 2PL model. For each bootstrap data set, we fit the 2PL model again and compute the corresponding total sum of X 2 s, denoted by\n2P L is used as the reference distribution. The\n2P L are shown in the left panel of Figure 9 . The observed value of SX 2P L based on the fitted model is 318, much larger than the ones from bootstrap data. Consequently, the p-value of this bootstrap test is 0, indicating that the lack-of-fit of the 2PL model. We then apply FLaG-IRT. The selected local dependence graph of the selected model has 20 edges, as shown in Figure 10 , where the positive and negative edges are in black and red, respectively. In particular, the most locally dependent item pairs also correspond to the most positive edges in Figure 10 . Similar to the analysis above, we compute the local independence indices for all the items pairs and visualize them in . Moreover, 500 bootstrap data sets are generated from the selected FLaG-IRT model and the bootstrap distribution of SX F LaG−IRT is shown in the right panel of Figure 9 . As we can see, the observed value of SX F LaG−IRT for the selected model is in the middle range of the bootstrap distribution and the p-value is 31.6%, indicating that the selected FLaG-IRT model fits well.\nBased on the above analysis, we see that even a well designed 12-item EPQ-R short form displays significant level of local dependence, which, if not adjusted, may result in severe measurement bias. The proposed FLaG-IRT model automatically adjusts for the local dependence based on the data, while maintaining the unidimensional latent trait as the key source of dependence among responses. As a result, the FLaG-IRT model learned from data fits well, at both the item pair level and the test level."}, {"section_title": "A.2 An Alternating Minimization Algorithm", "text": "We use an alternating minimization algorithm for optimizing (11). The positive semidefinite constraint on Σ is not easy to handle in the computation. Therefore, we reparameterize Σ = BB , where B = (b ij ) is a K × K lower triangle matrix. In addition, instead of constraining Σ kk = 1, we require b kk to be 1. There is a one to one correspondence between the two sets of parametrization and the transformation will be discussed in the sequel. We let l(A, S, B) = log L(A, S, BB ) and "}]