[{"section_title": "Abstract", "text": "The concept of the brain atlas is not new 1 . Cartographic approaches have been used for centuries to identify and target specific regions in the brain and to establish spatial relationships between a coordinate and a structure. Comprehensive maps of brain structure have been created, at a variety of spatial scales, from anatomical specimens 2-5 and various histological preparations that reveal regional cytoarchitecture 6, 7 , myelination patterns [8] [9] [10] , and protein and mRNA distributions. Most early and some more recent atlases of the human brain were derived from one, or at best a few, individual post-mortem specimens [3] [4] [5] [11] [12] [13] [14] . Such atlases provide anatomical references or represent a particular feature of the brain 15, 16 , such as a specific neurochemical distribution 17 or the cellular architecture of the cerebral cortex Beyond these traditional, anatomical atlases based on post-mortem tissue, modern brain atlases are being developed that incorporate flexible, computable systems, which accommodate the sometimes considerable variation in a population. The application of magnetic resonance imaging (MRI) to acquire detailed descriptions of anatomy in vivo is a driving force in brain mapping research. Tomographic imaging has the advantage of largely retaining the spatial integrity of the data by maintaining the intrinsic three-axis registration and simple volumetric coordinates 19, 20 . The atlases derived from these images are digital, allowing a wealth of computational algorithms to be applied to automatically align new two-and three-dimensional imaging data into the coordinate systems of these atlases 21 . Furthermore, there is an increasing ability to image various structural (as well as functional and chemical) features in the brain such as nuclei, cytoarchitectural details and white matter tracts. Technological advances continue to improve spatial and contrast resolution and have led to multispectral characterization (using MRI) of brain anatomy, reflecting features such as lipid content or water diffusivity in different tissues. Recently, chemoarchitectural maps, which describe receptor densities relative to their cytoarchitectonic localization and functional attributes, have been generated 21, 22 to bridge the gap between anatomical and functional observations. The transition from a static atlas representation to a computational one has dramatically extended the atlas concept. The brain atlas is now equivalent to a database that incorporates a multitude of data points that are organized, relational, extendable and testable. Initially, the brain atlas was purely neuroanatomical, based on a single representative example. Now it can include population statistics on structure, gene expression, receptor patterns or connectivity over time.\nIn this review, we describe the features and limitations of traditional methods of creating brain atlases and outline the requirements of a modern brain atlas. So far, most atlasing efforts have consisted of grey matter maps obtained from structural and functional MRI (fMRI) data. Here, we discuss the background and applications of human brain mapping, focusing on a few selected examples of methods that have shown rapid progress in recent years. These newer methods can be used to generate statistical data on cortical cytoarchitecture and receptor distributions, as well as Abstract | Atlases of the human brain have an important impact on neuroscience. The emergence of ever more sophisticated imaging techniques, brain mapping methods and analytical strategies has the potential to revolutionize the concept of the brain atlas. Atlases can now combine data describing multiple aspects of brain structure or function at different scales from different subjects, yielding a truly integrative and comprehensive description of this organ. These integrative approaches have provided significant impetus for the human brain mapping initiatives, and have important applications in health and disease. "}, {"section_title": "", "text": ", and protein and mRNA distributions. Most early and some more recent atlases of the human brain were derived from one, or at best a few, individual post-mortem specimens [3] [4] [5] [11] [12] [13] [14] . Such atlases provide anatomical references or represent a particular feature of the brain 15, 16 , such as a specific neurochemical distribution 17 or the cellular architecture of the cerebral cortex 6 . For example, Brodmann's map (1909) exclusively describes the cytoarchitectonic segregation of the cortex 6 , Dejerine's map (1901) describes fibre tract anatomy 18 , and the map by Schaltenbrand and Wahren (1977) describes the thalamus 14 . Beyond these traditional, anatomical atlases based on post-mortem tissue, modern brain atlases are being developed that incorporate flexible, computable systems, which accommodate the sometimes considerable variation in a population. The application of magnetic resonance imaging (MRI) to acquire detailed descriptions of anatomy in vivo is a driving force in brain mapping research. Tomographic imaging has the advantage of largely retaining the spatial integrity of the data by maintaining the intrinsic three-axis registration and simple volumetric coordinates 19, 20 . The atlases derived from these images are digital, allowing a wealth of computational algorithms to be applied to automatically align new two-and three-dimensional imaging data into the coordinate systems of these atlases 21 . Furthermore, there is an increasing ability to image various structural (as well as functional and chemical) features in the brain such as nuclei, cytoarchitectural details and white matter tracts. Technological advances continue to improve spatial and contrast resolution and have led to multispectral characterization (using MRI) of brain anatomy, reflecting features such as lipid content or water diffusivity in different tissues. Recently, chemoarchitectural maps, which describe receptor densities relative to their cytoarchitectonic localization and functional attributes, have been generated 21, 22 to bridge the gap between anatomical and functional observations. The transition from a static atlas representation to a computational one has dramatically extended the atlas concept. The brain atlas is now equivalent to a database that incorporates a multitude of data points that are organized, relational, extendable and testable. Initially, the brain atlas was purely neuroanatomical, based on a single representative example. Now it can include population statistics on structure, gene expression, receptor patterns or connectivity over time.\nIn this review, we describe the features and limitations of traditional methods of creating brain atlases and outline the requirements of a modern brain atlas. So far, most atlasing efforts have consisted of grey matter maps obtained from structural and functional MRI (fMRI) data. Here, we discuss the background and applications of human brain mapping, focusing on a few selected examples of methods that have shown rapid progress in recent years. These newer methods can be used to generate statistical data on cortical cytoarchitecture and receptor distributions, as well as Magnetic resonance imaging (MRI) . A non-invasive method to obtain images of living tissue. It uses radio-frequency pulses and magnetic field gradients; the principle of nuclear magnetic resonance is used to reconstruct images of tissue characteristics (for example, proton density, water diffusion parameters)."}, {"section_title": "Multispectral characterization", "text": "Multispectral imaging devices measure multiple features of an object at each spatial location, such as optical reflectance at different wavelengths, or different relaxometric decay constants (T1 and T2) in MRI."}, {"section_title": "Chemoarchitectural maps", "text": "Differences in the molecular composition of cortical and subcortical brain regions can be assessed using enzyme-or immunohistochemistry, in situ hybridization, receptor autoradiography and so on, revealing subdivisions with distinctive distribution patterns, such as expression of transmitter receptors."}, {"section_title": "Diffusion tensor imaging (DTI).", "text": "A technique developed in the mid-1990s, based on MRI in which diffusion constants of water molecules are measured along many (>6) orientations and diffusion anisotropy is characterized. It is used to visualize the location, orientation and anisotropy of the brain's white matter tracts, and is sensitive to directional parameters of water diffusion in the brain."}, {"section_title": "Myeloarchitecture", "text": "Subdivisions (numbered or named) of the cerebral cortex, called myeloarchitectonic maps, based on features (for example, stria of Gennari in the visual cortex) of myelinization (differential density of myelinated fibres and fibre bundles in different cortical layers), and identified in myelinstained histological specimens.\nwhite matter fibre tracts and projections, using techniques such as diffusion tensor imaging (DTI). It is likely that these methods will contribute to the future development of advanced integrative atlases. Brain maps that visualize distributed patterns of task-dependent functional activity are now beginning to be related to anatomical fibre connectivity computed from DTI -each modality contributes to better hypotheses and models regarding neural systems involved in cognitive function. We go on to evaluate several existing integrative, population-based international initiatives. Algorithms that are used to analyse probabilistic and time-varying atlases have led to important findings regarding some of the diseases that affect the brain, and have provided new perspectives on the effects of age, gender and genetic factors. We discuss how these atlases are evolving rapidly as developments in imaging modalities, post-mortem mapping and computational analysis of images are combined to detect new features that were not observable (or measurable) in the past."}, {"section_title": "The evolution of brain atlases", "text": "Lessons from the past. Early research on the cellular composition of the brain culminated in the development of atlases of the human cerebral cortex, which were pioneered by Brodmann 6, 23 . These studies continued until the 1960s . The cortex was segregated into numerous structurally defined areas, based on regional cytoarchitecture (identified mainly by the number of cortical layers, laminar patterns of cell packing density and the shape of neuronal cell bodies) or myeloarchitecture (identified mainly by the degree of myelination and the presence or absence of myelinated fibre bundles in the cerebral cortex). These types of architecture were studied by visual inspection of Nissl-or myelin-stained histological sections in single brains. However, when maps by different authors of this classical period are considered, a number of problems become apparent. For example, the drawings do not provide the sulcal pattern of a single real brain or a welldefined 'average' brain but of an imagined 'ideal' brain (for example, Brodmann's schematic drawing of a brain 6 ); so, it is impossible to compare different maps in a common reference space as they are not registered in a stereotaxic system, and brain shape and sulcal contours vary greatly between maps. The number of cortical areas also varies between the different maps, as the delineation procedure for areal boundaries was highly observer-dependent and not assessed quantitatively or statistically. Furthermore, with few exceptions, the drawings or descriptions do not show the positions of areas and their borders in the cortical sectors that are hidden in the sulci. This amounts to nearly two-thirds of the total surface area of the cortex 27 . Any desig nation of cortical areas in the sulcal part of the cortex 5 is pure supposition, and not supported by original observations. Finally, most classical maps 9, 10 do not match the high degree of cortical segregation that has more recently been shown by functional imaging -particularly in the multimodal association cortices [28] [29] [30] [31] . Indeed, architectonic brain mapping based on visual inspection has been severely criticized 24, 32 because of its lack of clearly stated and objectively verifiable criteria. This led to a decrease in the general interest in architectonic atlases for decades. More recently, axonal tracing techniques have been combined with architectonic observations to produce atlases of selected cortical regions in non-human primates and other mammals 28, 33 . Unfortunately, this experimental approach cannot be used in studies of the human brain. Meanwhile, stereotaxic atlases of the human brain, based on imaging data, began to be published (mostly in book form), primarily in response to the needs of neurosurgeons. These atlases compensate for some of the problems of the classical brain maps -particularly the lack of a spatial reference system. However, stereotaxic atlases tend to focus on subcortical structures and provide only sparse information about the cortex 14 . Furthermore, they lack quantitative information on the intersubject variability of areal boundaries 11 , intersubject variability in gross anatomy, left-right asymmetries and the criteria to identify architectonic areas 5 .\nThe driving force for modern brain atlases. The current resurgence of interest in brain atlases that provide architectonic maps of the human cerebral cortex has been largely motivated by the introduction of functional imaging techniques such as positron emission tomography (PET) and fMRI. Researchers using these techniques invariably want to define -as far as possible with the limited resolution of PET or fMRI -the location of neural activity and determine whether the focus of activity is associated with a portion of a specific cortical area, an entire cortical area or overlapping areas.\nThe development of functional imaging techniques has therefore relied on the evolution of structural imaging. These advances have included both in vivo, structural MRI and high-resolution imaging of threedimensional reconstructed histological sections. An example of the use of these techniques has been the development of the concept of a 'cortical area' , which has an important role in functional brain mapping. Cortical areas can be defined structurally on the basis of either macroscopic or microscopic (architectonic) criteria, although architectonic borders vary considerably in relation to macroscopic landmarks [34] [35] [36] [37] . The concept of 'brain mapping' benefits from the combination of functional imaging of a distinct and well-defined function with a microstructurally defined architectural atlas, because the correlation between function and its underlying cyto-or myeloarchitecture can then be tested by using the architectural map for the definition of regions of interest in functional imaging.\nThe correlation between the (micro)structure and the function of an area has been established for many cortical regions, in particular for primary sensory and motor areas 7, 8, [38] [39] [40] [41] . Many functional units in the cortex are consistently found in humans and other primates, such as primary visual area V1, or the motion-sensitive area MT/V5, in the middle temporal gyrus. The spatial layout of these regions in the cortex is also somewhat consistent across individuals 38, 39, 42, 43 . Visual areas V1-V5 were initially defined electrophysiologically, based on their highly selective responses to visual stimuli with specific intensities, orientations or directions of motion 29, 30, 38, 44, 45 . These classifications allow functional imaging studies to relate their observations to known anatomical units that were initially defined using electrophysiology or direct histological mapping.\nRequirements for modern brain atlases. Based on the criticisms of architectonic brain mapping 24, 32 , the requirements of basic and clinical brain research and the current progress in structural and functional brain imaging techniques, the criteria for ideal brain atlases can be established. They should include a multimodal microstructural approach that combines different independent methods, such as cytoarchitectonic, myeloarchitectonic, chemoarchitectonic and modern fibre-tracking approaches along with macroscopic, in vivo and tomographic imaging methods, and use observer-independent methods [46] [47] [48] [49] to define cortical boundaries -so-called architectonic parcellation. Brain atlases should contain data on interindividual variations in the geometry and topology of architectonic areas and should allow the use of algorithms that perform adequate linear (such as scaling, rotating, translation and shearing) or nonlinear (based, for example, on an elastic model 50, 51 ) alignment of individual brains and their structures to a standard spatial reference system. Nonlinear transformations, which apply local contractions or dilations, are often required (as well as linear transformations such as local rotations and shearing) to equate, or deform, an individual subject's anatomy to match the shape of a brain atlas 21 . In addition, efforts should be made to establish population brain maps (probability maps), which define the probabilistic position and borders of cortical areas based on studies of a large number of subjects across various population groups. Finally, these atlases should use a database format that provides easy access to the original data on which the atlas is based (for example, anonymized images from individual subjects, or models of specific brain structures). Alternatively, the statistical maps and anatomical delineations in the atlas should be readily importable into software and tool boxes that are commonly used when analysing new brain images. Once imported into other image analysis software, probabilistic maps of cortical regions or fibre pathways can be used to define regions of interest on new images, to provide a priori constraints or search regions for new statistical analyses, or simply to provide visual overlays of data from an alternative modality."}, {"section_title": "New architectonic atlas approaches", "text": "The limitations of classical brain maps led to the evolution of new concepts for generating atlases 34, 43, 52, 53 . As a result of these conceptual developments, an objective, observer-independent procedure for the parcellation of the cerebral cortex has recently been introduced (FIG. 1) . This technique is based on the measurement of the greylevel index (GLI) as an indicator of the volume fraction of cell bodies throughout the cortical layers from the . Bottom panel shows the Mahalanobis distance, which indicates the dissimilarity in laminar pattern between two cortical segments and can be calculated from the feature vectors from each profile. The Mahalanobis distance at each position of the sliding window is plotted. Significant maxima at positions n = 40 (blue arrow), n = 97 (black arrow), n = 305, n = 497 and n = 586 indicate the positions of putative areal borders. Performing this procedure in serial histological sections of several (usually ten) brains, three-dimensional reconstructed histological data sets of post-mortem brains and their areas are registered to common standard reference space, and cytoarchitectonic probability maps are calculated for each area."}, {"section_title": "Cytoarchitectonic approach", "text": "Warping of the individual brains and their cortical areas to the reference system (e.g., MRI volume of an individual in vivo brain)"}, {"section_title": "Receptor imaging approach", "text": ""}, {"section_title": "Functional imaging results", "text": "Multimodal atlas and database of the human brain "}, {"section_title": "Stereotaxic system", "text": "A technique or apparatus used in neurosurgery or brain imaging studies to localize a specific anatomical locus using standardized three-dimensional coordinates; used, for example, for directing the tip of a surgical instrument (such as a needle or electrode) to a known location."}, {"section_title": "Functional imaging", "text": "Distinct from structural imaging techniques such as computerized tomography or MRI that assess anatomical structure, functional imaging techniques (for example, positron emission tomography, functional MRI and electroencephalography) are sensitive to physiological processes such as neuronal activation, electromagnetic properties of living tissue, blood flow or metabolism."}, {"section_title": "Multimodal association cortices", "text": "The multimodal association cortices of the parietal and frontal lobes integrate somatosensory, auditory and visual information for higherorder cognitive processing."}, {"section_title": "Positron emission tomography", "text": "A medical imaging technique that uses injected radiolabelled tracer compounds in conjunction with mathematical reconstruction methods to produce a three-dimensional image or map of functional processes in the body, such as glucose metabolism, blood flow or receptor distributions."}, {"section_title": "Multimodal microstructural approach", "text": "An approach to characterize fine-scale anatomy using multiple histological and neurochemical techniques, revealing different aspects of cellular organization or molecular composition."}, {"section_title": "Fibre-tracking approaches", "text": "Using this approach, threedimensional trajectories of white matter tracts can be reconstructed. The algorithm is based on fibre orientation information obtained from diffusion tensor imaging.\nsurface to the white matter border in cell body-stained histological sections, and subsequent multivariate analysis of changes in the laminar pattern 46 . Using this procedure, areal borders can be more reproducibly mapped than in previous studies, which were based on visual inspections 34 . Three-dimensional reconstructions of post-mortem brains, including cytoarchitectonically defined cortical areas, are then elastically registered or 'warped' to the MRI volume of an in vivo brain that is also used as a spatial reference for the registration of functional imaging data 50, 54, 55 . This strategy (FIG. 2 ) allowed the classical maps to be corrected 56 and provided a quantitative description of the intersubject variability of cytoarchitectonic areas [34] [35] [36] [37] 40, 57, 58 . It has also facilitated linear or nonlinear registration of individual brains and their structures to a spatial reference system and the discovery of hitherto unknown cytoarchitectonic areas such as intraparietal areas hIp1 and hIp2 (REF. 59 ), areas of the secondary somatosensory cortex OP1-4 (REF. 60 ) and area hOc5 of the extrastriate cortex 61 . This integrated approach has also been used to create cytoarchitectonic probability maps of the human cortex 22, [34] [35] [36] 40, 52, 53, 56, 58, [62] [63] [64] [65] [66] [67] [68] [69] [70] . The resulting probability maps have been used for the anatomical interpretation of functional imaging observations 40, 41, 45, 52, [70] [71] [72] [73] [74] [75] . For example, it has been shown that left area 45 is more involved in semantic processing than left area 44 (REF. 71 ). So, schematic drawings of maps and areal borders have been replaced with probability and maximum probability maps 55 (FIG. 3) .\nThis allows the visualization of the intersubject variability in cytoarchitecture and quantitative definition of the presence and extent of cytoarchitectonic borders and cortical areas in all voxels of the reference brain or space.\nArchitectonic probability maps from a number of post-mortem brains can be spatially warped onto an individual or 'average' brain (represented by a highresolution MRI volume) as a common spatial reference system. This provides a powerful tool for the anatomical interpretation of functional imaging data, which can also be developed into a topographically organized multimodal database of the human brain."}, {"section_title": "Molecular architectonics.", "text": "Histochemical and immunohistochemical methods have greatly improved our knowledge of the regional chemoarchitecture of the cerebral cortex, mainly in animals. However, the often demanding requirements of these methods regarding tissue preservation and fixation have limited their application in human post-mortem brains. Moreover, a large-scale analysis of serial sections of whole human brain hemispheres is hampered by the time-consuming procedures, regionally unequal staining quality, lack of precise reproducibility and high costs. However, analysis of large brain sections is a necessary prerequisite in A map that depicts the likelihood of a particular feature. It can be used to show how frequently, in percentage, a given anatomical structure is found in a specific location across a population of subjects."}, {"section_title": "Cytoarchitectonic probability maps", "text": "Based on a sample of brains that have been parcellated using cytoarchitectonic criteria; they display the statistical likelihood, or relative frequency, that a particular voxel in stereotaxic space contains a given cytoarchitectonic unit (for example, a cortical area, or a subcortical nucleus)."}, {"section_title": "Maximum probability maps", "text": "Summary maps in which each voxel of the three-dimensional space has been assigned to the cytoarchitectonically defined unit with the highest probability. They are calculated on the basis of probability maps, such as cytoarchitectonic probability maps, to generate a map with unambiguously defined borders."}, {"section_title": "Voxel", "text": "The three dimensional equivalent of a pixel. A pixel is a picture element, and a voxel is a volume element. many mapping projects. Recent developments in the detection of neurotransmitter receptors have overcome this limitation and allowed the molecular mapping of human brains 22, 34, [76] [77] [78] [79] [80] . Neurotransmitter receptors are important for signal transduction in the brain; many types of receptor are expressed in any given cortical area, and even within a single neuron or glial cell 22 . So, information on regional differences in receptor density (receptor architecture) is an important feature of a modern brain atlas.\nThe distribution patterns of neurotransmitter receptors can be assessed using quantitative in vitro receptor autoradiography. This method is based on the binding of radioactively labelled ligands selective for binding sites of a defined receptor type or subtype, and subsequent analysis of binding site densities. The analysis of numerous receptor types in the same brain region is also feasible, and allows insight into the balance of neurotransmitter systems. Receptor autoradiography has numerous advantages. Most importantly, it is possible to study brain tissues without major loss in binding properties, up to a maximum post-mortem delay of approximately 18-28 hours (depending on the post-mortem conditions and receptor types). It also yields strictly quantifiable results, and allows analysis of large serial sections through complete, undissected hemispheres. Finally, it is possible to label numerous different receptors in immediately adjacent cryostat sections (10-20 μm thick), and to match cytoarchitectonic and myeloarchitectonic data derived from alternating sections of the same brains that have been used for receptor labelling.\nReceptor autoradiography has been used to study the regional distribution patterns (that is, differences between brain areas) and laminar distribution patterns (that is, differences between cortical layers) of selected neurotransmitter receptor types and subtypes in the human cortex 22, 34, 40, 69, 70, [79] [80] [81] [82] . It has been shown that localized changes in the laminar distribution patterns and/or mean densities (which are averaged over all cortical areas) of receptor binding sites resemble cytoarchitectonic borders 22, 34 . For example, the border between the primary (V1) and secondary (V2) visual cortices is clearly visible due to the considerably higher muscarinic M2 receptor density in V1 than in V2 (REFS 22, 34) (FIG. 4a,b) . The V1/ V2 border is also visible in myelin-stained sections owing to the unique presence of a heavily myelinated sublayer (Gennari's stripe) in area V1 (REFS 22, 34) . Compared with V2, α 2 -adrenergic, GABA A (γ-aminobutyric acid type A) and serotonergic 5-HT 2 receptors are also present at a higher density in V1, whereas glutamatergic kainate and AMPA (α-amino-3-hydroxy-5-methyl-4-isoxazole propionic acid) receptors are present at a lower density in V1. Such receptor architectonic features have led to the discovery of cortical areal borders and intracortical areal subdivisions that had not previously been detected in cytoarchitectonic or myeloarchitectonic studies. These include the subdivision of the primary motor area 4 (REF. 40 ), as well as the TE1.0 and TE1.1 (temporal cortex 82 ) subdivisions of the primary auditory cortex, which were revealed by the distribution pattern of receptors (FIG. 4c) . So far, this receptor autoradiography approach has also been used to examine various neurotransmitter receptors in more than 50 different cyto architectonically defined cortical areas. Receptor mapping not only adds multimodal data about the molecular basis of their areas and nuclei to brain atlases, but it is also a powerful tool for the identification of cyto-or myeloarchitectonically undetectable borders of cortical areas. Finally, as receptors have a key role in neurotransmission, receptor mapping enriches brain atlases with functionally relevant data that are directly related to anatomical criteria such as cyto-or myeloarchitecture."}, {"section_title": "White matter maps", "text": "In the past, most atlas efforts have focused on grey matter structure and function. Multimodal atlases, however, are incomplete without information about white matter. The white matter has an important role in connecting different regions of the brain. Perhaps surprisingly, our understanding of human brain connectivity is still limited. One possible reason for this is that it is extremely complex: given a specific number, n, "}, {"section_title": "T1-weighted images", "text": "One of most widely used MRI methods, in which the contrast is based on a selection of MRI acquisition parameters, producing an image that weights signal by the relaxometric parameter, T1, of each tissue (that is, the longitudinal relaxation time). In the brain, T1-weighting causes fibre tracts (nerve connections) to appear white, cortex and basal nuclei to appear grey, and cerebrospinal fluid to appear dark."}, {"section_title": "Relaxometry", "text": "The measurement of relaxation parameters in nuclear MRI, such as the longitudinal (T1) or transverse (T2) decay constants that characterize signal decay from excited nuclei. By detecting subtle differences in relaxation times, relaxometry is capable of differentiating various tissue types in the brain."}, {"section_title": "Anisotropy map", "text": "The directional dependency of water diffusion at each point in the brain can be summarized using measures such as fractional anisotropy. High anisotropy values indicate heavily myelinated white matter, whereas decreased anisotropy is often a sign of disease.\nof distinct functional locations in the cortex, there are as many as n 2 possibilities for the presence or absence of interconnections (as connections can be intraregional and be in either direction between two regions). Another reason is that the available tools to investigate brain connectivity in vivo are inadequate, as most existing methods are based on invasive techniques such as chemical tracers and lesion-based studies, which are less practical for population-based studies and inappropriate for humans. In addition, conventional MRI has also been powerless on this front. As shown in FIG. 5a , the white matter seems to be homogeneous in T1-weighted images.\nEven using relaxometry to derive quantitative measures that depend on tissue type, conventional MRI has been unable to provide sufficient contrast to decipher fibre tract organization in the white matter.\nHowever, this situation has changed since DTI was developed in the mid-1990s (REF. 83 ). The contrast of this MRI technique is based on directionality of water motion (random Brownian diffusion) in the brain, and it can provide two types of information. First, it can generate a so-called anisotropy map [83] [84] [85] [86] (FIG. 5b) . If the fibre architecture surrounding water molecules has a coherent orientation, as in the case of axonal bundles, water tends "}, {"section_title": "Anisotropic diffusion", "text": "Diffusion of a substance (for example, water) that is greater in certain preferred directions, such as along the axons of a fibre tract."}, {"section_title": "Isotropic diffusion", "text": "Diffusion of a substance (for example, water) that is uniform in all directions."}, {"section_title": "Tensor-valued information", "text": "Information that can be modelled mathematically as a matrix, or tensor, at each location in an object. Diffusion tensor imaging produces signals with at least six independent parameters at each anatomical point (the diffusion tensor); tensor calculus can then be used to estimate diffusion parameters in any specific direction.\nto diffuse preferentially along that orientation, in a process called anisotropic diffusion. If the molecular environment is random, water motion is also random, yielding isotropic diffusion. Therefore, the anisotropy map can reveal which brain regions have a more orderly structure (high diffusion anisotropy). Not surprisingly, many regions of the white matter have coherent fibre orientation with respect to the image resolution, and so have high anisotropy, as can be seen in FIG. 5b . The second type of information obtainable from DTI is the orientation of these ordered structures 83, [87] [88] [89] [90] [91] ; colour is often used to symbolize this information. In FIG. 5c , red, green and blue colours represent fibres running along the right-left, anterior-posterior and superior-inferior axes, respectively. The rich anatomical and spatial information conveyed by this orientation map can be clearly appreciated. Pixel-by-pixel information on fibre orientation can also be extrapolated to reconstruct three-dimensional trajectories of prominent fibre tracts based on a fibre-tracking approach [92] [93] [94] [95] [96] [97] [98] or a probability-based approach 99 . FIGURE 6 shows examples of such a three-dimensional fibre-tract reconstruction based on DTI data, which is remarkably similar to known white matter anatomy based on post-mortem samples 100 . The orientation information from DTI provides essential contrast in the white matter and opens up new opportunities for brain mapping and atlasing. Just as the cortical folding pattern provides clues to identify anatomical locations and map functions, the orientation contrast can be used to identify various functional units in the white matter. Combined with three-dimensional reconstruction, coordinates of specific white matter tracts can also be mapped. FIGURE 7 shows several examples of DTI-based white matter maps. Using a high-quality single-subject dataset, various white matter tracts have been identified and a white matter atlas generated 85, 90, [101] [102] [103] [104] [105] . By normalizing DTI data from multiple subjects into a common template coordinate system, a probabilistic map of white matter anatomy can be created for normal and diseased patient populations, allowing for quantitative comparisons of white matter anatomy [106] [107] [108] (FIG. 7b) . FIGURE 7c,d show a manually reconstructed map with parcellated white matter tracts based on DTI data. Once the white matter is parcellated into different tracts, these can serve as a valuable framework to map anatomical and functional information. If one is interested in the shape and size of a specific white matter tract, the fibre-tracking approach can be applied to create population-based maps 103 (FIG. 7e) . Using these mapping techniques, axonal degeneration after stroke or surgery can be followed in a tract-specific manner and these changes can be correlated with functional outcomes 109 . Therefore, we can investigate such questions as 'which white matter tracts are affected by stroke?' 110, 111 , or 'what is the functional outcome of degeneration in a specific white matter tract?' 112 . DTI can also be used to generate connectivity maps (FIG. 7f) by identifying brain regions associated with a specific white matter tract 113 . Such connectivity maps could provide important clues to deduce which cortical areas are likely to be affected when white matter injuries occur.\nAlthough DTI is a powerful technique for brain mapping, it has several limitations. First, it generates tensor-valued information at each pixel, accumulating large amounts of complicated anatomical information. Data analysis methodology is not yet sufficiently developed to harness this detail, making it challenging to quantify morphology from these datasets. Second, with current imaging resolution (2-3 mm), only the macroscopic anatomy of large white matter tracts can be studied. For example, the notion of 'fibre orientation at each pixel' is based on the assumption that there is only one fibre bundle with the same orientation in a given pixel. Currently, many new approaches alternative to the tensor-based method are being proposed, which can extract more anatomical information (such as identifying multiple fibre populations) from each pixel [114] [115] [116] [117] . Although these approaches have successfully demonstrated their effectiveness, with current imaging resolution, the information inherent in diffusion measurement is macroscopic and there is no way to obtain cellular-level or even synaptic connectivity information.\nThis resolution issue is also related to the validity of DTI-based tract reconstruction results. Although good overall agreement has been reported between the threedimensional reconstruction results and existing anatomical knowledge, there are frequent false-negative and falsepositive results due to noise and partial volume effects. In the future, it will be important to develop approaches to reliably extract anatomically and clinically valuable information from such contaminated data. Although this is a challenging task, several effective approaches have been suggested, such as knowledge-based tract reconstruction (namely, reconstructing only anatomically known fibres) 92 , probabilistic tracking 99 and population-average approaches 103 . Nevertheless, DTI can advance our knowledge of the correlations between white matter anatomy and function by providing a refined white matter map to which we can register various experimental findings. Finally, macroscopic DTI information can be compared directly with microscopic post-mortem data on fibre tracts [118] [119] [120] , yielding an integrative atlas system that evaluates both methods with considerable synergistic effects. This image was created using data from 30 healthy volunteers normalized to a common template using a 12 parameter affine transformation. c | Various structures are parcellated manually or by using three-dimensional tract reconstruction into individual tract families based on orientation (colour) information. d | This parcellation/reconstruction allows a threedimensional white matter parcellation map to be created. e | The morphology of a specific white matter tract can be investigated, based on a three-dimensional tract reconstruction technique followed by group averaging. Here, the inferior fronto-occipital fasciculus (IFO) was reconstructed from the normal population and mapped onto a common template. f | This approach can also be used to identify cortical regions associated with a specific tract, where the trajectory of the IFO is extrapolated to identify associated cortical regions, and a probabilistic cortical map is created from the 30 subjects. These kinds of map pave the way to investigate white matter anatomy and function in a systematic and quantitative manner. ACR, anterior corona radiata; ALIC, anterior limb of internal capsule; ATR, anterior thalamic radiation; CC, corpus callosum; CG, cingulum; CPT, corticopontine tract; CST, corticospinal tract; EC, external capsule; Fmajor, forceps major; Fminor, forceps minor; FX, fornix; GCC, genu corporis callosi; ILF, inferior longitudinal fasciculus; PLIC, posterior limb of internal capsule; PTR, posterior thalamic radiation; RLIC, retrolentricular part of internal capsule; SCC, splenium corporis callosi; SFO, superior fronto-occipital fasciculus; SLF, superior longitudinal fasciculus; SS, sagittal striatum; ST, stria terminalis; TAP, tapetum. Multimodality and population-based atlases Multimodal mapping. Before the advent of brain mapping methods 1 , atlasing efforts of various research groups were typically independent of one another. Most atlases had a different spatial scale and resolution, utilized different data structures, described different structural or functional characteristics and were inherently incompatible with the others. Although each of those brain mapping strategies has its unique advantage, the brain atlases that are derived from a single method will be limited, unless certain integrative approaches such as spatial normalization are implemented. An integrated, comprehensive approach requires these diverse mapping methods to be combined and correlated.\nCharacterizing a single subject with multiple imaging devices clearly combines the strengths of each imaging modality. Data from single subjects, pre-mortem and post-mortem, provide a unique view of the relationship between in vivo imaging and histological assessment. For example, Mega et al. 121 scanned patients in the terminal stages of Alzheimer's disease using both MRI and PET. These data were combined with a stain of neurofibrillary tangles and post-mortem three-dimensional histological images that show the gross anatomy 122 . This multimodal, but single-subject, atlas of Alzheimer's disease relates the anatomical and histopathological underpinnings to in vivo metabolic and perfusion maps of this disease. Recent work on neurodegenerative diseases has also warped histological data into MRI scans to better identify regions (such as the CA fields of the hippocampus and the basal nucleus of Meynert 123 ) that are relevant to understanding the pathology.\nPopulation-based atlases. Modern atlases not only incorporate information from multiple modalities -they also incorporate information from multiple members of a population. Normal anatomical complexity and variability between human brains are so great that group-specific patterns of anatomy and function are often obscured. Reports of structural differences in the brain linked to gender, IQ and handedness are a topic of intense controversy 124, 125 , and it is even less clear how these factors affect disease-specific abnormalities. The importance of these linkages has propelled computational anatomy to the forefront of brain imaging investigations. In particular, population atlases can be compiled into subpopulations to represent specific disease types, and subsequently stratified by age, gender, handedness or genetic factors.\nTo distinguish abnormalities from normal variants, a realistically complex mathematical framework is required to encode information on anatomical variability in homogeneous populations 126 . Warping algorithms can be used to equate individual brain datasets with an atlas template, and the applied transformations can be studied to examine patterns of anatomical variation and detect pathology. Cortical anatomy is altered in schizophrenia 127 , Alzheimer's disease 128, 129 and in various developmental disorders, including fetal alcohol syndrome 130 , autism 131 and Williams syndrome 132 . By using specialized strategies for averaging anatomy across individuals, specific features of anatomy emerge that are not observed in individual representations due to their considerable variability; population-specific patterns of cortical organization or asymmetry can then be mapped and visualized 124 . Population-based brain atlases 54, 133 provide an expandable framework to synthesize the results of disparate imaging studies. These atlases use novel analytical tools to combine data across subjects, modalities and time and to detect group-specific features not apparent in individual scans. A notable example is the pattern of anatomical asymmetry in the major cortical gyri and sulci, such as the prominent asymmetries in the perisylvian language-related cortices, which are well known 134 but not easily discernible in individual brain scans. The average patterns clearly emerge after averaging computational models of the cortical sulci across a population 124 . So, a computational framework can be used to answer neuroscientific questions regarding the development of these asymmetries 135 , and how they are modulated by gender 136 , aging or in psychiatric illnesses such as schizophrenia 37, 137, 138 . Furthermore, populationbased atlases can be stratified into subpopulations to reflect a particular (clinical or demographic) subgroup 1 . Design of appropriate reference systems for brain mapping data presents considerable challenges, as these systems must capture how brain structure and function vary in large populations, across age and gender, in different disease states, across imaging modalities and even across species 139 . As imaging data from different studies can now be compared in a common coordinate system, large databases of functional imaging data -and associated meta-data on experimental paradigms and findings -are now beginning to be assembled, along with tools developed to interact with them 140 . Notable examples of these neuroinformatics efforts include the ICBM 53 (see International Consortium for Brain Mapping in Online links box), the ADNI (see Alzheimer's Disease Neuroimaging Initiative in Online links box) consortium project to build a data repository of MRI, PET and other clinical and biomarker data on aging and Alzheimer's disease, the NIMH paediatric imaging study (which is scanning nearly 1000 children every 2 years for 10 years 141, 142 ) , and the Finnish twin registry, whose scans have been used to identify genetic influences on brain structure 125, 143, 144 . Over the next decade, population-based atlases are also likely to gain widespread applicability in genetic studies. In an exciting development, genetic linkage data have been incorporated into brain imaging studies to discover previously unknown effects on the brain of variations at specific genetic loci 145 (FIG. 8e) . Given their power to store and compute statistics on expected rates of brain development and degeneration for different clinical populations, dynamic brain atlases are also likely to be used in drug trials or studies of factors that influence disease expression and therapeutic response 146 , and studies on the effects of specific medications such as antipsychotics or mood stabilizers [147] [148] [149] . Image processing algorithms are also making digital brain atlases more versatile. For example, probabilistic atlases retain information on cross-subject variations in brain structure and function. These atlases are powerful new tools with broad clinical and research applications 52, 124, 150, 151 . Deformable brain atlases, which are essentially labelled templates of anatomy that can be locally dilated, stretched and scaled to match scans from new subjects 152 , are adaptable in that they can be individualized to reflect the anatomy of new subjects. The deformation can transfer all the accumulated data in the atlas onto the new subject's scan, thereby quantifying the degree of deviation in their anatomy, relative to a normative population [153] [154] [155] . 161, 182, 195 . Atlases could provide statistical measures of disease burden for drug trials, offering insight into the systems involved and factors that influence them. e | Individual deviations from these average patterns can also be analysed: twin studies have revealed aspects of brain structure (such as frontal grey matter) that are under extremely strong genetic control 188 . In the new field of imaging genomics, genetic linkage studies have been extended to brain mapping data to identify the statistical linkage between specific genetic variations (single nucleotide polymorphisms) and anatomical variations in the form of a statistical map 186 . DISC1, disrupted in schizophrenia 1; rs229, denotes a single nucleotide polymorphism marker (rs751229) located in DISC1. The colour bar denotes the correlation between intrapair differences in brain matter density with the number of alleles in common at this genetic marker locus in twins discordant for schizophrenia.\nFinally, dynamic brain atlases can also be used to reference and analyse dynamic, time-varying data. Recent studies have analysed longitudinally collected MRI scans to compute probabilistic information on growth rates [156] [157] [158] (FIG. 8a) (FIG. 8c) . A complementary development, which has advanced the power of multi-subject atlasing projects, is the widespread use of analysis techniques such as statistical parametric mapping (SPM)\nDisease-specific atlases. Surprisingly few atlases of neuropathology use a standardized three-dimensional coordinate system to integrate data across patients, techniques and acquisitions. Atlases with a welldefined coordinate space 54, 163 , together with algorithms to align data with them 21 , have enabled the pooling of brain mapping data from multiple individuals and sources, including large patient populations. Automated algorithms can then utilize atlas descriptions of anatomical variance to guide image segmentation [164] [165] [166] , tissue classification 167, 168 , functional image analysis 169, 170 and pathology detection 171 . An obvious challenge in integrating pathological data from tissue specimens results from the destructive sectioning and histological staining procedures. Even so, the advent of whole human head cryosectioning techniques (in which the intact blockface is imaged photographically) allows spatially coherent three-dimensional volumetric images to be acquired. Stained pathological material could, in principle, be aligned with these canonical volumes using three-dimensional image deformation strategies that have proven useful in creating cytoarchitectural atlases.\nStatistical representations of anatomy resulting from the application of atlasing strategies to specific subgroups of diseased individuals have revealed the profile of structural brain deficits in a number of diseases. These include studies of Alzheimer's disease 161 , HIV/AIDS 132, 172 , epilepsy 172, 146 , unipolar depression 173 , childhood and adult-onset schizophrenia [174] [175] [176] [177] , attention-deficit/hyperactivity disorder 178 , fetal alcohol syndrome 179 , Tourette's syndrome 180 , bipolar disorder 181, 149 , autism 131, 149 , Williams syndrome 132 and methamphetamine abusers 182 . Findings from these population atlases have often led to unexpected neuroscientific findings, such as a spreading wave of cortical changes in schizophrenia 176, 177 . Without methods to overcome the problems of anatomical variability, the statistical power to resolve disease and treatment effects is seriously undermined. First, owing to normal anatomical variation, diseased and healthy individuals overlap on most anatomical measures. Second, these difficulties are exacerbated by disease-related change such as atrophy 128, 149, 159, 183, 184 or other progressive and dynamic anatomical changes. To fully capitalize on neuroimaging data from the diseased brain, an appropriately complex mathematical framework is needed to address these challenges. Only then can brain maps be compared across patients and across time 133, 160, 182, 184, 185 . Atlases have also revealed how single genes can affect brain structure 186 . When they have supported existing models of disease, such as the sequence of spreading pathology in Alzheimer's disease, atlas-based descriptions of variance offer statistics on degenerative rates and can elucidate clinically relevant features at the systems level. Atlases have identified differences in atrophic patterns between Alzheimer's disease and Lewy Body dementia 187 , and differences in atrophic rates between clinically-defined subtypes of psychosis [188] [189] [190] . Based on well-characterized patient groups, population-based atlases contain composite maps and visualizations of structural variability, asymmetry and group-specific differences. Pathological change can be tracked over time, and generic features resolved, allowing these atlases to offer biomarkers for a variety of pathological conditions, as well as morphometric measures for genetic studies or drug trials."}, {"section_title": "Conclusions and perspectives", "text": "The evolution of brain atlases has seen tremendous advances; they can now accommodate observations from multiple modalities and from populations of subjects"}, {"section_title": "Box 1 | Statistical parametric mapping", "text": "Initially proposed as a method to analyse functional or metabolic images from multiple subjects in a common coordinate space 161, 192 , statistical parametric mapping (SPM) is now widely used by the brain mapping community to detect and identify activated brain regions in functional imaging studies. SPM relates patterns of activation to experimental or subject-specific parameters, and can be used to infer patterns of functional connectivity from time-series data, or to analyse anatomical images 193 . Atlasing efforts in the early 1990s pointed to the value of registering data from multiple subjects to a common coordinate space. Once aligned, imaging signals could be combined across subjects for statistical analysis, producing a statistic (for example, expressing a group difference) at any given voxel location in the canonical space. Because many millions of voxels are typically tested in a brain mapping study, statistical solutions to the multiple comparisons problem were developed based on the mathematical likelihood that clusters of certain sizes and magnitudes would occur by chance when no signal was present. SPM rapidly became a widely used software package for collating and analysing brain imaging data (see Statistical Parametric Mapping in Online links box), partly because it implemented powerful mathematical formulae -based on new findings in the theory of Gaussian random fields 194 -for inferring whether functional activations were present in multisubject studies. The SPM approach shares some affinity with atlasing efforts in that it reports statistical findings in a common coordinate space. In contrast to SPM, which typically analyses registered images on a voxel-by-voxel basis, computational atlasing efforts can also include computational anatomical work that models individual brain structures as geometrical surfaces and curves, such as cortical surface modelling and fibre tract modelling. Ultimately these approaches are complementary.\ncollected at different laboratories. The probabilistic systems described here show promise for identifying patterns of structural, functional and molecular variation in large image databases, for pathology detection in individuals and groups and for determining the effects of age, gender, handedness and other demographic or genetic factors on brain structures in space and time. Integrating these observations to enable statistical comparison has already provided a deeper understanding of the relationship between brain structure and function. Importantly, the utility of an atlas depends on appropriate coordinate systems, registration, and deformation methods to allow the statistical combination of multiple observations in an agreed, but expandable, digital reference framework.\nIn this review, we highlighted two sources of data that will have an increasingly important role in integrative brain atlases: molecular architectonics and DTI. Once stored in a population-based atlas, information from these techniques can help to interpret more conventional functional and structural brain maps by integrating them with data on molecular content, physiology and fibre connections -a development that can help to formulate and test new types of neuroscientific models. A goal of systems neuroscience is to establish brain systems that underlie cognitive processes and the factors that influence them. DTI data on fibre connectivity, stored in an atlas coordinate system, can offer a rigorous computational basis to test how identifiable anatomical systems (for example, visual, limbic or corticothalamic pathways) interact. This atlas information can be invoked as regions of interest that are incorporated into the statistical design of functional brain mapping studies (for example, with fMRI or electroencephalography), even when underlying fibre connections are not evident in the data being collected for a particular study. Molecular architectonic mapping also provides a complementary perspective in which known neurotransmitter and receptor pathways -the physiology and molecular features of which are now well understood -can be associated with functional subdivisions of the cortex, identified with tomographic imaging. For example, an fMRI study of inhibitory cognitive processes in drug abusers might be informed by other modalities of data on limbic-prefrontal connectivity (from DTI), or on cortical monoamine receptor distributions (from architectonic mapping). In each of these contexts, the coordinate system of the atlas, and the transformations that equate different modality data in the same reference frame, provide the means to build and test systems-level models of cognition or disease, incorporating data from traditionally separate domains of neuroscience.\nAs brain atlases begin to incorporate data from thousands of subjects, new questions in basic and clinical neuroscience can be addressed that were previously out of reach. For example, quantitative genetic studies are underway to link functional, structural and connectivity information with variations in candidate genetic polymorphisms that could influence them. As polygenic disorders involve the interaction of multiple genetic variations, each with a small effect on the overall phenotype, digital atlases provide the ideal setting to mine large numbers of images computationally with hybrid techniques from computational anatomy and quantitative genetics (such as linkage and association studies in which a statistic is computed at each voxel location in the brain 191 ). Another area of expansion is in the processing of clinical data from therapeutic trials, to determine factors that combat or modify disease progression. Statistical atlases, containing time-varying data, have revealed unforeseen but characteristic brain changes in several dementias and neuropsychiatric illnesses. The population-based atlases of the future will provide the necessary statistical power to identify demographic, genetic and environmental factors that influence therapeutic response. Most important of all, brain atlases are now being enriched with data from newer technologies, such as DTI, fMRI and modern high-throughput cytoarchitectural methods. These efforts are yielding whole new avenues of research into the functional organization of the brain that will be of interest not just to specialists in neuroimaging, but to all basic and clinical neuroscientists."}]