[{"section_title": "Introduction", "text": "For almost 24 years, the National Science Foundation (NSF) has funded the Association for the Sciences of Limnology and Oceanography Multicultural Program (ASLOMP). The program's goal is to encourage interested under-represented minority (URM) undergraduate and graduate students to pursue a career in aquatic sciences, which includes oceanography, limnology, stream ecology, marine biology, fisheries, and other subfields. Developed and administered by Professor Benjamin Cuker, professor of marine and environmental studies at Hampton University, ASLOMP has provided students from across the country full support (travel, lodging, food, and registration) to participate in the annual Association for the Sciences of Limnology and Oceanography (ASLO) meeting. The program also includes workshops, a field trip, a student symposium, and mentors who provide educational and career guidance to ASLOMP participants. In 2011, American Institutes for Research (AIR) began an evaluation of ASLOMP. Through a survey of former participants, the evaluation seeks to answer basic questions about the participants, their experiences in ASLOMP, and their education and career outcomes."}, {"section_title": "Background", "text": "Increasing the number of individuals from minority backgrounds who attain a degree in science, technology, engineering, and mathematics (STEM) fields is a particularly important challenge. More than a quarter century ago, a National Board on Graduate Education advisory group characterized the underrepresentation of minorities enrolled in graduate school as \"striking\" (as cited in Nettles & Millett, 2006, p. 12). They declared that \"increased minority participation in graduate education is an important national goal to be realized for the social, economic, intellectual, and cultural well-being of all persons\" (as cited in Nettles & Millett, 2006, p. 15). The challenge of developing a diverse workforce is still relevant and particularly evident in the aquatic sciences (Cuker, 2001;Huntoon & Lane, 2007). The U.S. Commission on Ocean Policy noted, \"Human diversity has the power to enrich and invigorate the ocean community with a range of perspectives critical to the overall capabilities of the ocean workforce. Science and management professionals who are part of a particular cultural or ethnic community can help to engender understanding of marine-related issues within their communities and can serve as role models to help young people envision themselves as future ocean professionals\" (as cited in Cuker, 2006, p. 13). The share of degrees earned in aquatic sciences by URMs, categorized as racial/ethnic groups traditionally underrepresented in higher education, including African American, Hispanic, Pacific Islander, Native American, Native Hawaiian, and Alaskan Native, continues to lag behind that of other students. URMs comprised approximately 29 percent of the U.S. population in 2010 (U.S. Census Bureau, 2011). However, they earned only a fraction of the degrees in the field of ocean sciences; 13 percent of bachelor's degrees, 11 percent of master's degrees, and 9 percent of doctorates in ocean sciences were awarded to URM students in 2010 (NSF, 2013). As these numbers demonstrate, gaps between URM students and other students persist at every degree point in the postsecondary pipeline. These gaps are more alarming given that by 2050, the U.S. Census Bureau (2008) estimates that racial and ethnic minorities will make up more than half of the population. Many researchers have worked to understand how to \"increase volume\" and \"prevent leakage\" in the STEM pipeline, and have identified the importance of social and academic supports. Social supports include helping students make the academic adjustment to postsecondary STEM education and establishing connections with faculty (Cole & Espinoza, 2008;Hurtado et al., 2007). Academic supports can be provided prior to college entry through summer \"bridge\" and academic enrichment programs and during college through tutoring programs and undergraduate research opportunities (AIR, 2012;Armstrong & Thompson, 2003;Lam, Srivatsan, Doverspike, Vesalo, & Mawasha, 2005;Villarejo & Barlow, 2007). Undergraduate research opportunities, in particular, help to develop students' science identity and assist students in understanding what scientific research entails (Hurtado, Cabrera, Lin, Arellano, & Espinosa, 2009;Kinkead, 2003;Lopatto, 2004). ASLOMP includes both social and academic supports to encourage and assist URM students to attain degrees in aquatic sciences. ASLOMP integrates research opportunities with mentoring to encourage students' exposure to and social integration into aquatic sciences research and the field (Cuker, 2007)."}, {"section_title": "ASLOMP Description", "text": "ASLO is the primary professional association for the aquatic sciences. ASLOMP's primary goal is to increase the number of underrepresented students in aquatic sciences careers through a program built around the annual ASLO conference. Exhibit 1 contains a logic model that underlies ASLOMP. Moving from left to right, ASLOMP operates by recruiting and selecting students with certain characteristics, and provides them with a set of opportunities. The components of ASLOMP are all expected to influence short-term, intermediate, and long-term outcomes."}, {"section_title": "Exhibit 1. ASLOMP Logic Model", "text": ""}, {"section_title": "ADD LINK", "text": ""}, {"section_title": "ASLOMP Participants", "text": "Historically, the program has recruited students from underrepresented racial/ethnic groups who have expressed an interest in aquatic sciences. In general, participants have been exposed to the aquatic sciences through coursework, research, their undergraduate major, or their graduate field of study prior to ASLOMP participation. Students are recruited through announcements sent to targeted institutions, such as minority-serving institutions with aquatic sciences programs, the NSF-sponsored Research Experience for Undergraduates (REU) program, the ASLOMP website, and word of mouth from former participants and ASLO members. Participants in the early ASLOMP cohorts had little research experience and were mostly exposed to the field through undergraduate coursework. However, by the 10th year of the program, most students had research to present. This shift mirrors the growth of NSF REU programs."}, {"section_title": "ASLOMP Components", "text": "ASLOMP uses opportunities presented by the ASLO annual meeting to bring together students from underrepresented groups and to facilitate their engagement with and integration into the ASLO community. In a review of programs focused on supporting diverse students in the geosciences (including aquatic sciences), Levine, González, and Martínez-Sussmann (2009)  noted that programs that provided field trips, research experience, and mentors to address educational transitions, career awareness, professional socialization, and the academic isolation experienced by URM students seem to be effective. All of these components are part of ASLOMP, as detailed by Cuker (2007Cuker ( , 2009, the founder of this program."}, {"section_title": "Field trip", "text": "ASLOMP provides opportunities to bond with other minority students and faculty as well as build research experiences. The ASLOMP field trip, usually to a local aquatic habitat, takes place the weekend before the ASLO meeting. It is guided by local scientists or naturalists who engage the students in hands-on activities, such as snorkeling, kayaking, and tide pool investigations. Whenever possible, the field trip features hands-on sampling and measurements, followed by analysis and discussion."}, {"section_title": "Mentoring", "text": "ASLOMP promotes interactions and relationships among diverse students, scientists, and the various constituencies of ASLO. In addition, the program strives to help participants experience a sense of belonging through social integration with program mentors who share students' backgrounds and interests, and serve as role models with whom they can identify. In general, mentors serve as role models who provide guidance and access to the greater network of aquatic scientists. The program uses two types of mentors: meeting mentors and near-peer mentors. Following is a brief description of each mentor type.  Meeting mentors are assigned two to seven students and help these students to navigate the ASLO meeting. Meeting mentors, who are ASLO members themselves, may include ASLOMP alumni and program mentors (described below). Meeting mentors help students find sessions to attend, assist them in interpreting scientific information, and introduce students to ASLO members with similar research interests. They are asked to attend at least one session with their students each day of the meeting. When possible, mentors are expected to attend presentations that are given by their mentees.  Near-peer mentors are graduate students who serve as mentors for participating students. Near-peer mentoring occurs between graduate and undergraduate students assigned to the same meeting mentor, as well as during other ASLOMP activities. It is less formal than the meeting mentoring."}, {"section_title": "Student symposium", "text": "The student symposium provides a forum for students to give their first scientific presentations at a national or international professional meeting. Undergraduate students typically present work they did during summer research experiences, such as an REU. For graduate students, this is a venue for presenting their initial research plans or data, as well as an opportunity for receiving valuable feedback for refining their ongoing work. The symposium is a venue for students to give a formal presentation, frequently their first professional presentation, to their mentors and peers in a supportive environment. After presenting at the student symposium once, participants are required to present a poster or paper at the regular ASLO sessions at subsequent meetings. Students also serve as symposium session moderators. The student symposium has evolved over the years of the program. It was first held in 1991 and was conducted originally in the evening, after the regular ASLO sessions. In 2000, it was made part of the regular daytime ASLO program. Starting in 2002, students were required to submit abstracts for the student symposium through the regular ASLO submission process, further integrating the symposium into the ASLO conference. The student symposium is focused on ASLOMP participants, but other students also can participate."}, {"section_title": "Opening dinner", "text": "The program begins with an opening dinner for ASLOMP students and mentors prior to the ASLO meeting. This event includes a keynote address by a renowned aquatic scientist and role model. Until 2000, all of the speakers were well-regarded scientists but not underrepresented minorities. Since 2000, all of the speakers have been scientists of color. From 2009 until the present, all have been scientists that participated in ASLOMP as students."}, {"section_title": "Workshops and working meals", "text": "ASLOMP workshops and working meals cover topics such as \"how to give a talk,\" \"how to engage in conversations with scientists,\" \"preparing for graduate studies,\" and \"how to apply to graduate school.\" In addition, recruiters for internships, graduate schools, government agencies, and other employers interact with students during these meals."}, {"section_title": "ASLO poster and presentation sessions", "text": "ASLOMP participants are required to attend poster and paper presentations during the regular ASLO conference sessions. Students also are required to present a poster or paper at a regular ASLO conference session after having presented previously in the student symposium."}, {"section_title": "Multicultural Students in Aquatic Sciences (MAS) newsletter", "text": "Program participants receive the Multicultural Students in Aquatic Sciences (MAS) newsletter, which is published about twice a month. It contains information about opportunities for scholarships, internships, graduate school, postdoctoral positions, employment, workshops, travel, and scientific meetings. It may also include brief articles on recent advances in the field and other issues of interest."}, {"section_title": "ASLOMP Outcomes", "text": "ASLOMP has the potential to influence participants' attitudes, knowledge, and behaviors about aquatic sciences (short-term outcomes) that should be conducive to their retention and advancement in degree programs (intermediate outcomes) and ultimately in their career (longterm outcomes)."}, {"section_title": "Short-Term Outcomes", "text": "ASLOMP's intended short-term outcomes are to enhance participants' self-efficacy, sense of community, professional skills, knowledge about aquatic sciences, interest in the aquatic sciences, knowledge about education and careers, and establishment of ongoing relationships."}, {"section_title": "Self-efficacy", "text": "One of the program's goals is to positively influence participants' sense of self-efficacy. Perceived self-efficacy or self-confidence is an important determinant of personal agency (Bandura, 2001), and people's perceptions of their self-efficacy affect the choices they make, their persistence through challenges, and their resilience in overcoming obstacles. Levine, González, Cole, Fuhrman, and LeFloch (2007), noted that self-efficacy in STEM is related to students' likelihood of staying in the geosciences education pipeline. ASLOMP may positively influence the choice of college major, graduate school, graduate field of study, and career by enhancing or strengthening participants' sense of self-efficacy.\nThe self-efficacy scale measured the extent to which ASLOMP participation helped students to believe they could successfully conduct aquatic sciences research and succeed in an aquatic sciences career. Overall, the mean was 3.3 on the 4-point scale, or between \"moderately important\" and \"very important.\" There was no difference by cohort. Participants noted that ASLOMP was important for building students' confidence. As one participant stated, \"Having students present and network at a professional scientific conference is hugely rewarding to their self-efficacy and identity. I love the focus on the undergraduate students and the inspiring message that they can succeed in academia and research.\" Another said, \"As a four-year institution professor, I can tell that students, after their participation in ASLOMP, came back very enthusiastic and more mature. Most of them come and get involved in research experiences and increase their performance in courses.\" Interacting with both other students and professionals, in particular those who \"looked like\" them, helped students to build self-efficacy. One participant said, \"The interactions that ASLO provided me, both with my peers and with career scientists, greatly improved the confidence with which I presented myself and my ideas to others in the science community.\" As another participant said, \"ASLOMP provided financial resources to get me to a conference during my final year of graduate school when I needed to see other brown folks in aquatic sciences to know that, 'I can do this!'\""}, {"section_title": "Sense of community", "text": "ASLOMP aims to foster a sense of belonging to the aquatic sciences community among program participants. Given that minority students may feel isolated in their respective institutions (Levine, González, & Martínez-Sussmann, 2009), ASLOMP hopes to foster the social integration of participants into the academic community of aquatic sciences.\nThe sense of community scale measured the extent to which participants felt that they had a lot in common with other ASLOMP participants and felt like they were part of a community. Overall, the mean was 3.3 on the 4-point scale, or between \"moderately important\" and \"very important.\" There was no difference by cohort. Many respondents commented that what they liked most about ASLOMP was being introduced to a community of students with similar backgrounds and interests, and having the opportunity to meet and network with scientists and researchers. As one student said, \"The ASLO meeting was the first national meeting that I ever went to and… I felt like I possibly belonged in this community of scientists and I was really happy to meet other people my age who felt the same way that I did about marine science.\" Another participant stated, \"I thought it was an excellent chance to meet other young students of aquatic science, who were asking the same questions that I was. It also helped me realize that career scientists were much more accessible than I previously imagined.\" Other related comments included that students \"loved the community\" and \"made friendships.\" As noted above, students appreciated becoming part of a community of minorities. A participant most liked \"interacting with students and professionals that look like me and understand my journey.\" And one participant commented, \"I liked the diversity of the students in ASLOMP because I don't see that much in my normal setting.\" Some respondents commented that the sense of community formed at ASLOMP extended beyond the ASLO conference, or that they hoped it would. One respondent gave a specific example of how a contact made at ASLOMP led to an exciting professional opportunity later: Several participants explained that the relationships they formed in ASLOMP helped them to navigate graduate school and encouraged them to finish graduate school. As one participant explained, \"The sense of community that I developed sustained me when I faced challenges in graduate school or found myself in hostile environments. The network also helped me to identify ways to deal with problems within my program.\" Another participant reflected that \"…after enrolling in graduate school, [ASLOMP] helped to maintain my enthusiasm to keep going. It was during my participation at ASLOMP that I really got immersed in the field and made important and lasting professional contacts.\" A third participant spoke about the potential for long-lasting relationships, stating, \"I like the friendships I made with other ASLOMP participants. I feel like these friendships are future collaborations in the making.\" Remaining engaged with ASLO after ASLOMP participation indicates the strength of students' integration into the aquatic sciences community. Overall, 36 percent of respondents said that they remained an ASLO member after participating in ASLOMP and 17 percent reported attending a subsequent ASLO conference without the financial support of ASLOMP."}, {"section_title": "Professional skills", "text": "ASLOMP provides participants with opportunities to refine or obtain new professional skills. Activities such as the student symposium and field trips provide a transitional forum for beginning students to engage in, present, and discuss research. These interactions as part of ASLOMP should build participants' professional research, discussion, and presentation skills.\nThe professional skills scale measured the extent to which participants felt that ASLOMP helped them learn how to conduct research, give a talk or oral presentation, and engage in conversations with scientists. Overall, the mean was 3.3 on the 4-point scale, or between \"moderately important\" and \"very important.\" There was no difference by cohort. Several respondents mentioned that the opportunity to present their research was what they liked the most about ASLOMP. As one participant said, \"The student symposium was a very safe and supportive space to present my first research project… I felt like they gave me the tools to be successful in conducting marine science research.\"\nA set of items about the extent to which participants felt that ASLOMP helped them learn how to conduct research, give a talk or oral presentation, and engage in conversations with scientists."}, {"section_title": "Interest in aquatic sciences", "text": "During their participation in ASLOMP, participants are immersed in a community of scientists and other students with similar backgrounds and interests. In addition, ASLOMP components include a variety of activities that may maintain or strengthen positive attitudes toward the aquatic sciences. These ASLOMP activities should influence participants' interest, which in turn will impact their educational persistence, as well as their long-term educational and career choices (Fouad, Smith, & Zao, 2002).\nThe interest in aquatic sciences scale measures the extent to which ASLOMP participation helped students to confirm or focus their interest in aquatic sciences, increase their interest in pursuing further studies in aquatic sciences, and further their interest in pursuing a career in the field. Overall, the mean was 3.2 on the 4-point scale, or between \"moderately important\" and \"very important.\" There was no difference by cohort. As one participant stated, \"ASLOMP really opened my eyes and interest to the aquatic sciences field.\""}, {"section_title": "Aquatic sciences knowledge", "text": "ASLOMP exposes participants to the most recent developments in the aquatic sciences and to information about the aquatic sciences field and profession. Through their participation in ASLOMP, students may broaden their knowledge of the aquatic sciences and different areas of study or research in the aquatic sciences."}, {"section_title": "Education and career knowledge", "text": "ASLOMP provides access to important information and guidance to enhance the education-and career-related knowledge of participants. Components such as the workshops and mentoring activities provide participants with information and guidance about accessing and securing financial support, finding and obtaining research opportunities in the aquatic sciences, preparing for and applying to graduate school, and obtaining jobs in the aquatic sciences."}, {"section_title": "Establishment of ongoing relationships", "text": "In addition to immersing participants in the aquatic sciences community, ASLOMP provides access to a variety of networking opportunities through which students may establish long-term connections with peers, mentors, and other ASLO members. These connections may be useful in helping participants to secure opportunities in the aquatic sciences field, such as internships, advanced studies, and employment."}, {"section_title": "Intermediate Outcomes", "text": "ASLOMP's short-term outcomes may subsequently influence participants' academic outcomes. For example, through short-term outcomes, such as the enhancement of participants' selfefficacy and interest in the aquatic sciences, participants may persist in the completion of a degree in aquatic sciences or STEM. Participants who first attend ASLOMP as an undergraduate may also obtain information and establish connections that facilitate or lead to their enrollment in a graduate program. These intermediate academic outcomes-undergraduate major, undergraduate degree, graduate school enrollment, and graduate degree-are crucial elements in the retention and advancement of participants in aquatic sciences careers."}, {"section_title": "Long-Term Outcomes", "text": "The fundamental premise behind ASLOMP's logic model is that the short-term and intermediate outcomes will collectively result in the retention of URMs in the aquatic sciences or STEM fields. That is, ASLOMP helps students to aspire to complete an undergraduate or graduate degree, which in turn enables them to enter careers in the aquatic sciences or fields related to the aquatic sciences. Ultimately, these long-term outcomes may lead to the achievement of ASLOMP's goal of increasing racial and ethnic diversity in the field of aquatic sciences."}, {"section_title": "Evaluation Design", "text": "ASLOMP administrators have evaluated the program and found that ASLO has increased its minority membership since ASLOMP was created. In 2005, ASLO conducted its first comprehensive study of membership demographics; 22 percent of respondents identified as minority (Cuker, 2006). Although no pre-ASLOMP baseline demographic data exist, anecdotal observations from ASLO meetings in the 1980s suggest that there were very few nonwhite members in attendance prior to the inception of ASLOMP. Although these demographic data indicate that the field of aquatic sciences has become more diverse over time, there had not been an independent, formal evaluation of ASLOMP or a long-term follow-up of ASLOMP participants. In 2011, AIR was contracted to conduct an evaluation to examine participant characteristics, experiences, and education and career outcomes. Frame data came from the program and were used to define the eligible sample for a Web-based survey administered to the population of former ASLOMP participants from 1990 through 2008."}, {"section_title": "Research Questions", "text": "The evaluation addressed the following seven research questions: In addition to these primary research questions, the evaluation also examined how participation has changed over time and whether participants' outcomes significantly differed based on when they participated."}, {"section_title": "Data Sources", "text": ""}, {"section_title": "Administrative data", "text": "We used program administrative data to identify and contact survey participants. We also used several data elements during analysis. We used student demographic data for nonresponse bias analyses. The administrative data also served as the source for the number and years of student participation and the participants' educational institutions. The participants were divided into two cohorts based on participation years. In 2000, the program became more competitive and ASLOMP policies shifted to require all students to present their research. Participants were placed into cohorts based on the year of their first ASLOMP participation according to administrative data. Cohort 1 includes students who first participated in ASLOMP from 1990 through 1999 and Cohort 2 includes students who first participated in ASLOMP from 2000 through 2008."}, {"section_title": "Survey data", "text": "Survey items were from existing surveys or created for this evaluation. Existing survey sources included the National Survey of Recent College Graduates (NSF, 2008a), the Survey of Earned Doctorates (NSF, 2009), the Survey of Doctorate Recipients (NSF, 2008b), the Students Persisting in Engineering Survey (Assessing Women and Men in Engineering Project, 2007), and a survey by Public Agenda (2009). Newly developed survey items were pilot-tested through cognitive interviews with seven former ASLOMP participants. Results from the pilot tests were used to revise and refine relevant survey items. The survey included content on participant demographics; their participation in ASLOMP (e.g., participation in specific ASLOMP activities); perceptions about their participation; desire for employment in the aquatic sciences; the perceived influence of ASLOMP participation on their knowledge, attitudes, and beliefs; the importance of ASLOMP to their subsequent educational and career choices; and education and employment histories. ASLOMP participants from 1990 to 2008 were invited to respond to the survey. We did not include students who participated after 2008 because we wanted all respondents to have had at least four years to complete their education program after ASLOMP participation. The survey sample included all eligible participants from ASLOMP administrative records. In total, 602 participants were identified for the survey sample. We conducted a two-stage nonresponse bias analysis with the available program data. First, we conducted a chi-square goodness-of-fit analysis to determine whether survey respondents significantly differed from the overall ASLOMP participant population (or survey frame) on background characteristics. There were no significant differences between respondent and participant population characteristics. The appendix contains more information on survey respondent and survey frame characteristics. Second, we conducted a logistic regression to determine whether student background characteristics predicted students' likelihood of survey response. The only significant predictor of response was the number of ASLOMP participations; those who participated multiple times had significantly higher odds of responding to the survey. See the appendix for details. Throughout this report, we used administrative data for the number and years of student participation and institution at first participation, but otherwise we used survey data. Most students completed the survey; item missingness was typically between 0 and 5 percent. However, we include two items with substantial missingness in this report. First, more than a quarter of respondents did not answer the item about how they first learned about ASLOMP or responded, \"I don't know.\" We felt that the responses were still informative for program recruitment. Also, 11 percent of eligible respondents did not report on their field of employment. Thus, these findings must be interpreted with caution. The sample size for each exhibit is included in the report."}, {"section_title": "Analysis", "text": "We used descriptive analyses to determine respondent characteristics, patterns of participation, and short-term, intermediate, and long-term outcomes of ASLOMP participants. We examined outcomes overall and by cohort, which demonstrates change over time. We also use regression analyses with a set of student background characteristics, indicators of exposure to the aquatic sciences prior to ASLOMP participation, and indicators of ASLOMP participation as predictors to understand the extent to which each of these factors related to shortterm, intermediate, and long-term outcomes."}, {"section_title": "Findings", "text": "This section presents findings about participant characteristics; patterns of participation; shortterm, intermediate, and long-term outcomes; and predictors of these outcomes. Each research question is addressed in turn."}, {"section_title": "Who are the ASLOMP participants?", "text": "As ASLOMP is designed to support students currently underrepresented in the aquatic sciences, it is important to examine the characteristics of student participants."}, {"section_title": "Demographics", "text": "Overall, ASLOMP is meeting its goal of serving URM students. As Exhibit 3 shows, ASLOMP participants have been predominantly URM students, including 45 percent African American and 37 percent Hispanic participants. The racial/ethnic mix of participants has changed over time; the percentage of African American participants has decreased while the percentage of Hispanic participants has increased. Among the ASLOMP participants of Hispanic origin, 58 percent were Puerto Rican, 29 percent were Mexican American, and 13 percent reported other or multiple Hispanic origins. Exhibit 3 provides a complete breakdown of the racial/ethnic composition of the survey respondents. Hereafter, we examine URM race/ethnicity with two dichotomous variables: Hispanic and African American. NSF data on the field of ocean sciences from 2010 indicates that 26 percent of bachelor's degrees, 30 percent of master's degrees, and 21 percent of doctorates were awarded to URMs (NSF, 2013). These national statistics do not enable an exact comparison to ASLOMP participants because both undergraduate and graduate students can participate in ASLOMP, and the field of ocean sciences does not include limnology. Still, these data suggest that the URM participation rate in ASLOMP is substantially higher than URMs' representation in the field."}, {"section_title": "Exhibit 3. Percentage of ASLOMP Survey Respondents With Various Background Characteristics", "text": "Exhibit 3 also indicates that 68 percent of participants were female and the percentage of female participants has increased over time. NSF data on the field of ocean science from 2010 indicates that 48 percent of bachelor's degrees, 54 percent of master's degrees, and 44 percent of doctoral degrees were awarded to women (NSF, 2013). Despite the limitations of these comparisons as described above, these rates suggest a very high participation rate for women in ASLOMP. Also, 63 percent of ASLOMP participants had at least one parent with a bachelor's degree or higher, including 37 percent who had at least one parent with a graduate degree. Nationwide, 55 percent of bachelor's recipients have at least one parent with a postsecondary degree (Cataldi et al., 2011). However, these rates vary substantially by race; 37 percent of African American bachelor's degree recipients and 38 percent of Hispanic bachelor's degree recipients have a parent with a bachelor's or higher. Again, these national statistics do not enable direct comparisons to the ASLOMP population, but they do suggest that ASLOMP participants come from highly educated families."}, {"section_title": "Prior aquatic sciences experience", "text": "ASLOMP aims to reinforce and build on students' preexisting interests in the aquatic sciences; thus, it is important to understand the extent of students' exposure to aquatic sciences before ASLOMP participation. When respondents first participated in ASLOMP, 73 percent were undergraduate students and 27 percent were graduate students. As Exhibit 4 shows, students' academic status at first participation has changed over time. Students in both cohorts were likely to have first participated in ASLOMP as an undergraduate student, but the percentage of graduate students has increased over time. Overall, approximately one third (32 percent) of respondents had taken at least one aquatic sciences course before participating in ASLOMP, more than half (56 percent) had declared an aquatic sciences major or were planning to major in aquatic sciences, and 12 percent had an undergraduate degree in aquatic sciences. As shown in Exhibit 5, participants in Cohort 2 were more likely to have an aquatic sciences major and less likely to have a degree prior to attending ASLOMP than participants in Cohort 1. Also important to becoming a scientist is research experience. About 70 percent of respondents had research experience in the aquatic sciences before ASLOMP participation. Prior research experience increased from 66 percent in Cohort 1 to 74 percent in Cohort 2, reflecting a shift in ASLOMP policies that required participants to present their research at the ASLO conference. The concomitant increases in students' intentions of majoring in aquatic sciences and first participation as a graduate student are likely related to the ASLOMP research presentation requirement; students who were prepared to present on their research would typically have needed more exposure to the aquatics sciences than just a course or two."}, {"section_title": "What are the patterns of ASLOMP participation?", "text": "This section describes how students learn about ASLOMP, how many times students participate in ASLOMP, their patterns of participation in specific activities, and how participation has changed over time. \nSurprisingly, fewer than half of the students reported participating in the six major ASLOMP activities: field trip, mentoring, student symposium, opening dinner, workshops and working meals, and ASLO presentations and poster sessions. However, about half of the participants returned in subsequent years. After ASLOMP, participants remained engaged with the program, with most serving as informal mentors to subsequent ASLOMP participants. In addition, almost half of respondents expressed an interest in serving as an ASLOMP mentor. What are the short-term outcomes for ASLOMP participants? Participants felt that ASLOMP was important for increasing their self-efficacy, sense of community, professional skills, interest in aquatic sciences, knowledge about aquatic sciences, and knowledge about education and careers. Participants reported that ASLOMP was less important for increasing their knowledge about education and careers than for other short-term outcomes. What are the relationships between student characteristics and short-term outcomes? We examined whether student characteristics predicted the short-term outcomes listed above. Predictors included measures of student background characteristics (gender, race, parent education, cohort), student experiences prior to ASLOMP participation (whether they were a graduate student when they first participated, whether they had research experience in the aquatic sciences), and ASLOMP participation (number of participations, number of ASLOMP activities). Generally, student background characteristics did not relate to how students perceived the importance of ASLOMP on short-term attitudinal and knowledge outcomes. However, Hispanic students reported that ASLOMP was significantly more important for increasing their professional skills and knowledge about aquatic sciences than their peers. Students' prior academic and research experiences were related to short-term outcomes. Students who participated in ASLOMP as graduate students or had prior research experience in aquatic sciences reported that ASLOMP was significantly more important for increasing their selfefficacy, confidence, and interest in aquatic sciences than other participants. In addition, the number of ASLOMP participations and number of ASLOMP activities engaged in by participants were significant predictors of many of the short-term outcomes. These findings indicate that those who come to ASLOMP with more academic experience and those who participated more fully in the program or attended multiple times were more likely to report that ASLOMP was important for their growth."}, {"section_title": "Number of participations", "text": "Overall, about half of the respondents (47 percent) participated in ASLOMP once. However, Exhibit 7 shows that the number of participations varied substantially by cohort; 36 percent of Cohort 1 respondents were one-time ASLOMP participants compared with 56 percent of Cohort 2. The maximum number of participations was 10 for Cohort 1 and seven for Cohort 2, according to program records. One possible explanation is that in the early years, there were fewer applicants, so there was less competition to attend multiple times. Among those who first participated as an undergraduate student, 44 percent participated once; among those who first participated as a graduate student, 53 percent participated once. This indicates that when participants started earlier in their academic career, they had more opportunities to attend ASLOMP. Further, multiple-time participants tended to participate in ASLOMP in consecutive years or with a single-year gap between participations. The participation gaps may be due to the research presentation requirement. One student lamented that ASLOMP is only available to those with new research to present, and students may not have new research every year during their undergraduate or graduate programs."}, {"section_title": "Participation in specific activities", "text": "The number of activities students participate in is an indicator of the extent to which they take advantage of ASLOMP. As described earlier, there are six key activities that compose the program. Overall, 42 percent of respondents reported participating in all six of the ASLOMP activities. Full participation has increased over time; 36 percent of Cohort 1 participated in all ASLOMP activities compared with 47 percent of Cohort 2. Travel schedules and fatigue may be explanations for students' lack of full participation in ASLOMP, particularly given that the conference sometimes involves international travel, includes preconference activities, and encompasses multiple days. When focusing on the three core activities identified by ASLOMPthe student symposium, meeting mentors, and the field trip-participation was higher than in all six activities, but still fewer than half (49 percent) of students reported participating in all three activities. Examining activity-specific participation, at least 65 percent of participants reported participating in each of the ASLOMP activities. Participation was highest for attending an ASLO poster or paper session (85 percent), the student symposium (83 percent), workshops or working meals (82 percent), and the opening dinner (81 percent). Participation was lowest for attending the field trip (71 percent) and meeting with meeting mentors (65 percent). Exhibit 8 presents the cohort-specific participation rates in each of the six ASLOMP activities. As the exhibit shows, a higher percentage of Cohort 2 participants reported participating in each of the activities. Imperfect recollection of attendance at specific activities may be a potential explanation of lower reported participation for Cohort 1 participants. However, across cohorts, reported participation levels did not exceed 86 percent. "}, {"section_title": "ASLOMP mentorship", "text": "The multiple methods for participating in the meeting mentor activity differentiate it from the other program activities. As noted above, 65 percent of participants reported meeting with their meeting mentor. Mentors met with participants individually and in small groups. Overall, among the participants who took advantage of meeting with their mentors, 67 percent did so as part of a small group and 43 percent did so individually. As Exhibit 8 illustrated, there was a substantial increase in the percentage of students meeting with their mentors across cohorts (58 percent of Cohort 1 and 71 percent of Cohort 2). Exhibit 9 shows that the majority of participants in both cohorts convened in small-group meetings. In Cohort 2, about three quarters (74 percent) of those who participated in this activity met in a small group with their meeting mentor. Participants also had the opportunity to meet with a near-peer mentor, typically a graduate student in the field. Overall, only 17 percent of ASLOMP participants met with a near-peer mentor. Perhaps this is because near-peer mentoring was not one of the core ASLOMP activities. Former ASLOMP participants can return to serve the program in an official role as an ASLOMP mentor. As students, they can serve as a near-peer mentor. After they establish a career in the aquatic sciences, they can be a meeting mentor. Only 5 percent of respondents served as a formal ASLOMP mentor; however, 84 percent of respondents reported serving as informal mentors to ASLOMP participants. As informal mentors, respondents reported providing students with information about research opportunities (83 percent), applying to graduate school (69 percent), and obtaining internships (69 percent), and helping to introduce ASLOMP participants to ASLO attendees (67 percent). In addition, almost half of all respondents (45 percent) expressed an interest in serving as an ASLOMP mentor. What are the short-term outcomes for ASLOMP participants? As the conceptual framework outlines, the short-term goals of ASLOMP are to build the following outcomes for participants: The first six of these outcomes were measured through survey scales, which are described in more detail in the appendix. Each scale is 4 points, with 1 indicating \"not important\" and 4 indicating \"very important.\" Means for each scale by cohort are included in the appendix. The last outcome, ongoing relationships, was measured by asking students whether they kept in touch with ASLOMP participants, ASLOMP mentors, or other ASLO attendees after their participation in ASLOMP. We also assessed the outcomes through three open-ended items that asked students the following questions:  \"What did you like most about ASLOMP?\"  \"If you could enhance or add any activities to ASLOMP, what would you do?\"  \"Is there anything else you would like to share about the ASLOMP program or your experiences since participating?\" Many students commented on the importance of ASLOMP to these short-term outcomes. This section provides descriptive findings for each short-term outcome based on the survey scales and open-ended items."}, {"section_title": "Knowledge about aquatic sciences", "text": "The knowledge about aquatic sciences scale measures the extent to which ASLOMP participation helped students to increase their knowledge of aquatic sciences, broaden their understanding of different areas of study or research within aquatic sciences, and learn more about recent research in aquatic sciences. Overall, the mean was 3.4 on the 4-point scale, or between \"moderately important\" and \"very important.\" There was no difference by cohort. Several respondents said that ASLOMP was an experience that exposed them to the range of research in the aquatic sciences field. As one participant said, \"The conference made me realize there was so much out there that I didn't know and an entire world of science was out there.\" Another participant commented, \"I was happily overwhelmed by the number of topics that were presented at the conference. I never knew that you could study so many different things.\" Another student explained: ASLOMP gave me the opportunity to travel to a national scientific conference, an experience that really opened me up to the field and the interesting work being done… I can say with complete certainty that ASLOMP has been one of the most influential experiences I have had, with regards to my decision to pursue a career in marine science.\nA set of items about the extent to which ASLOMP participation helped students to increase their knowledge of aquatic sciences, broaden their understanding of different areas of study or research within aquatic sciences, and learn more about recent research in aquatic sciences."}, {"section_title": "Knowledge about education and careers", "text": "The education and career knowledge scale measured the extent to which ASLOMP provided students with important information or guidance about obtaining financial support, engaging in research in aquatic sciences, obtaining an aquatic science degree, applying to graduate school, preparing for graduate studies, working in an aquatic science job, and making decisions about the next stage of one's career in aquatic sciences. Overall, the mean was 2.7 on the 4-point scale, or between \"slightly important\" and \"moderately important.\" There was no difference by cohort. Several participants reported receiving guidance about applying to graduate school and career options. As one participant said: The ASLOMP program introduced me to people and research topics that were critical in helping me decide my focus for graduate studies and research and with whom I may have wanted to work with. I was introduced to a wide variety of research topics and many researchers within a short period of time. Another participant said, \"It was great having the time to speak with mentors and other students in the ASLOMP program to help me think about the specific path I was most interested in pursuing.\" However, this scale had the lowest mean of the short-term outcome scales. When responding about specific support and guidance, about half of the participants reported receiving important information from ASLOMP about education and career-related opportunities. Overall, the highest percentage of participants reported receiving information or guidance about internships (49 percent) and about opportunities to do research in aquatic sciences (49 percent). The survey asked about students' participation in two other programs, the Hall-Bonner Program for Minority Doctoral Scholars in Ocean Sciences and the Multicultural Students at Sea Together (MAST) program. Overall, 6 percent of respondents participated in the Hall-Bonner Program and 14 percent participated in MAST, demonstrating that some ASLOMP participants were able to access other opportunities to do aquatic sciences research after their participation in ASLOMP. Approximately 40 percent of participants reported receiving information about scholarships, research positions, graduate school, and advanced studies. About one third (32 percent) of respondents said that ASLOMP provided them with important information or guidance about employment. Participants differed little between the two cohorts regarding receiving information (see Exhibit 10). Cohort 2 participants were a bit more likely to report receiving important information in all areas except for internships, advanced studies, and opportunities to do research in aquatic sciences. The section below on student recommendations describes students' reflections about education and career guidance and expresses the unmet needs of students in terms of increasing information and guidance from ASLOMP about education and careers. \nA set of items about the extent to which ASLOMP provided students with important information or guidance about obtaining financial support, engaging in research in aquatic sciences, obtaining an aquatic sciences degree, applying to graduate school, preparing for graduate studies, working in aquatic sciences job, and making decisions about the next stage of one's career in aquatic sciences."}, {"section_title": "Establish ongoing relationships", "text": "The survey also included an item that asked participants about whether they kept in touch with fellow ASLOMP participants, ASLOMP mentors, and other ASLO attendees after their participation in ASLOMP. Overall, 76 percent of participants kept in touch with at least one person after ASLOMP, but this varied by cohort (66 percent in Cohort 1; 85 percent in Cohort 2). Between 1990 and 2008, the rise of the Internet, e-mail, and the more recent proliferation of social and professional networking sites, such as Facebook and LinkedIn, have made networking easier and may help to explain the increase in post-ASLOMP connections in Cohort 2, in addition to the fact that they participated in the program more recently. A Cohort 2 respondent said that the participants from one recent year have remained connected on Facebook. What are the relationships between student characteristics and short-term outcomes? Using regression analyses to examine the relationships between student characteristics and shortterm outcomes, Exhibit 11 summarizes results for each short-term outcome, which were run as separate models with the same set of student background characteristics as covariates. Student background characteristics. As Exhibit 11 shows, students of Hispanic origin reported that ASLOMP was significantly more important in developing their professional skills and knowledge about aquatic sciences than contributing to other outcomes. Cohort 2, the more recent participants, had higher odds of keeping in touch with others after the program than Cohort 1 participants. This finding was noted descriptively earlier, and the regression demonstrates that the finding holds after controlling for other student characteristics. Also, as noted above, the cohorts did not differ in the other short-term outcomes, and this remained true after controlling for other student characteristics."}, {"section_title": "Exhibit 11. Regression to Predict Short-Term Outcomes for ASLOMP Participants", "text": "Experiences prior to ASLOMP participation. Students came to ASLOMP with varying degrees of academic and research experience, and both of these variables were related to a variety of short-term outcomes. Participants who were graduate students at the time of first participation reported that ASLOMP was significantly more important to increasing their self-efficacy, sense of community, and interest in the field of aquatic sciences than undergraduate students. On the other hand, participants who were graduate students at first participation were significantly less likely to have established ongoing relationships with ASLOMP attendees than those who first participated as undergraduate students. Participants with prior research experience in the aquatic sciences reported that ASLOMP was more important to increasing their interest in the field than participants without this prior experience. Together, these findings suggest that ASLOMP was more important to participants with more aquatic sciences experience prior to ASLOMP, particularly in terms of the affective short-term outcomes than their peers. However, there was no difference in the importance of ASLOMP to the development of professional skills or knowledge based on prior experience. ALSOMP participation. ASLOMP participation, both number of participations and number of activities attended, positively correlated with most of the short-term outcomes. Students who participated more also felt that ASLOMP was more important to their growth. However, these analyses cannot establish the cause of the relationship. For example, perhaps engagement with aquatic science led students both to participate more often and to feel that the participation was important to their self-efficacy."}, {"section_title": "What are the educational outcomes of ASLOMP participants?", "text": "Overall, 59 percent of respondents earned a graduate degree and almost all participants (94 percent) earned at least a bachelor's degree. Exhibit 12 illustrates the highest degree earned by ASLOMP participants. Cohort 2 reported fewer doctorates than Cohort 1, but this may be due to the longer time period required to complete a doctorate."}, {"section_title": "Exhibit 12. Highest Degree Earned, by Cohort", "text": "n= 398 (179, Cohort 1; 219, Cohort 2) Note: These data include participants who were in school at the time of the survey. Fewer than five students in each cohort had not earned a bachelor's degree. At the time of the survey, 26 percent of all respondents were enrolled in school, including 1 percent in a bachelor's program, 8 percent in a master's program, 13 percent in a doctorate program, and 3 percent in a professional degree program. The vast majority of participants who were still in school were from Cohort 2. These data indicate that ASLOMP participants had typically earned some type of graduate degree, and Cohort 2 participants were more likely to currently be in pursuit of a graduate degree than Cohort 1 participants. Exhibit 13 displays the major field of study for students' highest degree earned. These findings are presented overall because sample sizes were too small for disaggregation by field, degree, and cohort. Students reported their academic major for each postsecondary degree earned, and we coded these into aquatic sciences, STEM, and other fields of study based on NSF's Classification of Instructional Programs (CIP) Crosswalk. All aquatic sciences fields are listed under STEM, but we separated them out for the purposes of this study. Following NSF's definition of STEM fields, we categorized medicine and education fields in the Other category. Note: Bachelor's degree includes a major or minor in the field. There were too few students to disaggregate field of study for professional degree recipients. As Exhibit 13 shows, the highest degrees earned by ASLOMP participants are predominantly in aquatic sciences or STEM fields. More than two thirds of doctorates (67 percent) were in aquatic sciences, indicating that participants who pursue a doctorate are committed to the field of aquatic sciences. In contrast, fewer than half (46 percent) of those whose highest degree is a bachelor's earned it in aquatic sciences and about one third (34 percent) of those whose highest degree is a master's degree earned it in aquatic sciences. What are the employment outcomes of ASLOMP participants? The main goal of ASLOMP is to encourage and support students to enter a career in the aquatic sciences or a related STEM field. In the analyses in this section, we excluded participants who were in school from our employment analyses. Thus, the employment analyses in this section include the 293 respondents who were not in school at the time of the survey. More than 90 percent of respondents who were not in school reported being employed, including 94 percent of Cohort 1 and 90 percent of Cohort 2. 2 Respondents characterized their job as \"in the aquatic sciences,\" has \"some aquatic sciences components,\" or has \"no aquatic sciences components.\" We used this self-characterization of employment to be as inclusive as possible of aquatic sciences employment. For those who reported that their job had no aquatic sciences components, we examined their occupation field to determine whether their job was in a STEM field as this is another long-term outcome of interest for ASLOMP. Overall, 20 percent of respondents were working in the aquatic sciences. An additional 29 percent of respondents were working in a job with some aquatic sciences components and 24 percent were employed in a STEM field. Therefore, about three quarters (73 percent) of respondents were working in aquatic sciences, a job with aquatic sciences components, or a STEM field. Exhibit 14 presents the employment field for all employed respondents by cohort. Cohort 2 participants were more likely to have jobs in the aquatic sciences than Cohort 1 participants."}, {"section_title": "Exhibit 14. Field of Current Employment, by Cohort", "text": "n= 293 (159, Cohort 1; 134, Cohort 2) Note: Excludes participants who were in school at the time of the survey. 2 Among those in school, 55 percent reported also being employed. In addition to type of career field, we examined whether participants were employed in academia, which we defined as those working in a college or university or in a universityaffiliated research setting. Overall, almost one fifth of employed participants (19 percent) were working in academia. Exhibit 15 indicates that one third (33 percent) of those working in aquatic sciences were employed in academic positions, compared with 24 percent of those working in fields with some aquatic sciences components and 19 percent of those working in STEM."}, {"section_title": "Exhibit 15. Academic and Nonacademic Employment, by Field", "text": "n=52 (aquatic sciences), 75 (some aquatic sciences components), 62 (STEM) Note: Excludes participants who were in school at the time of the survey. There were too few students to disaggregate the \"other\" employment field by employment type. The presence of participants in academia and the broader K-12 teaching community is important to the overarching ASLOMP goal to improve the diversity of aquatic sciences: There is a \"multiplier effect\" for educators to influence the knowledge of and interest in the field of aquatic sciences for the next generation of students. In open-ended survey items, several respondents noted that their ASLOMP experience impacted their career and provided examples of \"multiplier effect.\" The survey data do not include any items that allow us to document the number of K-12 educators; they may be included in the \"Some aquatic sciences components\" category or the \"Other\" category, depending on how they characterized their work. But the following two quotes indicate that some ASLOMP participants became K-12 educators and they demonstrate the importance of recognizing educators among ASLOMP \"successes.\" As one participant stated: I started an aquatic science class at my school, even though I was told the students wouldn't be interested. Next year will be its third year, and so far three sections are needed for the amount of students who are interested. ASLOMP planted the education seed in my head when I attended a small talk and spoke up during the discussion that followed. We spoke about the gap in education and the need for more scientists. This fall, I will be starting an educational leadership program for higher education so that I can make some changes. If ASLOMP participants are not working in aquatic sciences, why not? Among those who were employed but not in an aquatic sciences field, it is useful to understand whether ASLOMP participants chose a different career path or faced barriers to obtaining employment in the aquatic sciences. More than one third (36 percent) of participants working in other fields reported that their interests had changed. However, 20 percent noted that they were not in the field due to limited pay or promotion opportunities. An additional 11 percent noted challenges with working conditions (e.g., job location, hours) and 13 percent could not find a job in the field. Taken together, 44 percent of those not in aquatic sciences wanted to be, but could not find a position or a satisfactory position. As Exhibit 16 shows, Cohort 1 participants were more likely to have changed their interests since participating, which is expected given that they have had more time to pursue careers and change career paths."}, {"section_title": "Exhibit 16. Reasons for Not Working in Aquatic Sciences, by Cohort", "text": "n= 118 (74, Cohort 1; 44, Cohort 2) Note: Excludes participants who were in school at the time of the survey. \"Other\" reasons include personal or family reasons. Although the career interests of some respondents had changed, several respondents emphasized that ASLOMP was crucial to their professional development. As one participant stated: Furthermore, ASLOMP participants generally had positive feelings about the field of aquatic sciences. All survey respondents were asked about their future work plans, and 63 percent said they were at least somewhat likely to work in aquatic sciences in the future."}, {"section_title": "What are the relationships between student characteristics and aquatic sciences or STEM degrees and employment?", "text": "To understand the extent to which student background characteristics and ASLOMP components predict whether ASLOMP participants earned a graduate degree in a STEM field or were working in a career with at least some aquatic sciences components, we conducted a set of logistic regression models. 3 Each model included students' demographic characteristics, indicators of students' academic experiences prior to participating in ASLOMP, and indicators of ASLOMP participation. Similar to the descriptive employment analyses above, the regression analyses were limited to participants who were not enrolled in school at the time of the survey. As Exhibit 17 shows, none of the variables in our model predicted earning an aquatic sciences or STEM graduate degree. However, being employed in an aquatic sciences or STEM field could be predicted by student characteristics and ASLOMP participation. Note: Excludes participants who were in school at the time of the survey. *p < .05; **p < .01; ***p<0.001"}, {"section_title": "Exhibit 17. Logistic Regressions to Predict Aquatic Sciences and STEM Degrees and Employment", "text": "Student background characteristics. Recent ASLOMP participants (Cohort 2) were significantly more likely to be employed in the aquatic sciences than older participants (Cohort 1). Participants whose parents had a postsecondary degree were significantly more likely to have an aquatic sciences or STEM career than their first-generation college-going peers. Experiences prior to ASLOMP participation. Participants who were graduate students when they first participated in ASLOMP were significantly more likely to be employed in aquatic sciences or STEM fields. Not surprisingly, this indicates that students who were further in their academic studies prior to ASLOMP were more likely to work in the field. ASLOMP participation. The number of times a student participated in ASLOMP also significantly predicted having an aquatic sciences job. It is not surprising that students who participated in ASLOMP the most frequently were also the most likely to have a career in aquatic sciences."}, {"section_title": "What recommendations do participants have for improving ASLOMP?", "text": "Generally, participants were very satisfied with ASLOMP. Repeat attendance is an indicator of program satisfaction, and the number of participations discussed earlier indicates that about half of participants attended the conference multiple times. Furthermore, more than three quarters (79 percent) of survey respondents reported that they had recommended ASLOMP to others and almost all (94 percent) of the respondents said that they were likely to recommend ASLOMP to others in the future. Even keeping in mind that survey respondents may be more positive than nonrespondents, these findings suggest that ASLOMP was a positive experience for most participants. However, in an open-ended survey item that asked, \"If you could enhance or add any activities to ASLOMP, what would you do?\" respondents provided a set of concrete recommendations for ASLOMP. First, several respondents suggested recruiting students earlier in their academic careers. As one participant explained, \"ASLOMP provided me the opportunity to attend my first scientific conference, which was a great experience,\" but commented, \"I wish I had learned about ASLOMP earlier in my research career. At the point that I participated, I was already on my path.\" Other respondents recommended expanding undergraduate participation and one even suggested starting in high school or community college. Second, participants asked for more information and guidance on graduate school and careers. Several participants commented on a need to \"talk realistically\" and \"have honest conversations\" about job opportunities, pay and benefits, difficulties in finding employment in the aquatic sciences, and employment opportunities for aquatic scientists in academic and nonacademic environments. One person specifically recommended having the mentor supports be focused on career counseling. Another participant suggested having a hands-on workshop for building a CV [curriculum vitae] and other graduate school or job application materials. Several participants expressed a desire to \"facilitate more interactions between minority program participants and other ASLO participants.\" One respondent said, \"I would desegregate the minority forum and integrate minority conference participants into the general ASLO program. All posters and talks would be concurrent with the general ASLO meeting. I would maintain the supporting activities provided to minority participants.\" Another respondent said: I would urge the program to encourage students, especially those with previous experience with the program, to take part in regular ASLO sessions. It seemed to me that the ASLOMP sessions could be a crutch for more experienced presenters. Force them to get out of their comfort zone and present research to a broader audience. Participant comments on integrating ASLOMP participants into the larger ASLO conference centered on the idea that supports are important for minority and female students, but also that they had to learn how to navigate \"everyday life\" in the field. As one respondent commented: I think that we have to be sure to make an effort to integrate with the rest of ASLO. While we want to be visible in some ways, we also need to train students in the program in realistic scenarios of everyday life of an aquatic scientist. ASLOMP offers a 'bubble' for students that they won't have at most graduate schools. Many participants asked to improve the mentor component of ASLOMP. This includes improving mentor selection, emphasizing participation in the mentor activities, and focusing the mentoring on graduate school and career guidance. One participant suggested, \"As a past and future ASLOMP mentor, I would improve the meeting mentor selection process.\" Respondents did not specify how to improve mentor selection, but ASLOMP could leverage interest among former participants; almost half (45 percent) of respondents expressed interest in serving as an ASLOMP mentor. Increasing participation in mentor activities and focusing the mentorship around graduate school and career guidance were related suggestions. The data presented in the above sections indicate that participation in the mentor activity has increased over time, and those who meet with their meeting mentor rate the experience positively. However, a few Cohort 1 participants said they did not remember having a mentor, and several participants across cohorts commented that their mentor was the least helpful part of their ASLOMP experience. As one respondent commented: Several respondents discussed facing racism and sexism in graduate school, and they suggested that ASLOMP address these challenges to better prepare students. Some respondents indicated that the sense of community they formed in ASLOMP sustained them, but a few respondents said that they left their graduate program or opted for other careers due to these challenges. One participant recommended, \"I would include some training for students of color and women of color in particular for coping with insidious harassment that can sometimes occur and how to find advocates for helping students navigate the bureaucracy of higher education institutions.\" Issues of harassment, racism, sexism, and institutional politics are undoubtedly difficult to address, but respondents were clear in expressing this need. One potential way to prepare students for challenges in graduate school and careers is to leverage ASLOMP mentors; there was a strong desire to extend mentorship beyond ASLOMP. As one participant explained: ASLOMP has a long history of focusing on students of color [and] has a large community of professionals from which to draw for mentoring experiences. I feel strongly that mentoring on a continual basis outside of the ASLO conferences is vital for student success. Even though there are relatively few people of color in the aquatic sciences, it is vital for students of color to have contact with other people of color. Using multiple types of mentoring (electronic, one-on-one, group, peer, graduate-undergraduate, etc.) would help to answer some of the need for students to seek mentoring from those who 'look like them' and might have had similar life experiences. One ASLOMP mentor and former participant also recommended that all mentors be required to have some type of contact with their students after ASLOMP. There was also a strong interest in facilitating and encouraging connections among alumni after ASLOMP. As one participant said, \"I would like for there to be more ways for alumni of the program to remain plugged in… I really miss and would greatly benefit from continuing opportunities to network within the ALSOMP community and the ASLO community at large.\" Another participant stated: The newsletter is a great way to learn of events and opportunities, but if there were some sort of social forum like Facebook or some social network where former and potential attendees and mentors can get in touch with each other and share information, it would vastly improve the connection aspect of the program. Finally, the survey asked students about the utility of the Minorities in Aquatic Sciences (MAS) newsletter, which is the only formal mechanism through which ASLOMP provides information, networks, and opportunities to ASLOMP participants beyond the ASLO conference. Survey respondents' perceptions about the newsletter varied substantially across cohorts. Among Cohort 1 participants, fewer than one third (31 percent) said it was useful, but 67 percent of Cohort 2 participants said the MAS newsletter was useful. This difference between cohorts was likely due to the differing life stages between the two cohorts, with the younger students more likely to find the content relevant to their education and early career planning.\nParticipants were overwhelmingly positive about their ASLOMP experience, but they offered several recommendations for improving the program: start reaching out to students earlier in their academic careers, provide more information and guidance about education and careers, improve the mentoring component, and support students in maintaining relationships and contacts beyond the ASLO conference."}, {"section_title": "Summary", "text": "ASLOMP has been operating since 1990 with support from NSF. Basic analysis of program data by ASLOMP administrators found that the program has served URM students from colleges and universities across the United States and its territories. Anecdotal evidence also revealed that students were satisfied with their ASLOMP experience and felt that ASLOMP participation was important for their educational and career development. However, an external evaluation of ASLOMP that examined a broader range of issues had not been conducted. In 2011, AIR started an evaluation of ASLOMP to examine characteristics of the participants and their patterns of participation, program experiences, and, most importantly, education and career outcomes. The evaluation surveyed ASLOMP participants from 1990 through 2008 to examine these issues."}, {"section_title": "Evaluation Findings", "text": "Who are the ASLOMP participants? ASLOMP is serving a diverse group of students who are underrepresented in aquatic sciences and STEM fields. But ASLOMP participants are not representative of URM students in higher education overall. Their parents are highly educated, and research shows that students with college-educated parents have an advantage over first-generation college students in terms of college enrollment, degree completion, and graduate school enrollment (Chen, 2005;Choy, 2001;Ishitani, 2003). ASLOMP also recruits from a pool of students who have had substantial exposure to and interest in aquatic sciences before participating in ASLOMP. The majority of participants had declared or planned to major in the aquatic sciences or already had an undergraduate degree in aquatic sciences and had experience doing research in the field."}, {"section_title": "What are the education (intermediate) and employment (long-term) outcomes of ASLOMP participants?", "text": "Almost all participants (94 percent) had earned at least a bachelor's degree and more than half had earned a graduate degree. The majority of students had earned their highest degree in aquatic sciences or STEM fields. In addition, 26 percent of participants were in school at the time of the survey, primarily pursuing graduate degrees. Excluding current students, 92 percent of ASLOMP participants were employed and almost three quarters (73 percent) of employed participants were working in aquatic sciences or STEM fields. These findings demonstrate that ASLOMP participants were successful in meeting the intermediate and long-term goals of the program."}, {"section_title": "What factors predict aquatic sciences and STEM degrees and careers among ASLOMP participants?", "text": "When examining whether student background characteristics, experiences prior to ASLOMP, and ASLOMP participation predicted education and career outcomes, pre-ASLOMP experiences were related to career outcomes. Being a graduate student when first participating in ASLOMP was a significant predictor of having an aquatic sciences or STEM career. Participating in ASLOMP multiple times was also a significant predictor of career outcomes. None of the variables in our regression model predicted aquatic sciences or STEM graduate degree attainment."}, {"section_title": "Recommendations", "text": "Taking the quantitative findings and student recommendations together, we present the following recommendations:  Consider the importance of ASLOMP application criteria, including students' academic status and their research experience in aquatic sciences. Participants who first participated as graduate students reported that ASLOMP was significantly more important in increasing their self-efficacy, sense of community, and interest in aquatic sciences than their peers. Also, students with prior research experience in aquatic sciences reported that ASLOMP was significantly more important in increasing their interest in the field. However, there was no difference in terms of ASLOMP's importance in developing participants' professional skills or knowledge based on their prior experiences. Prior academic and research experiences may prime participants to benefit from ASLOMP, but some respondents reflected that the program might have had more impact if they had been involved with ASLOMP earlier in their academic and career path when they could have been exposed to research and developed their professional skills and knowledge about the field of aquatic sciences. Thus, it is important to consider the potential implications of selectivity in the application process.  Use the mentoring component to focus on providing students with information and guidance about education and career options in the aquatic sciences. Knowledge about education and careers was the lowest scale score among the short-term outcomes, and students clamored for more information and guidance. Participation in the meeting mentor activity was the lowest of all ASLOMP activities, and small-group meetings were used more than individual meetings. Perhaps additional mentors could be trained, drawing on the participants who have expressed interest in mentoring and those who currently act as informal mentors to allow for more individualized attention.  Develop and maintain mechanisms for continued interactions and networking for ASLOMP participants after ASLOMP. Although some former participants took the initiative to develop communication networks, others did not. Perhaps ASLOMP could set up social networks (e.g., groups on Facebook) and invite participants before they even attend the program to allow them to interact with each other before, during, and after the program.  Further investigate students' participation in program activities. It was beyond the scope of the survey to determine reasons for the lack of full participation. It may be that participants could not remember the details of their participation well enough. If students are truly not engaging in activities, program staff could strategize about the number of activities offered, whether any activities should be tailored for specific participant groups (i.e., undergraduate students, first-time participants), and how to increase participation."}, {"section_title": "Caveats and Future Research", "text": "This study found that ASLOMP participants felt they derived benefits from their participation. Participants typically attained postsecondary degrees in the aquatic sciences or STEM fields and were generally employed in aquatic sciences or STEM careers. However, further research is needed to determine the extent to which ASLOMP influences or causes these outcomes. This study did not have a comparison group, so it is not possible to determine the counterfactual-what participants would have achieved in the absence of ASLOMP. Thus, questions remain about whether ASLOMP selects highly motivated and committed students who would have attained similarly successful education and career outcomes without ASLOMP, or whether ASLOMP \"adds value\" to students' experiences and outcomes. Future research would benefit from including a comparison group of students who were interested in aquatic sciences, had taken courses in aquatic sciences, or majored in aquatic sciences, but did not participate in ASLOMP. Of course, having a comparison group does not mitigate the potential for selection bias in terms of self-selection of students who apply to ASLOMP or the selection of applicants to participate in ASLOMP. The \"gold standard\" research design would be to conduct a randomized controlled trial experiment, randomly selecting ASLOMP participants from a pool of eligible applicants. ASLOMP is oversubscribed, meaning that it receives more applicants than available program spots. ASLOMP has increased the rigor of its application requirements over the years, but it would be worthwhile for program administrators to consider the minimum level of prerequisites that would enable students to fully participate in and benefit from the program, and then randomly select attendees from the pool of qualified applicants. If the program shifted to use random assignment, a future study could examine the causal relationship between ASLOMP and participants' outcomes. Also, future research could benefit from multiple modes of data collection, including a survey to understand student participation and experiences at the time of program participation, and administrative records data, such as data from the National Student Clearinghouse on participants' postsecondary enrollment and degree attainment. Still, this study provided answers to fundamental questions about ASLOMP participants, their experiences, and their outcomes. It demonstrated that ASLOMP has served URM students and that participants were very satisfied with their experience and were generally successful in earning aquatic sciences degrees and finding employment in aquatic sciences or STEM fields. In open-ended survey items, many students commented on their appreciation for the ASLOMP experience. As one student said, \"I'm not sure I would have been able to be involved in the scientific process without their assistance-both financial and exposure to new opportunities.\" Self-efficacy A set of items about the extent to which ASLOMP participation helped students to believe they could successfully conduct aquatic sciences research and succeed in a career in aquatic sciences."}, {"section_title": "0.90", "text": "Community A set of items about the extent to which participants felt that they had a lot in common with other ASLOMP participants and felt like they were part of a community."}, {"section_title": "0.81", "text": ""}, {"section_title": "0.80", "text": "Interest in aquatic sciences A set of items about the extent to which ASLOMP participation helped students to confirm or focus their interest in aquatic sciences, increase their interest in pursuing further studies in aquatic sciences, and increase their interest in pursuing a career in aquatic sciences."}, {"section_title": "0.89", "text": ""}, {"section_title": "0.71", "text": ""}, {"section_title": "Scale Description Cronbach's alpha", "text": ""}, {"section_title": "0.87", "text": "Exhibit A-5. Means for Each Short-Term Outcome Scale, by Cohort "}]