[{"section_title": "Summary", "text": ""}, {"section_title": "What Is the Issue?", "text": "As annual U.S. ethanol production increased 9 billion gallons between 2000 and 2009, demand for the feedstock used to produce ethanol also increased. In the United States, corn is the primary feedstock for ethanol production, and harvested corn acreage increased by roughly 10 percent (7.2 million acres) over the same period, with much of the change occurring in 2006-08. The environmental and economic implications of such a large shift in land use depend largely on where these additional corn acres are located. In this study, we analyze data from a special bioenergy survey of farm operators to determine, for the fi rst time, how farm-level land-use decisions affected corn supplies and competing crops."}, {"section_title": "What Did the Study Find?", "text": "As farmers react to price changes for commodities they can produce on their farms, adjustments in land-use decisions can be complex. Not only do landuse decisions by individual farmers refl ect the relative productivity of farmland for specifi c crops, but price expectations can differ from one operator to the next and decisions can change from year-to-year as new expectations are formed. Increased demand for corn, attributed to bioenergy policies and other market conditions during 2000-09, resulted in a complex array of cropping pattern changes.\n• Corn production expanded between 2000 and 2009 due partly to an increase in corn acreage relative to historic levels and partly to an increase in corn yields.\n• Crop acreage shifts at the farm level indicate complex market adjustments between 2006 and 2008:\n Farms specializing in soybeans in 2006 accounted for most of the increase in corn acreage;\n Farms shifting from other crops into soybeans offset the shift from soybeans to corn; and  Some farms reduced corn acreage, while other farms expanded soybean and corn acreage simultaneously.\n• Expanding total acreage in major cultivated crops on corn and soybean farms also increased corn and soybean acreage:\n The average shift from hay, USDA Conservation Reserve Program, or grazing land into cultivated cropland accounted for about a third of the average increase in harvested crop acreage, mostly from hay; and  Double cropping (consecutively producing two crops of either like or unlike commodities on the same land within the same year) and a reduction in idled cropland also expanded harvested crop acreage."}, {"section_title": "Introduction", "text": "Between 2000 and 2009, U.S. ethanol production increased from 1.6 billion gallons to 10.8 billion gallons (U.S. Department of Energy, 2010) . Over the same period, U.S. corn production increased from 9.9 billion bushels to 13.1 billion bushels, while harvested corn increased from 72.4 million acres to 79.6 million acres (USDA, National Agricultural Statistics Service, 2010) . 1 This study examines how farms expanded corn acreage during this period, primarily between 2006 and 2008, and informs a number of questions about the unintended environmental effects of bioenergy policies.\nIncreasing demand for ethanol (and for corn as an ethanol feedstock) over the past decade came in response to a rise in energy prices and Federal bioenergy policies aimed at reducing greenhouse gas emissions, reducing groundlevel ozone and smog, and increasing energy independence. 2 Previous studies suggest, however, that bioenergy policies may have unintended impacts, including those on the environment, the livestock sector, and food prices due to increased competition for corn. (See box, \"Crop Prices and Ethanol Demand,\" for a discussion of the changes in corn and other crop prices between 2000 and 2009.) Potential environmental impacts include the loss of wildlife habitat, greater carbon emissions, increased local air pollution from ethanol production, and reduced water quality (Searchinger et al., 2008; Hill et al., 2009; U.S. Environmental Protection Agency, 2010) . The magnitude of these impacts depends on how and where corn production expansion occurs and how farmers adjust production of other crops (Malcolm et al., 2009 ). For example, increased conversion of hay or pasture to crop production or increased double-cropped acreage 3 and the use of more inputs may accelerate nutrient runoff and soil erosion. Even shifts from relatively low-input crops to high-input crops (e.g., wheat to corn) could affect environmental quality. When acreage shifts from one high-input crop to another (e.g., cotton to corn), however, ethanol-induced changes may be negligible or could even reduce environmental externalities.\n1 Harvested acres are used as a measure of land committed to corn rather than planted acres because the latter includes corn planted for silage. 2 The Renewable Fuel Standard and ethanol production tax credits seek to replace a portion of gasoline consumption with ethanol consumption. The Clean Air Act requires the addition of oxygenates to fuel in some areas of the country to reduce ground-level ozone and smog. Ethanol is currently the preferred oxygenate in most regions of the country, particularly since MTBE (methyl tertiary butyl ether), the previously preferred oxygenate, has been identifi ed as a drinking water pollutant. 3 The practice of consecutively producing two crops of either like or unlike commodities on the same land within the same year.\nThe changes in corn production described in this report are not only a response to domestic bioenergy policies but also to other market forces and Government policies. According to the Congressional Budget Offi ce (CBO) (2009), about 20 percent of the increase in corn prices between 2007 and 2008 was due to domestic ethanol demand. The CBO report also cites research by the International Food Policy Research Institute (IFPRI) that 40 percent of the rise in corn prices between 2000 and 2007 was due to global ethanol demand. Other factors infl uencing corn prices included energy prices, exchange rates, and adverse weather. Recent changes in the corn market allow us to examine how corn production has expanded. As shown in the price series below, corn price increases since 2006 were accompanied by a price increase for soybeans and wheat, but cotton prices have not increased as dramatically. Since farmers react to price trends when making land-use decisions, these price trends infl uence the pathways the farm sector has taken as it adjusted to increased demand for corn for ethanol production."}, {"section_title": "Crop Prices and Ethanol Demand", "text": "Relative changes in major crop prices "}, {"section_title": "Relative Importance of Corn Acreage for Corn Expansion", "text": "Agricultural markets can meet the growing demand for corn-based ethanol by:\n1. Diverting corn from other uses, such as exports, food production, and livestock feed;\n2. Increasing corn yields (bushels per acre); or 3. Increasing the amount of land planted to corn.\nCorn acreage could be increased by reducing acreage in other crops, bringing new acreage into crop production, or expanding double-cropping practices. All of these changes occurred in response to ethanol production increases over the past decade.\nNon-ethanol uses of corn have not increased over the past decade, as greater ethanol production has captured a larger share of corn production. The use of distillers' grains (a by-product of ethanol production) as livestock feed may have reduced demand for corn, but even with this substitution, some corn was diverted from other uses. Between 2000 and 2009, corn used for ethanol increased by 3.7 billion bushels, while total corn production increased by 3.2 billion bushels (fi g. 1).\nCorn yield increases have not kept up with ethanol production growth. Current agricultural projections show corn yield increasing at about 2 bushels per acre per year, which is almost the same rate that corn yield increased nationally between 2000 (USDA, Economic Research Service, 2010 . If corn acreage had been maintained at the 72.4 million acres harvested in 2000, then yield increases of 2 bushels per acre per year would have provided for only an additional 1.3 billion bushels of corn-below the amount needed to fuel expanding production of ethanol. 4\n4 From the perspective of indirect effects, this reliance on \"maintained\" acreage (in conjunction with yield increases) is as relevant to the analysis of bioenergy policies as any potential reliance on \"expanded\" corn acreage relative to historic trends. Distinguishing between \"maintained\" and \"expanded\" corn acreage is useful, however, since each may have different environmental impacts. "}, {"section_title": "Aggregate Evidence of the Expansion in Corn Acreage", "text": "Crop acreage adjustments ultimately occur at the fi eld level as farmers decide whether to plant a particular crop on each piece of land in a given year. Often farmers make multiyear planting decisions and plant crops in rotation. One of the most common rotations sees corn and soybeans planted in alternating years on the same fi eld, which makes shifting to more intensive corn rotations (e.g., a 3-year rotation of corn-corn-soy) a plausible adjustment to higher corn demand. 5\nMost crop acreage data are available only at an aggregated level (national, State, or county). In this section, we compare aggregate data (national, State, and county) with predictions from previous simulation studies. The aggregate data show that reducing soybean acreage is not the only option to expand corn acreage. Our farm-level analysis, presented in the next section, demonstrates how net acreage changes in aggregate data resulted from farm-level decisions.\nMost simulation studies of bioenergy policies predicted large increases in corn acreage as ethanol production increased. The studies differ signifi cantly, however, in the sources of those acreage increases (table 1) . For two different scenarios, Searchinger et al. (2008) predicted that increases in domestic (U.S.) corn acreage would come predominately from reducing soybean and wheat acreage, as well as from increasing cropland acreage. The U.S. Environmental Protection Agency (EPA) (2010) predicted that increases in corn acreage would come from reducing soybean acreage and increasing cropland. In contrast, Malcolm et al. (2009) predicted that increases in corn and soybean acreage would come primarily from reducing idled cropland.\nObserved changes are never a perfect test of simulation study predictions, which generally compare simulated outcomes with a simulated (and calibrated) baseline scenario. Observed changes may differ from those previously predicted because of the range of ethanol expansion under consideration, unexpected changes in related markets (e.g., fertilizer), or differences between shortrun and longrun adjustments. Nonetheless, the increase in ethanol demand over the past decade was precisely the type of demand-side shock that these simulation studies sought to model. . Over the long run, however, both corn and soybean acreage have been expanding without an obvious historical shift out of soybeans and into corn. 6 In general, corn and soybean acreage expanded over both the long and short run (table 2) , whereas most other crop acreage decreased over the long run, suggesting that acreage responses to greater corn demand do not mimic acreage responses predicted by simulation studies.\nRegional differences in soybean acreage changes may explain why national soybean acreage did not decrease over this period. Several States in the Corn Belt and Lake State regions-most notably Iowa, Illinois, and Minnesotashow large increases in corn acreage with proportional decreases in soybean acreage (fi g. 3). Other States-most notably South Dakota, Kansas, Mississippi, and Arkansas-show large increases in both corn and soybean acreage.\n5 Most regions of the country see substantial benefi ts from joint production of corn and soybeans. Corn production is nutrient intensive, whereas soybeans fi x nitrogen in the soil. As a result, rotating corn and soybeans can reduce fertilizer costs. In addition, rotating corn and soybeans can reduce pesticide application costs by reducing the chance of pests and diseases becoming established. 6 In the absence of bioenergy policies promoting the production of cornbased ethanol, soybean acreage might have been substantially higher. In such a case, the actual shift away from soybean acreage is simply obscured by increases in soybean demand that are unrelated to bioenergy policy. This would require a rapid increase in soybean demand that occurred simultaneously with the rapid increase in ethanol demand since 2006. Regional differences are also apparent in how farms expand total harvested acreage (fi g. 4). Expanding harvested acreage was an important trend in the Northern and Southern Plains, as well as in the lower Mississippi River Valley. Aggregate data sources do not provide detail on how harvested acreage might have expanded, including conversion of previously uncultivated or fallowed land to cultivated cropland or the expansion of double cropping. For that, we turn to farm-level data. "}, {"section_title": "Farm-Level Evidence of the Expansion in Corn Acres", "text": "Farm-level data reveal important differences in how various types of farms expanded corn production. These data may explain why aggregate national data do not show a net movement out of soybeans and why county-level data show an increase in total harvested acreage in some regions. The data were derived from a special bioenergy version of the Agricultural Resources Management Survey (ARMS), in which corn and soybean farmers reported on acreage and the crops they planted over the 2006-08 period (see box, \"Background on the Data: 2008 ARMS\"). Due to the focus on movement into corn acreage and how ARMS selected farms for survey, our study identifi es farms according to the dominant crop among noncorn acreage (table 3) . (See box \"Farm Classifi cations\" for details on the farm classifi cation scheme.) If corn acreage is coming primarily from soybean acreage, as predicted by some simulation studies, then soybean farms will account for most of the growth in corn production. Alternatively, if corn acreage is coming primarily from an expansion of cropland, then the growth in corn production may be more evenly spread across all types of farms or more concentrated among farms with land in forage production.\nBoth market adjustments and normal crop rotations can infl uence how we observe farm-level changes in acreage. To reduce the infl uence of normal crop rotations on observed land-use decisions, we focus on net acreage changes over the entire 2-year period . By comparing 2006 acreage with 2008 acreage, we reduce the chance of mistaking planned rotations for market adjustments. For example, consider a farm that grows only corn and soybeans, practices corn/soybean year-on-year rotations on every fi eld, and has 4 out of 10 equal-sized fi elds (40 percent of total acreage) in corn in 2006. We would expect that farm, without any market adjustments, to have 60 percent of its acreage in corn in 2007 before returning to 40 percent of its acreage in corn in 2008. Year-on-year changes in acreage would refl ect rotations, whereas 2006-08 changes in acreage would refl ect market adjustments. Year-on-year rotations and continuous production are the most common forms of joint production of corn and soybeans, although a full treatment of rotations introduces uncertainty into a farmers' crop rotation selection (e.g., Livingston et al., 2008) .\nThe contribution of each farm type to increased corn acreage is the total change in corn acreage for that type of farm (a weighted sum of the change in acreage) divided by the total change in corn acreage for all farms (a weighted sum of the change in acreage) times 100. These percentages use the ARMS sampling weights, which refl ect the share of all farms growing corn and soybean represented by each farm type ( to corn acreage expansion because they reduced corn acreage between 2006 and 2008. Over half (53.2 percent) of the corn acreage expansion came from soybean farms. The remaining increase in corn acreage is split almost evenly between the other farm types. Nonetheless, cotton farms played a disproportionate role in expanding corn acreage. Cotton farms in 2006 made up less than 1 percent of the ARMS sample but were responsible for more than 12 percent of the increase in both corn and soybean acreage. (table 3) . Cotton farms accounted for a signifi cant portion of soybean acreage expansion (12.2 percent) despite being a small part of the sample. \"Other\" farms played a larger role in soybean acreage expansion than in corn acreage expansion. In contrast, wheat farms contributed more to corn acreage than to soybean acreage.\nAttributing corn and/or soybean acreage growth to a decrease in a farm's dominant crop acreage is supported by the fact that observed reductions The USDA's National Agricultural Statistics Service and Economic Research Service annually conduct the Agricultural Resource Management Survey (ARMS) to obtain information on farming practices and production costs. Each year, a portion of the survey targets specifi c crops or livestock commodities. The 2008 ARMS incorporated several innovations that provided an unprecedented source of data on farm-level changes in corn production:\n• The bioenergy version of the 2008 ARMS simultaneously sampled corn and soybean farmers. Since these two crops are often grown in rotation, targeting producers of both crops provided a full representation of how farms vary in the joint production of corn and soybeans.\n• The 2008 ARMS also included questions about production practices in 2006 and 2007, particularly with respect to crop acreage. Responses provided a measure of within-farm variation in corn production over time."}, {"section_title": "Background on the Data: 2008 ARMS Survey", "text": "Farms were categorized according to their dominant crop in 2006. In keeping with the standard defi nition of a dominant crop, \"corn\" farms had at least 50 percent of their 2006 harvested acreage in corn. Among other farms, the goal is to identify which crop represents the most likely source for new corn acres. Among noncorn farms, a dominant crop was therefore defi ned as a plurality of at least 33 percent of noncorn harvested acres in 2006. Thus \"soybean\" farms harvested at least 33 percent of noncorn acreage in soybeans and more soybeans than any other noncorn crop. \"Cotton\" farms harvested at least 33 percent of 2006 noncorn acreage in cotton, and \"wheat\" farms harvested at least 33 percent in wheat. For \"hay\" farms, alfalfa and other hay were treated as a single crop category. \"Other\" crop farms harvested either sorghum, barley and oats (combined), or \"other\" as their dominant crop or were highly diversifi ed and did not harvest a single crop that constituted at least 33 percent of their noncorn acres."}, {"section_title": "Farm Classifi cations The Ethanol Decade: An Expansion of U.S. Corn Production, 2000-09/ EIB-79", "text": "Economic Research Service/USDA \nChange in barley/oats 0. \nin acreage are consistent with farm classifi cations (i.e., the largest average reduction in wheat acres is for wheat farms). For each farm type, the average change in total harvested acres is often larger than the average shift into both corn and soybeans (table 3) . This is not the case for cotton farms. While the data show that 2008 corn and soybean farms signifi cantly expanded harvested acreage between 2006 and 2008, the data also suggest that these farms did not exhaust opportunities for onfarm expansion of harvested acreage. The average farm operated more acres than it harvested and, in some cases, much more acreage.\nOverall, farm-level averages indicate that movement from soybean acreage to corn acreage is offset by other movement into soybean acres. The new soybean acreage appear to be coming from corn, cotton, sorghum, and other crops, as well as from expansion in total harvested acreage."}, {"section_title": "Changes in Harvested Acres", "text": "Farm-level data also provide insight into how total harvested acreage expanded:\n• By cultivating land previously either idled or uncultivated (e.g., pasture);\n• By expanding double cropping; or\n• By consolidating (adding additional acreage by purchasing or leasing surrounding farms).\nIn Although the 2008 ARMS did not ask explicitly about double cropping, the extent of this practice can be inferred from the data. In 2008, about 14.6 percent of corn and soybean farms reported more harvested acreage (when summed across all crops) than total land that could be \"considered cropland.\" 9 Farms with harvested acreage larger than cropland acreage (i.e., farms inferred to be double cropping in 2008) also had a much higher rate of expansion in harvested acreage than other farms. 10\nData from the 2007 Agricultural Census and annual NASS crop production summaries reveal that an estimated 12 million acres were double cropped in 2008, an increase of about 4 million acres since 2006. For this study, we estimated the total amount of double-cropped acreage in each region in census years (1997, 2002, and 2007) by taking the difference between total harvested acreage for all crops and age the reported \"harvested acreage,\" or any acreage on which at least one crop was harvested. Beyond increases in cropland or double cropping, harvested acreage growth at the farm level could also represent an increase in average farm size due to consolidation. This growth represents an inherent diffi culty with farm-level data across multiple periods because farms that exit due to consolidation may be missed. Analysis of USDA county-level crop production summary data, for which farm consolidation is not a problem, confi rms that an increase in harvested corn acreage (2006-08) is positively associated with an increase in the sum of harvested acreage for major crops. While some uncertainty remains about the relative importance of cropland expansion versus doublecropping expansion, our analysis shows that harvested acreage expansion was an important source of growth in corn production. U.S. double cropping estimates, by region Conclusions U.S. corn production has increased dramatically over the past decade. Until 2006, corn production increases were largely due to increases in corn yields. Since 2006, corn production expansion resulted from increases in corn acreage.\nOur fi ndings partially support previous predictions about the indirect impacts of bioenergy policies; the largest source for new corn acreage was farms that grew primarily soybeans in 2006. However, there has not been a net decrease in soybean acreage. Reduced acreage of other crops and increased harvested acreage have been important sources for the simultaneous expansion of corn and soybean production. Several sources for corn (and soybean) acreage expansion-increases in double cropping, conversion of uncultivated hay, and reductions in cotton acreage-could have unintended consequences that differ from those suggested by earlier simulation studies. In addition, since observed patterns in both aggregate crop acreage data and farm-level land-use decisions refl ect relative crop prices during the study period, future farm-sector and farm-level adjustments to increased ethanol production could differ from those reported here. For example, recent increases in cotton and wheat prices may mean that land-use decisions for the 2011 planting season will result in cropping patterns not observed in 2008."}]