[{"section_title": "", "text": "property damages increase by about $110 million per degree Celsius of sea surface temperature rise, and the number of people affected by flooding inundation increases by about 4,900 per degree Celsius of sea surface temperature rise. These results indicate that it may become necessary to consider the effects of climate change when building future coastal communities and adapting the protection of existing communities. v ACKNOWLEDGEMENTS First, I would like to thank my committee chair, Dr. Jennifer Irish, for her support and guidance through my graduate career at Texas A&M. I would also like to thank Dr. Francisco Olivera for his help on this research as well as always being available for my questions regarding GIS. I am also thankful for my other committee members, Dr. Billy Edge and Dr. John Nielsen-Gammon, for their contributions and time in reviewing this research. I would also like to thank the sponsor, the National Commission on Energy Policy, for allowing me to participate in this exciting project. I am very grateful to Dr. James Kaihatu who provided the results from SWAN, Mir Emad Mousavi who completed nearly all of the ADCIRC simulations used for this study, and Katy Song who provided the tidal data necessary to determine water levels. I would also like to thank Sean Finn for his help with the property damage assessment in the Summer of 2008. I am also very grateful to Lauren Dunkin who spent countless hours in our office helping me create maps in GIS and assess property damages. Without her help, this project would have taken much longer to complete. Finally, I want to thank my parents, John and Barbara Frey, for their unconditional love, support, and  (Woolsey, 2008). Storm surge associated with hurricanes is said to have the potential for the greatest loss of life and property related to a hurricane (National Hurricane Center (NHC), 2009). Best estimates suggest that in an average year in the Atlantic basin there will be eleven tropical storms, six of which become hurricanes, while two of those hurricanes will reach major hurricane status (National Oceanic and Atmospheric Administration (NOAA), 2007a). Each of these storms that makes landfall has the opportunity to produce devastating coastal flooding. Hurricane Katrina, which devastated the Louisiana and Mississippi coast in 2005, had a very high storm surge, which resulted in the deaths of around 1500 people (third mostly deadly hurricane) and cost about $81 billion in damages (most costly hurricane) (NOAA, 2007a). While hurricanes with the effects of Katrina are rare, it is possible that hurricanes will be more intense in the future due to sea-surface warming (Elsner et al., 2008;Knutson and Tuleya, 2008;Emanuel et al., 2008;Emanuel, 2005;Webster et al., 2005). It is also expected that these warmer temperatures will result in 0.18 to 0.59 m of sea level rise by the year 2100 (IPCC, 2007). A combination of hurricane intensification and sea level rise will most likely increase the area of flooding inundation associated with coastal storms. When a larger area is inundated during a coastal storm, the total damages related to the storm and the number of people affected by the storm also increase."}, {"section_title": "Hurricane Damages", "text": "Damages associated with hurricanes and tropical storms can be very costly. Tropical cyclone damages can be caused by several different phenomena: rain, wind, tornadoes, and storm surge. Even in inland areas, a hurricane can produce up to a meter of rain in a few days. For example, Tropical Storm Allison made landfall in Texas in 2001 and generated upwards of 75 centimeters (30 inches) of rain in some areas around Houston (Stewart, 2002). Flooding due to rainfall was the main cause of damage for that storm, which was estimated at about $5 billion (Stewart, 2002). Hurricane winds can also result in substantial damages to homes, vehicles, and trees. For example, a Category 4 hurricane which is characterized by winds between 211 and 249 km/hr (131 and 155 mph), would cause about 100 times the damages as a Category 1 hurricane (NHC, 2009). Many hurricanes can also spawn tornadoes. It was estimated that Hurricane Beulah, which will be considered in this thesis, produced 141 tornadoes. Storm surge can increase the mean water level more than 5 m (15 ft) in some areas. In coastal areas, storm surge is usually the cause of most damages and loss of life. For example, Hurricane Katrina's storm surge (excluding the flooding in New Orleans) resulted in over $21 billion in insured losses (ISO, 2005). Although winds, flooding from rainfall, and tornadoes can produce much damage, only structural damages due to flooding from storm surge will be considered in this thesis. It is also important to mention that as hurricanes intensify due to climate change, storm surges will likely be higher, which will result in greater damages to structures."}, {"section_title": "Population Affected by Hurricanes", "text": "Every hurricane that makes landfall has the potential to affect large numbers of people. However, individuals may be impacted to different degrees. For example, some may consider evacuations, gas prices, drinking water, and the economy as the effects of a hurricane; therefore, a person affected by any of those things would be affected by a hurricane. By using that criterion, for example, Hurricane Katrina affected over 15 million people (Hurricane Katrina Relief, 2005). While hundreds of thousands could evacuate from a storm, this thesis will consider only those who suffer damages as affected by a hurricane. The U.S. Census Bureau (2009) determined that 18.89% of businesses in Louisiana and 7.73% of businesses in Mississippi were in FEMA Designated GIS Damage Zones. While the number of people directly affected by Hurricane Katrina is not mentioned, the hurricane destroyed or made uninhabitable about 300,000 homes (Colby, 2006). Once again, as climate change intensifies hurricanes, it is expected that storm surges will be greater, which will affect a greater number of people. Also, as the population near the coast continues to increase, the number of people likely to be affected by a hurricane will also increase."}, {"section_title": "Barrier Islands", "text": "A chain of barrier islands protects much of the Texas Gulf Coast. Barrier islands receive the greatest burden of a storm and can shield the mainland regions from the highest storm surges. However, even small hurricanes can shape barrier islands by lowering and shifting dunes and cutting new inlets, while the most intense hurricanes can completely inundate barrier islands (Fritz et al., 2007). These morphodynamic effects from hurricanes can lead to less protection of the mainland in the future. The long term evolution of barrier islands is also affected by sea level rise. As sea levels rise, barrier islands move landward and can begin to drown if the sediment supply rate does not keep up with sea level rise (FitzGerald et al., 2008). Once again, this could negate the added protection to the coast that a barrier island creates. Several barrier islands in Texas, such as Galveston Island and Mustang Island, are inhabited. This creates difficulties during hurricanes, since massive evacuations are necessary and the damages to homes on barrier islands will be high. For example, only one home in the town of Gilchrist, Texas, survived the storm surge from Hurricane Ike in 2008 (Hanna, 2008). Once again as hurricanes intensify and sea levels rise, it is likely that damages on barrier islands will increase, more people will be affected by flooding, and more barrier islands will suffer complete inundation during hurricanes. A barrier island / back-bay system will be considered in this study."}, {"section_title": "Thesis Content", "text": "This thesis is divided into six sections. Section 1 presents a general overview of the effects that climate change has on hurricane flooding, property damages, the number of people affected by hurricanes, and barrier islands. Section 2 presents an overview of existing research related to hurricanes; climate change and sea level rise; hurricane intensity, barrier island morphodynamics, and coastal flooding due to climate change and sea level rise; and damage assessments. Section 3 discusses the hurricane selection process and the climate change scenarios chosen for the analysis. Section 4 includes an explanation of physics-based hydrodynamic, wave, and morphodynamic models used to predict flood elevations and GIS (Geographic Information Systems) used for geospatial analysis. This section also discusses the processes of determining flooding inundation, property damages, and populations affected. Section 5 discusses and compares the results of storm-induced barrier island response and compares flooding inundation, property damages, and populations affected for the hurricane and climate change scenarios. Section 6 includes conclusions and recommendations for further research."}, {"section_title": "BACKGROUND AND LITERATURE REVIEW", "text": ""}, {"section_title": "Introduction", "text": "Hurricanes have always been a part of life for people living in hurricane-prone coastal communities. However, the number of people living near the coast has grown considerably during the last few decades. For example, coastal watershed communities only account for about 25% of the land area in the United States, but just over 50% of the total population live in these areas (United States Commission on Ocean Policy, 2004;Bureau of the Census, 2002). Additionally, the population in coastal watershed communities is projected to increase to 165 million people by 2015, which equals an increase of 3,600 people per day (NOAA, 1998). With so many people living near the coast and with more moving there each year, damages due to coastal storms will also increase. While people living on the coast would feel the effects of a coastal storm; barrier islands, which protect mainland areas and still are homes to many people, can be overwashed or breached as seen during Hurricanes Katrina and Ike (Fritz et al., 2007;Moskowitz, 2008). Many also believe that climate change may cause an increase in the intensity of hurricanes (Anthes et al., 2006;Curry et al., 2006;Webster et al., 2005). Additionally, the National Oceanic and Atmospheric Administration (NOAA, 2001) collects mean sea level records which show a rise in sea level in many of the United States' coastal areas. A combination of more intense storms and sea level rise would cause an increase in hurricane flooding and damages (Irish et al., 2008a). It is also believed that as sea levels rise, the protective barrier islands will erode more quickly (Evans, 2004). This section provides a background of the effects of climate change on hurricane flooding inundation and damages and the effects of sea level rise and hurricanes on barrier island morphodynamics. Section 2.2 will give an introduction to hurricanes. Section 2.3 of this literature review provides an overview of the process of storm surge. Section 2.4 will discuss the effects of climate change on eustatic sea level rise, hurricane intensity, and coastal flooding. The effects of hurricanes and eustatic sea level rise on barrier island morphodynamics will be covered in Section 2.5. Section 2.6 will provide an overview of literature that discusses general damages due to coastal storms, while Section 2.7 will give a summary of the literature reviewed.\nThis section includes the results of the hydrodynamic characteristics, XBeach simulations, and the flooding inundation, property damages, and populations affected for Hurricanes Bret, Beulah, and Carla (Shifted). The hydrodynamic characteristics will be discussed for all of the scenarios simulated in XBeach. The following section will show the amount of lowering of different locations on the barrier islands. The next three sections will discuss each set of hurricane scenarios separately. Each of these sections will begin with discussion and maps including the flooded area and property damages. The population affected will be discussed last. The next section will compare flooding inundation, property damages, and population affected between Hurricanes Bret, Beulah, and Carla (Shifted). The final section will discuss other important factors not included in this analysis."}, {"section_title": "Hurricanes", "text": "The Atlantic basin hurricane season lasts from June 1 to November 30, with the most activity occurring between August and October (Landsea, 1993). The National Hurricane Center (2008) defines a tropical cyclone (hurricane in the Northern Hemisphere west of the Greenwich Meridian to the International Dateline) as a storm with a maximum sustained surface wind using a one minute average of 74 mph or greater. The Saffir-Simpson Hurricane Scale rates a hurricane's intensity and is shown in Table 1. Although hurricanes are characterized by central pressure, surge, and wind, only the maximum wind speed is used to determine the hurricane's category.  NOAA, 2007a). Hurricanes are extremely damaging; eight of the ten costliest natural disasters in the United States were hurricanes (Woolsey, 2008). 2007a). Hurricanes are also very dangerous and can result in numerous deaths. For example, the Galveston Hurricane of 1900 caused between 8,000 and 12,000 deaths, while Hurricane Katrina (2005) caused about 1,500 deaths (NOAA, 2007a). Additionally, over 50 people were confirmed dead from Hurricane Ike, but most recent estimates state that 34 people are still unaccounted for in Galveston County (Sanz, 2009). Table 3. Most Intense Hurricanes (From NOAA, 2007a) Lastly, the intensity of hurricanes based on central pressure at landfall is also measured. Table 3 shows the ten most intense hurricanes to hit the United States between 1851 and 2006. Hurricane Katrina ranks third in minimum central pressure at landfall but is considered a Category 3 Hurricane based on its wind at landfall. Even though Hurricane Katrina weakened considerably before landfall, the size of the storm, central pressure, and shallow offshore depths contributed to the high, wide-spread surge (NOAA, 2005)."}, {"section_title": "Storm Surge", "text": "Although hurricanes produce very strong winds and sometimes can spawn tornadoes, the most dangerous part of a hurricane for people on the coast is storm surge. A storm surge is characterized by elevated water levels which can last between hours and many days. Depending on the category of the hurricane, low-lying evacuation routes can be blocked by hurricane surge many hours before a hurricane makes landfall (NHC, 2008). Since hurricanes are generally classified by wind speed, two hurricanes with the same hurricane category could produce very different storm surges. For example, a coastline with a shallow offshore bathymetry would be inundated by a greater storm surge than a coastline with a steep bathymetry. This is one of the reasons Hurricane Katrina produced such devastating storm surges in Mississippi and Louisiana (Chen et al., 2008). Additionally, if there are two storms with all of the same characteristics with the exception of storm size, the larger storm will produce a higher storm surge (Irish et al., 2008b). A hurricane's storm surge is generated by the barometric pressure reduction, wind stress, Coriolis force, and wave setup (Dean and Dalrymple, 2002). Since a hurricane or extratropical storm is a low pressure system, a large barometric pressure gradient is created. This pressure gradient may cause water to be pulled into the low atmospheric pressure area. However, barometric tide is a minor contributor to storm surge as its magnitude is under a meter. The barometric pressure's contribution to storm surge is estimated as where η B is the barometric response, Δp is the pressure differential, and γ is the specific weight of seawater. Generally, the barometric response is given as where the units for η B are in centimeters while Δp is measured in millibars (Dean and Dalrymple, 2002). Wind stress tide is another component of storm surge. When wind blows over water, a frictional drag is caused which creates wind stress tide. Unfortunately, wind stress cannot be determined theoretically at present. The empirical formula for wind stress is given as where τ s is the wind stress, ρ is the density of water, c f is a dimensionless friction coefficient (values range from 1.2 x 10 -6 to 3.4 x 10 -6 ), and W is the wind speed which is usually measured in meters per second at a 10 m elevation. Once several forces are determined and derivatives calculated, the equation for the increased water level for a constant continental shelf depth and wind stress is estimated as where η w is the water level increase, h is the constant continental shelf depth, A s is a dimensionless parameter, x points shoreward from the edge of the continental shelf, l is the shelf width, and n accounts for bottom shear stress (Dean and Dalrymple, 2002). Generally, wind stress is the most important component of storm surge. Another component of storm surge is the Coriolis tide. In the Northern Hemisphere, the Coriolis force, which is due to the Earth's rotation, will deflect to the right. In some cases, this component of storm surge can be large, but it may also reduce storm surge when the current flows in the opposite direction. The last major component of storm surge is wave setup, which occurs in the wave breaking zone and results in superelevation of the water level. This wave setup is caused by the breaking waves transferring momentum to the water column. Dean and Bender (2006) report that wave setup can make up to 30 to 60% of the total storm surge."}, {"section_title": "The Effects of Climate Change on Sea Level Rise, Hurricane Intensification, and", "text": ""}, {"section_title": "Flooding", "text": "The Intergovernmental Panel on Climate Change (2007) defines climate change as \"a change in the state of the climate that can be identified by changes in the mean and/or the variability of its properties, and that persists for an extended period, typically decades or longer.\" The IPCC 2007 6°C between 1900and 2000. The IPCC (2007 also projected that the global surface temperature could further increase between 1.1 and 6.4°C by the end of the 21 st century.  Figure 2 shows an example of projected global temperature increases by the last decade of the 21 st century. The greatest increase in temperature is expected to occur in the Arctic. Additionally, the IPCC (2007) states that since 1978, Arctic sea ice has shrunk by 2.7% per decade. Due to these projected temperature increases and the trend of shrinking sea ice, it is likely that the Arctic will be completely without late-summer sea ice by the end of the 21 st century (IPCC, 2007). Lastly, the IPCC (2007) also states that some of the effects of temperature increases in North America could include more winter  From IPCC, 2007) flooding due to decreased snowpack, heat waves, and loss of coastal habitats. Three important effects of climate change will be discussed in more detail: eustatic (global) sea level rise, hurricane intensification, and increases in coastal flooding. Eustatic (global) sea level rise refers to sea level rise due to expansion (temperature increases) of water and melting of glaciers and ice caps. Historical eustatic sea level rise rates averaged between 1.7 and 1.8 mm/yr during the 20 th century (IPCC, 2001;White et al., 2005). The National Oceanic and Atmospheric Administration (2007b) collects historical sea level rise records for many coastal communities and have found rates similar to that of the IPCC (2007) and White et al. (2005). More recently, the IPCC (2007) has found that the historical eustatic sea level rise rates were between 1.3 and 2.3 mm/yr between 1961 and 2003. However, the rates rose to between 2. 4 and 3.8 mm/yr between 19934 and 3.8 mm/yr between and 20034 and 3.8 mm/yr between (IPCC, 2007. Several studies have concluded that eustatic SLR is accelerating due to global warming (IPCC, 2007;. The IPCC (2007) also projected eustatic SLR between 0.18 and 0.59 m by the last decade of the 21 st century. Some believe that the eustatic SLR projections of the IPCC 2007are conservative and suggest that there will be at least 1 meter of SLR in the next 100 years due to the melting of ice caps and glaciers (Pfeffer et al., 2008;Rahmstorf, 2007).  It is also important to note that land subsidence also contributes to total sea level rise. Subsidence occurs when the surface of the earth shifts downward due to groundwater extraction, mining, or the extraction of natural gas. The coasts of Louisiana are subsiding very rapidly; the total observed rate of sea level rise which considers eustatic SLR and subsidence is over 10 mm/yr (NOAA, 2008). In some areas of Alaska, the land is rising more than the eustatic sea level is rising, which gives a negative rate of total sea level rise (NOAA, 2008;US EPA, 2009). In Texas, land subsidence rates can be as much as 2 to 4 cm/yr (Buckley et al., 2003;NOAA, 2008). Recent research suggests that hurricanes may intensify due to warmer sea-surface temperatures which correlate with global warming (Elsner et al., 2008;Knutson and Tuleya, 2008;Emanuel et al., 2008;Emanuel, 2005;Webster et al., 2005). For example, Webster et al. (2005) states that the number of Category 4 and 5 hurricanes has almost doubled between a five year period in the 1970s and a five year period in the past decade. Elsner et al. (2008) and Emanuel (2005) mention that the average tropical cyclone intensity in the North Atlantic has increased and give SST rise as a possible reason. In this thesis, hurricane intensification will refer to a decrease in a hurricane's central pressure. Tuleya (2004, 2008) have estimated that for every 1°C of SST rise, the intensity of a hurricane will increase about 8%. This is given in the equation: where p ΔSST is the projected future hurricane central pressure, p o is the present day hurricane central pressure, ΔSST represents the change in sea surface temperature, while p far is the far-field barometric pressure. This equation is very important to the research contained in this thesis and will be considered in Section 3 of this thesis. Both sea level rise and hurricane intensification will result in greater coastal flooding. This thesis will focus on increased coastal flooding due to surge from additional hurricane intensification, but sea level rise will also be considered as the intensified scenarios will correspond to certain years in the future. As these topics become more important, there has been more literature regarding sea level rise, hurricane intensification, and their effects on coastal flooding. It should be mentioned here that inland flooding from rainfall is not considered for the research in this thesis, but increased rainfall due to hurricane intensification has been researched (Gutowski et al., 1994). First, there have been several papers which discuss the impending risk of flooding in island nations due to sea level rise (Lal, 2002;Singh, 1997;Pernetta, 1992). For example, Pernetta (1992) presents a case study of the Maldives and explains most of the islands are less than 1 m high. The capital island of Male' has already been confronted with high seas, since much of the city is on reclaimed land (Pernetta, 1992). Pernetta (1992) also states that several island nations including Tuvalu and the Marshall Islands could cease to exist with future sea level rise. Lal (2002) discusses a 1-m sea level rise and states that the Marshall Islands would lose 8.6% of the total land area. There have also been many case studies which consider sea level rise in Europe and the Mediterranean region (Alpar, in press;Poulos et al., in press;Snoussi et al., 2008;Pruszak and Zawadzka, 2005;Kont, 2003). Pruszak and Zawadzka (2005) investigated the effect of sea level rise due to climate change in a study area in Poland and found that about 41,000 people would be vulnerable to flooding from a sea level rise of 0.3 m and about 244,000 would be vulnerable to flooding from a sea level rise of 2.5 m. Snoussi et al. (2008) recently completed a case study of a location in Morocco on the Mediterranean coast and stated that for a 2 m to 7 m sea level rise, the site location would lose between 24 and 59% of its land to flooding. Several recent case studies have considered the effect sea level rise has on the frequency of coastal storm flooding (Cayan et al., 2008;Cooper et al., 2008;Kirshen et al., 2008;Kleinosky et al., 2007;Gornitz et al., 2002); however, intensification of storms is only included in . Cooper et al. (2008) conducted a case study for the state of New Jersey which concluded that 1% to 3% of the state could be permanently inundated in a century, and a 0.61 m rise in sea level could result in the present day 100 year flood level being exceeded every 30 to 40 years. Kirshen et al. (2008) studied the impact of SLR in the Boston area. For a SLR of 0.6 m between 2000 and 2100, the authors found that the present day 100 year flood level would be exceeded at least once every decade by 2050. Kleinosky et al. (2007) considered SLR of 30, 60, and 90 cm in Hampton Roads, VA, a region of Virginia which includes Norfolk, Virginia Beach, and Williamsburg. The authors found that the storm surge flooding risk zones for major hurricanes (Category 3 and higher) increased between 7% and 28%, while the flooding risk zones for critical facilities (hospitals, schools, etc) increased between 1% and 19%.  conducted a similar investigation in Australia and found that in Cairns the 100 year storm event increases in height from 2.5 m to 2.9 m by 2050 and the average recurrence interval period for the 2.5 m event decreases from a 100 year event to a 40 year event as a result of sea level rise and cyclone intensification. Although  considered cyclone intensification, no cyclones were modeled in the study and an intensification of 10% was applied to cyclones to determine the decreased interval period for a storm event. Gornitz et al. (2002) conducted a case study involving New York City and determined that the return period of the present day 100 year storm flood could decrease to between 19 and 68 years by the 2050s and between 4 and 68 years by the 2080s. The authors also found that the 100 year storm flood will increase from a current level of 2.96 m to between 3 and 3.5 m by the 2020s, between 3.1 to 3.8 m by the 2050s, and up to 4.2 m by the 2080s. Although there has been much research regarding sea level rise and hurricane intensification, research which considers sea level rise with additional flooding due to hurricane intensification is limited. Karim and Mimura (2008) recently studied the effects of hurricane intensification and SLR from climate change on coastal Bangladesh. The authors used a 1-D numerical hydrodynamic model and determined inundation area, depth, and intrusion length for 8 different climate scenarios. The results of Karim and Mimura (2008) show that flooded area increases by 13% when the SST increases 2°C and the flooded area increases by 25% when the SST increases by 4°C. The authors also considered SLR in their analysis and found that a SST increase of 2°C and a SLR of 0.3 m created a risk flood area that was 15% larger than the present risk area. Ali (1996Ali ( , 1999) also conducted a similar study in Bangladesh. Ali (1996Ali ( , 1999 intensified a stationary, uniform wind field with climate projections of SST increase of 2°C and 4°C and SLR values of 0.3 m and 1 m. The author found that a 2°C SST rise and a SLR of 0.3 m resulted in 20% more flooding and a 4°C SST rise and a SLR of 1.0 m resulted in 40% more flooding than a cyclone with winds of 225 km/hr under existing climate conditions. Ali (1996Ali ( , 1999 also found that in cases where SST was increased but SLR was not considered, flooding inundation increased by 13% for a 2°C increase and 31% for a 4°C increase. Ali (1999) (FitzGerald et al., 2008). In order to determine the landward migration of barrier islands, the Bruun Rule (Bruun, 1954;Bruun, 1962) is used. The Bruun rule is given as: where L * represents the cross-shore distance, h * is the closure depth, B represents the berm height, S is the rate of sea level rise, and R is the shoreline retreat. This rule assumes that mass is conserved and movement is upward and landward. There have also been several modifications of the Bruun rule. A modification of the Bruun rule which includes the entire barrier island is shown below: Where L *o is the ocean active nearshore width, L *L is the active nearshore width of the bay, h *o is the closure depth on the ocean side, h *L is the closure depth of the bay side, and W B is the width of the barrier island (Dean, 1991;Dean and Maurmeyer, 1983). By using this equation, one can estimate the rate of shoreline retreat for a barrier island. Morton et al. (2005) studied historical shoreline changes in the Gulf of Mexico. In addition to sea level, hurricanes and other strong storms can also greatly affect the morphology of barrier islands. This has been a popular topic of research in the past few years, particularly after Hurricanes Ivan and Katrina (Morton, 2008;Houser et al., 2008;Fritz et al., 2007;Wang et al., 2006;Stone et al., 2004). For example, Morton (2008) studied shoreline changes on the Gulf of Mexico resulting from strong storms, sea level rise, and a deficit in sediment-budget. Fritz et al. (2007) observed post-Katrina damages on six Mississippi and Alabama barrier islands that were completely inundated. The authors noted that the islands suffered major erosion and local accretion, Dauphin Island was breached (1.9 km wide), and the total width of the channels between the islands was increased 37%. Wang et al. (2006) visited several beaches after Hurricane Ivan in 2004. The authors explain that overwash occurred up to 100 km to the east of the storm center, back beach erosion occurred up to 300 km to the east of the storm, up to 100 m 3 /m of beach was lost in some areas, and berms recovered to their pre-Ivan heights within 90 days but moved between 15 and 40 m landward. In a study on morphodynamics of a barrier-inlet system, Davis and Barnard (2003) mention that hurricanes had cut several breaches in their study area in Florida. There has also been research regarding modeling morphodynamics of barrier islands (Tuan et al., 2008;Cañizares and Irish, 2008;Masetti et al., 2008). Tuan et al. (2008) modeled overflow in channels on barrier islands and accurately computed the channel growth. Cañizares and Irish (2008) used several models to accurately simulate the morphological effects and bay flooding levels for several historical storms on Long Island, NY."}, {"section_title": "Damages due to Storms and Flooding", "text": "The topic of damage assessments due to coastal storms is a very broad topic, and as expected, research is very extensive. This section is composed of several sub-sections: economic assessments of climate change and sea level rise, flooding risk assessments and mapping, case studies of sea level rise and hurricane flooding damages, hurricane wind damages, and other applications of damages. As climate change has become a popular topic of discussion in recent years, more literature from economists which detail models of additional damages due to climate change and sea level rise has come forward (Bosello et al., 2007;Brown Gaddis et al., 2007;Hallegatte et al., 2007;Bosello et al., 2006;Hall and Behl, 2006;Fankhauser and Tol, 2005;Darwin and Tol, 2001;West et al., 2001;Tol, 1996;Tol, 1995). For example, Bosello et al. (2007) used an economic model to estimate the impacts of a 25 cm sea level rise in 2050 in eight different regions. West et al. (2001) looked at the effect sea level rise has on storm damage and economics and concluded that for a hypothetical community, storm damage caused by sea level rise is small compared to other damages from sea level rise. West et al. (2001) focused mostly on economic impacts and did not discuss intensification of storms due to climate change. However, the authors also mention that storm damage caused by sea level rise may increase in other locations (West et al., 2001). Brown Gaddis et al. (2007) argued that economic damage assessments from coastal disasters should include social, built, natural capital, and human costs. Risk assessments and mapping of coastal and river flooding has also been an emerging research topic (De Pippo et al., 2008;Purvis et al., 2008;Ramlal and Baban, 2008;Hardmeyer and Spencer, 2007;Natale and Savi, 2007;Guidry and Margolis, 2005;Van Der Veen and Logtmeijer, 2005;Chubey and Hathout, 2004;Merz et al., 2004;Esnard et al., 2001;Lekuthai and Vongvisessomjai, 2001). Hardmeyer and Spencer (2007) completed a risk-based analysis for Rhode Island. The authors found that there will be an increase of more than 50% in annual flooding damages if development trends continue. Guidry and Magolis (2005) used GIS to determine school flooding in North Carolina. In their assessment, they found that about 18% of the schools in the study area flooded, but they also discovered that there was a higher percentage of flooded schools in low income areas. Chubey and Hathout (2004) performed a risk assessment in southern Manitoba using imagery and GIS and determined that a flood that lasted one interval longer (3 more days) than the second largest flood in history would flood 18% more land within the study area than the historical flood. Esnard et al. (2001) studied the effects of flooding from coastal storms in Nags Head, North Carolina using GIS. The authors classified the occupied and vacant parcels into zones of expected damage and considered zoning requirements for vacant land. Estimating the cost of damages due to sea level rise or hurricane flooding has become increasingly important. Kirshen et al. (2008) studied the effects of sea level rise for the city of Boston and estimated that coastal flooding (damage and adaptation) will cost between $6 and $94 billion over a 100 year period beginning in 2000. A similar study conducted by Pruszak and Zawadzka (2005) discussed Poland's vulnerability to sea level rise and mentioned that a 100 cm sea level rise over a 100 year period could cost Poland about $30 billion in land loss. Michael (2007) studied the effects of climate change on three communities on Chesapeake Bay. Michael (2007) looked at the cost of sea level rise and coastal flooding events (without intensification) and concluded that for a 1 m sea level rise over 100 years, episodic flooding damages would average 9 times more than the estimated loss from complete inundation. In the case of a 0.6 m sea level rise over 100 years scenario, the damage from episodic flooding averages about 28 times the cost of complete inundation (Michael, 2007). The author also stated that these communities have few structures below 0.6 m in elevation, so the costs of total inundation are small. Hallegatte (2007) determined the increased risk due to climate change by using the \"beta and advection model\" (BAMS) (Marks, 1992) and a hurricane intensity model based on environmental factors to develop synthetic hurricane tracks. The author assumed a 10% increase in the intensity of a hurricane as a result of climate change. This 10% increase in the intensity of a hurricane resulted in a 54% increase in the economic losses due to the hurricane (Hallegatte, 2007). Larsen et al. (2008) recently conducted a study regarding the risk of climate change for Alaska's public infrastructure. Between now and 2030, the cost of damages to public infrastructure in Alaska due to climate change could increase 10 to 20%, while between now and 2080 the increase in damages to public infrastructure could increase 10 to 12%. Nicholls (2002) reported that the number of people annually affected by coastal flooding globally could be as high as 510 million people for a 96 cm SLR considering population increases. There have been several studies that consider wind damages to buildings (Heneka and Ruck, 2008;Pinelli et al., 2008;Klawa and Ulbrich, 2003;Huang et al., 2001;Fronstin and Holtmann, 1994). For example, Klawa and Ulbrich (2003) developed a model that determined loss from winter storms in Germany. Huang et al. (2001) studied hurricane wind risk and concluded that Florida has a greater hurricane risk than North or South Carolina. Fronstin and Holtmann (1994) evaluated residential property damages from Hurricane Andrew. The authors noted that older homes had less damage from Hurricane Andrew than homes built after the 1960s, since the building codes were stricter before the 1960s. Fronstin and Holtmann (1994) stated that the storm would have caused 33% less damage had the properties been built to 1960s codes. Several papers explore other applications of sea level rise or hurricanes. Suarez et al. (2005) studied the effects of climate change and flooding on transportation in the Boston area and found that travel delays and lost trips will nearly double due to climate change. Han et al. (2009) and Chen et al. (2007) both looked the effects of hurricanes. For example, Han et al. (2009) accurately estimated the distribution of power outages due to Gulf coast hurricanes. Chen et al. (2007) studied the effects of historical hurricane surges on coastal highways in the Mobile Bay area. The authors coupled several surge and wave models which accurately predicted flooding inundation and water levels on highways from several historical coastal storms. The authors stress that predicting flooding inundation on coastal highways is particularly significant, because evacuation routes could be flooded before an approaching storm."}, {"section_title": "Summary of Literature Review", "text": "The background study included in this literature is very broad, but each topic presented here is related to the topic of this thesis. A brief introduction to hurricanes is necessary, because hurricane-related impacts are considered in this study. The components of storm surge are discussed, since it is important to identify which features of storm surge are dominant. Climate change is introduced to explain current trends in temperatures and sea level rise. The effects of climate change are also explained, since this thesis will consider sea level rise, hurricane intensification, and coastal flooding. It is also important to note barrier island morphodynamics due to hurricanes and sea level rise, because a morphological model will be used to determine barrier island lowering. Economic damages will be considered for several hurricane scenarios. Preparing flooding inundation maps using GIS is a large part of this research, so it was necessary to study the work others have done with GIS. While damages from hurricane winds are not considered for the work in this thesis, for completeness research regarding wind damage assessments has been included. It is also very interesting and essential to review literature that models damages for other applications (such as power outages) due to sea level rise or hurricanes. One of the most important things to note here is that no study has been conducted that considers every topic included in this thesis. There are many studies that consider flooding inundation due to sea level rise, but only a few include hurricane flooding. Ali (1996,1999) and Karim and Mimura (2008) studied the effects of climate change on hurricane flooding inundation, but since the area for the study is not protected by barrier islands, morphological effects are neglected. Additionally, Ali (1996Ali ( , 1999 and Karim and Mimura (2008) used simple wind forcings or 1D hydrodynamic models, which are much less comprehensive than the study described in this thesis. There has also been much research regarding long-term barrier island morphodynamics due to sea level rise, but most papers do not include storm-induced morphodynamics and its impact on hurricane inundation on the mainland. Climate change and hurricane damages cover a wide range of research topics, and this literature review addresses all of these concepts. However, this thesis focuses on increases in hurricane flooding inundation, property damages, and population affected due to hurricane intensification from climate change and sea level rise. "}, {"section_title": "SITE LOCATION AND SELECTION", "text": ""}, {"section_title": "Selection of Site Location", "text": "The warm waters of the Gulf of Mexico are ideal for hurricanes. Additionally, the Gulf of Mexico's bathymetry is fairly shallow, which can lead to high surges. For these reasons, it is reasonable to consider the effects of hurricane intensification at a site located on the shores of the Gulf of Mexico. The City of Corpus Christi, Texas, ( Figure   4) which is located on the Gulf of Mexico, was selected to show the effects of climate change on hurricane flooding inundation, property damages, and population affected.  Bureau, 2009). Corpus Christi is also a very popular tourist destination; tourism generates about $1 billion for the Corpus Christi area annually (Corpus Christi Convention and Visitors Bureau, 2009). Much of Corpus Christi is at an elevation high enough not to be affected by hurricane flooding; however, many locations in Corpus Christi are extremely vulnerable to hurricane flooding. For example, much of the barrier island is elevated less than a few meters above sea level. Most of the areas on the barrier island are protected by dunes, but these dunes can be eroded in the event of a hurricane. There are also some locations on the barrier island that do not have dune protection, and the maximum elevation across the island in these locations is about 1.25 m. Additionally, homes on the bayside of the barrier island are built directly on the water. In the event of a hurricane, water in the bay will rise and flood most of these homes. While the mainland has more protection that the barrier island, the land near Oso Bay (the body of water to the west of the Naval Base) and Oso Creek is extremely low-lying. These areas can expect catastrophic flooding in the event of a strong hurricane. This area of town is also rapidly growing in population. Many of the refineries are located to the south and west of the Nueces Bay. These refineries are vulnerable during flooding, because the Nueces River Basin floods very easily. Although much of the land located on water is low-lying, there is a stretch of land near downtown that is located on a bluff. This 5 to 7 m bluff provides some protection to homes, and minimal flooding in these areas is expected for most hurricane scenarios considered here."}, {"section_title": "Hurricane Selection", "text": "In order to determine the effects of climate change in the Corpus Christi area, three historical hurricanes were selected. This set of hurricanes was selected based on historical information which includes hurricane tracks and storm surge. Using the historical hurricane record for the Gulf of Mexico (HURDAT database; Landsea et al. 2003), all major hurricanes, classified as a Category 3 Hurricane or higher on the Saffir-Simpson Scale, which made landfall on the Texas coast since 1950 were considered. Only three of the hurricanes meeting these requirements resulted in measurable surge in the Corpus Christi area (Hurricane Beulah (1967), Hurricane Allen (1980), Hurricane Bret (1999)). Table 4 gives characteristics for all storms with measurable surge in Corpus Christi. Although Hurricane Beulah surges were within the range of the surges for Hurricane Allen, Hurricane Allen's central pressure was slightly more intense than Hurricane Beulah, while Hurricane Beulah was a larger storm in radius to maximum wind. Hurricanes Beulah and Bret will be considered in the study due to their direct influence on the City of Corpus Christi and the ability to simulate their wind fields in a parametric PBL wind mode1 (e.g. Thompson and Cardone, 1996). However, it would be very difficult to use a PBL model for Hurricane Allen, since the storm had a complex meteorology, including a double eye configuration (National Ocean and Atmospheric Administration, 1980). Therefore, Hurricane Allen will be excluded from this study. However, Hurricane Allen's storm surge was the most significant at Corpus Christi since 1950; another significant storm was selected as a replacement. Two major hurricanes have made landfall within the 160 kilometers north of Corpus Christi since 1950. Due to the large surges of Hurricane Carla (1961) and Hurricane Celia (1967), which were similar in magnitude to Hurricane Allen, these hurricanes could be considered for this study. While these storms did not produce severe flooding in the Corpus Christi area, if either storm followed a more southerly track, Corpus Christi would have been greatly affected by flooding. There are no obvious geographical or climatological reasons why these storms could not have followed a more southerly track. Since Hurricane Carla was considered one of the most intense hurricanes to hit the Texas coast, this storm on a more southerly track was included in the set of storms for this study.  Lawrence and Kinberlain (2001) Each historical storm was used to verify surge model performance and was used as a base case in comparing flooding due to hurricane intensification from climate change. In order for Hurricane Carla to be used to evaluate climate change impacts, it was necessary to modify the track to follow a more southerly track. The historical track of Hurricane Carla was shifted about 130 km southwest along the coastline, which will cause the maximum hurricane surge for this event to occur in Corpus Christi. This modified track would make landfall just south of Corpus Christi, which would cause a catastrophic type storm surge scenario. By modifying the Carla track in this way, the study will now include three storms with very different intensities, tracks, and areas of flooding inundation. This modified historical storm for Hurricane Carla may be used a benchmark case and be used to compare to future intensified scenarios. For the purpose of this thesis, this modified tract of Hurricane Carla will be called \"Hurricane Carla (Shifted).\" Once again, three hurricanes are considered as present day cases which will be compared to future hurricane intensification scenarios. The set of three storms considered in this study are Hurricane Beulah, Hurricane Bret, and Hurricane Carla with a more southerly track. Additionally, these storms range in intensity and size, so the flooding inundation in Corpus Christi will also have a range of base level conditions. Hurricanes Bret, Beulah, and Carla (Shifted) will be simulated, which will show the effects of climate change. Since Hurricanes Bret and Beulah will be simulated using their historical tracks, the impacts of climate change on previous storms can be addressed. Lastly, by using the modified Hurricane Carla track, the impact of climate change on a catastrophic-type storm-surge event near the Corpus Christi area may also be considered.  (Wigley, 2004), which provided a range of monthly sea level air temperatures for 2030 and 2080 based on the assumed B1, A1B, and A1FI future climate scenarios from the IPCC. B1 is described as a world where the population grows until mid-century then declines, there is a move towards a service and information economy, and there is an introduction of resource-efficient and clean technology (UNEP, 2003). A1B is part of the A1 storyline and represents an energy system which is balanced across all sources (meaning no energy source is relied on too heavily) (UNEP, 2003). The A1FI scenario is also part of the A1 storyline and represents a fossil intensive technological emphasis (UNEP, 2003). Three possible carbon dioxide doubling sensitivities were considered (2°, 3°, and 4.5°C) for each climate change scenario. Air temperatures at sea level were assumed to equate to water SST, since studies have not found a clear difference in trends between air and sea surface temperatures (Cane et al., 1997). For each year considered in this study, there is a range of possible SST rise projections. These ranges are shown in Figure 5. Based on these projections, the SST may rise between 0.36 and 1.38°C by 2030 and between 0.96 and 5.02°C by 2080. For each degree (in Celsius) of SST rise, it is expected that there will also be an increase of approximately 8% in hurricane intensity (Knutsen andTuleya, 2004 and. This relationship was discussed in Equation 2.6 in Section 2.4. The central pressure for the future hurricane scenarios which correspond with SST rise are shown in Figure 6 below. These projections indicate that Hurricane Carla may intensify between 0.14 and 0.45 mb/yr, while Hurricanes Bret and Beulah may intensify between 0.07 and 0.32 mb/yr. Only hurricane intensification due to rising SSTs in the future is considered in this analysis; therefore, hurricane intensification between the historical event and present day has not been considered. This means that each hurricane could intensify more than the projections used in this study. Using the A1FI scenario (high rate of warming) with high sensitivity, Hurricane Carla will have a very low central pressure at landfall of 901 mb. The impacts of sea level rise (SLR) will also be considered in this analysis. The two main sources of SLR on the Texas coast are eustatic SLR, which is SLR on a global scale based on glacial and ice sheet melting and thermal expansion due to temperature increases (IPCC, 2007) and land subsidence. The climate model MAGICC/SCENGEN (Wigley, 2004) was used to project the eustatic SLR. Figure 7 shows the range of projected eustatic SLR. For example, the eustatic SLR ranges from 7.5 to 14.4 cm for 2030 and from 20.9 to 58.4 cm for 2080. However, new research suggests that eustatic SLR rise rates are higher than represented for this study (Rahmstorf, 2007), so the projected eustatic SLR rates used in this study may be lower than upper limit rates. It was also necessary to estimate the rate of land subsidence in the Corpus Christi area between 2008 and 2080. In order to do this, the historical rate of eustatic sea level rise in Corpus Christi needed to be determined. The IPCC (2007) states that the measured eustatic sea level rise rate is between 1.7 and 1.8 mm/yr. A NOAA tide gauge located in Rockport, which is about 50 km north of Corpus Christi, observed a measured sea level rise of 4.6 mm/yr from 1948 to 1999. The observed eustatic SLR from the IPCC was subtracted from the measured sea level trend in Rockport, which resulted in an estimated local land subsidence of 2.9 mm/yr. Based on this criteria, the land subsidence in Corpus Christi by 2030 will be 6.4 cm, while this amount will be 20.9 cm by 2080. This rate of land subsidence will be considered uniform for the Corpus Christi area. Additionally, no acceleration or deceleration of land subsidence with time will be considered. Figure 8 shows the projected relative (eustatic plus land subsidence) SLR, as well as the measured rated based on NOAA. Lastly, the Hurricane Bret, Hurricane Beulah, and Hurricane Carla (Shifted) sets will each include a historical storm and four projected future hurricane scenarios. Originally, each set was to include a low estimate and high estimate for the year 2030 and for the year 2080 to span the range of projections. However, it was determined that the final water levels that would be used for the GIS analysis were very similar for the high estimate 2030 and the low estimate 2080 (Mousavi et al., In Review). Therefore, the middle estimate 2080 was considered in this study. By considering the middle estimate 2080, the analysis of flooding inundation, property damages, and population affected will consider a full range of future scenarios. A summary of the scenarios included in the study are shown in Table 5. an overview of the entire research project and discuss which parts will be included in this thesis. Section 4.3 will give a brief background of ADCIRC, and Section 4.4 will address SWAN. Section 4.5 will describe the applications of XBeach. Section 4.6 will give an introduction to GIS. The process to determine flooding inundation will be explained in Section 4.7, while Section 4.8 will discuss the methodology used to determine structural property damages. Section 4.9 will describe the process to determine populations affected by the storms."}, {"section_title": "Overview of Research Procedure", "text": "This thesis will discuss the flooding inundation, structural property damages, and the number of people affected by flooding for each of the historical and future scenarios for Hurricanes Bret, Beulah, and Carla (Shifted). The work presented in this thesis is only a part of a larger research project. Figure 9 is a flow chart which shows the processes necessary to complete the larger research project. Topics which are circled have been completed by the author of this thesis and will be discussed in further detail. The other topics are in square boxes which represent elements of the project that were completed by others. While an overview is provided in this section, more details about additional aspects of the project can be found in Irish et al. (2008a) and Mousavi et al. (In Review). The first step for the entire research process was to run the parameterized PBL model (Planetary Boundary Layer Model), which provides the wind and pressure fields needed for ADCIRC and SWAN runs. ADCIRC 1 refers to the first set of ADCIRC simulations. This set of simulations produced preliminary water levels, which were then be used as inputs for SWAN and XBeach. Once the preliminary water levels were determined, SWAN was run to give wave spectra for each storm. Then the wave spectra from SWAN and water levels from ADCIRC were included as input for XBeach. XBeach modeled the barrier island morphodynamics over the course of several idealized hurricanes. The barrier island was lowered based on the XBeach morphodynamic results, and these new topographies and bathymetries were added to the ADCIRC grid. XBeach is circled and boxed, because the XBeach grids and simulations were completed by the author of this thesis but modifications of the ADCIRC grids based on barrier island lowering were provided. ADCIRC 2 represents the second set of simulations using ADCIRC. The PBL model, SWAN, and XBeach results were included as inputs for the second set of ADCIRC simulations. This set of simulations output the final, updated water levels for each hurricane. A further discussion of the hydrodynamic conditions can be found in Mousavi et al. (In Review). Once the final water levels were determined, GIS applications could begin. The water levels from ADCIRC were added to the eustatic SLR and subsidence to give the final mean tide water elevation. Therefore, the climate projections which were developed earlier were also needed for this section of the research. Although the tidal range in the Gulf of Mexico is small relative to other locations, the MLLW (mean lower low water), MSL (mean sea level), and MHHW (mean higher high water) were mapped. Therefore, the calculated tidal range was also needed as an input for the water level elevation. When the final water level elevations were added to GIS, the flooding inundation maps were created and the flooded area was calculated. Structural damages were estimated from parcel data from the City of Corpus Christi and the mean water level within each parcel. Lastly, the population affected was determined in GIS by using tract information from the U.S Census Bureau (2008) and water levels. In summary, the work discussed in this thesis is only part of a complex research project. All of the work in GIS and the XBeach simulations were conducted by the author of this thesis. The PBL model, both ADCIRC simulations, SWAN, and ADCIRC grid modifications based on XBeach results were conducted by other people working on this research project. The results of the final ADCIRC simulations were then provided to the author of this thesis, so that the project could be completed in GIS. While every step of the research project was important, the major outcome of the project was to determine the impact of climate change on hurricane flooding inundation, structural damages, and the number of people affected by flooding."}, {"section_title": "Introduction to ADCIRC (ADvanced CIRCulation)", "text": "Once the study site, hurricanes, and climate change scenarios were selected, ADCIRC (ADvanced CIRCulation) was used to determine elevated water levels associated with each hurricane (Luettich and Westerink, 2004). ADCIRC is a finiteelement hydrodynamic model which solves mass and momentum conservation equations. Here, ADCIRC was forced with ocean waves, wind, and tides to simulate storm water levels and currents (Luettich and Westerink, 2004). ADCIRC was used twice over the course of this research (discussed in Section 4.2). The first set of ADCIRC simulations used a numerical grid of 280,000 nodes which determined the "}, {"section_title": "Introduction to SWAN", "text": "When waves break in shallow water near a coastline, the water level rises above the still water elevation of the sea due to the momentum transfer (Komar, 1998). This is called wave setup and can also impact the flood levels within bays (Irish and Cañizares, 2008). Wave forcing was developed using the spectral wave model SWAN (Simulating WAves Nearshore) model (Booij et al. 1999). For this study, SWAN was used to generate and propagate waves resulting from hurricane wind forcing ultimately to determine water level contributions by wave setup and wave-induced barrier island erosion. SWAN output included nearshore directional spectra and wave radiation stress. More information about SWAN as it relates to the full research project can be found in Irish et al. (2008a)."}, {"section_title": "XBeach", "text": "As mentioned previously, it was necessary to determine the amount of barrier island lowering and breaching due to hurricanes in order to reasonably estimate both barrier island and back-bay flooding. This was accomplished with the XBeach morphological model (Roelvink et al., 2007;McCall, 2008 Roelvink et al., 2007) coast, and the y-axis is alongshore (Roelvink et al., 2007). Figure 11 shows the coordinate system used in XBeach. The grids used in XBeach are staggered, where the water depths and water levels are defined at the center of the cell, while sediment transports and velocities are calculated in cell interfaces (Roelvink et al., 2007). Figure   12 shows a schematic of the staggered grid. Figure 12. XBeach Staggered Grid (From Roelvink et al., 2007) Several governing equations are required to simulate morphological change within XBeach. These governing equations include short wave equations, roller-energy balance which is used to model energy from breaking waves, shallow water equations, sediment transport, and bottom updating. The XBeach model uses the following shallow water equations, which neglect Coriolis and horizontal diffusion terms as follows: where h d is the water depth, u is the velocity in the x direction, v is the velocity in the y direction, g is the acceleration due to gravity, τ bx and τ by are the bed shear stresses, η is the water level, and F x and F y are the wave radiation stresses (Roelvink et al., 2007). Sediment transport is also very relevant to this study. For sediment transport, the XBeach model uses a depth-averaged advection-diffusion equation which is as follows: where C is the depth-averaged sediment concentration, u E and v E are the Eulerian shallow water velocities, D h is horizontal diffusion, C eq is the equilibrium concentration, and T s , is adaptation time (Galapatti, 1983). The Soulsby-van Rijn formulation is used to calculate the equilibrium concentration: where A sb are the bed load coefficients, A ss is the suspended load coefficient, and represents the drag coefficient (Soulsby, 1997). Both A ss and A sb are functions of the water depth, relative density of the sediment, and the sediment grain size (Soulsby, 1997). The combined Eulerian and orbital velocity need to exceed a threshold value, u cr , in order to set the sediment in motion, and the bed slope effects are described in the last term of Equation 4.5 (Soulsby, 1997). In order to run XBeach simulations for this study, several steps needed to be A standard sieve analysis was conducted, and it was determined that the mean sediment grain diameter, d50, was 0.217 mm and, d90, where 90% of the sediment passed through the sieve was 0.345 mm for the sediment. This information is shown in Figure 13 and is The XBeach analysis includes the morphological effects on the barrier islands due to hurricanes. This is important, because these effects (flow over island, breaching) could greatly increase the area of flooding on the mainland. In order to predict the morphodynamic effects on the barrier island, one could expect that grids including the elevations for every section of the barrier island would be created. However, the amount of flooding inundation in Corpus Christi could be attributed to morphological effects on barrier islands over 100 km away. Also, XBeach simulations are computationally intense; for example, one XBeach simulation with waves and water levels corresponding to Hurricane Carla for a 1 km stretch of the barrier island could take up to 10 days to finish. Due to time constraints, several idealized grids with representative characteristics of certain areas of the barrier island near Corpus Christi were used to estimate the morphodynamic effects. It was also assumed that the future barrier island can be represented by the present barrier island conditions, meaning the dune elevation on the barrier island can keep up with rising sea level (Dean and Maurmeyer, 1983;Bruun, 1962). The XBeach grids for the Corpus Christi area were built using information from two different sources. The high resolution ADCIRC grid (mentioned previously) provided bathymetries in the nearshore Gulf of Mexico and in Corpus Christi Bay. However, the ADCIRC upland grid resolution was too coarse to adequately resolve the barrier island to predict morphological change. Therefore, the barrier island topographies were collected from the USGS 10 m topography for the City of Corpus Christi. LIDAR data from the USGS was also considered, but the coverage was not sufficient in the Corpus Christi area. A series of profiles in GIS were made across the island and the maximum dune height, distance across the dune, and other distinguishing characteristics were recorded. These profiles were then classified into five categories based on the width of the island, dune characteristics, and location at each cut. These classifications are shown Figure 15 Christi Bay or the Intracoastal Waterway. Area 2, however, has no protective dune and the elevation is relatively constant across the entire width of the barrier island. These characteristic features are shown in Table 6 below. Areas 2 and 3 are further classified as wide and narrow. For example, the distance between the ocean and bay for Area 2 wide is 3095 m, while it is only 740 m for Area 2 narrow. The morphological effects due to the hurricanes are very different for these two barrier island widths, so it was necessary to consider a wide and narrow barrier island. While Area 2 narrow is a very small section of the barrier island system, this is the section where breaching is most likely to occur. The profiles from Area 1 were all very similar in distance between the bay and ocean, so a narrow and wide classification was not necessary. Then each idealized grid was created based on the topographic and bathymetric information. In the cases where the topography varied alongshore (Areas 1 and 3), a weak location of low dune elevation was created (based on the profiles taken for the island) to account for the possibility of severe overwash and breaching at the weak point on the barrier island. Figure 16 shows a 3D picture of one of the idealized grids. Another requirement for XBeach was the hydrodynamic conditions during the course of the simulation. Hydrodynamic conditions (waves and surge) corresponding to the historical storm and the storm related to a sea surface temperature increase of 5.23°C for Bret, Beulah, and Carla were normalized, aligned, and averaged which resulted in the idealized hydrodynamic conditions used for XBeach. Two different locations, an offshore boundary and a bay boundary, were chosen for analysis. The water levels for both locations came from the preliminary ADCIRC simulations. The spectrally-based wave heights and peak periods modeled with SWAN were used. The values from ADCIRC and SWAN were normalized using each time series' maximum value, then the peaks of the normalized time series were aligned and the normalized time series were averaged. In order to produce the time series for the idealized water levels for the ocean and bay locations and the waves, the normalized hydrograph was multiplied by the peak surge or peak wave height of interest for the simulation. Once the hydrodynamic conditions and the morphological conditions corresponding to a hurricane were selected, XBeach simulations could be completed. Each simulation was run for 44 hours to capture the morphological response, with the peak water levels and wave height occurring around the 23 rd hour. Four idealized hydrodynamic conditions (see Section 5.2) were simulated for each morphological area using XBeach. After each simulation was completed, the morphological results were viewed and dune lowering amounts were calculated. Since only four hydrodynamic conditions that span the hydrodynamic conditions of all of the storms were simulated in XBeach, an interpolation procedure was conducted to determine the morphological effects for the hydrodynamic conditions corresponding to each storm. The dune-lowering lookup tables were developed by mapping initial dune elevations for each hydrodynamic case and each morphological area with their respective lowered amount. Finally, the barrier island elevations in the ADCIRC grid were lowered based on the dune lowering look-up tables where the specific lowering amount was interpolated based on the desired hydrodynamic condition for surge simulation. When the ADCIRC grid elevations were lowered, sediment was removed from the dunes and moved landward to account for conservation of mass. These ADCIRC grids with modified topographies were used in all of the final ADCIRC simulations. More information about the barrier island lowering and the modified ADCIRC grids can be found in Irish et al. (2008a)."}, {"section_title": "Geographic Information Systems (GIS)", "text": "The majority of the work on this thesis was done in GIS (Geographic Information Systems). GIS is described as database management system which includes geographic information. GIS also integrates hardware and software with data which can be analyzed and displayed for all forms of geographically reference information (ESRI, 2009 "}, {"section_title": "Quantification of Flooding Inundation Using GIS", "text": "Before the latitude, longitude, and surge level for each ADCIRC node could be added in GIS, some work needed to be done in a spreadsheet. Since the grid consisted of approximately 1.3 million nodes, it was only necessary to consider nodes in the nearshore region and on land near Corpus Christi. Before the tides could be considered, some work was done in GIS to determine flooding only based on ADCIRC surge calculations. Since the tides are different in the bay than the ocean, a selection was done to classify the locations inside the bay separately from those in the ocean. The total water levels in GIS consisted of the ADCIRC water level, tides, eustatic sea level rise, and subsidence. However, it should be mentioned here that while eustatic SLR will be uniform across the entire study area, water levels in future storms will vary spatially due to relative SLR. For example, the water levels associated with a future hurricane once sea levels have risen 79.4 cm will not necessarily be equal to the water levels of an identical hurricane in present day plus 79.4 cm. A further discussion of this effect can be found in Mousavi et al. (In Review). In order to account for the impact of astronomical tide variation, calculations were done three times, so a low tide (MLLW), mean sea level (MSL), and high tide (MHHW) scenario could be used for each hurricane scenario. Figure 17 is a flow chart highlighting the steps to determine the final water levels for GIS. 2008) was used to appropriately determine the flood depth with respect to the ground elevation. The NED is a digital elevation model (DEM) in raster format with a cell size of 10 meters. Upon further review of this information, it was determined that the elevations were calculated with respect to the NAVD88 datum (USGS, 2006), while the ADCIRC flood levels were with respect to MSL. Therefore, the NED was vertically shifted to the MSL tidal datum using the raster calculator. NOAA 2007b   home. This damage relationship was used in this study. As Figure 19 shows, the expected percent of building damage is different for one story homes versus two story homes. However however, the foundation is built between 1.5 and 2.7 m above MSL (based on visual observations during site visits). Although the homes are built up slightly, they are directly on the water, so the morphological impact of the largest storms will most likely completely destroy the homes on the islands. Complete destruction of homes on the barrier island was not considered in the property (structural) damages estimates. For the purpose of this thesis, Figure 19 was used for the homes on the island. It is possible that the hurricanes that completely inundate the barrier island could destroy every home on the island as was the case on Bolivar Island during Hurricane Ike (Hanna, 2008). If this is considered, the cost of damages on the barrier island alone could reach $1.36 billion. Finally, homes in Texas rarely have basements, so it is assumed that no homes have basements in this analysis. In addition to residential structures, there are also oil refineries north of Corpus Christi and high-rise buildings in the downtown area. Although extensive research was conducted to determine the amount of damage a refinery or a high rise building would sustain during a storm, no additional publicly available information was uncovered. Therefore, the two story estimate damage table was used to approximate damage to refineries. Electrical systems and other necessities are often located on the ground floor of a high-rise building. Therefore, most of the damage would occur on the lower floors. For the purpose of this thesis, the percent of building damage for a two story building was used to estimate the damages of a high-rise building. however, for the shifted track of Hurricane Carla, there was not as much of an impact because the storm surge was much higher. Lastly, it was determined that the value of each parcel listed in the parcel data from the City of Corpus Christi included both the land value and the structure value. The flood estimation charts from FEMA only consider damages to structures, so it was necessary to determine the \"structures only\" value of each parcel. While the parcel data does not divide the parcel value into land and structure, the City of Corpus Christi's webpage gives this additional information. First, the City of Corpus Christi was divided into five categories: oil refineries, downtown, one story homes on the mainland, two story homes on the mainland, and the barrier island. For each of these categories, several parcels were selected at random to be considered as representative of the category. The total, structure only, and land only values were added together for all parcels in a certain category. Based on these calculations, a structure only percentage of total value was determined. For the downtown region and the barrier island, some parcels are located directly on the water while other parcels do not have water access. A parcel located directly on the water would have a substantially higher land value than a parcel of the same size not located directly on the water. Therefore, a percentage representing structure's value of the total value was calculated for parcels on the water and parcels on land for the downtown region and the barrier island. Table 7 show the percentages associated with each category. In order to calculate the property damages for structures only, a few more steps needed to be taken in GIS. Originally the parcels were divided into new shapefiles for one and two story homes for the zonal statistics process. Now it was necessary to make new shapefiles for downtown on the water, downtown inland, oil refineries, barrier island inland, and barrier island on the water. Since the two story included refineries and downtown and the one story included homes on the barrier island, the one and two story shapefiles needed to be recreated. By doing this, all of the parcels in a certain category were listed together. Then the economic analysis could be conducted for each category for each scenario. Once the economic analysis was completed, the total property damages were multiplied by the percentage representing the structures only value compared to the total value which gave the total structural property damages for each category. In the analysis, one and two story buildings were combined and considered as residential on the mainland. Since the barrier island and the downtown region used two different classifications, the total structural damage for the parcels on water and inland could be added together to get the total structural damage for the barrier island and downtown region. This cost analysis procedure was conducted for low (MLLW), mean (MSL), and high (MHHW) tide cases for each hurricane scenario. Economic damage results are presented and discussed in the following section. The economic damage only includes damage to homes and buildings. There is no information about roads or power lines, so those damages were not calculated. The damages due to wind, moving water (e.g. surge related waves), and erosion were not considered. Also, the values provided from the City of Corpus Christi (2008) represent appraised values. During a visit to Corpus Christi, real estate fliers were collected to establish the listed values. About 10 properties on the barrier island were used to determine the relationship between the listed price and the appraised price. From this collection of properties, it was determined that the cost of damages using the listed values of homes would be approximately 37% higher. Also, the economic estimates are in 2008 dollars, so inflation was not considered. Although population growth is expected in Corpus Christi, the estimated property damages only include homes currently in Corpus Christi. Due to these assumptions, it is likely that the actual economic damages for these storms would be higher than the estimated damages."}, {"section_title": "Quantification of Population Affected Using GIS and MATLAB", "text": "Although flooded area and economic (structural property) damages give much insight into the impacts of each hurricane, it is difficult to determine the number of people who would be affected by a storm. Therefore, it was deemed necessary to develop a method to estimate the number of people who would be affected by each hurricane scenario. In order to estimate these results, information was collected from several United States Census directories. First of all, a list of different tracts located in Nueces County was collected from American FactFinder (United States Census Bureau, 2008). This information includes the population in each tract. Figure 20 shows the tracts in Corpus Christi. Once all of this information was put together, it was possible to determine the number of people affected by each storm. It is also important to note at this point, that the population numbers by tract used in this analysis come from the 2000 census; there are no more recent population numbers by tract available. However, the total population in Corpus Christi during the 2000 census was given as 277,454. The total population of Corpus Christi grew less than 1% to 278,384 in 2007(American FactFinder, 2008. Since these populations are so similar, it is expected that the populations by tract should not increase drastically between 2000 and 2007. Once the total population for each tract was collected, the shapefile of the tracts in Nueces County was added to GIS. For this analysis, the population in each tract was assumed to be uniform. Although this uniform condition is unlikely, especially in tracts which are located partially on the coast, the census information did not provide the detail of information needed for a more accurate analysis. The shapefile for the tracts was then Figure 20. Map of Corpus Christi with Tract Information (U.S. Census Bureau, 2008) intersected with the parcel only flooded area shapefile. The newly created shapefile included the parcel information for each flooded parcel as well as the tract information. The total area (in square kilometers) was calculated per parcel. This shapefile was exported to a spreadsheet, where the area of each parcel in a particular tract was added together to find the total area affected by flooding in each tract. however, this category would be considered to have negligible damage. The second category includes up to 0.9 m (3 ft) of flooding above the foundation. The 0.9 m (3 ft) above the foundation was chosen as a cut-off point, since the percentage of building damage for two story buildings begins to level off at that point (see Figure 19). This category could be considered as minimal damage. A third category of flooding damages is between 0.9 m and 1.5 m (3 and 5 ft). After 1.5 m (5 ft) for the one story buildings, the "}, {"section_title": "Summary of Models and Methods", "text": "This section details the physics-based numerical models and the applications of GIS. The first set of ADCIRC simulations produced preliminary water levels. These water levels were used as inputs for SWAN and XBeach. XBeach was then used to estimate the morphological effects of the hurricanes on the barrier islands. A barrier island lowering lookup chart was developed and modified ADCIRC grids were used for the final set of ADCIRC simulations. The final water levels from ADCIRC, subsidence and eustatic SLR rise, and tides were considered to determine the water levels for GIS. Flooding inundation maps were created, while flooding inundation areas, property damages, and the number of people affected by flooding were calculated for each scenario for Hurricanes Bret, Beulah, and Carla (Shifted). Section 5 will provide and discuss the results of historical and intensified scenarios for Hurricanes Bret, Beulah, and Carla (Shifted)."}, {"section_title": "RESULTS", "text": ""}, {"section_title": "Idealized Hydrodynamic Conditions and Barrier Island Lowering Using XBeach", "text": "All of the hydrodynamic conditions used for the XBeach simulations were idealized (methodology explained in 4.5).   Irish et al., 2008a) in Figure 25. These new barrier island elevations were applied to the ADCIRC grid. For these Hurricane Beulah cases, the area that seems to be the most vulnerable to morphological effects is Area 1. The dunes in Area 1 are low, while the barrier island is narrower than some of the other locations. Additionally, Area 2 (narrow), which is located to the north of Aransas Pass, is vulnerable to breaching during all of the Hurricane Beulah and Hurricane Carla (Shifted) simulations within ADCIRC. As the intensity of the hurricane increases, the dune lowering predicted also increases. This will cause more surge to move into Corpus Christi Bay, which will cause an increase in flooding inundation and property damages. Examples of the applied grids are shown in   While a map comparing all of the scenarios is very informative, one can see more detail by only comparing the Present  and the High Estimate 2080 cases. This is shown in Figure 29. By comparing these two cases, it is very easy to see that the new flooding occurs at the very northwestern part of Corpus Christi, in the downtown area, and on Mustang and Padre Islands. Although the High Estimate 2080 case has been intensified, relative sea level rise (subsidence and eustatic) is also considered. The Present  case represents no relative SLR, while a relative SLR of nearly 80 cm is used for the High Estimate 2080. Since the water levels are low compared to Hurricanes Beulah and Carla, the effects of SLR are the greatest for the Hurricane Bret intensification. The cost of property damages was also estimated for each of the Bret scenarios. The property damages (structural damages only) for the Present Day (2008) scenario were estimated to be about $7,500,000, while the estimated property damages for the High Estimate 2080 cases were about $286,000,000. Additionally, it is important to note that the Present  scenario causes very minimal damage. While the High Estimate 2080 case costs over 35 times the Present  case, this number is still small relative to larger storms. However, it is possible that with higher sea surface temperatures, the smallest storms will still cause a considerable amount of damage. There is also a large increase in the cost of property damages between the High Estimate 2030 and the Middle Estimate 2080 (almost $100,000,000 more in damages during the Middle Estimate 2080 storm). This is reasonable since the area of flooding inundation increases from about 50 square kilometers to about 85 square kilometers. Additionally, an analysis was conducted to determine the total population affected by each of the storms.  foundation, between 0.9 and 1.5 m (3 to 5 ft) above the foundation, between 1.5 and 2.4 m (5 to 8 ft) above the foundation, and more than 2.4 m (8 ft) above the foundation. By doing these addition calculations, a more detailed analysis can be conducted. The results for Hurricane Bret are also shown in Figure 30. First, the number of people affected by water on their property but not in their home or other structure increases from Present  to the High Estimate 2030, but decreases after the High Estimate 2080. One reason for this increase then decrease is the surges increase more dramatically between the 2030s and 2080s. A much higher surge on the barrier island would mean that a higher number of people would be affected by more than just water on their property. The number of people affected by 0 to 0.9 m (0 to 3 ft) and 0.9 to 1.5 m (3 to 5 ft) of water above the foundation more than triples between Present Day (2008) and High Estimate 2080. As can be seen in the figure, the Present  case has almost no people affected by more than 1.5 (5 ft) of water. In the High Estimate 2080 case, over 700 people are affected by flooding between 1.5 and 2.4 m (5 and 8 ft). The High Estimate 2080 is the only case where people would be affected by more than 2.4 m (8 ft) of water, but since this number is so small (about 10 people), it shows that this amount of flooding is very isolated."}, {"section_title": "Climate Projections for Hurricane Beulah", "text": "Hurricane Beulah is the middle storm in this analysis. Once again, the Present   scenario is mostly on the Gulf of Mexico side. This means that the water has either destroyed the dunes or the water is flowing over the dunes. It should also be mentioned Figure 32. Comparison of Flooding Inundation for Hurricane Beulah Present  and High Estimate 2080(Aerial Photography From TNRIS, 2008 that the High Estimate 2080 scenario included a relative SLR of nearly 80 cm. While this is a very significant increase in water level, SLR will not affect the Beulah scenarios as much as the Bret scenarios. The cost of property damages was also estimated for each of the Beulah scenarios. The property damages for the Present     storm is still very costly, a storm intensified to the High Estimate 2080 scenario would be very destructive. Although $499,000,000 does not seem that costly for a storm, these numbers are slightly deceiving because this amount only considers structural damages in the City of Corpus Christi. The cost of this storm would be much higher when including all locations affected. The total number of people affected by each Hurricane Beulah scenario was also calculated. The population affected by flooding nearly doubles between the Present Day (2008) case the High Estimate 2080 case (13,900 people to 26,100 people). Based on Figure 33, there is a larger jump in the number of people affected by flooding between the High Estimate 2030 and the High Estimate 2080 than the Present  and the High Estimate 2030 cases. Also, if the 2080 storms were to occur, nearly 10% of the population of Corpus Christi would be affected. Since the barrier island is almost completely inundated in all cases, all of the residents of the islands would be urged to leave. These 2080 storms could begin to cause evacuation problems, since other communities on the coast in addition to Corpus Christi would be advised to leave.  TNRIS, 2008) mainland. This is significant because these are residential locations. Even though the barrier island is completely inundated in the Present  case, each intensified scenario will bring higher surges over the island. This will cause even more property damages on the island and will bring more water into Corpus Christi Bay. Once again, the flooded area increases more between the High Estimate 2030 and the High Estimate 2080 than between the Present  and the High Estimate 2030. When comparing only the Present  case and the High Estimate 2080 case, much more detail can be seen for the flooded locations. This is shown in Figure 35. For example, there is not much new flooding in the northwestern parts of Corpus Christi. However, there is a significant increase in the amount of flooding inland of downtown Most of this new flooding occurs due to the rise in surge in Oso Bay and the flow of this surge into Oso Creek. This is also a highly populated area of Corpus Christi, so a storm with the intensity of the High Estimate 2080 would be catastrophic for the City. Additionally, a small part of the mainland directly on Corpus Christi Bay does not experience much flooding, since this location is on a bluff. A cost analysis confirms the idea that all of the Carla (Shifted) scenarios are catastrophic. The Present  scenario would cause just over $1 billion in damages, while the High Estimate 2080 would cause $2.1 billion in damages. Although the cost between these storms only doubles, the increase in the damages of these storms is significant. The High Estimate 2030 scenario would cause about $1.3 billion in damages, so the increase between 2030 and 2080 is much greater than the increase between present day and 2030. Although the intensification of the storm between 2030 and 2080 is very significant, relative (subsidence and eustatic) sea level rise also contributes to the addition flooding and damages. However, the relative SLR is small compared to the total water levels for all of the Carla (Shifted) scenarios. It is also important to realize that these numbers reflect only the structural damages in the City of Corpus Christi. A hurricane of the magnitude of the shifted Carla cases would cause tens of billions of dollars in damages. An analysis of the total number of people affected by the floodwaters in Corpus Christi was also conducted. As can be seen in Figure 36, the number of people affected by any of the Carla scenarios is extremely high. However, the number of people affected by flooding nearly doubles between the Present    Although flooded area between each scenario for a particular storm was already analyzed, it was also necessary to compare the flooded area between hurricanes. Bay is located on a bluff, these areas will be protected from the surge of smaller storms. Additionally, the barrier island is very low-lying (a maximum elevation of 1.25 m in some areas). For the Present  Hurricane Bret scenario, not much of the barrier island is flooded. Over the course of this intensification, the barrier island becomes more flooded, which attributes to the rapid increase in inundation area per degree of SST rise. The barrier island is nearly completely inundated for the Present Day (2008) HurricaneBeulah storm and is completely inundated for all of the Hurricane Carla (Shifted) storms. For this reason, all or nearly all of the flooding area inundation increases occur on the mainland. Since much of the City's mainland is protected by a bluff and is at a higher elevation, the rates of increases of inundation area will not be as significant as for the Hurricane Bret cases. Also, between Present  and the 2030s (considering Low and High Estimates) the flooding inundation increases between 1.2 and 1.6 times. Between Present  and the 2080s, flooding inundation increases 1.6 to 3.7 times. Although a Low Estimate 2080 was not considered in this analysis, the flood levels for the High Estimate 2030 case and a Low Estimate 2080 cases were very similar. For this reason, the flooding inundation increase between Present  and the Low Estimate 2080 was considered to be the same as the increase between Present  and the High Estimate 2030. For Hurricane Beulah, the increase between Present  and the 2030s was between 1.1 and 1.2 times, while the increase was between 1.2 and 1.8 times by the 2080s. The same calculations were conducted for Hurricane Carla (Shifted), and the increase between Present  and the 2030s was between 1.02 and 1.06 times and the increase between Present Day (2008) and the 2080s was between 1.06 and 1.25 times. Based on these results, the increases in the amount of inundation decrease as the historical storm's intensity increases. The reason for this trend is, once again, due to the topography in the Corpus Christi area (low lying barrier island, bluff protecting mainland). Hurricane Beulah and Carla (Shifted) increase by $75 million and $210 million per degree of SST rise, respectively. Although Hurricane Carla (Shifted) had the greatest increase in the value of property damages per degree of SST rise, the property damages for these storms have the smallest increase relative to the historical storm. For example, between the Present  storm and the 2030s, the property damages increase by 1.1 to 1.3 times; between Present  and the 2080s, the property damages increase 1.3 to 2.1 times. For the Hurricane Bret scenarios, the property damages increase between 2.5 and 5 times by the 2030s and between 5 and 50 times by the 2080s. Lastly, the property damages increase between 1.5 and 2 times by the 2030s and between 2 and 4.3 times by the 2080s for the Hurricane Beulah scenarios. The reason the results seem conflicting has to do with the damage costs of each set of storms. For example, Hurricane Bret's damages only ranges from $7.5 million to $286 million. Since these numbers are small relative to Hurricane Carla (Shifted), it makes sense that the property damage increase in dollars for each degree of SST rise will be much smaller. On the other hand, the intensified Hurricane Bret scenarios had the greatest increase in the cost of damages compared to the cost of the historical storm, since the historical storm was so small. Since the present day storm had less than $10 million in damages, comparing this to any number will produce dramatic results. However, even the Present  Hurricane Carla (Shifted) results in over $1 billion in damages, so it would not be possible for the damages to increase between 5 and 50 times like the Hurricane Bret scenarios. Although the cost of property damages only doubles between the Present     The same analysis was conducted for the oil refineries. As can be seen in Figure   40, the oil refineries are in a less vulnerable location for all of the Hurricane Bret and Beulah storms, since less than 10% of the parcels affected in all cases. For the Present  Hurricane Carla (Shifted) case, over 10% of the parcels are affected by flooding inundation. By the High Estimate 2030 scenario, this number jumps to over 20%. The High Estimate 2080 cases flooded about 50% of the oil refinery parcels. This amount of damage could potentially stop production in these refineries for an extended period of time. Therefore, the oil refineries are less vulnerable for intensified smaller storms, but even a present day case for Hurricane Carla (Shifted) would be catastrophic. A catastrophic event like any of the Hurricane Carla (Shifted) scenarios could cut off production and cause major damages to the oil refineries in Corpus Christi.   flooded. However, it should be noted that although the inundation area does not increase much, the depth of the floodwaters will be significantly higher for the intensified scenarios of Hurricane Carla (Shifted). The total number of people affected by each of the hurricanes was also compared. Figure 43 shows the total number of people affected by each hurricane. The Present  Hurricane Carla (Shifted) affected about ten times more people than Hurricane Bret Present  and about four times more people than Hurricane Beulah Present . While the number of people affected by a storm increases at similar rates for Hurricanes Beulah and Carla (Shifted), the number affected by Hurricane Bret increases three times between the Present   The same type of analysis was conducted for the population classifications.  Hurricanes Bret and Beulah. Since the depth of flooding is so much greater for a larger number of people, it makes sense that the Hurricane Carla (Shifted) scenarios cause so much more damage than the Hurricane Bret and Beulah scenarios."}, {"section_title": "Discussion of Other Factors", "text": "Although this topic was researched as accurately as possible, there are still several variables that could affect the results of this research. First of all, the economic damages only included damages to structures. This means that damages to roads, parks, land, beaches, power lines, and other public infrastructure are not considered. Additionally, wave and wind action are not considered in this analysis. Therefore, standing water in homes is the only damage considered. Secondly, while damages to oil refineries are included, revenue lost due to closure of the oil refineries is not included. Closure of oil refineries for an extended period of time could hurt not only the City of Corpus Christi, but could also affect the country in terms of gas prices and the economy. The hurricane season runs from June to November, which also includes the peak tourist season. Should a hurricane make landfall at Corpus Christi, extensive damage to the beaches would be expected. It is likely that these beaches would be closed for a period of time for clean up and recovery. Lost revenue due to fewer tourists after a hurricane is not included in this analysis. During a particularly strong hurricane like an intensified Hurricane Carla shifted scenario, surge will completely inundate the barrier island. If this occurs, it is likely that the sediment on the barrier island will shift. Considering the shifting of sand and rapid movement of water over the barrier island, the homes on the barrier island will have much more damage than only flooding damages. It is possible that all homes on the barrier island could be completely destroyed. The total structural value of all of the homes on the barrier island is approximately $1.35 billion. For these catastrophic storm events (all of the shifted Hurricane Carla scenarios), it may be more realistic to consider total damages on the barrier island. One recent example of complete damages is Hurricane Ike, which completely destroyed all but one home in Gilchrist, Texas (Hanna, 2008 Christi was hit by two deadly hurricanes in 1916 and 1919, which resulted in the building of the seawall and breakwater. The seawall is about 5 m high, which was about 1 m higher than the surge of the 1919 hurricane (Givens, 2007). Due to the existence of the seawall, there is not much flooding in downtown Corpus Christi for many of the storms in this analysis. Figure 46 shows a view of Downtown Corpus Christi from the Oso Bay is very low lying (Figure 47), which can be seen by the large scale flooding on the maps. However, if addition protection was to occur here, this area would likely not have as much flooding. The barrier island itself protects the mainland area, so the barrier island feels the full effects of a hurricane. However, Mustang and Padre Island have very little protection. While dunes are natural protection for the islands, some of the dunes Figure 47. View of Oso Bay in Corpus Christi have been destroyed in the locations of homes. The homes on the bayside of the island are located directly on the water, which is shown in Figure 48. These homes have no protection from rising water, and a hurricane would easily inundate the first floor of the homes. Although most of the barrier island has no protection, there is one small seawall which protects a series of condos on Padre Island. While there are no plans for additional man-made structures currently, given population growth on the coast, it is probable that there will be new man-made features for protection in the next 72 years. Once again, the cost and effects of additional protective structures on the barrier island have not been considered in the study for this thesis.   Dunes, 2009) are already in the works. This community in particular will start building about 100 homes and several condos on the Gulf of Mexico side of the island very soon. There will likely be many more communities like this in the future. New homes are not considered in the damage assessment. As more developments are built, more people will also come to the Corpus Christi area. Since there are no projections as to the amount of growth expected in the Corpus Christi area, population growth was not taken into account for the analysis in this thesis. It is also important to mention that the populations used in this analysis came from the 2000 census. However, there has only been a slight growth in the Corpus Christi area between 2000 and 2007. It is also important to mention that there are other sources of errors in this study. For example, the sea surface temperatures and eustatic sea level rise values for future scenarios are projections. These values may prove to be incorrect in the future. Subsidence rates were based on historical relative and eustatic SLR and were considered to be steady. It is highly unlikely that subsidence rates will remain constant until 2080. Also, the estimations of future hurricane intensity may not accurately reflect potential future conditions. Additionally, the barrier island lowering was idealized, which means that the barrier island may not react to hurricane scenarios as expected. There could also be some physics-based modeling errors. Although the GIS analysis was conducted as accurately as possible, there are several times in the GIS process that could contribute to errors. First, the total area flooded was determined from GIS calculations. These calculations could include small errors in total area flooded and errors due to the resolution. In the flooding inundation analysis, flooding is considered as flooding from the hurricane surge and flooding from sea level rise. This means relative SLR is considered within the flooded area for hurricane flooding. However, locations within the range of relative SLR would already be affected by flooding and damages would already be estimated. Since the flooding inundation in this study includes both relative SLR and surge from hurricane intensification, the actual flooded area and property damages from the hurricane's surge would be less than presented. During the structural damage analysis, the mean depth of flooding is considered as the depth of flooding inside a home. While this should be a reasonable assumption for most parcels, there could be some parcels where the home is located in the corner of a parcel or on a hill. A parcel may average 1 m of flooding, but the home could be built on a hill where there is no flooding. Some parcels only flooded in some locations, so a home built in the corner of the parcel may not be flooded. Also, the structural values for each home were unknown, so the structural values were determined to be a certain percentage of the total value (structure and land). Since these structural values were estimated, this could also be a source of error."}, {"section_title": "SUMMARY AND CONCLUSIONS", "text": "Hurricanes Bret, Beulah, and Carla were selected as the three historical hurricanes for this analysis. A set of intensified scenarios for each hurricane were chosen to show the impact climate change has on hurricane flooding inundation, property damages and population affected. Water levels from ADCIRC simulations which included the impact of storm morphodynamics were used to determine flooding for each scenario, and flooding inundation maps were developed using GIS. Additional analyses were conducted to determine the cost of property damages and the number of people affected by each storm. As expected, as the hurricanes were intensified and the sea level rose, the water levels were higher and the area of flooding inundation also increased.  "}]