[{"section_title": "Abstract", "text": "Livestock manure can be a significant source of greenhouse gases (GHG) including methane (CH 4 ) and nitrous oxide (N 2 O). However, GHG emissions are strongly affected by the type of waste management system (WMS) used. For example, CH 4 emissions increase substantially under anaerobic conditions that occur in many WMSs. There is a need for improved estimates at regional and national scales of the effect of WMSs on GHG emissions and identification of opportunities and associated costs to mitigate these emissions. As New York State is the fourth largest dairy producer in the country, our objectives were to quantify (i) the changes in WMS and associated GHG emissions over time, (ii) a methane conversion factor (MCF) derived from existing data from three covered manure storage units in New York, and (iii) the benefit and cost of installing covers and flares to destroy CH 4 from existing storage units. We found that GHG emissions from changing manure management increased from 0.7 Tg carbon dioxide equivalents per year (CO 2 e yr ). Jenifer L. Wightman and Peter B. Woodbury* S ociety increasingly expects agriculture to produce food in a manner that maintains environmental quality. In the past, daily spreading of manure was common, leading to a high potential for nutrients in manure to contaminate surface waters, particularly during fall or winter when crops are not growing and frozen ground increases surface runoff of nutrients to streams (Williams et al., 2011) . To address water quality, manure is often stored in a solid mound or in a liquid storage unit (liquid-slurry, deep pit, or anaerobic lagoon) for many months so manure can be spread on dates closer to when crops can take up the nutrients, reducing the potential for pollution of surface and groundwater. In most cases the cost for these infrastructure improvements is borne by the farm.\nHowever, without aeration, stored liquid manure quickly becomes anaerobic, promoting conditions for conversion of the volatile solids (VSs) to CH 4 (reviewed by Kebreab et al., 2006) . On a 100-yr scale, CH 4 is a greenhouse gas (GHG) that is 34 times as potent as carbon dioxide (CO 2 ); on a 20-yr time scale CH 4 is 86 times as potent as CO 2 (Myhre et al., 2013), making it an even more important target for near-term GHG mitigation efforts (Shoemaker et al., 2013) . In contrast, anaerobic conditions can reduce the production of nitrous oxide (N 2 O) from the nitrogen (N) in the manure. As N 2 O is 298 times as potent as CO 2 (100-yr timescale; Myhre et al., 2013), CH 4 and N 2 O must be considered when evaluating the GHG from a change in manure management systems.\nManure management can be responsible for a large fraction of national agricultural emissions for countries reporting to the United Nations Framework Convention on Climate Change (Chadwick et al., 2011) . Despite their increasing prevalence, there are few measurements of CH 4 emissions from uncovered dairy manure storage units (lagoons, other earthen storage units, or concrete or metal storage tanks; Lory et al., 2010; Owen and Silver, 2015) . We use earthen storage units as a general term for storing manure (liquid or liquid-slurry) in the ground for >6 mo (see Supplemental Table S2 for USEPA definition of waste management system [WMS] \nJournal of Environmental Quality\n• Increased anaerobic storage of manure has doubled GHG emissions from manure management.\n• Methane accounts for >80% of emissions from manure management.\n• Based on three trials, separated liquid manure storage was estimated to have a MCF of 0.61.\n• Capture and flare of CH 4 is estimated at $0.005 per liter of milk.\nLivestock manure can be a significant source of greenhouse gases (GHG) including methane (CH 4 ) and nitrous oxide (N 2 O). However, GHG emissions are strongly affected by the type of waste management system (WMS) used. For example, CH 4 emissions increase substantially under anaerobic conditions that occur in many WMSs. There is a need for improved estimates at regional and national scales of the effect of WMSs on GHG emissions and identification of opportunities and associated costs to mitigate these emissions. As New York State is the fourth largest dairy producer in the country, our objectives were to quantify (i) the changes in WMS and associated GHG emissions over time, (ii) a methane conversion factor (MCF) derived from existing data from three covered manure storage units in New York, and (iii) the benefit and cost of installing covers and flares to destroy CH 4 from existing storage units. We found that GHG emissions from changing manure management increased from 0.7 Tg carbon dioxide equivalents per year (CO 2 e yr −1 ) in 1992 to 1.6 Tg CO 2 e yr −1 in 2012. We derived an MCF of 0.61 based on data from dairy manure storage units with covers that captured and flared CH 4 in 2010 and used this MCF to project GHG reductions for a statewide mitigation scenario in year 2022. This scenario, covering and flaring CH 4 from 662 manure storage units, mitigates 1.8 Tg CO 2 e annually or 62% of manure GHG (CH 4 and N 2 O) at an estimated cost of $224 million ($0.005 L −1 milk or $13 Mg CO 2 e −1\n).\nNew York Dairy Manure Management Greenhouse Gas Emissions and Mitigation Costs (1992 Costs ( -2022 Jenifer L. Wightman and Peter B. Woodbury* S ociety increasingly expects agriculture to produce food in a manner that maintains environmental quality. In the past, daily spreading of manure was common, leading to a high potential for nutrients in manure to contaminate surface waters, particularly during fall or winter when crops are not growing and frozen ground increases surface runoff of nutrients to streams (Williams et al., 2011) . To address water quality, manure is often stored in a solid mound or in a liquid storage unit (liquid-slurry, deep pit, or anaerobic lagoon) for many months so manure can be spread on dates closer to when crops can take up the nutrients, reducing the potential for pollution of surface and groundwater. In most cases the cost for these infrastructure improvements is borne by the farm.\nHowever, without aeration, stored liquid manure quickly becomes anaerobic, promoting conditions for conversion of the volatile solids (VSs) to CH 4 (reviewed by Kebreab et al., 2006) . On a 100-yr scale, CH 4 is a greenhouse gas (GHG) that is 34 times as potent as carbon dioxide (CO 2 ); on a 20-yr time scale CH 4 is 86 times as potent as CO 2 (Myhre et al., 2013) , making it an even more important target for near-term GHG mitigation efforts (Shoemaker et al., 2013) . In contrast, anaerobic conditions can reduce the production of nitrous oxide (N 2 O) from the nitrogen (N) in the manure. As N 2 O is 298 times as potent as CO 2 (100-yr timescale; Myhre et al., 2013), CH 4 and N 2 O must be considered when evaluating the GHG from a change in manure management systems.\nManure management can be responsible for a large fraction of national agricultural emissions for countries reporting to the United Nations Framework Convention on Climate Change (Chadwick et al., 2011) . Despite their increasing prevalence, there are few measurements of CH 4 emissions from uncovered dairy manure storage units (lagoons, other earthen storage units, or concrete or metal storage tanks; Lory et al., 2010; Owen and Silver, 2015) . We use earthen storage units as a general term for storing manure (liquid or liquid-slurry) in the ground for >6 mo (see Supplemental Table S2 for USEPA definition of waste management system [WMS] ). Because it is difficult and expensive to measure CH 4 emissions over an entire year on farms, statistical models are a practical means to predict emissions of different types of manure under different manure storage conditions with different climatic conditions for regional and national assessments (Intergovernmental Panel on Climate Change [IPCC], 2006) .\nEmissions of CH 4 and N 2 O from manure storage depend on the storage conditions of the N and VS content in the manure. Under anaerobic conditions that promote CH 4 emissions, key driving factors include the mass of VS, storage time, and temperature (Dong et al., 2006; Hashimoto et al., 1981) . Current GHG emission models (USEPA, 2013; IPCC, 2006) are based on limited data (Mangino et al., 2001; Owen and Silver, 2015) . However, only a few studies have compared on-farm measurements of CH 4 emissions with those predicted by this type of model. For example, Lory et al. (2010) found very few measurements validating these models. VanderZaag et al. (2011) demonstrated high flux in measured emissions over a 6-mo study period. Continuous measurements of CH 4 emission from dairy manure slurry in storage tanks in Nova Scotia, Canada, from May through November indicated that modeled CH 4 emissions were substantially higher than measurements during the first month, presumably a result of a lack of methanogens when starting with an empty storage unit (Wood et al., 2012) . However, the total emissions predicted by the model were not compared with those measured over the entire study period. These results show that there is a need for improved validation and testing of models such as USEPA model for assessing CH 4 emissions from manure management.\nRecognizing that New York is the fourth largest milk producer in the United States, we focused on the following three questions: (i) How has manure management changed as goals for improved water quality have led to increased anaerobic storage of manure and how has this changed the GHG emissions from manure management? (ii) How does a key aspect of the USEPA model of CH 4 emissions (the methane conversion factor [MCF]) compare with annual field measurements from covered liquid storage units? (iii) What would be the benefit and cost for future feasible scenarios of covering manure storage units and flaring the CH 4 as a mitigation strategy of GHG?"}, {"section_title": "Materials and Methods", "text": "To determine how past changes in manure management affect farm GHG emissions, we first analyzed trends in dairy farm size and manure WMSs from 1992 to 2012 throughout New York. We then projected future changes to 2022. Based on the VS (the precursor of CH 4 production) and N content (precursor of N 2 O production) in the manure, we calculated changes in GHG emissions resulting from changes in dairy manure storage from 1992 to 2022. To evaluate opportunities to mitigate GHG emissions, we estimated the potential emissions reductions from covering liquid manure storage units to capture and flare CH 4 and developed feasible scenarios for years 2017 and 2022. Because we focus on WMS, we do not include enteric emissions or emissions after manure application to the field."}, {"section_title": "Trends in New York Dairy Farms", "text": "Using Census of Agriculture 5-yr survey data, we used regression analysis to quantify trends in total milking cow numbers over time and then projected these trends into the future (USDA, 2014) . The ratio of heifers to milking cows (0.5) was averaged between 2007 herd values (National Agricultural Statistics Service, 2014 . Regression analysis was used to project the number of farms in four different size categories through year 2022 based on existing concentrated animal feeding operations sizes: <200 cows, 200 to 399 cows, 400 to 699 cows, and >700 cows. From these farm-size categories, we assumed that farms with >200 cows had long-term storage (~6 mo; Supplemental Table S1 )."}, {"section_title": "Calculation of Greenhouse Gas Emissions from Waste Management System", "text": "To calculate emissions from both milking cows and heifers, the total weight of milking cows (680 kg) plus heifers (407 kg) was converted to animal units (AUs: defined as 453.6 kg). Volume of manure production from dairy cows was based on milk production (27 kg milk day −1 in New York; National Agricultural Statistics Service, 2014), while manure production from heifers was based on weight ( ) was used to calculate the CH 4 emissions from each manure management strategy: daily spread (MCF DS = 0.005), solid storage (MCF S = 0.04), liquid-slurry (MCF LS = 0.24), and anaerobic lagoon (MCF AL = 0.68). We also created an MCF for the northeastern United States covered liquid storage (MCF NEcl ) based on a pilot study of separated liquids as described below. The separated liquids scenario was based on data from the literature (Chastain, 2009; Gooch et al., 2005; Rico et al., 2011; Sutaryo et al. (2013) , summarized in Supplemental Table S3) , and partitions manure between liquids (81%) and solids (19%) with an average 0.6 mm screen resulting in 44.5% of total VS and 78% of the total N distributed to the liquid portion of manure (Supplemental Table S3 ). Emissions of N 2 O associated with manure management come from three processes: (i) direct emissions from storage, (ii) indirect emission from leaching of nitrate to a remote site and subsequent conversion to N 2 O, and (iii) volatilized N redeposited at a remote site and subsequently converted to N 2 O. All three N 2 O emissions are calculated following USEPA methods (USEPA, 2013; Supplemental Equation S7-S9; Supplemental Table S2 ). To convert from CH 4 and N 2 O to CO 2 equivalents (CO 2 e), the 100-yr IPCC global warming potential (GWP) conversion factors of 34 and 298 were used, respectively (Myhre et al., 2013) .\nWhile feed intake, bodyweight, milk, and manure production per cow have increased over time, data on historic diets as well as manure VS and N characteristics were not available. By using contemporary animal characteristics for historic WMS and using the trends in herd size over time, we are able to quantify the impact of changes in WMS on GHG emissions. This data limitation means that historic emissions may be overestimated, but contemporary emissions are representative to allow estimation of current GHG mitigation opportunities. It is likely that both dietary efficiency and cow size will increase in the future, resulting in additional increases in milk production efficiency and lower total amounts of manure production for the same total milk production. This would affect the total GHG emissions but would not affect the variation among future scenarios of WMS, thus while the absolute VS in the future may be different than our projection, the proportion of emission between future WMS (liquid-slurry, separated liquids, covered liquids) is robust."}, {"section_title": "Field Measurements for Methane Mitigation Strategy", "text": "A pilot project performed by Environmental Credit Corporation (ECC) placed covers (1.5 mm high-density polyethylene) and flares on five existing New York dairy-farm manure storage units from 2008 to 2009. The storage units contained only separated liquids in a range of 1265 to 1710 AUs per farm (ECC, 2011) . Animal populations were tracked using each farm's dairy herd management software; animal numbers were used to calculate VS from heifers and milking cows with default values listed earlier. Average monthly temperature was taken from the nearest NOAA National Climate Data Centers in New York. Biogas flow was continuously monitored using a Sage Prime thermal mass flow meter (Sage Metering, Inc.). These flow data were automatically corrected from ambient conditions to standard temperature of 21°C and 0.101 MPa (1 atmosphere), recorded every 10 min and downloaded to a data logger. Environmental Credit Corp. aggregated and analyzed the raw data to produce monthly data sets. Methane concentration readings were taken quarterly consistent with the requirements of Climate Action Reserve (CAR; 2012) protocols. Operation of the flare was continuously monitored via thermocouple with the flare temperature recorded every 10 min. Annual flare effectiveness (AFE, defined here as fraction of the annual biogas flow that was flared) was calculated by dividing the operational flow (when the flare was hot, we assumed it was 99% effective in combusting products in the gas; in the winter months, flare operation was often 0) by the total flow. From these pilot project data, we estimated an MCF NEcl using data selected from the three farms that had consistent maintenance and data completeness throughout a 1-yr period between 2010 and 2011. The MCF NEcl was derived from data reported in Supplemental Table S4 using Supplemental Equation S6. We believe that any fugitive emissions are minimal as a result of the design and normal operation of the cover; however, fugitive emissions would be expected if the cover were opened intentionally or unintentionally, and this was not quantified for either MCF or AFE."}, {"section_title": "Costs of Methane Mitigation by Installing Covers and Flares", "text": "To calculate how much it would cost to implement covers and flares for liquid manure storage on dairies throughout New York, we calculated the area of manure storage to be covered, which required an estimate of the volume of manure storage. We estimated the surface area of liquid manure storage for two representative dairy farm sizes: 1000 cows (large) and 550 cows (medium) (Supplemental Table S5 ). Storage volume was calculated based on (i) volume of separated liquid manure, (ii) wash water, and (iii) rainfall. The separated-liquid manure was 81% of the total manure volume (Supplemental Table S3 ). This was combined with 11.4 L of wash water per cow per day (USEPA, 2012 Service, 2004) . Storage depth of these earthen basins ranges from 2.4 to 4.3 m deep depending on distance to bedrock (Karl Czymmek, personal communication, 2012) . The average storage depth was set at 3 m with an added 36 cm of rain (102 cm rain, 66 cm evaporation) for a total depth of 3.4 m. Using this depth, the required surface area of the large and medium storage units was 4300 and 2300 m 2 , respectively. The large storage unit was designed to contain 14.5 million liters for 6 mo of liquids from a 1000-cow farm (with a range of 4-mo retention for a 1500-cow farm to 12-mo retention for a 500-cow farm). The medium storage unit was designed to contain 8 million liters for 6 mo of liquids from a 550-cow farm (with a range of 4-mo retention for an 825-cow farm to 12-mo retention for a 275-cow farm). These cover sizes have a volume that can accommodate a range of storage capacity based on geology, rainwater, and changing numbers of cows on a farm (Supplemental Table  S5 ). As solids have been separated, it is assumed no solids need to be removed over the 10 yr of the cover life, and liquids are removed by pumping for improved timing of nutrient application to fields.\nThe ECC pilot project reported costs for installing five covers during 2007 through 2008 on preexisting manure storage units (ECC, 2011) . The cost for cover and flare installation was averaged across five farms with a range in total herd size of 1350 to 1800 animals (including heifers) and represents the large 6-mo storage cover. We adjusted this cost for the medium cover using the ratio of the cover surface area. We then added the cost of a solids separator (Pronto and Gooch, 2009) . Because the cover would prevent rain from collecting in the manure storage, we subtracted savings from avoided hauling of this rainwater from the storage unit to the field. Hauling on large farms can cost an estimated $0.005 L −1 , whereas on smaller farms, hauling for shorter distances can cost $0.0032 L −1 (Hadrich et al., 2010) . Because there are many variables that affect rainwater hauling costs (e.g., larger farms generally have longer distances to field, amount of rainfall varies across the region, and hauling methods such as pumps or tankers) we averaged the 175-cow dairy with the 1400-cow dairy to address a range in transport costs across the state ($0.004 L −1 ; Hadrich et al., 2010). Finally we added a cost for cover disposal at the end of 10 yr and calculated interest on the total cost accrued over 10 yr at 4.5%."}, {"section_title": "Future Scenarios to Reduce Greenhouse Gas Emissions", "text": "To estimate mitigation scenarios for 2017 and 2022 that address increased CH 4 emissions from liquid manure storage using our two cover sizes, we must consider that in 2012, 12 farms averaged 3351 cows (0.2% of total number of farms). That is, our large storage cover is for 1000 milking cows and many farms are significantly larger. So, for example, based on the regressions for determining farm number and cow number in the 2017 scenario of farms larger than 700 cows, we assumed an average of 1.25 large covers per farm (any individual farm would have one or more covered storage units depending on the number of cows). The 2017 and 2022 scenarios are described below (covers by categories are presented in Supplemental Table S6 ).\nScenario 2017 assumes that 100% of farms with greater than 700 milking cows would have liquid-separated storage and average 1.25 large covers per farm; 50% of farms with 400 to 700 milking cows would have liquid-separated storage and have one medium cover.\nScenario 2022 assumes that 100% of farms with greater than 700 milking cows would have liquid-separated storage and average 1.5 large covers per farm; 100% of farms with 400 to 700 milking cows would have liquid-separated storage and have one medium cover, while 50% of farms with 200 to 399 milking cows would use liquid-separated storage and have one medium cover."}, {"section_title": "Results", "text": ""}, {"section_title": "Trends", "text": "We previously showed that since the 1990s, the number of dairy cows in New York has decreased while milk production per cow has increased to 6 billion kg yr −1 (Wightman et al., 2015) . Along with this decrease in total statewide herd, there is also a decrease in the number of farms because a greater percentage of the total herd is found on fewer but larger farms (>200 cows). In 1992, 96% of farms had <200 cows but accounted for 81% of the New York herd (Supplemental Fig. S1 ), while the remaining 4% of farms housed nearly 20% of the herd (on farms with >200 cows). In the 1992 Census, there was no category for farms with more than 1000 cows, but in 2012, these large farms account for 30% of New York's herd. While only 9% of farms housed >200 cows in 2012, they accounted for 57% of the New York herd (Table 1) . We analyzed historical trends in farm size and found strong linear trends over time (r 2 = 0.94-0.99 except the stable 200-499 cow per farm category; Supplemental Fig. S1 ). We then extrapolated these trends to 2017 and 2022. Assuming continued redistribution of cows to larger farms, 20 and 35% of New York dairy farms will have >200 cows by 2017 and 2022, respectively, corresponding to 73 and 87% of the total state herd. These results suggest that the majority of the state herd will be managed on large farms (>200 cows).\nAlong with changes in animal number and farm size, there are also changes in manure management, primarily moving away from daily spreading. Based on past farm size trends, we hypothesized that farms with >200 cows will have at least 6 mo of storage. Table 1 compiles trends for cow number, farm number, and our estimated proportion of stored manure in 2022 (liquid storage was calculated as 81% of stored manure based on solid-liquid separation; Supplemental Table S3 ). For historic WMS validation, a 1990 survey of New York extension agents indicated that manure was managed as 70% daily spread, 20% liquid, and 10% solid (Safley et al., 1992) . A recent survey of predominantly New York farmers found that 47% of 200 surveyed (averaging 295 cows per farm) had at least 6 mo of storage (Ketterings et al., 2012) , and 62% of farms with >200 cows per farm had 6 mo of storage (Supplemental Table S1 ). As dairies shift away from daily spread to manure storage, a greater proportion of the total N and VS in the manure is stored in more anaerobic conditions.\nSeveral important historical trends are quantified. These include increases in (i) milk production efficiency, (ii) average farm size, (iii) the amount of manure in anaerobic storage, and (iv) GHG emissions from the dairy sector.\nAverage milk production efficiency (milk produced per cow) has increased substantially since 1992 (Table 3) , reducing manure per gallon of milk and subsequently reducing the VS (and CH 4 ) per gallon of milk. That is, if the historic (1992) cow population was managed using contemporary WMS, GHG emissions would have been much greater (Table 3) . Increased milk production efficiency (less feed per gallon of milk) results in less manure produced per gallon of milk and therefore reducing the mass of N and VS available in the excreted manure to become N 2 O or CH 4 , respectively. Over time, WMS are being changed to systems that are more anaerobic (Table 1; Safley et al., 1992; Ketterings et al., 2012) . The VS stored in anaerobic conditions create more CH 4 than the same mass of VS stored in more aerobic conditions.\nMethane is a potent GHG but is also easily combustible, thus negating its GWP of 34. Based on a pilot study done on three dairy farms in New York with separated-liquid manure storage retrofit with a cover and flare, we estimate an MCF (0.61), an annual flare effectiveness (81%), associated costs ($380,000 for 1000-cow farm), and a price for carbon credits (~$10 per Mg CO 2 e). Although only limited data were collected in this pilot study, the results do support the use of the USEPA methodology to estimate CH 4 emissions from anaerobic lagoons for separatedliquid storage. Specifically, the average MCF (0.61) from the three farms is similar to the USEPA MCF for anaerobic lagoons (0.68), and the USEPA value falls within the range of the three farms (0.5-0.7; Table 4). Table S2 ) for proportion of manure managed in 1992 (Table 1) Table S2 ) for proportion of manure managed in 2012 as daily spread, solids, and LS (Table 1) . 2022-LS, business as usual with trends toward increased LS storage (70% LS; Table 1) using USEPA MCF values (Supplemental Table S2 ) for daily spread, solids and LS. 2022-AL, same projected increase in manure storage (Table 1) Table S2 ). The annual flare effectiveness is 81% (shown below zero).\nWe used the results of this pilot study to estimate the costs of implementing such a practice. The two cover options (medium and large) addressed a range of farm size and storage duration (275-1500 milking cows, greater volumes and storage times possible if covered, thus increasing manure capacity by avoiding collection of rainwater in the storage unit). We estimate the large cover (1500 milking cows for 4 mo to 500 milking cows for 12 mo) would cost $380,000 ($10 per Mg CO 2 e if 1000 milking cows) and a medium cover (825 milking cows for 4 mo to 275 milking cows for 12 mo) would cost $270,000 ($13 per Mg CO 2 e with 550 milking cows). In the 2017 scenario, this amounts to $133 million and covers the liquid manure portion of 55% of the state herd. The 2022 scenario costs $224 million and covers the liquid portion of 81% of the state herd. In our analysis, the average cost for the 10-yr cover in 2022 was estimated to be $13 per Mg CO 2 e based on 2008 installation costs. This value is at the very lowest end of those estimated by the US Government Interagency Working Group on Social Cost of Carbon (2013) that found the social cost of CO 2 (i.e., CO 2 -induced damages to agricultural productivity, human health, and property damage from increased flood risk) ranges from $12 to 129 Mg CO 2 e . Thus, the estimated cost for installing covers is cost-effective, compared with the social cost of CO 2 , and matches current market prices for carbon trading."}, {"section_title": "Emissions", "text": "As more manure is stored in more anaerobic conditions, more GHG are produced. Methane and N 2 O emission estimates, in CO 2 equivalents, for each WMS in 1992 and 2012 are presented in Table 2 . Methane accounts for 80 to 83% of WMS emissions in 1992 and 2012. However, despite having more cows in 1992, the emissions were only 45% of those in 2012. While N 2 O emissions increased 78% in the 2012 system, the quantitative impact of increased N 2 O on climate is modest in comparison with the increased CH 4 production from anaerobic storage.\nThe shift over time toward anaerobic manure storage systems has increased GHG emissions. In Table 3 , the CH 4 emissions were greater in 2012 (0.22 kg CO 2 e kg −1 milk) than 1992 (0.11 kg CO 2 e kg −1 milk). If the 2012 manure were managed using the 1992 WMS, the CH 4 emissions from WMS would be 37% of what they were under 2012 WMS (Table 3) . These results indicate that the increased efficiency in milk production has reduced the potential emissions from the contemporary state herd. However, this benefit has been overwhelmed by the tremendous increase in GHG as a result of anaerobic storage conditions. In particular, this move to anaerobic storage has produced large increases in CH 4 ."}, {"section_title": "Mitigation", "text": "Methane is easily oxidized to CO 2 by combustion, thus greatly reducing the powerful GWP of CH 4 . We acquired data from a manure-cover pilot project by ECC that captured and flared CH 4 from liquid-manure storage. Data from New York Table 4 ). Liquid-manure storage (solids stored separately) led to an MCF value that was closer to USEPA's anaerobic lagoon (AL) value than their liquid-slurry (LS) value. We also calculated an AFE of 81% (fraction of the total biogas flow that was flared). This AFE was used to indicate destruction of CH 4 in the biogas for all future mitigation scenarios (2017) (2018) (2019) (2020) (2021) (2022) .\nWe also used these pilot projects to estimate cost (Table 5 ) for a range of storage capacity (Supplemental Table S5 ). We estimate a large cover to cost $380,000 ($38 milking cow −1 yr −1\n) and a medium cover to cost $270,000 ($49 milking cow −1 yr −1 ) (Table  5) . Notably, the cost savings from not hauling rainwater (the cover prevents rain from diluting and increasing manure transportation costs) is nearly equivalent to the interest payments of a large cover (64% for the medium cover). Based on our MCF NEcl , the cost per cover for the two farm sizes is $9.63 and $12.51 per Mg CO 2 e yr −1 for the 1000-milking-cow farm and 550-milkingcow farm, respectively (Table 5) .\nTo identify financially viable mitigation potential at the state level, the projected farm numbers were used to determine a number of medium and large covers for future manure management scenarios. The 2017 scenario ($133 million) covers 375 storage units for the separated-liquid-manure fraction of 55% of the New York herd and the 2022 ($224 million) scenario covers 662 storage units for separated-liquid-manure fraction of 81% Table 2 . Effect of manure management strategy on total greenhouse gas (GHG) emissions. O V indirect refers to N that volatilized from the point source and redeposited at a remote location and subsequently converted to N 2 O (not including emission on land application). § N 2 O R indirect refers to N that has run off from the point source to a remote location and subsequently converted to N 2 O (not including emission on land application). ¶ Using USEPA methane conversion factor values for daily spread, solids, and liquid-slurry. of the New York herd (Table 6 ). That is, in the 2017 scenario, 375 covers could destroy 1.25 Tg of CO 2 e yr −1 using the MCF NEcl (Table 6 ). In the 2022 scenario, an additional 287 covers would be added to the 2017 scenario for a total of 662 covers. Covers in the 2022 scenario using the MCF NEcl would address only 40% more emissions than the 2017 scenario, accounting for and additional mitigation of 0.5 Tg CO 2 e yr −1 but in total accounts for 62% of the total herd GHG emissions (CH 4 has the same solid-liquid separation as the 2022 AL scenario and maintains the USEPA MCF S for the solid portion, but in this case, the liquids from 81% of the herd are covered and CH 4 is captured and flared using the MCF NEcl of 0.61 and the AFE of 81%. Given leaks or other issues, the covered scenario (2022*) has the potential to emit as much as the uncovered liquid storage scenario (2022 AL ), while also indicating that proper function and management of cover and flare with only an 81% AFE will reduce total emissions to below the current 2012 WMS estimate. In summary, if current trends continue and New York dairy farms continue to move toward liquid manure storage (liquidslurry, bar 3, and solid-liquid separation, bar 4), New York dairy (despite having fewer cows and producing more milk than in the 1992 scenario) manure WMS may contribute an additional 1.3 to 2.6 Tg CO 2 e yr −1 ."}, {"section_title": "Daily spread † Solids Liquid-slurry Total --------------Mg CO 2 e yr −1 --------------% GHG 1992", "text": ""}, {"section_title": "Discussion", "text": "The objectives of this study were to quantify historical trends in WMS on New York dairy farms and how these trends affected GHG emissions to project future trends in WMS and GHG emissions and to estimate the costs for feasible future scenarios to reduce GHG emissions. This topic is important and timely given increasing global attention to reduce and regulate GHG emissions in addition to the fact that farms both produce GHG and are affected by climate change. The results demonstrate that covering and flaring CH 4 from anaerobic manure storage units is a viable approach to reduce GHG from manure management on dairy farms, and that it can be done at a price that is competitive in current carbon markets."}, {"section_title": "Uncertainties", "text": "As in most environmental studies that cover many decades, make projections into the future, and cover a wide range of farms, there are uncertainties resulting from data limitations. First, it is commonly known that milking cow size is increasing (with and without hormones such as recombinant bovine somatotropin) and dairy cow diets are changing. Data limitations did not allow us to include these factors in our analysis. In the past, average dairy cows were smaller, and thus, the amount of manure produced per cow was less. However, diets have also changed, which is important because it affects the amount of VS and N excreted as manure. Because it is difficult to project such changes in the future, our analysis uses the same animal size and VS and N production in the future as is currently used. It is likely that both dietary efficiency and cow size will increase in the future, resulting in additional increases in milk production efficiency and lower total amounts of manure production for the same total milk production. While the VS content in the future may vary from our projection, the proportion of CH 4 emission across the future WMS scenarios is robust.\nThe USEPA has created single MCF values for temperate regions for each WMS. In reality, there is great diversity in factors such as WMS management, diet, microclimates, etc. that would be expected to cause variability in the actual MCF from an actual farm. Others have indicated that these MCF calculations may be problematic (Lory et al., 2010; Owen and Silver, 2015) . Here we use data from three pilot projects with specific conditions including actual cow number, separated solids, a cover, a meter of gas flow, and a monitor of flare effectiveness. We did indeed find large variation among farms in estimating MCF values. This variation could be even greater if detailed data on VS and N were available for these farms and if continuous rather than periodic measurements were made of CH 4 concentrations in the biogas. Future studies that perform such detailed measurements, as well as additional measurements of CH 4 emission both from the designed liquid-removal outlet and any fugitive emissions, would be valuable to improve on the results presented herein. However, this pilot study used the CAR procedure for sale of credits and represents a type of data collection for purposes of verifying carbon credit payments on farms. The resulting average MCF from these data is quite close to the USEPA anaerobic lagoon MCF (which is liquid only), which provides some support for the USEPA and CAR methodologies.\nAdditional assumptions made for our analysis impact the cost and effectiveness of implementing covers with flares. For example, if the large cover system lasted 20 yr rather than our assumption of only 10 yr, it would save the farm $125,000 by preventing rain water collection, resulting in fewer gallons of liquid hauled over 20 yr. Effectiveness of the flare is also an important consideration with much uncertainty surrounding CH 4 content of biogas, wind, and flare activity (Gogolek, 2012; Clean Development Mechanism Executive Board [CDMEB], 2006) . Based on the results of the pilot project we use an 81% AFE. Higher efficiency may be feasible, as efficiencies were higher than this in the ECC dataset during many high CH 4 -producing months on multiple farms. This longer cover life combined with an increased AFE of 95% (Gogolek, 2012; CDMEB, 2006) in the 2022 mitigation scenario would cost $9 Mg CO 2 e −1 (compared with $13 for a 10-yr cover and 81% AFE). Alternatively, a 50% AFE (CDMEB, 2006) with a 10-yr cover would cost $21 Mg CO 2 e −1 ."}, {"section_title": "Considerations for Future Planning", "text": "Despite the uncertainties discussed above, this project identified methodology to mitigate GHG at large scale in a costeffective manner relative to other costs of GHG emissions. This estimate accounts for reduced water-hauling costs. We could not account for several factors. First, liquid storage retains N for spring application, thus reducing cost to purchase of synthetic N; we do not credit this savings because that is a benefit of having storage and independent of a cover. Second, there will be benefits to water quality, but again these are primarily a function of the storage and not of the cover. That said, there are additional nonmonetized benefits specific to covers: (i) covers reduce permit violations from extreme weather conditions by preventing excess rainwater from causing overflow (Karl et al., 2008; Kunkel et al., 2013) , and (ii) covers reduce odor that can be an important issue for farmers and their neighbors.\nIn addition to the benefits listed, there are some further considerations. Clearly, a malfunctioning flare or cover could cause more total emissions, and these technical and regulatory issues must be seriously considered. Malfunctioning systems may also have safety considerations (unmanaged flammable CH 4 and toxic H 2 S production), which require maintenance and employee training. Additionally, continued efforts to reduce VS and N in the diet (and increase in overall feed efficiency; Higgs et al., 2012) will continue to reduce the GHG emission potential relative to milk production. As the separated solids have a disproportionate amount of VS and a proportionate amount of N in a mildly anaerobic state, further study of the relationships between the GWP conversion factors for CH 4 (GWP of 34) and N 2 O (GWP of 298) are warranted as these conditions favor production of N 2 O with its higher GWP.\nOur scenario greatly reduces the global warming impact of CH 4 (from separated liquids amounting to 3939 Mg CO 2 e 1000 milking cows −1 yr −1 while costing $380,000 and operating 10 yr), but CH 4 can also be used to generate electricity, providing additional benefits of farms' energy self-reliance and displacing emissions from electric-grid fossil fuels. The New York State Energy Research and Development Authority's (NYSERDA) Anaerobic Digester to Electricity Program is making $57 million available between 2011 and 2015 to install anaerobic digesters (ADs) across New York in an effort to mitigate CH 4 and produce renewable electricity (NYSERDA, 2011) . This grant may support as few as 57 AD systems, meaning $57 million will mitigate baseline emissions from 57 large farms. If those 57 AD farms averaged 1000 cows each, it would mitigate only a third of the emissions (0.22 Tg CO 2 e yr −1 ) that the same dollars spent on covers and flares for 150 large farm storage units (0.59 Tg CO 2 e yr −1 ). The additional benefit of displacing the use of fossil fuel emissions is minimal. Data from six California dairy farms (with 245-2193 milking cows) that used AD systems produced 650,000 kwh yr −1 (average farm size was 1081; California Energy Commission, 2009). Using 2012 New York grid emissions for in-state electric production at 0.24 kg CO 2 e kwh −1 (NYSERDA, 2014), each ~1000-milking-cow farm would mitigate an additional 152 Mg CO 2 e yr −1 of electric-grid emissions. Recognizing these anaerobic digester systems are designed to produce maximal CH 4 from total manure (VS in solid plus liquid manure), biogas-displaced electric-grid emissions account for only 4% of the mitigation potential from flaring of CH 4 produced by separated liquids on a 1000-milking-cow dairy (3939 Mg CO 2 e flared by large cover capture at the cost of $380,000). In this system, while displacing fossil fuels with manure-CH 4 electric generation is beneficial, it is minor in comparison to the destruction of CH 4 with its high GWP. While mitigation of farm GHG is voluntary, New York State is part of the Regional Greenhouse Gas Initiative (RGGI) that regulates the electric sector for GHG emissions and allows offsets from dairy farm CH 4 destruction (though, to our knowledge, no offsets have been filed to date and June 2015 RGGI auction 28 clearing price was $6 Mg CO 2 e −1 ; RGGI, 2015) .\nThis illustrates the relative impact of addressing climate change in manure management systems via renewable energy production and mitigating GHGs. On a 20-yr time scale, CH 4 is 86 times as potent as CO 2 (Myhre et al., 2013) , making it an even more important target for near-term GHG mitigation efforts (Shoemaker et al., 2013) . There are many ways a farm could manage CH 4 and N 2 O emissions (Hou et al., 2015; Montes et al., 2013) . However, our analysis uses the 100-yr time scale for CH 4 GWP and illustrates the relative cost-effectiveness of this mitigation strategy with numerous other benefits. A policy that supports manure covers will address multiple local and global impacts from dairy, and has been demonstrated as feasible.\nThe scenarios we developed are not intended as predictions. While manure containment systems allow for spring nutrient application, they are not a legal requirement. Likewise, while there is growing awareness of GHGs, farms are not legally required to mitigate GHGs. Though our estimated cost of $0.005 per liter milk is small from a consumer perspective, regulated milk pricing likely means that this cost would be paid by the farmer. We are neither predicting that this number of storage units would be installed nor that they would be covered. Instead the scenarios represent an ambitious but feasible projection of a mitigation strategy that would proactively respond to a trend of larger farms generating significant amounts of CH 4 from stored manure while protecting water quality."}, {"section_title": "Conclusions", "text": "We analyzed historical changes in New York dairy farm management and developed future scenarios for decreasing GHG emissions by covering and flaring CH 4 from liquid-manure storage units. We estimated that increased anaerobic storage of manure increased CH 4 emissions from manure management from 0.56 Tg CO 2 e yr −1 in 1992 to 1. "}]