[{"section_title": "Introduction", "text": "[2] The cold halocline of the Arctic Ocean (z = 50 to 200 m) insulates surface water and the overlying sea ice from the heat contained in the Atlantic layer [Aagaard et al., 1981;Steele and Boyd, 1998]. The halocline structure is especially complex in the Canada Basin due to combined inputs from the Pacific Ocean and from waters originating upstream in the Eurasian Basin. Sequential layers here consist of Pacific Summer Water (31.0 < S < 32.0), Pacific Winter Water (core at S = 33.1) and Lower Halocline Water (S$34.2) of Atlantic origin [Coachman et al., 1975;Jones and Anderson, 1986]. Further, there are two water types of Atlantic-origin water in the salinity range of Lower Halocline Water (LHW): the warm and oxygen-poor LHW found in the southwestern Canada Basin [Woodgate et al., 2005] (blues curves in Figure 1); and the cold and oxygen-rich LHW found in the northwestern Canada Basin [McLaughlin et al., 2004] (red curves in Figure 1). Dense Pacific Winter Water, whose salinity has been enhanced to S = 34.2 by local sea ice formation in the Barrow-Cape Lisburne Polynya [Weingartner et al., 1998], is sometimes observed in the southern Canada Basin in the vicinity of Barrow Canyon [Shimada et al., 2005]. This latter water is not included in the following discussion of LHW source regions because it is known to be of Pacific origin. [3] Woodgate et al. [2005] suggested that the warm, oxygen-poor LHW variety is formed by diapycnal mixing between Pacific Winter Water and upwelled denser Atlantic Waters over the Chukchi shelf/slope, and here we refer to this water as diapycnally mixed Lower Halocline Water (D-LHW). The cold and oxygen-rich LHW variety was first observed by McLaughlin et al. [2004] over the Chukchi Plateau in the Canada Basin and shown by Shimada et al. [2005] to spread toward southeastern Canada Basin. Falkner et al. [2005] examined halocline oxygen distributions along a section extending from the North Pole to the Lincoln Sea, and noted that the North Pole was the most upstream region to exhibit the oxygenrich variety of LHW. This water must be formed by convection because cold and oxygen-rich properties originate in surface waters [cf. McLaughlin et al., 2004;Shimada et al., 2005]. Here we examine Arctic Ocean data to investigate and evaluate potential source regions of this LHW and trace its spreading pathway into the Canada Basin. Potential vorticity, PV = f/r(@r/@z), (where f is the coriolis parameter and r is potential density, thus the contribution from relative vorticity is not included) has been used as a tracer for convectively formed water masses in studies of ocean circulation in the Pacific and Atlantic Oceans [cf. Keffer, 1985;Talley, 1988]. Here we use the PV distribution together with potential temperature and dissolved oxygen distributions to trace the circulation of this cold, oxygen-rich type of LHW (see Figure 1)."}, {"section_title": "Data", "text": "[4] Temperature and salinity data from expeditions listed in Table 1 and from the World Ocean Database 2001 [Conkright et al., 2002] were examined together with oxygen data from O 2 sensors or bottle samples from 1994 Arctic Ocean Section (AOS94), 1996 R/V Polarstern (PS96) and 2002 -2004 Joint Western Arctic Climate Studies (JWACS). The AOS94 and PS96 bottle oxygen data were interpolated using spline interpolation. The averaged vertical sampling distance between bottle oxygen samples is about 15 m and it corresponds to 3 samples between S = 34.1 and S = 34.3. Oxygen sensor (SBE43) data from the 2002 -2004 JWACS in the southern Canada Basin on the CCGS Louis S. St-Laurent and R/V Mirai were calibrated using dissolved oxygen samples analyzed by an automated Winkler titration method. The quality of the calibrated SBE43 oxygen data (±2 mmol/kg) permits the identification of water masses above the Atlantic layer. For salinity surface properties (Figures 1 -4), potential temperature and dissolved oxygen data were averaged in the salinity ranges S = 34.1 to S = 34.3. In calculating PV the density gradient was averaged between S = 34.1 and S = 34.3, i.e., @r/@z = (r s=34.3 À r s=34.1 )/(z s=34.3 À z s=34.1 )."}, {"section_title": "Identification of the Cold and Oxygen-Rich Lower Halocline Water Formation Region", "text": "[5] In the Canada Basin there is no volumetrically significant source of ventilated water in the LHW salinity range, except for the locally and occasionally observed dense Pacific Winter Water, because the surface salinity is insufficiently high to form saline LHW waters. Thus the cold and oxygen-rich LHW (illustrated by the reds curves in Figure 1), must be advected from outside the Canada Basin, and likely originates in the Eurasian Basin where the salinity in the winter mixed-layer equals that of LHW in the Canada Basin. Although the formation of such water occurs in winter, almost all available data have been collected during summer. To estimate the winter mixedlayer depth, we note that the core of the previous winter's mixed-layer in the following summer is typically indicated by a remnant layer of cold water located between the fresh summer melt and/or river water and the warm, saline Atlantic water in the Eurasian Basin. McPhee et al. [2003] used drifting buoy data from the Eurasian Basin to show that temperature of the winter mixed-layer core typically remains within 0.1-0.2°C of the freezing temperature throughout summer. We thus use cold water with temperatures within 0.1°C of the freezing point from Figure 1. Distribution of (a) potential temperature (°C), (b) dissolved oxygen (mmol/kg), and (c) potential vorticity (10 À11 m À1 s À1 ) in the S = 34.1À34.3 isohaline from JWACS 2002 -2004. Black contours are every 0.2°C from À1.2 to À0.6°C in Figure 1a, 10 umol/kg from 230 to 330mmol/kg in Figure 1b, and 25 Â 10 À11 m À1 s À1 from 75 to 325 Â 10 À11 m À1 s À1 in Figure 1c. Dots denotes station locations. Yellow contours are depths at 500 m and 2000 m. The area shallower than 100 m is lightly shaded. Typical profiles for two types of the Lower Halocline Water in the Canada Basin are shown in (d) potential temperature (°C) versus salinity, (e) dissolved oxygen (mmol/kg) versus salinity, and (f) potential vorticity (10 À11 m À1 s À1 ) versus salinity. The location of the profiles is shown by the solid colored crosses on the map. The vertical line in Figures 1d, 1e, and 1f denotes S = 34.2. Gridded data for Figures 1a, 1b, and 1c was made on 0.2°in latitude and 0.4°in longitude spacing. A Gaussian distribution with an influence radius of 80 km and an e-folding scale of 40 km was applied as a weighting function. If there was no data within the influence radius, the influence radius was extended to 100 km; if there was no data with 100 km, the region was treated as having no data, and shown in white on the maps. Oxygen data from the expeditions were used to produce the plots shown in Figure 3. summer temperature and salinity data to mark the base of the winter mixed-layer from the previous winter and obtain proxy estimates of salinity (Figure 2a).Cold water with salinity greater than S = 33.8 is evident in two regions: the Barents Sea and the Nansen Basin. Cold water in the Barents Sea reflects the origin of LHW formed by air cooling and sea ice melt [Steele et al., 1995]. However, potential temperatures on S = 34.1-34.3 here are relatively warm (Figure 2b), implying that the Barents Sea is not a source. Water on this isohaline is cold in the Nansen Basin and corresponds to Convective Lower Halocline Water (C-LHW) whose formation was proposed by Rudels et al. [1996] and Steele and Boyd [1998]. Such water is oxygen-rich because it originates during the formation of the winter mixed-layer. In other basin and shelf regions, the winter mixed-layer is fresher than S = 33.8. These results show that the cold, oxygen-rich and low PV LHW observed in the Canada Basin (Figure 1) is derived from C-LHW formed in the winter mixed-layer of the central Nansen Basin."}, {"section_title": "Spreading Pattern of C-LHW Toward the Western Arctic Ocean", "text": "[6] Correlation plots of dissolved oxygen saturation (Oxs) versus potential temperature (q) and Oxs versus potential vorticity (PV) on the C-LHW isohaline S = 34.1 -34.3 from data collected during JWACS 2002-2004, AOS94 and PS96 reveal good linear relationships with q = À0.04 Â Oxs + 2.38 and PV = À4.80 Â Oxs + 510 ( Figure 3). The correlation coefficients are À0.96 and À0.94 for Oxs versus q and Oxs versus PV respectively. Estimates of standard error [cf. Emery and Thompson, 1997] are q = ±0.07°C and PV = ±11 Â 10 À11 m À1 s À1 and include the errors in both the slope and intercept. We exclude data from stations located between 145 -160°W and south of 200 km offshore from the shelf slope (100 m isobath), where the influence of dense Pacific Winter Water is dominant [Shimada et al., 2005], stations located west of 170°W and south of 76°N in the Canada Basin, where the influence of D-LHW is dominant [Woodgate et al., 2005], and stations for which the bottom depth is shallower than 500 m because here relative vorticity is large. In the Nansen Basin, the C-LHW Figure 2. Distribution of (a) salinity of the winter mixedlayer, and (b) potential temperature (°C) and (c) potential vorticity (10 À11 m À1 s À1 ) on the S=34.1À34.3 isohaline from expeditions listed in Table 1 and from the World Ocean Database 2001. Black contours are S=33.8 in Figure 2a, every 0.2°C from À1.5 to À0.5°C in Figure 2b, and every 20 Â 10 À11 m À1 s À1 from 60 to 240 Â 10 À11 m À1 s À1 in Figure 2c. Dots denotes station locations. In Figure 2a yellow contours are depths at 100 m and 2000 m, and in Figures 2b and 2c yellow contours are depths 2000 m and the area shallower than 100 m is lightly shaded. Gridded data on 25km spacing was made for this figure. A Gaussian distribution with an influence radius 250 km and e-folding scale of 125 km was applied for weight function. If the number of observations within influence radius was less than 10, the region was treated having no data and shown in white on the maps. dissolved oxygen (DO) is near saturation and the temperature is near freezing (Figure 3a), indicating that it originated from a winter mixed-layer with a verticallyuniform salinity and a low PV (Figure 3b). From the Nansen to the Canada Basin, oxygen saturation values decrease and q and PV increase. [7] Although oxygen data from O 2 sensors or bottle samples are limited to recent expeditions, the good correlation between DO and PV and DO and q implies we can use q and PV as proxy data for DO to examine the spreading pattern of the oxygen-rich C-LHW at S = 34.1 -34.3 (Figures 2b and 2c). As such, C-LHW can be identified as cold and low PV water that originates in the winter mixed-layer of the central Nansen Basin. Rudels et al. [1996] suggested that C-LHW flows cyclonically along isobaths and exits throughout Fram Strait. Rudels et al. [2004] suggested that the boundary current, including C-LHW outflow from the Barents Sea, follows the shelf slope and crosses into the Canadian Basin near the southern end of Lomonosov Ridge around 81°N. Our results show that some fraction of cold, low PV C-LHW in the Amundsen Basin also leaks into the Makarov Basin across the eastern latitude side of the Lomonosov Ridge. C-LHW that originates in the central Nansen Basin is not delivered to the Western Arctic along the slope of the Laptev and East Siberian seas, but instead spreads into the Makarov Basin across the Lomonosov Ridge between 82°N and 86°N. It subsequently enters the Canada Basin above the deep channel on the Alpha-Mendeleyev Ridge and continues spreading into the basin north of Chukchi Plateau. The distribution of q on S = 34.1 -34.3 from XCTD data obtained aboard the USCGS Healy in 2005 ( Figure 4) also shows that C-LHW near the channel between the Alpha-Mendeleyev Ridge from 81-83°N is colder than waters on either side of this channel. Smith et al. [1999] on the basis of Iodine 129 distributions also suggested that Atlantic origin water leaks towards the Canada Basin north of Chukchi Plateau. These synoptic observations support the spreading pattern of C-LHW across the Alpha-Mendeleyev Ridge. The spreading pathway of cold, oxygen-rich and low PV C-LHW is illustrated in Figure 5."}, {"section_title": "Summary", "text": "[8] DO has been used to trace newly-ventilated water in the world ocean, however observational data are sparse in the Arctic Ocean. Results presented here show that the good correlation between DO and PV, calculated on an isohaline surface, allows the use of PV as a proxy to trace the formation and spreading of newly-ventilated LHW in the Arctic. [9] The source region and spreading pattern of cold, oxygen-rich LHW found in the northern Canada Basin are investigated using Joint Western Arctic Climate Study 2002-2005 and other data. Our results indicate this Convective LHW originates in the winter mixed-layer of the central Nansen Basin and spreads into the Makarov Basin across the Lomonosov Ridge between 82°N and 86°N. It Figure 3. Plot of (a) oxygen saturation (Oxs) (%) versus potential temperature (q) (°C) and (b) Oxs (%) versus potential vorticity (PV) (10 À11 m À1 s À1 ) on the S = 34.1 -34.3 isohaline from expeditions listed in Table 1. Blue, green, yellow, and red dots indicate the station in the Canada, Makarov, Amundsen and Nansen basins, respectively. Solid line is linear regression. subsequently enters the Canada Basin across the Alpha-Mendeleyev Ridge and continues eastward into the Beaufort Gyre north of the Chukchi Plateau. The results in this study are based on the assumption of steady state conditions during the last two decades. This approach is reasonable at first order, and detailed studies in the future are required to determine whether and how transit pathways of this C-LHW vary."}]