[{"section_title": "CHAPTER 1 INTRODUCTION", "text": ""}, {"section_title": "Background", "text": "Storm surge is an abnormally high sea level produced by severe meteorological conditions (Gill, 1982). Here \"abnormal\" refers to the excessive water level on top of normal astronomical tides and \"severe meteorological conditions\" often refer to tropical or extra-tropical cyclones. Storm surge threatens many coastal areas around the world, including the Gulf coast ( Figure   1.1). The Bhola tropical cyclone during November 1970 killed about 500,000 people in Bangladesh and India, primarily through storm surge and the associated inundation (Frank and Husain, 1971). In August 2005, the storm surge generated by Hurricane Katrina struck New Orleans and created the most costly natural disaster in the United States (Figure 1.2), with an estimated property loss at about $81 billion (Blake et al., 2007). The deadliest natural disaster in the United States resulted from the same phenomenon: the 1900 Galveston hurricane killed about 8000 people, mainly by storm surge (Blake et al., 2007). Storm surge is not limited to the ocean. It also occurs in large lakes (Donn, 1959;Irish, 1965), where the forcing can either be an isolated storm or squall lines (Irish, 1965). The similarity among all storm surges is that water level disturbance is created by wind stress and atmospheric pressure change of severe weather systems. As the disturbance reaches the ocean or lake coast, it causes significant water level variations and even inundations of low-lying lands. The threat from storm surge may become more serious in the future. First, population and wealth continue to concentrate in coastal areas. According to the study by Pielke et al. (1998), there was a trend that the property loss caused by storm surge doubled every ten years. If this trend holds for now and the following decades, a simple calculation shows that a second Hurricane Katrina in 2050 could cause more than $1800 billions' worth of property damages. Second, the climate change, especially anthropogenic global warming may increase the impact of storm surges through sea level rise, whose average rate is about 0.3 cm year -1 (IPCC, 2007) at present, and the change of hurricane intensity. How hurricanes will respond to climate change is not known yet. However, recent numerical models (Bender et al., 2010;Knutson et al., 2010) suggest that while the total number of hurricanes (category 1 to 5) would decrease, the number of the most intense ones (category 4 and 5) could double. Attention has already been given to the combined effect of sea level rise and intensified hurricanes. For example, these projected changes may lead to storm surges 0.3 m higher at Corpus Christi, Texas, after 20 years, according to Mousavi et al. (2010). Figure 1.1 The worldwide hurricane (or \"typhoon\" in Asia) tracks (upper panel) and the United States coastal counties that ever experienced hurricane strikes (lower panel). Images are from NOAA."}, {"section_title": "Brief Review of Storm Surge Study", "text": "The earliest tropical cyclone recorded in NOAA's historical hurricane dataset, or HURDAT, is in June 1851, which made landfall at Texas (Blake et al., 2007). Murty et al. (1986) provided an extensive list of storm surge events in the Bay of Bengal which date back to as early as 1737. These events were generally accompanied by heavy loss of life. Before the era of aerial/satellite observation and modern computer, the measurement, analysis and prediction of storm surge were strongly limited by the scarcity of data and the lack of computational tools. Some studies in the 1950s used statistical analyses to obtain empirical relations which linked storm surge height to certain hurricane parameters. The hurricane central pressure was commonly used as such a parameter, partly because it was the most available data at that time. Conner et al. (1957) used 30 records of maximum storm surge height and hurricane central pressure to obtain empirical relations between them with linear regressions. All these records were from hurricanes that made landfall on the Gulf coast states. It was found that the statistical relation could explain about 50% of the maximum surge height variation (Conner et al., 1957). The authors also noted the possible importance of other factors including Radius of Maximum Wind (RMW), hurricane forward speed and the angle between the hurricane track and the coastline (the Approach Angle). Later Hoover (1957) included tidally-corrected storm surge data from both the Gulf coast and the Atlantic coast. Besides empirical relations between the maximum surge height and hurricane central pressure, it was found that storm surges along the Gulf coast were much larger than those along the Atlantic coast (Hoover, 1957). There was no satisfactory explanation for this at that time. Theoretical analysis was less used compared with statistical or numerical methods. Theoretical analysis is useful but the mathematical difficulty limited its applications only to highly simplified cases (Kajiura, 1959;Heaps, 1965). The study of storm surges by numerical models started in the 1950s. Hansen (1956) developed a numerical model to simulate storm surges in the North Sea. Later another model was applied to storm surge in the Great Lakes by Platzman (1958). The computed results were encouraging when compared with field measurements, and the potential of storm surge modeling was recognized. Jelesnianski (1965) used a frictionless, linearized storm surge model and obtained several qualitative characteristics of storm surge. For instance, the maximum surge was found to occur on the right side of the hurricane center, shortly after the hurricane's landfall. The importance of ingress angle (the angle between hurricane's wind vectors and isobaric contours) was stressed in that study while the hurricane motion (forward speed and track) was concluded to have little effect. Jelesnianski (1966) investigated the parameter space consisting of maximum wind speed, RMW, and forward speed to derive a set of nomograms for prediction purpose. It was shown that higher surges occur when the storm moves from the southeasterly to southern direction (with the coast in the north). Bottom stress was added in a subsequent study (Jelesnianski, 1967), with more track angles and forward speeds used. It was found that shelf seiches and travelling edge waves could make significant contributions to the surge height and even change the location of the maximum surge. These waves are more easily generated by storms whose tracks are at acute angles with the coastline, they are also more easily generated by fast moving storms (the author did not specify what is \"fast moving\". It was mentioned in the text that edge waves appeared for storm with a 20 mph forward speed and became significant for a 40 mph forward speed). A detailed account of the early numerical algorithms for storm surge modeling can be found in Heaps (1969). After the development of models in the 1950s and 1960s, numerical studies of storm surge rapidly grew and the algorithms matured with time, such as boundary condition treatment (Wurtele et al., 1971), wetting and drying treatment (Flather and Heaps, 1975), and surge-wave coupling (Mastenbroek et al., 1993). In most of the early models, structured curvilinear grids were used for domain discretization. Later unstructured grid models were developed, with the advantage of accurate coastline representations and flexible controls of grid resolution. The finite element method was first applied to tide and coastal circulation in the 1970s (Connor and Wang, 1974;Lynch and Gray, 1979). Its application to storm surge can be found in Luettich et al. (1992). A review of the development of storm surge modeling can be found in Bode and Hardy (1997), where details of algorithms and related literature are available. The Bay of Bengal is another place that has been under extensive storm surge research (Flierl and Robinson, 1972;Das, 1972;Das et al., 1974;Murty et al., 1986;Dube et al., 1997). Flierl and Robinson (1972), and Das (1972) applied numerical models to the Bay of Bengal after the devastating storm surge in November 1970. It was found that the coastline shape (close to that of a right angle), and the wide and gentle bathymetry helped increase the surge height. Das et al. (1974) studied the interaction of tide and storm surge in the Bay of Bengal (the tidal range there is about 4 m) and showed that due to nonlinear effects, a direct superimposition of the modeled surge height (tide excluded) and the tide would overestimate the surge height. A review of storm surge studies in the Bay of Bengal is provided by Murty et al. (1986). The advance in computational resource has made high resolution models with faithful representations of complex coastal features, bays and deltas for example, feasible. Shen et al. (2006) applied a high-resolution model UnTRIM (Casulli and Walters, 2000) to the Chesapeake Bay, the coastline of which has many estuarine details. Weisberg and Zheng (2006) applied FVCOM (Chen et al., 2003) to the Tampa Bay which has similar geometric complexity. Based on the ADCIRC model (Luettich et al. 1992), Westerink et al. (2008) developed a storm surge model configuration covering the entire Gulf of Mexico and part of the Western Atlantic Ocean. The Louisiana coast has the finest resolution (~ 100 m) and the complex network of inlets, channels, lakes and bays is well represented. The total node number of the grid is 314,442. This high resolution enables the model to predict the peak storm surge with an absolute error less than 0.3 m. Storm surge can have the characteristics of free or forced long waves. For example, it may occur as seiches and resonate with the natural oscillation (Weenink, 1956;Rossiter, 1958). Weenink (1956) used a one-dimensional damped oscillator model for water level and captured the storm surge caused by two storms passing the North Sea within 5 days in 1954. In the fall of 1999, barotropic waves (together with reflections and refractions) generated by a fast moving (~ 30 m s -1 ) tropical storm caused storm surge which damaged several docks on the southeast coast of Newfoundland, Canada, with the storm itself several hundred miles off the coast and the local wind weak. A similar event occurred again in 2000 through the same mechanism (Mercer et al., 2002). Yankovsky (2008) reported long wave responses along the west coast of Florida induced by Hurricane Wilma after analyzing a set of high-resolution observations. A long wave pulse followed by a weak oscillating train was detected. The leading pulse had amplitude larger than 1.5 m and was identified as an edge wave, which was later confirmed by an idealized numerical experiment (Yankovsky, 2009). The accuracy and reliability of storm surge models have seen improvements over time. Now, operational models are routinely used. The readily available computational resource and numerical models also result in more process studies of storm surge, like its dependence on certain hurricane parameters. Rego and Li (2009) studied the effect of hurricane forward speed on storm surge in the Louisiana coast and found that a faster forward speed decreases the flood volume but increases the peak surge by a factor of 40%. The effect of hurricane RMW on storm surge was also examined. After the SSHS 1 (Saffir-Simpson Hurricane Scale) was published in 1974 (Simpson, 1974), there has been some misconception about SSHS being a reliable storm surge indicator, as pointed out by Irish et al. (2008). Hurricane Katrina in the record 2005 hurricane season (category 3 at landfall) caused a higher surge than Hurricane Andrew (category 5 at landfall) in Florida and Louisiana in 1992. This is contradictory to what the SSHS would suggest. Considering Hurricane Katrina was twice the size of Hurricane Andrew, Irish et al. (2008) suggested and confirmed by numerical experiments that hurricane size (RMW) is important, especially for strong hurricanes over mildly sloping coasts. In fact, there are several suggestions to replace SSHS with a new categorization system more suitable for storm surges. Kantha (2006) and Powell et al. (2007) recommended the use of the integrated kinetic energy of the hurricane wind field, in stead of SSHS which only uses the value of the maximum wind speed. Irish and Resio (2010) developed a non-dimensional \"SS\" (surge scale) based on simplified hydrodynamic equations. This scale incorporates parameters like hurricane wind speed, RMW, its approach angle and the regional bathymetry. Improved performance in the evaluation of storm surge height over SHSS was demonstrated (Irish et al., 2010). It is clear that storm surge is a very complex phenomenon with many factors playing their roles, including hurricane central pressure, maximum wind speed and RMW, its forward speed and track, the ocean bathymetry and coastline shape, the astronomical tide, the associated rainfall, and river stage. Because of this complexity, an important factor in one case might be found insignificant in another case, as shown by previous studies. It should be noted that those parameters are not necessarily independent of each other. For example, a change in the landfall point is not just a shift of the hurricane track: the bathymetry and coastline that the hurricane experiences change accordingly. And a change in hurricane central pressure would affect the wind field if the wind is calculated from the balanced wind equation. There is a possibility that this inter-dependence among parameters can lead to false conclusions. In this thesis, the experiments are highly simplified, so we can avoid some of these complications. Figure 1.1 shows the wide possibility of the angle at which hurricanes cross the coastline, which basically covers the whole (0°, 180°) range. In this thesis the approach angle θ is defined as the angle in degrees between the coastline and the hurricane track, measured clockwise from the coastline right of the landfall point (facing the north), which itself is designated as approach angle zero (Figure 1.3). It is the same as the one used by Jelesnianski (1966). With this definition, Hurricane Katrina has θ ~ 90°; while Hurricane Irene in the 2011 hurricane season has θ ~ 180° near the New Jersey coast. In reality, a typical hurricane track is curved and a single θ value is insufficient in describing the whole shape. However, considering that the most significant storm surge generation occurs when the hurricane is over shallow area, a straight segment can be used to approximate this short section of the track; then one θ value fully describes the track's directional information. "}, {"section_title": "Definition of Approach Angle θ", "text": ""}, {"section_title": "Simplifications", "text": "Because of storm surges' complexity and the idealized character of this study, several simplifications are made and described below."}, {"section_title": "Exclusion of tide", "text": "Tide can be very important for storm surge, especially when the tidal range is large. The coincidence of storm surge with high tide can be particularly disastrous. Many studies indicate that there are complex nonlinear interactions between tide and storm surge (Heaps, 1983;Jones and Davies, 2007;Rego and Li, 2010). This complexity is avoided by excluding tide."}, {"section_title": "Exclusion of atmospheric pressure", "text": "Hurricane is a weather system with a low pressure center, thus the exclusion of pressure effect may appear doubtful at first. Indeed, the atmospheric pressure depression produces a water mound which moves with the hurricane (Jelesnianski 1965). But in many cases the wind stress is more important than the pressure depression in causing storm surge. A scaling analysis confirms this. The decreased atmospheric pressure causes water level to rise (1 mbar depression ~ 1 cm water level rise) so that inside the water the isobaric surface can remain horizontal. This effect is called the inverse barometer effect. Take the water level rise as , then:  is the pressure depression (the pressure difference between the center and the outside of the hurricane). To find out the relative importance, the effect of wind stress is also expressed in terms of water level. Following Gill (1984, P340), the ratio of water levels caused by wind stress and pressure depression is:"}, {"section_title": "2", "text": "The scales of parameters for a typical hurricane are: The ratio is generally much larger than one and wind forcing is dominant. The hurricane parameters used in this thesis resemble those in the table and atmospheric pressure effect can be safely neglected."}, {"section_title": "Exclusion of wave effect", "text": "The term \"wave\" has different references according to the context. In the thesis it refers to those shallow-water ocean waves modified by the Earth rotation, for example, the large scale swell up or swell down of sea surface during storm surge. In oceanography we also have \"short waves\" usually generated by local winds, with wavelengths of tens of meters. Short waves appear during storm surges and are responsible for some major damages. Those riding on top of the increased water level can drive water to further height, running over levees and causing additional inundation. With higher frequency, the short waves have energy significant enough to damage coastal structures and buildings. Short waves need to be considered for local damage assessment. However, they do not affect the overall storm surge distribution. For simplicity, they are ignored in this study."}, {"section_title": "Barotropic assumption", "text": "A barotropic model does not have the effect of density variation. The reason for this assumption is that a storm surge is associated with strong wind mixing and thus weak baroclinic components. Many studies of storm surge have reasonably neglected the baroclinic effect (Jelesnianski, 1965;Das et al., 1974;Murty et al., 1986;Mousavi et al., 2010).  (Flierl and Robinson, 1972). These scenarios need separate studies. Straight coastlines are used for all experiments in this thesis."}, {"section_title": "Simplification of geometry", "text": ""}, {"section_title": "Research Method", "text": "Numerical experiment is the main research method. It is used to study specific effects such as the modifications of long waves by Coriolis force, and for systematic studies of hurricane approach angle and forward speed. Based on the simulation results, physical reasoning guided by wave dynamics is carried out. The equations used for the numerical experiments are listed below. 1 1 0 FORTRAN codes were written for some experiments. I also used a community model, the Finite Volume Coastal Ocean Model (FVCOM) version 2.7 (Chen et al., 2003). FVCOM has the advantage of better mass and momentum conservations. The unstructured grid can accurately capture complicated coastline variations, although this advantage is not seen when a simplified straight coastline is used. FVCOM also has wetting and drying treatment, enabling the study of inundation. The time range of experiments is typically two or three days, with a time step around one minute. In my own FORTRAN code I neglected all nonlinear terms in the above equations, while FVCOM solves the full version. In both cases, however, the results are interpreted with linear wave dynamics due to the small Rossby number. Besides using a personal computer, the LONI (Louisiana Optical Network Initiative) cluster computer system was also used. A script can be written to automate most parts of the simulation: changing one parameter, creating new input files, running the job and renaming/storing the output files. The Python scripting language was used for this task with its multithread functionality managing several simultaneous computation jobs."}, {"section_title": "Domain and Grid", "text": "There are several numerical experiments in this thesis. For those studied with my own FORTRAN codes, structured grids with the Arakawa-C arrangement (Arakawa and Lamb, 1977) are used. For those studied with FVCOM, grids are generated either with FORTRAN or an open source meshing package DistMesh (Persson and Strang, 2004), which is a collection of Matlab ® scripts. A grid used later is provided below (Figure 1.4 "}, {"section_title": "Wind Forcing", "text": "Many wind models have been proposed to represent the hurricane wind field in storm surge modeling (see a summary in Das, 1972). Here the wind model developed by Holland (1980) and used by many others is chosen. Because this thesis only deals with idealized cases, this model is sufficient. The model has an atmospheric pressure distribution defined by P = P c + (P n -P c ) exp(-A r -B ), in which P c and P n are pressures of the environment and of the hurricane center, respectively; A and B are empirical parameters. The tangential wind speed as a function of the radial distance from the hurricane center is: An example wind speed profile defined by the above formula is shown below (Figure 1.5). "}, {"section_title": "Thesis Structure", "text": "This thesis focuses on the effects of hurricane approach angle and forward speed by analyzing the results from numerical experiments with a hierarchy of complexity. In chapter 2 the main characteristics of shallow water wave propagations close to the coastline are studied. Chapter 3 is about the generation of the waves by hurricanes. Chapter 4 examines the effects of hurricane approach angle and forward speed. Chapter 5 presents experimental results after adding bathymetry to the simulation and allowing for inundation. Chapter 6 summarizes and concludes this thesis."}, {"section_title": "CHAPTER 2 KELVIN WAVES IN COASTAL AREAS", "text": ""}, {"section_title": "Introduction", "text": "A typical storm surge has a spatial scale of ~ 100 km and a time scale of ~ 1 day. For the Earth rotation effect to be important in a dynamical process, the corresponding Rossby number should be smaller than one. For a typical storm surge, which we reasonably assume produces a flow of about 1 m s -1 in the mid-latitudes where the Coriolis parameter is on the order of 10 -4 s -1 , the Rossby number is estimated as: U is the generated flow speed and L is the spatial scale of the storm surge. Here the Rossby number is ~ 0.1, which means that the Earth rotation is more important than inertia and it has significant effects on the dynamics.  "}, {"section_title": "The Kelvin Wave", "text": "Kelvin wave, named after Lord Kelvin (Kelvin, 1879), is a linear solution of the shallow water equation with Coriolis force included and with a solid lateral boundary. It can be expressed in terms of water level as: Equation 2.2 summarizes the main characteristics of the Kelvin wave. 1. It only propagates in one direction. Hereafter this direction will be referred to as \"downcoast\", and the opposite direction that does not support Kelvin wave will be called \"upcoast\". Along its direction of propagation the Kelvin wave is non-dispersive with a phase speed of , as if there were no rotation. 2. Its amplitude decreases exponentially in the cross-coast direction; the e-folding distance is the Rossby Deformation Radius R d = / . There is no propagation in this direction. These characteristics of Kelvin waves are demonstrated in many studies. Water level fluctuations in the equatorial Western Pacific Ocean send Kelvin waves along the Equator which continue propagating pole-ward after reaching the east Pacific coast (McWilliams, 2006). Tidal Kelvin wave curving around the British Channel, first reported by Doodson and Corkan (1932), is another well known example. The generation of Kelvin waves can be by tide or wind or incidences of waves from the ocean. The last one occurs through a rather complex reflection at the boundary (the complexity is due to the Earth rotation). The theoretical study by Crease (1956) showed that Kelvin waves can be generated in the rear side of a semi-infinite thin barrier by plane waves impinging on the barrier. The generated Kelvin wave then travels along the barrier to infinity without attenuation, giving a remote signal in the otherwise wave shadow region. Kajiura (1962) studied and showed the generation of Kelvin waves by the incidence of cylindrical waves onto an infinite, straight coast. To get a better appreciation of the generation of Kelvin waves and the Coriolis effect, a numerical experiment is carried out. It is based on the classic study of tidal wave reflection by Taylor (1922). With the help of numerical models, the transitional response is studied to understand the process. It will be shown that plane waves propagating into the channel evolve into Kelvin waves near the channel boundaries. On reaching the closed end of the channel, the Kelvin waves rotate around to \"reflect\" back. FVCOM is used for this experiment and the grid is created with FORTRAN. The rectangular domain (with two snapshots) is shown in Figure 2.2. Other parameters (latitude is 53°, width is 402 km and depth is 73.15 m) are chosen according to the geography of the North Sea, as in Taylor (1922). Bottom friction is neglected. The only forcing is the M 2 tide along one side of the domain, with amplitude of 2 m. The tide at this boundary starts from 0 m and achieves its maximum (2 m) in 3 hours. This very first crest is followed for examinations. Figure 2.3 shows the crest's cross-channel profiles at different times after it passed the left boundary and before it reaches the right boundary. Initially it has no crosschannel variations (the red curve). Without the Earth rotation this shape would have been maintained. However, with rotation, a cross-channel slope has to be established and over time the     The process can be described from these results. Wave motions near a boundary have particle velocities parallel to the boundary. The deflections of the velocity by the Coriolis force pile the water against the boundaries, producing a surface slope that requires velocities to be adjusted to balance the pressure gradient force. This is an oscillatory, interactive velocity-pressure adjustment. In this experiment, the adjustment is apparent within a few hours: hour 5 is about 2 hours after the left boundary had a high tide and the water level shape has already been significantly adjusted. Although this experiment uses a rectangular domain, the argument has broader implications. Disturbances next to the coast always have dominant velocity components parallel to the coastline. If the Rossby number is small, Coriolis force affects the motion and Kelvin waves can be generated. The systematic experiment in chapter 4 uses a semi-infinite ocean bounded by a straight coastline. The following experiment is carried out to further illustrate the Coriolis effect and long wave behaviors in such a domain."}, {"section_title": "Evolution of Waves along the Coast", "text": "Here a water level disturbance at the coast is set as the initial condition and subsequent evolutions are modeled. The domain and boundary conditions are described in section 1.5.   appears once the disturbance spreads over enough distance. In the last snapshot the most noticeable feature of the entire domain is one single down-coast propagating crest. We can show that it is a Kelvin wave. In Equation (2.2) a plane wave is used which does not readily apply to the waves in Figure 2.5 initialized by a cylindrically symmetric function. However, the crest does have the two basic characteristics of the Kelvin wave summarized before. We check them: 1. The propagation speed can be easily estimated, for example, from snapshots 2 and 6: which is close to the theoretical value = 22.1 m s -1 . 2. Following the down-coast crest as in the Taylor Because the time scale of the geostrophic adjustment is 1/f, which in this case is about 24 hr in time or about 1900 km in terms of the traveling distance of the gravity wave, a longer simulation time and a much larger domain are required to reach the fully adjusted state. Enough evidence has been provided, however, to show that the disturbance generates a Kelvin wave in the down-coast direction. At last we consider a wave maker at the origin, which is the same location as the water pulse, to provide a case with forcing continuous in time. It is defined by η(0,0,t) = sin(2π*t/T). The forcing period T is 2 hr. This is close to the time scale of a location experiencing opposite winds from a moving model hurricane used in later chapters. The water depth is 50 m and the Arakawa-C grid (Arakawa and Lamb, 1977) is used. There is no initial elevation or velocity in the domain. The \"analytic profile\" in the legend means the profile calculated from equation (22), with the same water level as the numerical profile at the coast. The lower panel is a snapshot at hour 9, just before the disturbance reaches the boundary, showing both the u velocity component (in m s -1 , color plot) and the water level (in m, contour plot).  Figure 2.7 The water level (in m, color and contour plots) and velocity (vector plot) at hour 4. The velocity orientations next to the up-coast portion of the coastline are turned right by the Coriolis force and point away from the coast. There is a vortex left at close to the location of the initial pulse, which is probably due to the effect of both the Coriolis force and the boundary. Without the boundary, the classic geostrophic adjustment in an infinite ocean occurs, with a reduced height bump and a clockwise velocity field in geostrophic balance as the final result. Next to a boundary, it requires a different response. Analytic solution of a similar problem with a semi-cylinder shaped initial disturbance was given by Minato (1982), which showed the formation of such a vortex.   2.9 The cross-coast water levels (m) of the first crests generated from the source. The left panel follows the down-coast crest and the right panel follows the up-coast crest. As before, the red curve is from the numerical result, and the blue curve is an exponentially decreasing profile plotted for comparison.   Kelvin wave can be generated by wind stress (Gill and Clarke, 1974;Beletsky et al., 1997). But the role of Kelvin wave in coastal oceans forced by a large scale hurricane wind field is unclear. The basic assumption of this thesis is that during a storm surge both Kelvin and Poincare waves are generated. Because of the difference in their propagations and the wave characteristics of the storm surge, they would play important roles in storm surge evolution."}, {"section_title": "CHAPTER 3 LONG WAVE GENERATION BY HURRICANE", "text": "In the last chapter the effect of Coriolis force in the coastal shallow water wave dynamics was discussed through several numerical experiments. If the hurricane wind field is considered as a moving wave source and the storm surge as a forced redistribution of water mass according to wave dynamics, then it is natural to expect that the different behaviors of Kelvin waves and Poincare waves to play important roles in such a process. This chapter uses two experiments to examine the wave generations by hurricanes."}, {"section_title": "A One-dimensional Model", "text": "We start with a simple one-dimensional model. The purpose is to find out the basic characteristics of wave generations by a sheared wind field moving over the water. The wind is assumed to be along the y-axis (can be positive or negative). Wind speed is however independent of y and changes with x. The variation of wind speed in the x direction is chosen to be close to that of a cross section through a hurricane center, and provides a first order crude approximation to the two-dimensional hurricane wind structure. This wind field moves along the x-axis at a constant forward speed. The governing equation is: 1 0 F y is the wind forcing in y direction, U is the constant forward speed of the wind field, and H is the water depth which is also constant. A coordinate transformation is needed before solving this equation. An Earth coordinate requires a very large domain or the storm would quickly move out of the domain before any pattern can be recognized. The Galilean Transformation (x -U t → x'; t → t') resolves this inconvenience by fixing the coordinate system onto the storm. The equation becomes (primes are removed): As expected, extra terms of advection appear. These terms need to be considered in choosing numerical schemes. Here a finite difference scheme on a staggered grid (Figure 3.1), with leapfrog time integration is used for its 2 nd order accuracy in both space and time. Numerical stability requires the time step of integration satisfy the CFL condition: dt < dx/(U + c), where c is the maximum gravity wave speed in the whole domain. A sponge layer (Palma and Matano, 1998) with 1000 km thickness is padded to the left and right boundaries 1 so waves can be absorbed with minimum reflections. A spatial filter (Shapiro, 1970) is used to remove high frequency numerical modes. The code (implemented with FORTRAN) is first verified by the classic Rossby Adjustment Problem (Rossby, 1938) which is governed by the same equation, but with no forcing. The analytic solution for a stepwise initial water level has a closed form formula for the u velocity (Gill, 1982): is the Heaviside function and J 0 (x) is the 0 th order Bessel function. Both the transient response and the final state show satisfactory agreements (Figure 3.2). Now we apply a wind stress defined by τ τ x e , with positive values pointing into and negative values out of the paper. First we look at a fast 1 moving storm (U = 20 m s -1 ; gh = 14 m s -1 ). The water depth is 20 m so the gravity wave speed is less than the forward speed of the storm. This happens in reality when the storm is moving over shallow water. The Coriolis parameter is set to be unrealistically high (2 * 10 -4 s -1 ) for the convenience of discussion, so that the water level variation has a shorter wavelength and the wavy pattern is visible within the limited numerical domain. The upper panel of Figure 3.3 shows the water level after the system reaches its steady state (here \"steady state\" means after the storm travels over the ocean for a long time, 8 days in this case). For this forward speed, no waves can propagate in front of the storm and a wake is developed (Figure 3.3).  = 14 m s -1 ): the steady state (upper panel) and the transient development (lower panel). The wind stress (in Pa) is scaled down by a factor of 1/20 so it resides in the plot range. For a slow moving storm the depth is increased to 50 m and the Coriolis parameter is changed to 7.29 * 10 -5 s -1 . These are the same parameters to be used in later chapters. The wave is quite different from the previous one (Figure 3.4). There is no wake for a slow moving storm in its steady state; instead the water level assumes a steady shape that moves at the same speed as the storm. This is in accordance with the result obtained by Geisler (1970): the equation of water level has a hyperbolic character for fast moving storms, but an elliptic character for slow moving ones. In the later case the steady state water level is similar to a \"spread\" in the shape of the wind stress function, with amplitude decreasing exponentially away from the wind field."}, {"section_title": "Forward Speed and Resonance", "text": "In order to assess the effect of forward speed on water level, several additional tests are done with different U values. Only storms with U = 5, 10, 15 m s -1 are considered. The responses are summarized in Figure 3.4: a faster forward speed actually produces a lower water level in its steady state. If we further reduce the water depth by half to 25 m, in which case the 15 m s -1 forward speed is close to the gravity wave speed ( = 15.6 m s -1 ). The \"steady state\" patterns change greatly (Figure 3.5). When U increases from 5 m s -1 to 10 m s -1 , the water level decreases as in the previous example (Figure 3.4). But for U = 15 m s -1 the water level increases dramatically and has a more vibrating pattern. This is resonance (Proudman, 1929;Li and Liu, 1987). This result indicates the importance of the relative magnitude of storm forward speed and local gravity wave speed. In real oceans, where bathymetry or changes as the storm moves to different locations, resonance may occur locally. Note that if the water level variation exceeds water depth through resonance, the linearization of the primitive equation is no longer valid. The analytic analysis by Li and Liu showed that the nonlinearity or friction will suppress the resonance (Li and Liu, 1987).  Next we look at the transient response of a moving storm with U = 10 m s -1 ( gh ~ 23 m s -1 , Figure 3.6). Unlike the fast case where the generated waves are behind the storm, waves can propagate both behind and ahead of a slow moving storm. The storm causes a disturbance that moves ahead of it, which is the forerunner of the storm surge (Jelesnianski, 1967). The forerunner is followed by water level variations with larger spatial scales. This is because the forerunner moves faster than the storm and over time causes the increase of distance between them. All these disturbances have large spatial scales such that there are no apparent oscillations. These characteristics are observed again in the next two-dimensional experiment. "}, {"section_title": "A Two-dimensional Model", "text": "Here a grid in a 1000 km * 800 km rectangular domain is generated for use with a twodimensional model (Figure 3.7). A spatial resolution of 5 km is used in both directions, with a total number of 201 * 161 grid points. The model hurricane starts from zero (no wind everywhere) and is ramped up in 4 hours until the full forcing function is achieved to avoid the generation of gravity waves due to abrupt forcing (Fandry and Steedman, 1994). A hurricane's intensity generally decreases quickly after landfall, due to the loss of energy source from its bottom and the excessive bottom friction. Here after the hurricane reaches 200 km inland it is specified to stop its motion and its maximum wind speed linearly diminishes to zero in 6 hours. The hurricane used in this experiment has a maximum wind speed of 40 m s -1 , RMW of 40 km and forward speed of 10 m s -1 . For one such hurricane moving perpendicular to the coast (θ 90°), the time series of water level from the location of the maximum surge is plotted in Figure   3.8. The water level begins to rise more than 12 hours before hurricane landfall. The maximum surge occurs about 0.5 hour after the landfall and is located 40 km to the right. This is in accordance with the results of Jelesnianski (1965) and Das et al. (1974). The surge then recedes with a quick drop of water level (back to ~ 0 m in less than 3 hours), followed by some oscillations and a slow decrease. Water level information at a single location is insufficient to show the development of the storm surge. Therefore, the time series at different locations are gathered together into one plot. It helps to keep the following in mind when reading these figures ( Figure 3.9 and 3.10): 1. Only a sequence of locations parallel (Figure 3.9) or perpendicular (Figure 3.10) to the coast is used in each plot. 2. In the plot of the along coast sequence, the curve in the middle is from the landfall point. The lower (upper) curves are from locations west (east) of the landfall point, respectively. In the plot of the cross-coast sequence, the lowest curve is from a location on the coast, and the upper curves are from locations further away from the coast (to the south). 3. The vertical shift between adjacent curves is 0.5 m in Figure 3.9 and 1.0 m in Figure  3.10. They can be used as scales. In Figure 3.9 it is clear that one pattern appearing in a curve reappears in the curve next to it with a time shift. Since the horizontal axis is time and the vertical arrangement contains spatial information, together these curves display wave propagation. The wave speed equals the gravity wave speed = 1912.54 km day -1 . One feature that should be emphasized in Figure 3.9 is the difference between the up and down-coast directions of wave propagation: the latter maintains the wave signals over long distances but the former does not. This is clear by tracking the wave patterns along the gray lines. This difference is more obvious when different hurricane approach angles are used, as will be shown later. The waves developing along the hurricane track (the north-south centerline of the domain) are shown by plotting the water level time series of the locations along it. As the first onedimensional experiment in this chapter, waves caused by a slow moving hurricane begin with a water bulge, the forerunner, which is followed by a depression (Figure 3.10, apparent for upper curves from locations away from the coast). They propagate at the speed of . The main water level increase is limited within a certain range of the coastline, and occurs around the time of landfall (the magenta rectangle in Figure 3.9). It causes waves propagating in both up and down-coast directions (Figure 3.9). The storm surges far away from the landfall point are sometimes called \"remote effects\". The importance of remote effects in real storm surges was documented and studied before (Mercer et al., 2002). An example from the Gulf of Mexico is Hurricane Dennis (Morey et al., 2006). A coastal location 275 km east of the landfall (near Pensacola, Florida) experienced an unexpectedly high storm surge: 1 m higher than the prediction by the SLOSH model (Jelesnianski et al., 1992). It was found that a remote effect accounted for this. Indeed, by using a larger numerical domain which allows waves generated in other places to propagate into the modeled area, the model result was dramatically improved to 5% accuracy in terms of the maximum surge height. The remote effect was identified as a topographic Rossby wave (Morey et al., 2006), considering that the sloping bathymetry and the under predicted location is to the east of the landfall. In Figure 3.  are produced for two extra hurricanes (Figure 3.12). They have the same wind parameters (maximum wind speed, RMW and forward speed) but different approach angles. The first hurricane has θ = 30° so it moves in a direction similar to the Kelvin wave, but slower than it; the second hurricane has θ = 150° and moves against the Kelvin wave. The difference is obvious. The hurricane with θ = 30° generates a clear down-coast propagating wave. By the way, the drastic change of the curves' shape around the location and time of hurricane landfall (the middle point of the red vertical line) is due to the strong wind forcing which boosts the surge height. After that the wave continues its down-coast propagation without noticeable changes in shape. On the contrary, the lower panel shows a more irregular wave pattern; those straight lines of gravity waves are plotted for contrast purpose: they do not mark any trend. and their roles in the evolution and distribution of storm surge will be explained."}, {"section_title": "CHAPTER 4 HURRICANE APPROACH ANGLE AND FORWARD SPEED", "text": "The effect of hurricane track on storm surge is complex, as shown in many studies (Jelesnianski, 1966;Flierl and Robinson, 1972;Das et al., 1974;Mercer et al., 2002;Weisberg and Zheng, 2006;Irish et al., 2008). Jelesnianski (1966) used five \"crossing angles\" and found that the maximum surge occurs at θ = 65° (by curve fitting) for the depth profile used. This was attributed to the different depth profiles along the hurricane track. Flierl and Robinson (1972) carried out numerical simulations in the Bay of Bengal and showed that 10% ~ 25% of the variation of the surge height could be caused by the \"track angle\" depending on the landfall point. Different approach angles were used by Weisberg and Zheng (2006) in their study of storm surges' sensitivity to hurricane parameters in the Tampa Bay, Florida. They showed that a storm surge in the bay would be maximized if the hurricane moves in such a direction: parallel to the coastline with wind directions ahead of the hurricane center towards the land. In the study of storm size's effect on storm surges at the Gulf coast, Irish et al. (2010) experimented with different approach angles for one forward speed (5.1 m s -1 ) and different bottom slopes. It was found that the maximum surge may decrease by 25% or increase by 8% depending on the angle, compared with the storm surge caused by a normal incidence hurricane; and surges produced by westward moving hurricanes (θ < 90° in this thesis' context) are relatively smaller. In the study of barotropic waves generated by tropical storms, Mercer et al. (2002) demonstrated the effect of approach angle acting through its change of the bathymetry along the storm track. A one degree change of the angle can lead to a surge increase of 0.5 m. Resonance due to the bathymetry explains this high sensitivity. While these prior results have revealed the importance of approach angle, the understanding of the details of the dynamics is still sketchy. The common goal of these studies was mostly to quantify the storm surge height caused by real hurricanes within a certain area under different scenarios. The results showed complicated contributions from different factors. For example, Flierl and Robinson (1972) based their study on the real bathymetry and coastline of the Bay of Bengal. This makes it difficult to isolate the effect of any specific parameter. The conclusion reached by Weisberg and Zheng (2006) is likely to be limited to the Tampa Bay which has a complex and unique geometry. The number of approach angles used (four) may not be sufficient for a more general conclusion. Other studies lacked a systematic approach as well in discussing the effect of approach angle. Thus a systematic study of the approach angle separated from the influences of other factors is needed. Such a study can shed some light on the process and mechanism of storm surge generation and propagation. Because of the reasons mentioned above, the numerical experiment conducted in this study is designed to minimize the number of controlling factors. It uses only model hurricanes moving along straight tracks at constant forward speeds. The water depth is constant and the coastline is straight. This eliminates most local effects and different approach angles make no difference in the depth or coastline the hurricane experiences. The model hurricane approaches the coast from all possible angles: 0° to 180° with 1° increments, Figure 4.1 shows all 181 tracks. The hurricane wind field is created as was described in chapter 1. Figure 4.1 All the approach angles used, from 0° to 180° with 1° increment."}, {"section_title": "Effect of Hurricane Approach Angle", "text": "The effect of approach angle by moving the same hurricane towards the landfall point (the origin of the numerical domain) from different directions is studied first. The following parameters are used: the maximum wind speed is 40 m s -1 , the RMW is 40 km and the hurricane forward speed is 10 m s -1 . The results from the 181 simulations are summarized into a single plot showing the maximum surge as a function of the approach angle (Figure 4.2). The hurricane approach angle affects the maximum surge to a large extent even though other parameters remain the same. However, the dependence does not appear to be simple and is not even monotonic. To understand the dynamics causing this variation, the detailed evolutions for a few angles are analyzed below. The foci will be on angle 132° which exhibited the maximum surge, and on angle 41° which showed a minimum. The first to be analyzed is angle 41°.   , 16, 22, 30, 40, 46, 55, 70, 85, 100, 117, 125, 131, 140, and 149) are chosen (marked by the red and yellow squares in   Figure   4.3). The reason is that the wave travels faster than the hurricane (similar to Figure 3.6). As the wave moves away from the region of the strongest wind forcing, the cylindrical propagation and possible dispersion reduce its magnitude. In Figures 4.4e -4.4h, the maximum water level shifts from the front of the hurricane to the coast. After reaching the coast it stays there and moves along the coastline. Those four snapshots correspond to the quick rise of water level to its maximum from t = 0.25 day to t = 0.4 day. The  Figure 4.4 Time sequence of water level (m), with the time (in hour) for each plot indicated in its title. Parameters are U = 10 m s -1 ; θ = 41°. Notice the first eight plots (a -h) each has its own color scale, while the remaining plots have the same color scale fixed in between (-0.5 m, 0.5 m). A and B in each subplot mark the positions of the maximum and minimum water level, respectively. The vectors show the wind field. The black line is the hurricane track and the black circle shows the hurricane location. The radius of the circle equals the RMW. ( fig. 4.4 cont'd) rise is due to the blocking of water movement by the coast, similar to the results in chapter 3. Together they show the Kelvin wave propagation in the down-coast direction. For the parameters of this experiment, the wave travels faster than the hurricane. In this way, the mechanical energy is carried away in the form of wave energy before the hurricane landfall. This reduces the potential water level of the storm surge. After the landfall, the wind weakens and disturbances in the domain propagate as free waves (Figures 4.4q -4.4r). Now we examine the case with θ = 132°. This hurricane has the largest surge of all the 181 cases. According to the snapshots (Figure 4.5), the storm surge development is similar to the previous one (Figures 4.5a -4.5h) until the surge reaches the coast (after snapshot    Figure 4.3 can now be explained. Poincare waves radiate in a wide span of directions from near the location of the maximum surge, this is not favorable for storm surge formation. The snapshots l ~ o in Figure 4.5 show that the peak surge occurs (around hour 22 in the right panel of Figure 4.3) when the hurricane is close to landfall and the strongest landward wind forcing presents. The remote effect is unimportant for this approach angle. Actually the angular dependence is weak around θ = 132°: in Figure 4.2 the curve is nearly flat for θ ∈ (100°, 140°). Now we examine the effect of hurricane forward speed. At the same time, we check whether the effect of hurricane approach angle obtained in this section holds in a broader context when the forward speed varies. Figure 4.5 Time sequence of water level (m), with the time (in hour) for each plot indicated in its title. Parameters are U = 10 m s -1 ; θ = 132°. Notice the first eight plots (a -h) each has its own color scale, while the remaining plots have the same color scale fixed in between (-0.5 m, 0.5 m). A and B in each subplot mark the positions of the maximum and minimum water level, respectively. The vectors show the wind field. The black line is the hurricane track and the black circle shows the hurricane location. The radius of the circle equals the RMW. .6 Colored lines (in red, green and blue) show the movement of the location of the maximum surge for two hurricanes with θ = 41° (upper panel) and θ = 132° (lower panel). The straight black line shows the hurricane track in each case. The red, green and blue sections roughly correspond in time to the initialization, intensification and dissipation of storm surge, respectively. The random looking of the blue lines is due to accidental superimpositions of free waves during storm surge dissipation. The colored background shows the maximum surge level achieved by each location. Figure 4.7 Time series of the x (blue) and y (green) coordinates of the location of the maximum surge for two hurricanes with θ = 41° (upper panel) and θ = 132° (lower panel). The portions marked with stars correspond to the green lines in Figure 4.6."}, {"section_title": "Effect of Hurricane Forward Speed", "text": "Intuitively an increase in the hurricane forward speed has two effects. First, the resultant wind speed of the right half of the hurricane becomes higher, so the wind forcing is stronger. Second, as the hurricane moves faster, it has less time to force the water. These two effects are opposed to each other in causing storm surge, as demonstrated by Rego and Li (2009). In addition, the resonance discussed in chapter 3 depends on forward speed and we can call it the third effect. As will be shown, a fourth effect, identified by numerical experiments in this section, is also important. Table 4.1 lists parameters for five more model hurricanes: only the forward speed is varied in comparison to the previous hurricane studied. Notice the larger forward speeds in Table   4.1 are uncommon or even unrealistic for storms in the tropical area, but they can be achieved by storms moving further north to the mid-latitudes (Ke and Yankovsky, 2011). Mercer et al. (2002) reported that in the falls of 1999 and 2000, two tropical storms with very fast forward speeds (~30 ms -1 ) crossed the banks of Newfoundland, Canada. Again for each forward speed 181 approach angles are used. Together with the results from the first experiment there are a total of 1086 simulations. The angular dependences for each hurricane forward speed are summarized together (upper panel of  Figure 4.8). The three effects of forward speed mentioned before can be excluded from later analysis. The reason is that for approach angles larger than 120°, the maximum surge changes little when the forward speed increases from 8 m s -1 to 15 m s -1 (Figure 4.8). In addition, the water depth is 50 m ( ~ 22.1 m s -1 ), so resonance can not occur for any of the forward speeds. When the hurricanes come from the southwest quadrant (θ > 90°), the maximum surge changes little with different U values; when the hurricanes come from the southeast quadrant (θ < 90°), the maximum surge clearly increases with U. For the fastest hurricane (U = 15 m s -1 ), the maximum surge occurs at θ max = 31°, in contrast to the first experiment (U = 10 m s -1 ; θ max = 132°). The U = 15 m s -1 case is used to find out the reason for this difference. Two approach angles θ = 31° and θ = 167° at which extremes occur are chosen to examine the details of storm surge evolution. As Figure 4.5, each hurricane has 16 snapshots ( Figures 4.9 and 4.10).     and the hurricane center. In the left panel, the maximum surge already occurred when the hurricane gets the closest to that location -the water level is actually dropping at that moment. In the right panel the two events (maximum surge and closest distance) occur at about the same time. We can say that the hurricane's direct forcing and the remote effect in the left panel superimpose to generate the surge in the right panel. This \"reuse\" of the wave energy dispersed away earlier causes surges higher than to be expected from direct forcing alone. Figure 4.12 Time series of water level (m) at the location of the maximum surge. The black curve in each subplot is the distance (unit is 500 km) between this location and the hurricane center. The time of the maximum surge is indicated by the text near the peak of the blue curve. Parameters are U = 10 m s -1 , θ = 41° for the left panel and U = 15 m s -1 , θ = 31° for the right panel. This effect of hurricane forward speed is further illustrated by Figure 4.13, which shows the temporal evolution of water level along the coastline for the above two hurricanes. For a complete comparison, similar plots are also made for the two hurricanes approaching from the southwest direction. They were used before in Figure 4.5 (U = 10 m s -1 , θ = 132°) and Figure 4.10 (U = 15 m s -1 , θ = 167°). In both panels of Figure 4.13, the red and blue bands are the dominant features. They are Kelvin waves because they only propagate in the down-coast direction at the gravity wave speed. The Kelvin waves form much earlier than the hurricane landfall (the black dot in each panel). The hook of the red band near the hurricane landfall is due to direct wind forcing. This forcing also sends a negative surge (the blue band) to the down-coast direction because the hurricane wind direction to the left of the landfall point is offshore. Towards the up-coast direction the surge is positive: the upper right quadrant of each panel has positive values. In Figure 4.14 the two  Figure 4.13 Temporal evolution of the water level (m) along the coastline. Parameters are U = 10 m s -1 , θ = 41° for the upper panel and U = 15 m s -1 , θ = 31° for the lower panel. The white plus marks the time and location of the maximum surge. The green line is the x coordinate of the hurricane center. The black dot on this line has x = 0, i.e., it marks the landfall. The hurricane in the lower panel moves faster so its landfall is earlier. The noticeable slant bands in each panel are Kelvin waves. The velocity can be verified against ~ 1912.54 km day -1 . Some small artificial reflections at the west boundary are visible because no OBC has perfect wave radiation. Figure 4.14 Temporal evolution of the water level (m) along the coastline. Parameters are U = 10 m s -1 , θ = 132° for the upper panel and U = 15 m s -1 , θ = 167° for the lower panel. The white plus marks the time and location of the maximum surge. The green line is the x coordinate of the hurricane center. The black dot on this line has x = 0, i.e., it marks the landfall. The hurricane in the lower panel moves faster so its landfall is earlier. Some small artificial reflections at the west boundary are visible because no OBC has perfect wave radiation. hurricanes have up-coast movements and suppress Kelvin wave generation. Kelvin waves can only be identified in that Figure after the wind forcing weakens. The surge in the upper panel of Figure 4.14 is relatively limited in both space and time. This is in accordance with the snapshots for this case in Figure 4.5. Compared with that, the lower panel of Figure 4.14 again shows the importance of hurricane forward speed albeit this time it is not related to Kelvin wave. This panel corresponds to Figure 4.10. Because of the fast forward speed, the hurricane is able to follow the forced wave for longer time. This continuous forcing leads to a more extensive storm surge along the coast. Together Figures 4.13 and 4.14 demonstrate in a compact way the importance of wave dynamics which we have been discussing since chapter 2."}, {"section_title": "Extra Experiments with Bottom Friction and Hurricane Size", "text": ""}, {"section_title": "Effect of Bottom Friction", "text": "All previous simulations in this chapter were carried out without bottom friction. To examine the effect of friction, we compare the maximum surges with and without bottom friction for the U = 10 m s -1 , θ = 132° case of the first experiment. The bottom drag coefficient is defined to be 0.0025. Figure 4.15 shows the time series of the maximum surge for the two cases. however does not alter the previous conclusions."}, {"section_title": "Effect of RMW", "text": "The 181 runs of the first experiment were repeated with a RMW 15 km larger. The increase in RMW systematically shifts the curve towards larger values (Figure 4.16). There are changes in the angular dependence as well, but overall the results are similar to the first experiment. The explanations provided in previous sections still apply. Figure 4.16 highlights the importance of RMW. For most approach angles, an increase of the RMW from 40 km to 55 km roughly doubles the maximum surge height, even though the two hurricanes are of the same category. The advantage of the \"energy perspective\" (Kantha, 2006;Powell and Reinhold, 2007) is clear here. Using only the maximum wind speed (as in SSHS) is not enough in describing the distribution of the wind field. Since storm surge is mainly caused by the energy input into the ocean by hurricane, a more appropriate approach may be to use the integrated kinetic energy of the whole wind field (Kantha, 2006;Powell and Reinhold, 2007). "}, {"section_title": "CHAPTER 5 SIMULATION WITH BATHYMETRY AND INUNDATION", "text": "At the end of his study of the statistical relation between hurricane central pressure and the maximum surge level, Hoover (1957) asked why \"the surges generated by Gulf of Mexico storms appear to be significantly greater than those generated by Atlantic coast storms\". Now it is generally agreed that storm surges over gently sloping continental shelves are often times more severe. Flierl and Robinson (1972) (Table 5.1) in which y is the distance from the coastline (landward direction is positive).  The land is a simple slope with the highest elevation 40 m at y = 40 km (the second column in Table 5.1). The model hurricane has a maximum wind speed of 40 m s -1 , RMW equals 30 km and forward speed equals 8 m s -1 . The bottom friction coefficient is 0.0025. The f-plane approximation is used with the Coriolis parameter defined at the latitude of 28°. The maximum surge height and the inundation volume ( Figure 5.3) are used to quantify the storm surge. Five approach angles are used and the results are summarized in Figure 5.4. Figure 5.3 An illustration of the surge height and the surge volume. The former is defined as the vertical distance (the arrows, in m) between the water level (cyan) and the land (brown). This figure has its maximum surge height located around y = 0 km. The light blue area is the inundation volume which is the total amount of water flushed over land (in km 3 ). The θ = 60° case has the highest surge and inundation volume, while the θ = 150° case has the lowest in both. The θ = 30° case is qualitatively different from other bell-like curves. Snapshots of the three cases are shown in Figure 5.5 (θ = 30°), Figure 5.6 (θ = 150°) and Figure 5.7 (θ = 60°). Near the coast the water is shallow and the gravity wave speed is no longer large compared with the hurricane forward speed (U = 8 m s -1 ). For example, the depth should be about 10 m (at y = 75 km) to have a gravity wave speed of 10 m s -1 . This suggests the direct forcing may be more important than wave motions. Nonetheless, certain characteristics of the storm surges caused by up and down-coast moving hurricanes in chapter 4 seem to remain here. The experiment shows non-trivial dependence of storm surge on hurricane approach angle in more realistic situations. The conclusions made in previous chapters provide certain understandings, but clearly more work needs to be done to elucidate the complex mechanism. With added complication of the existence of irregular coastlines, the results are expected to be even more complicated. Figure 5.4 The maximum surge height (upper panel) and the inundation volume (lower panel) for five hurricanes with different approach angles. Figure 5.5 The θ = 30° case. The surge height within (-300 km, 300 km) * (-50 km, 10 km) (upper panel) and a zoom-in to (-300 km, 300 km) * (0 km, 10 km) (lower panel). The blue line shows the hurricane track. In some subplots a red square marking the hurricane center is visible. The white plus shows the position with the maximum surge height whose value is indicated by the nearby text (m). Figure 5.6 The θ = 150° case. The surge height within (-300 km, 300 km) * (-50 km, 10 km) (upper panel) and a zoom-in to (-300 km, 300 km) * (0 km, 10 km) (lower panel). The blue line shows the hurricane track. In some subplots a red square marking the hurricane center is visible. The white plus shows the position with the maximum surge height whose value is indicated by the nearby text (m). Figure 5.7 The θ = 60° case. The surge height within (-300 km, 300 km) * (-50 km, 10 km) (upper panel) and a zoom-in to (-300 km, 300 km) * (0 km, 10 km) (lower panel). The blue line shows the hurricane track. In some subplots a red square marking the hurricane center is visible. The white plus shows the position with the maximum surge height whose value is indicated by the nearby text (m)."}, {"section_title": "CHAPTER 6 SUMMARY AND CONCLUSION", "text": "In this thesis the storm surge is considered as a forced long ocean wave influenced by the Earth's rotation. The hurricane is the wave source that creates the storm surge and affects its development. The motion of the hurricane is represented by two parameters: the approach angle θ and the forward speed U. The effects of both θ and U on the storm surge are the foci of this study. A typical storm surge has a small Rossby number which, for a flat bottom ocean, means there are two dominant wave types. The Kelvin wave near the coast, with its trapped character, is an important energy carrier. The fact that it only propagates in the down-coast direction explains why θ can significantly affect the storm surge. The Poincare wave is a shallow water wave modified by the Earth rotation to become dispersive. Unlike the Kelvin wave, it is not confined to the coast. Instead, it radiates wave energy in all possible directions. As the hurricane is the wave source, its motion over the ocean and the different propagation characteristics of the two types of waves affect storm surge development and evolution. The process studies in chapter 2 showed that, at the coast, the wave tends to evolve towards a Kelvin wave that propagates in the down-coast direction. When the wave generated by a hurricane reaches the coast, similar changes may or may not occur depending on the wave motion. With a coast in the north and a hurricane approaching it from the southeast direction (θ < 90°), both the forerunner and the subsequent forced surge satisfy this condition and Kelvin waves are generated. On the contrary, a hurricane moving from the southwest direction (θ > 90°) is less effective in Kelvin wave generation. After generation, the Kelvin wave propagates in the down-coast direction at the gravity wave speed. With a slow forward speed, a hurricane from the southeast direction is favorable to Kelvin wave generation. The energy is then carried away by the Kelvin wave from the landfall location and the potential storm surge height is reduced. The confined, along-coast motion of the Kelvin wave also affects large coastal area. For an up-coast moving hurricane, the Kelvin wave is insignificant and the storm surge is mainly affected by the Poincare wave. If we compare the upcoast and down-coast parts of the experiments in chapter 2, we can see that many differences in those results are similar to the results obtained in chapters 3 and 4; even though the latter cases are wind forced motions. The reason is that the uniform bathymetry, frictionless bottom and the straight coastline help manifest the characteristics of the two simple wave types. As a conclusion, the importance of hurricane approach angle θ is due to the difference in wave generation when different values of θ are specified. For hurricanes approaching from the southeast direction, as has been said, the Kelvin wave is important in this case. While the propagation of a Kelvin wave is well defined or \"fixed\" (downcoast at the gravity wave speed), the hurricane can still move with a variety of combinations of approach angle (only θ < 90°) and forward speed. There is a possibility that the Kelvin wave can be re-captured by the hurricane. In this thesis, an example is the hurricane with a forward speed of 15 m s -1 . When the Kelvin wave and direct wind forcing are superimposed, the storm surge is much higher than it would be expected from any single factor alone. This is the effect of hurricane forward speed studied in this thesis. It was also found that storm surges are sensitive to the hurricane size, or the RMW. A systematic experiment in chapter 4 showed that an increase of the RMW from 40 km to 55 km, with all the other parameters (including SSHS) kept the same, leads to a doubling of the maximum surge height for almost all approach angles. Physically, a larger hurricane forces the ocean over larger areas, thus tends to generate higher surge. This, however, is not reflected by the commonly used SSHS. In the real world, of course, the simple mechanisms of θ and U summarized above are complicated by other factors such as the uneven bathymetry, irregular coastline and time-varying hurricane motion (direction turns, faster and slower motions). For example, in this thesis only a straight coastline was used. If an indentation with the scale of the Rossby Deformation Radius is present on the coastline, wave propagation will be affected. There can be oscillations and reflections of the wave. The timing of the Kelvin wave with respect to the hurricane landfall will also change. This would be a quite different picture even if there is no other complication. Bathymetry variations can add such complication, because it determines the gravity wave speed. This may result in new wave types and affect the wave generation. In this these, only a qualitative evaluation was performed by the experiment in chapter 5. It was shown that different approach angles still have obvious effects when more realistic bathymetry and inundation are added. More importantly, the mechanisms from earlier simple experiments appear to have some applicability. The coastal geography and the hurricanes have great variations. The wind forcing of the hurricane alone (like the SSHS) is insufficient to determine the storm surge development. It is advisable to consider the hurricane approach angle and forward speed in the modeling and explanation of real storm surges."}]