[{"section_title": "Introduction", "text": "Establishing whether parental divorce has a causal negative effect on children's outcomes is a crucial issue for the evaluation of divorce and family laws. Several states in the U.S. have recently started tightening divorce requirements, reversing the liberalizing trend in divorce laws that began around 1970. 1 The proponents of tightening the divorce regime often argue that making divorce easier has negative consequences for children. However, as pointed out by Gruber (2004), this argument relies on three implicit suppositions. First, that easier divorce regulations cause an increase of divorce rates. Empirical work on this supposition has reached mixed conclusions: while Friedberger (1998) finds that there is an impact of unilateral divorce on divorce rates in the U.S., the evidence presented by Wolfers (2003) indicates that the increase in divorce rates is only transitional, disappearing after a decade. Second, that changes in divorce regulation only have an impact on families and children through their effect on the propensity to divorce. The third supposition that drives criticism of easier divorce regulations, on which this paper focuses, is that divorce has an adverse impact on children. There is an enormous literature that finds that experiencing parental divorce is negatively related to a wide variety of children's outcomes such as educational attainment, fertility choices (specially non-marital birth during teenage years), future earnings, employment status and welfare recipiency among others (many of these stud- 1 Unilateral divorce, which requires the willingness of only one spouse to divorce, rather than the consent of both spouses, was rare before the late 1960s but was in place in most states by the mid-1970s. ies are reviewed in Amato andKeith 1991, andHaveman andWolfe 1995). However, this large literature can hardly be interpreted causally because divorce is associated with socioeconomic characteristics that also determine children's attainments. For instance, there is a negative relationship between divorce and men's earning ability (Sander 1986). Moreover, even if socioeconomic information is available, the question of causality is further complicated because it is unlikely that these observable variables can fully capture the unobservable differences that may exist between families that choose to divorce and intact families; for example, it may be the conflict associated with divorce, rather than divorce per se, what leads to children's inferior outcomes. Therefore, it is easy to overstate the detrimental impact of divorce. Several studies have stressed the difficulties associated with the endogeneity of parental divorce. Manski et al. (1992) present and interpret alternative estimates of the effect of family structure on high school graduation, obtained under differing assumptions about the process generating family structure and high school outcomes. Sandefur and Wells (1997) and Bjorklund et al. (2004) use sibling data to control for unmeasured characteristics of families that are common to siblings. Corak (2001) assumes that parental loss by death is exogenous and argues that children with a bereaved background offer a benchmark to assess the endogeneity of parental loss through divorce, considering that any difference between the outcomes of individuals from bereaved and divorced backgrounds represents the consequences of an endogeneity bias. In a related paper, Lang and Zagorsky (2001) also consider parental death as an exogenous source of parental absence. Gruber (2004) states that \"what is required to appropriately identify the impact of divorce is an exogenous instrument that causes some families to divorce and others not, based on a factor independent of the determinants of their children's outcomes\" (p. 806). However, a valid instrument is hard to find in this context and not even changes in divorce laws could be considered as such if, as suggested by Stevenson and Wolfers (2003), changes in divorce regimes may directly affect the nature of intrafamily bargaining, with potential implications for children's outcomes. In this paper we revisit the question of whether parental divorce leads to children's worse outcomes using a nationally representative sample of youths from the National Education Longitudinal Study of 1998(NELS: 1988. We expand the existing empirical literature in two important ways. First, we examine the relationship between parental divorce and student's performance on standardized tests. Test scores are often used to evaluate the performance of students, teachers and schools (Kane and Staiger 2002) and many studies have shown that scores on cognitive tests taken during adolescent years are important determinants of future wages and employment probabilities (Murname et al. 1995;Neal and Johnson 1996;Cawley et al. 1997;Currie and Thomas 2001;Zax and Rees 2002). There is also evidence that the greater dispersion of cognitive test scores in the United States plays a role in explaining the fact that wage inequality is higher in the U.S. than in Europe (Blau and Kahn 2004). Moreover, psychologists (e.g. Harris, 1983) have shown that children's scores in cognitive and developmental tests are strong predictors of later outcomes. This voluminous literature suggests that test scores are important variables to examine. Second, our empirical approach, which is different from methods used in the literature, allows for the possibility that parental divorce is correlated with unobserved family characteristics that may influence children's outcomes. The longitudinal nature of the NELS allows us to account for the potential endogeneity of parental divorce by using double and triple differences models that rely on observing the outcomes of children from intact and divorced backgrounds before and after the divorce takes place. Our main finding is that parental divorce does not adversely affect teenagers' cognitive skills. Teenagers from divorced families appear to perform worse than their counterparts from intact families before the divorce actually takes place. Our results also suggest that cross-section estimates actually overstate the detrimental effect of parental divorce. The paper proceeds as follows. Section 2 lays out our empirical strategy for identifying the impact of parental divorce on adolescents' cognitive ability. The data set used is described in Section 3. Section 4 discusses the results and Section 5 offers some concluding comments."}, {"section_title": "Empirical Model", "text": "Let Y (i, t) be the outcome of interest for teenager i at time t. As a starting point, let us assume that we observe the population of youths in two periods, t = 1 and t = 2. Between these two periods, some fraction of the population experiences parental divorce. We denote D(i, t) = 1 if teenager i has experienced parental divorce between period 1 and period 2 and D(i, t) = 0 if teenager i's parents are still married in period 2. Since teenagers are only exposed to parental divorce after period 1, D(i, 1) = 0 for all i by definition and youth with D(i, 2) = 1 are called treated while those with D(i, 2) = 0 are called controls. The following formulation of the difference-indifferences (DID) framework is based on that in Ashenfelter and Card (1985) and Abadie (2005). Suppose that Y (i, t) follows a components-of-variance scheme: where δ(t) is a time-specific component, α is the impact of parental divorce and υ(i, t) is a serially uncorrelated transitory component. Finally, η(i) is an individual-specific component that represents unobserved pre-disruption characteristics such as the conflict between the parents or the stress and friction associated with an unhappy family life. If D(i, t) is independent of η(i) and υ(i, t), then the difference in test scores between treated and controls in t = 2 will estimate the effect of parental divorce α. However, D(i, t) is very likely to be correlated with η(i). Given the longitudinal nature of the NELS:1988, which we describe in detail in the next section, both pre-divorce and post-divorce data are actually available. Hence, one could control for η(i) by comparing the scores of teenagers from divorced families with the scores of these same teenagers before the divorce occurs. However, this comparison might be contaminated by temporal variation in test scores that is not due to parental divorce. Since not all the teenagers in the population experience parental divorce, teenagers from intact families can be used to identify temporal variation in the outcome that is not due to divorce. This is the main idea behind the DID estimator. Differencing (1) with respect to t we obtain: where δ = δ(2) − δ(1). The parameters of interest are identified under the condition P (D(i, 2) = 1|υ(i, t)) = P (D(i, 2) = 1) for t = 1, 2. Under this restriction, the least square estimator of α is the sample counterpart of the following equation:  where π = π(2) − π(1) and X(i) is a vector of observed characteristics that are assumed uncorrelated with υ(i, t). Note that the model is now identified under the In other words, if non-parallel test score dynamics for the treated and the controls can be explained by including covariates, then model 3 is identified. Accordingly, the plausibility of this condition relies on the inclusion of a rich set of covariates. However, if the dynamics of test scores depend on unobservables, or, in other words, if the unobserved variation associated with divorce is not fixed over time, identification breaks down. 3 One way to assess the plausibility of the identifying condition is to use data on more than one pre-divorce period (that is, use data for t = 0 as well) to apply the DID estimator to at least two pre-divorce periods and test that α is equal to zero: where γ = γ(1)−γ(0) and τ = τ (1)−τ (0). Alternatively to the DID model and in order to relax its identifying condition, we also apply a difference-in-difference-in-differences (DIDID) estimator to the three data periods. The DIDID model, which is obtained by substracting equation 4 from equation 3, is identified under the more general condition that unobserved factors jointly influencing cognitive development and the probability of divorce grow at a constant rate. 4"}, {"section_title": "Data", "text": "The individual data used in this paper are from the National Educational Longitudi-  -ups in 1990, 1992, 1994 and 2000. 5 The first follow-up includes responses from approximately 17,500 of the students from the first wave while the second follow-up includes approximately 16,500 students from the original cohort. On the questionnaires, students reported on a range of topics including school, work and home experiences. Depending on the year, data were also collected from parents, schools and teachers. In addition, for the three in-school waves of data collection (1988, 1990 and 1992), cognitive tests were administered. The administration of cognitive tests in multiple waves allows us to analyse the impact of changes in teenagers' lives on their performance on standardized tests. The NELS:88 cognitive test battery consists of multiple choice tests in four subject areas: reading comprehension, mathematics, science and history/citizenship/geography. In the base year, all students received the same set of tests. In order to avoid \"ceiling\" and \"floor\" effects, that is, many students getting either all items correct or incorrect, the reading and mathematics tests in the first and second follow-ups were tailored to students' ability levels in the previous wave. Item Response Theory was used to develop scores that are on the same scale and thus can be compared to measure gains in achievement over time. The maximum possible scores that a teenager could achieve are 81 in mathematics, 38 in science, 47 in history and 54 in reading. Our identification strategy, described in the previous section, requires observing teenagers' outcomes before and after parental divorce. 6 Therefore, we depart from a sample of approximately 16,500 teenagers who participated in the first three waves of the data. Furthermore, our estimation strategy requires having information on test scores in at least two points in time and being able to code family transitions during high school. A unique feature of the NELS:88 data is that youth who leave high school prior to graduation continue to be interviewed throughout the longitudinal study. It is therefore possible to include in our analyses dropouts who are not represented in other national school-based surveys. Moreover, students who had transferred out of the school from which they had initially been selected were subsampled and reinterviewed. It is also worth noting that all statistics presented in this paper are weighted using NELS:88 weights, which attempt to compensate for unequal probabilities of selection and to adjust for the effects of nonresponse. 7 In order to code family transitions, we have used information from the parent questionnaires and we have contrasted it with the information provided by students. We have classified families into two broad categories in 1988: intact families (with both biological parents) and non-intact families (stepfamilies and single parent families). For the majority of our analyses, which require observing teenagers before and after parental divorce, we have departed from the sample of students from intact families in 1988 and then identified those who experience parental divorce during high school and those whose families remain intact. 8 In order to focus on the impact of parental divorce, 7 Weights are calculated in two main steps. In the first step, unadjusted weights are calculated as the inverse of the probabilities of selection, taking into account all stages of the sample selection process. In the second step, these initial weights are adjusted to compensate for nonresponse; such nonresponse adjustments are typically carried out separately within multiple weighting cells. The nonresponse adjustment factor was intended to adjust for the fact that some of the sampled students did not participate, that is, did not return a completed questionnaire. 8 The NELS:88 information on parental marital status does not allow us to distinguish between we exclude teenagers who experience parental death during high school. Regarding multiple transitions, we have counted families that undergo divorce and subsequently remarry while their child is in high school as divorced families, but our results are unchanged when eliminating these families. In line with the idea that children of divorce come from more disadvantaged backgrounds than children from intact families, intact families on the 1992 mathematics test. To assess the magnitude of these effects, we also use the student's 12th-grade percentile rank based on her 12th-grade score in all the tests as dependent variables. The results of these analyses, shown in column 2, suggest that experiencing parental divorce reduces test score ranks in mathematics, science, history and reading by 12, 11, 11 and 7 percentile points, respectively. Part of the estimated difference in test scores between teenagers from divorced and intact families may be due to the observed background differences highlighted in Section 3. Hence, we now explore whether these findings are robust to the inclusion of controls. First, consider the coefficients on some of the explanatory variables, reported in Table 3. There are statistically significant and negative impacts on the mathematics score from being Black or Hispanic, working more than 21 hours per week and attending a public school. On the other hand, having highly educated parents, coming from families with high socioeconomic status, having a working mother, being male and not living in the South appear to increase the mathematics score. 13 Regarding the impact of parental divorce, conditional estimates for all four examinations are also reported in Table 2 (columns 3 and 4, row 1 of each panel). It is found that parental divorce is associated with a decrease of approximately 4-5 points in the mathematics, science and history percentile ranks, while the reading rank is only reduced by approximately 2 percentile points and it is not statistically significantly. The results suggest that conditional coefficient estimates are substantially smaller in ab- 13 We obtain qualitatively very similar results for the other three examinations, with the notable exception of the statistically significant and negative impact on the reading score from being male. solute value than the unconditional estimates displayed in columns 1 and 2. However, they are still negative and (with the exception of the reading examination) statistically significant at standard levels and the associated percentage effects range between 5% (mathematics score) and 2% (reading score). 14 The estimated negative effects so far obtained are generally in line with previous studies on the implications of parental divorce. However, they may overstate the detrimental impact of divorce if they measure both the effect of parental divorce and the effect of unobserved family characteristics, η(i), associated with divorce. In fact, when equation 1is estimated using 1990 (10th-grade grade) test scores information (Table   2, row 2 of each panel), it is found that, prior to parental divorce, teenagers whose parents will divorce between 1990 and 1992 perform worse than their counterparts from intact families. This is consistent with the results of Piketty (2003), which reveal that pre-separation children do as bad at school as single-parent children in France. As a next step in our analysis we use a DID estimator, which is obtained by comparing the change in test scores for teenagers who are exposed to parental divorce with the change in test scores for teenagers from intact families. DID estimates without and with covariates (equations (2) and (3), respectively) are displayed in row 3 of each 14 There are alternative ways of assessing the magnitude of the effects. We have also computed the percentage variation of test scores due to parental divorce as  Corak (2001), who uses Canadian administrative data and concludes that, with respect to labor market outcomes such as earnings and use of social programs, the causal impact of divorce is relatively \"mild or insignificant\"(p. 712). Along the same lines, Lang and Zagorsky (2001) use data from the NLSY and find little evidence that a parent's presence during childhood affects educational and labor market outcomes. 15 The NELS:88 dataset does not contain information on parental marital status after 12th grade. Therefore, one may be concerned that we are underestimating the impact of parental divorce by including in our control group teenagers from families that will go through a divorce after the high school period. In order to address this issue, we have performed a simple simulation exercise: we have assumed that teenagers from intact families with low test scores are those more likely to experience parental divorce later in life and we have re-estimated our DIDID models by dropping from our sample those teenagers from intact families with test scores in the lower tail of the distribution. The results of this analyisis suggest that in order to find a statistically significant effect of parental divorce one would need to eliminate at least 30% of the teenagers currently classified as belonging to intact families and even in this case the magnitude of the estimated effect would not be bigger than 2.3 percentile points."}, {"section_title": "The Impact of Parental Divorce by Adolescent Characteristics", "text": "Although our analyses mainly focus on the average effect of parental divorce, it may be that it has little impact on most teenagers but a very important impact on certain groups. Hence, we also evaluate the impact of parental divorce for teenagers with specified characteristics in Table 5. The results in Table 5 reveal that the effect of parental divorce is very small for all the categorizations of the data examined. We find that coefficient estimates are never statistically significant at standard levels and we cannot reject the hypothesis that the effects are equal for the mutually exclusive groups considered. For the sake of brevity, Table 5 only displays results for the mathematics score. However, an examination of the corresponding findings for the science, history and reading scores indicated that they were remarkably similar. This suggests that the impact of parental divorce does not significantly differ across groups of adolescents."}, {"section_title": "Age at Time of Parental Divorce", "text": "We have so far analysed the effect of experiencing parental divorce for the population of teenagers whose parents divorced while they were between the 10-th and 12th-grade. However, the impact of parental divorce may be greater if the divorce occurs when children are younger. Moreover, to the extent that regulations that tighten the divorce regime do not avoid divorce but delay it by a few years, it is also interesting to explore the differences between children whose parents divorced while they were between the 10th-grade and 12th-grade grade with children whose parents divorced at earlier ages. Given that cognitive tests were also administered in the 1988 wave of the NELS:88, some evidence on this issue can be provided by estimating the effect of experiencing parental divorce between 1988 and 1990 on the 1990 (10th-grade grade) test scores. The results of this analysis are reported in Table 6. 16 All DID coefficient estimates are now negative, including those corresponding to the reading and science examinations, which are positive in Table 2. However, the estimated effects remain very small and statistically insignificant at standard levels in most cases. Moreover we cannot reject the hypothesis that these effects equal those reported in Table 2. This indicates that parental divorce is not more detrimental if it occurs when children are younger, at least as long as they are between the 8-th and 12th-grade grade. This finding is consistent with Cherlin et al. (1995) and Piketty (2003). Cherlin et al. (1995) use British data and find that the timing of parental divorce (ages 7 to 11 versus ages 11 to 16) in a child's life does not make a difference for young adult outcomes. Piketty (2003) obtains analogous results by analysing French data on school performance."}, {"section_title": "\"Less Immediate\" Effects of Parental Divorce on Cognitive Ability", "text": "Thus far, we have estimated the impact of parental divorce on cognitive development in a relatively short interval after the divorce occurs. However, the effect of parental divorce may be attenuated over time. Insight into the \"less immediate\" impact of parental divorce can be found by examining the impact of divorce between 1988 and 1990 on cognitive test scores in 1992, ensuring at least a two-year lag between the dates of the divorce and the examination. 17 Table 7 reports the results of this analysis. For the math, history and reading examinations, it is found that the estimated effects of parental divorce appear to be more detrimental than the more immediate effects displayed in Table 6. However, both effects are very modest and we cannot reject the hypothesis that they are equal. This suggests that the long run and the short run effects of parental divorce do not significantly differ."}, {"section_title": "Summary and Conclusions", "text": "This paper examines whether parental divorce negatively affects students' performance as measured on standardized tests. The negative association between parental divorce and children's outcomes has been documented extensively. However, this negative relationship may be reflecting unobserved family differences between teenagers from divorced and intact families. In order to account for the endogeneity of parental divorce we employ double and triple differences models which control for the family specific effects operating through the parental divorce decision. Our empirical work identifies several important results. First, parental divorce does not have a negative causal effect on teenagers' cognitive development. Our evidence also suggests that the impact of parental divorce is almost invariant across groups of adolescents. Second, we report that teenagers from divorced families perform worse than their counterparts from intact families before the divorce actually takes place. Our empirical analysis strengthens the evidence that cross-section estimates actually overstate the adverse impact of parental divorce. Third, parental divorce does not appear to be significantly reduced over time. Finally, we find that parental divorce is not more adverse for teenagers if it occurs when they are younger, at least as long as they are in grades 8-12. Overall, our findings suggest that the impact of parental divorce on students performance is much less adverse than is suggested by earlier studies based on cross-section analyses that do not control for endogeneity. However, due to data limitations our analysis focuses exclusively on teenagers and we cannot exclude the possibility that parental divorce may be more detrimental for younger children.     Note: Robust standard errors given in parentheses with p<0.1=˜, p<0.05=* and p<0.01=**. N. Obs.=7,967 for maths. DIDID stands for difference-in-difference-in-differences. All specifications include the control variables listed in Table 1.  Note: Robust standard errors given in parentheses with p<0.1=˜, p<0.05=* and p<0.01=**. N. Obs.=7,869 for maths, 7,802 for science, 7,709 for history and 7,878 for reading. DID stands for difference-in-differences."}]