[{"section_title": "", "text": "Problem-Solving in Technology Rich Environments and Self-Rated Health Among Adults in the U.S.: An Analysis of the Program for the International Assessment of Adult Competencies Everyday problem-solving skills, or the ability to find effective solutions for everyday challenges, have been shown to be an important predictor of health status among aging adults (Mienaltowski 2011;Thornton, Deria, Gelb, Shapiro & Hill, 2007). Further, age-related cognitive declines can contribute to difficulties in everyday problem solving that involve domains such as processing speed, working memory, and inductive reasoning (Mienaltowski, 2011;Schaie, Willis & Caskie, 2004). In an era of digital technology, health-related information and patient-physician communications is increasingly being integrated through emerging technologies like computerized systems, which may present a unique challenges associated with managing one's own health and navigating healthcare systems in later life (Gordon & Hornbrook, 2018). In the context of an aging society and given the increasing reliance on technology in healthcare settings and health management, problem solving skills in an environment of fast-changing digital technology could influence the health of middle-age and older adults by limiting access to and use of digitalized health information (Mackert, Mabry-Flynn, Champlin, Donovan, & Pounders, 2016)."}, {"section_title": "Literature Review", "text": ""}, {"section_title": "Problem Solving and Health", "text": "Problem solving skills (PSS) refer to individuals' ability to draw from accumulated knowledge/experience and critical thinking skills to reach sound solutions and adapt to everyday challenging environments (Mienaltowski, 2011). Problem solving may require that individuals recruit different skills based on the nature of the 'challenge' at hand. For instance, crystallized intelligence is knowledge or experience that is accumulated over time and remains as a person ages, such as language, or general knowledge. In contrast, fluid intelligence refers to the ability to solve unfamiliar problems and use critical thinking skills through processing speed, inductive reasoning, and working memory (Ziegler, Cengia, Mussel, & Gerstorf, 2015). Skills related to fluid intelligence have been shown to decrease starting in the late-twenties and mid-thirties, while crystallized intelligence is thought to remain stable in mid-life until there is a gradual decline in the seventies and eighties (Schaie et al., 2004). Thus, solving problems that require fluid skills (e.g., processing speed, inductive reasoning) can be more challenging in middle and older adulthood due to age-related cognitive declines. These age-related changes in strategies for problem solving can result in different individual outcomes across the life course (Artistico, Cervone, & Pezzuti, 2003;Burton, Strauss, Hultsch, & Hunter, 2006). For instance, differences in PSS can have important consequences for health and health behaviors later in life. There is now evidence that PSS are moderately related to a number of health conditions and overall health status. Visser and colleagues (2015) found that among stroke survivors, greater PSS are associated with better health related quality of life. PSS have been also studied in the context of diabetes self-care (King et al., 2010), mobility (Areáin et al., 2015, and ability to complete Activities of Daily Living (ADLs) or instrumental activities of daily living (IADLs) (Kimber, 2013). The positive relationship between PSS and health-related outcomes are generally consistent. These studies support that PSS is a predictor of health status. Similarly, problem-solving therapy (PST) has shown positive health-related outcomes such as reduced depressive symptoms in several clinical trials and interventions for older adults (e.g., Areán, Raue, Mackin, Kanellopoulos, McCulloch & Alexopoulos, 2010;Gustavson, Alexopoulos, Niu, McCulloch, Meade & Areán, 2016). PST is a problem-focused cognitive-behavioral intervention that promotes proactive problem solving and positive coping strategies (Haley, 1987). Overall, this body of research supports a positive relationship between problem solving and health in middle and older adulthood."}, {"section_title": "Technology and Health", "text": "Although PSS has been associated with health, the roles of specific PSS components remain understudied (Kimbler, 2013). This is particularly the case for PSS in the context of technology-rich environments (PSTRE). PSTRE refers to \"using digital technology, communication tools and networks to acquire and evaluate information, communicate with others and perform practical tasks\" (OECD, 2012, p.46). High PSTRE skills can facilitate the successful attainment and assessment of health information using digital sources, providing individuals with greater PSTRE with additional health-promoting opportunities and resources. Limited research has examined the direct influence of PSTRE and its effect on health. Among such studies, Prins and colleagues (2015) found that an increase in PSTRE was associated with 7.6% greater odds of reporting better self-rated health among adults aged 16-65. However, this relationship became non-significant after accounting for sociodemographic characteristics. Importantly, adults over the age of 65 were not included in their analysis. The second half of adult life is a life stage where individuals often experience declining health. Given the growing presence of technology in healthcare and health care management (Mackert et al., 2016), the use of problem-solving skills within technology-rich environment present opportunities for promoting the health of middle age and older adults. In an era of digital technology, health-related information and patient-physician communications are increasingly being provided through web-based modalities (Gordon & Hornbrook, 2018). For instance, eHealth, or consumer health information technologies allow prompt access to patient-physician communication and health-promoting information (Gewald & Rockmann, 2016). The role of technology in healthcare is likely to continue expanding, which offers opportunities for health promotion by allowing individuals to take active control of their health management (Jacobs, Lou, Ownby, & Caballero, 2016). The Healthy People 2020 initiative calls for the use of health information technology as a tool for improving population health and health care quality. However, utilizing these resources requires basic knowledge and the ability to adapt to emerging technologies (Czaja et al., 2006). Digital health literacy has been used to capture the skills required to use technology for health management and health information seeking (Norman & Skinner, 2006). Older adults may face a number of barriers that limit their digital health literacy. For instance, older adults may have less familiarity with the use of digital technology and may be less likely to use these resources (e.g., online health information management system) for health management (Gordon & Hornbrook, 2018). Differences in access to digital technologies and the ability to use these technologies to obtain health information can contribute to health disparities for middle and older adults."}, {"section_title": "Conceptual Model", "text": "Given a lack of conceptual scholarship involving a direct relationship between PSTRE and health, we draw from two relevant conceptual models: Paasche-Orlow and Wolf 's (2007) model linking health literacy to health outcomes, and Gewald's and Rockmann's (2016) model of enhanced eHealth use. Health literacy is defined as \"the degree to which individuals have the capacity to obtain, process, and understand basic health information and services needed to make appropriate health decisions\" (U.S. Department of Health and Human Services, 2010). On the other hand, PSTRE can be considered a specific type of general PSS. Given the increasing interest in health and digital technology in later life, we apply these conceptual models to in Technology Rich Environments (PSTRE) skills. The U.S. PIAAC uses a four-stage stratified probability method to recruit adults between the ages of 16 and 74. PIAAC provides final sampling and replicate weights to correctly estimate nationally representative results (AIR PIAAC Team, n.d.). Additional technical information about PIAAC has been published elsewhere (National Center for Education Statistics, 2017). The current analysis uses data for adults over the age of 35. Our decision for this age cut-off is based on support for changes in cognitive skills (i.e., fluid intelligence indicators) that relate to problem-solving that involves novel problems (e.g., emerging technologies). Of 4,532 eligible respondents, our final analytic sample consisted of 3,260 respondents who were randomly selected to complete the PSTRE module."}, {"section_title": "Variables", "text": "Outcome variable. Our outcome of interest is self-rated health. PIAAC respondents were asked the following question: \"In general, would you say your health is excellent, very good, good, fair, or poor?\" In light of the low number of fair and poor health responses, self-rated health was dichotomized as (1=good health [excellent, very good, good] or 0= poor health [fair, poor]). Predictor variables. PSTRE was analyzed by a set of 10 statistically estimated means (i.e., plausible values; range 0-500) based on the respondents' performance on a select number of PSTRE-related tasks (OECD, 2012a). PIAAC's PSTRE domain measures and quantifies individuals' ability to use digital devices and software applications to solve everyday tasks. More specifically, the PIAAC assesses PSTRE skills by presenting respondents with a set of computerbased tasks of increasing difficulty. These tasks incorporate adaptive response functions and are timed in order to rigorously assess individuals' PSTRE skills. For example, a simpler task asks individuals to organize or sort large numbers of digital files according to their size, or adjust software program settings according to specific instructions (OECD, 2012a, p.55). More complex tasks may involve locating an email, opening its attachments, and using the attached information to create simple graphics and tables. (See Chapter 5 of the OECD's 2012a technical report for detailed information and additional sample items). Age was measured in two different ways: in five-year intervals (i.e., 35-39, 40-44, 45-49, 50-54, 55-59, 60-65, 66-70, and 71+) and ten-year intervals (i.e., 35-44, 45-54, 55-65, 66 +). Although the five-year interval provides more detailed information and was used in the main analysis, the ten-year intervals were included in subgroup analyses, given the small sample size and distribution of two relevant covariates (health insurance and income) in older age groups. This decision was made based on PIAAC-specific recommendations, which suggests a minimum subgroup sample size of 62 in order to produce meaningful, reliable results (AIR PIAAC Team, n.d). Covariates. Sex was coded as 1-female and 0-male. Race/ethnicity was dichotomized to reflect whether a respondent identified as non-Hispanic white or some other race/ethnicity (1non-Hispanic white and 0-other). The sample size for the specific race/ethnic groups was insufficient. Educational attainment was dichotomized to represent 1-college degree or higher and 0-less than a college degree. Income was categorized based on a five-category scale developed by PIAAC to illustrate representative income quintiles (1-lowest income to 5-highest income). Non-employed individuals, or those with no income, were aggregated to the lowest income quintile given PIAAC's classification of the unemployed as non-earners. A dichotomous variable was used to denote whether a respondent had health insurance (1-yes and 0-no). Finally, based on Gewald and Rockmann's (2016) conceptual model of technology and health, we included a variable to capture the use of the internet for health-information seeking. Based on the question \"How much information about health issues do you get from the Internet?\" and the responses, \"a lot\", \"some\", \"a little\", and \"none\", we dichotomized internet use for health information-seeking (1=yes [\"a lot\", \"some\"] and 0=no [\"a little\", and \"none\"]) based on conceptual and distributional considerations."}, {"section_title": "Analytical Approach", "text": "We used the IDB Analyzer version 4.0.14, developed by the International Association for the Evaluation of Educational Achievement (2017). The IDB Analyzer generates a macro program that can be executed using SPSS or SAS software in order to estimate representative figures with PIAAC data, and incorporates sampling weights (SPFWT0), replicate weights (SPFWT1-SPFWT80), and PSTRE plausible values into the statistical analysis (AIR PIAAC Team, n.d; IBM SPSS Statistics, 2017; SAS Institute Inc, 2013). Unweighted descriptive statistics were computed for all variables included in the final model. In order to address our first research question (Is there an association between PSTRE and self-rated health?), we used a fully adjusted binary logistic regression to model self-reported health [dichotomized given the skewed distribution and conceptual reasons for the meaningful groups (positive vs. negative health)] as a function of PSTRE values while adjusting for covariates (Wright, 1995). We also constructed unadjusted models to establish the baseline models. To address our second research question (are there significant age differences in the relationship between PSTRE and self-rated health?), we conducted a series of logistic regression analyses for age groups based on the five-and ten-year intervals. In order to explore meaningful age-group specifications in the context of our research, age in five and ten-year intervals were used in separate analyses. Our decision to utilize both age categorizations (i.e., five and ten-year intervals) for the sub-group analysis was informed by the PIAAC guidelines requiring the use of subgroups with more than 62 observations in order to make accurate estimations (AIR PIAAC Team, n.d.). Due to the small sample sizes for those who were not employed and/or uninsured among older age groups, we eliminated income and health insurance from our covariates in the sub-group analysis. This way, the model specifications were consistent across the age groups and results were comparable. Since the objective of the sub-group analysis is to explore the relationship between the self-reported health and PSTRE across age groups, the comparable models were required. Finally, given the conceptual relevance of health information seeking using the internet, we tested an interaction between PSTRE scores and internet use for health information-seeking; results for this interaction were non-significant in our preliminary analysis. We also tested models that included the age and income variables measured in a series of dichotomous variables. We verified no major differences between these models, and final models were constructed with the age and income as ordinal measures. All analyses were conducted using SAS version 9.4 (SAS Institute Inc, 2013). Table 1 presents unweighted descriptive statistics (except for the PSTRE scores) for our analytic sample by health status. The majority (85%) of respondents in our sample reported good health. The average weighted PSTRE score was 265. Respondents with good self-reported health had, on average, higher PSTRE scores than those with poor health (268.415 and 265.432; t = 8.053; p < .05; df = 3,259). There were a smaller percentage of respondents in the two oldest age categories of 66 to 70 and 71 and over (10.726% and 5.782%, respectively). Over half of respondents were in the lowest income quintile (54.412%) mainly due to the employment status (i.e., unemployed or retired). Nearly half of respondents were female (54.822%), while the majority (60.741%) had a high school-level education or less, identified as white (68.878%) and reported having health insurance (81.919%). Finally, over 67.977% of participants reported using the Internet frequently for accessing health information."}, {"section_title": "Results", "text": "[Insert Table 1 here]   Table 2 presents estimated Odds Ratios (OR) from weighted binary logistic regression models that address our first research question. In the unadjusted model, PSTRE was a statistically significant predictor of good health status (OR = 1.012, p < 0.001). That is, a onepoint increase in PSTRE score was associated with 1.012 times odds of reporting good health. This relationship remained significant in our adjusted model after accounting for covariates (OR = 1.006, p < 0.01). A one-point increase in PSTRE score was associated with 1.006 times odds of reporting good health. Importantly, only income (OR = 1.509, p < 0.001) and college education (OR = 1.371, p < 0.001) were statistically significant predictors of good health. On a related note, given the validity of self-rated health changes in later life (i.e., moderation effect by age) (see Zajacova & Woo, 2016), we ran separate models for the life stages. For example, follow-up analysis of age 35-49, and 50 and older showed that the estimated odds ratios of PSTRE [age 35-49 (OR = 1.007, p < 0.01); age 50 and older (OR = 1.005, p < 0.01) were consistent with our final model (OR = 1.006). This is not to say that the interpretation of selfrated health by life stages are comparable, but its associations with PSTRE were consistent across age groups in our study. [Insert Table 2 here]   Table 3 presents adjusted logistic regression results for our subgroup analyses of five and ten-year age subgroups, which address our second research question. For the five-year age categories, PSTRE was a statistically significant predictor of good health status among the 45 to analyses, PSTRE was a statistically significant predictor of good health status among all age groups; 35 to 44 year-old group (OR= 1.006, p <.05), 45 to 54 year-old age group (OR = 1.008, p < 0.01), 55 to 65 year-old age group (OR = 1.006, p < 0.05), and those 66 years or older (OR = 1.010, p < 0.05). College education was a significant predictor of self-reported health in the age groups 35-44, 45-54 and 55-65. All other covariates were not statistically significant in any of the ten-year age groups. [Insert Table 3 here]"}, {"section_title": "Discussion", "text": "We addressed two research questions: (1) Is there an association between PSTRE and self-reported health? and (2) Are there significant age-related differences in the relationship between PSTRE and self-reported health? In support of our first research question, results from our analysis show that an increase in problem-solving skills in the context of a technology-rich environment (i.e., PSTRE) was associated with better self-rated health. Unlike the previous studies of PSTRE and health of adults aged 16 to 65 (e.g., , the PSTRE and health relationship persisted after introducing relevant socio-demographic characteristics among those aged 35 and 74. This relationship was partly explained by income and education. Income and educational status are well established social determinants of health in later-life (CDC Online Newsroom, n.d.). With regard to our second research question about age-related differences in this association, subgroup analyses showed mixed findings. Consistent with the empirical and conceptual literature, which suggest age-related declines in the ability to solve novel problems such as those of emerging technologies (Mienaltowski, 2011), we expected to see age-related changes in the association between PSTRE and health in middle and older adulthood. However, we found limited and inconsistent support for significant age differences. Our two sets of subgroup analyses by five and ten-year categories yielded different results. PSTRE was the only statistically significant predictor of good health among 45-49, 60-65, and 66-70 year-olds in the first set of analyses. On the other hand, the second set of analyses showed that PSTRE was a significant predictor of good health for all age groups. Yet, it should be noted that there could be significant differences in the way older and younger cohorts utilize PSTRE skills for healthrelated information. Our study lays the groundwork for future research to further investigate this relationship as well as to disentangle age, period, and cohort effects. In view of the empirical and conceptual scholarship, we expected age differences in the use of the internet for health information seeking (Jensen, King, Davis, & Guntzviller, 2010). However, internet use for health information seeking was not associated with reporting better health in any of our age subgroup analyses. This may suggest the use of alternative health information sources, such as healthcare professionals or books and magazines (Hall, Bernhardt & Dodd, 2015;Yamashita, Bardo, Liu & Cummins, 2018). Higher PSTRE may be related to the use of these multiple health information sources. Indeed, there is evidence that health information seeking can be influenced by education and health literacy, with higher education being associated with greater use of text-based information, and higher health literacy associated with less use of the internet for health information (Yamashita et al., 2018). Nevertheless, PIAAC's PSTRE domain is a novel and complex measure that assesses cognitive ability through problem-solving, as well as familiarity with technology (OECD, 2012a). The integration of these two domains (cognitive ability and technology use) provides an informative new measure that bridges previous avenues of inquiries related to the assessment of online health-information seeking in older adults (Berkowsky & Czaja, 2018). PSTRE can be considered one of the health literacy domains that are important for health in later life. Past studies have found positive relations between general literacy, numeracy and self-rated health (e.g., . It should be noted that the PIAAC provides general literacy and numeracy in addition to the PSTRE skills assessment. Our decision to focus on PSTRE was based on a lack of inquiry on PSTRE as well as the relevance to the research needs on digital technology, health and aging. Given the little understanding about the relationship between PSTRE and health, we did not include other competency measures such as literacy and numeracy in order to document the baseline effect of PSTRE. Given our findings and insights from the previous research, components of health literacy, such as literacy, numeracy and PSTRE, are likely to contribute to health outcomes in different ways. Future research needs to identify such unique effect for informing health promotion programs targeting specific health literacy domains like PSTRE. Additionally, further research is needed to determine the subdomains of PSTRE (instead of a single-item indicator) and potential mechanisms by which PSTRE impacts a variety of health-related outcomes among middle age and older individuals."}, {"section_title": "Limitations", "text": "This study should be considered in light of some methodological limitations. First, our analysis uses cross-sectional data, which limits the ability to make any causal inference. Second, we cannot rule out potential omitted variable bias. Particularly, traditional demographic characteristics such as marital status and other social network/support information would be helpful in future research although not available in the current PIAAC data. Third, the PIAAC public use files only provide age group information. In addition, age range in the PIAAC is limited to ages 16 to 74. Given the importance of age for problem-solving skills, future studies should consider extending the age range beyond 74 years old to more broadly capture age-related health declines in the context of a digital era. Fourth, our sample distribution and the suggested sample size requirements for using the IDB Analyzer restricted our analytic approach to control for two relevant covariates (income and health insurance status) in our subgroup analyses. Although the decision was appropriate for the examination of age group differences, omission of these covariates could have over-or under-estimated the effect of PSTRE on health in general and, arguably, in older age groups with limited sample sizes. Finally, given our use of a dichotomous, self-reported measure of health, future research should consider more direct and objective indicators of health status."}, {"section_title": "Contributions", "text": "Despite the limitations, this study adds to the growing, yet limited, body of research on the malleable factors such as adult education and skill proficiencies (e.g., PSTRE), which are influential on health status among adults in multiple life stages (e.g., Paasche-Orlow et al., 2007;Prins & Mooney, 2014). We address a gap in this literature by focusing on an understudied adult competency indicator of PSS (Kimber, 2013). We are one of few studies to use nationally representative data to directly explore PSTRE and its association with self-reported health in middle-aged and older adults. Results from our adjusted logistic regression analysis provide support for the association between PSTRE skills and self-rated health even after accounting for the sociodemographic characteristics. These findings have the potential to inform the design of competencies-based health promotion as well as adult education programs that incorporate technological problem-solving in order to address health disparities among middle-aged and older adults (Mackert et al., 2016;Tikkanen, 2017)."}, {"section_title": "Implications", "text": "There are a few preliminary implications we can draw from the results of this study. Our results suggest that adult education programs could include problem-solving and technology skills interventions to better equip middle-aged and older individuals to effectively navigate health care systems and enhance health outcomes. Promoting PSTRE could be an efficient and autonomous (e.g., self-care) way to reduce health disparities. From a life course perspective, lifelong learning is no longer a means merely to acquire new knowledge and skills; it has become a critical process to obtain necessary skills (e.g., appropriate use of internet as health information source) to navigate in this digital era (Tikkanen, 2017). In addition, our findings suggest that healthcare professionals can identify and provide additional support (e.g., customized instruction, recommendation for technology-related training) to individuals with limited technological proficiencies as a potential avenue to limit health disparities. As our findings suggest, individuals with low PSTRE skills could benefit from technology-related training programs in order to promote health outcomes. For example, enhanced PSTRE could improve health outcomes by allowing middle age and older individuals to take active participation in managing their health with the use of emerging digital technologies (Kiosses & Alexopoulos, 2014). At the same time, any intervention programs should consider age differences in skill sets as well as attitudes toward technology use. Finally, this study provides policymakers with a nationally representative profile of adults' PSTRE, which, although understudied, seems to be important for health in in middle and old age."}, {"section_title": "Conclusion", "text": "In an era of emerging digital technology in healthcare, practicing self-care and navigating healthcare systems is becoming increasingly dependent on technology-related problem-solving skills. Difficulty understanding and using the rapidly advancing technologies for health-related information and health management may exacerbate already existing health inequalities, particularly among older individuals. In this study, we find that that problem-solving skills in the context of technology-rich environments is positively associated with self-reported health among American adults. Furthermore, we find unique age group differences, with higher PSTRE skills being associated with better health at the differential degrees by life stages. Our findings highlight the importance of promoting technological problem-solving skills through lifelong education in order to promote the health of aging adults.  "}]