[{"section_title": "Abstract", "text": "Alzheimer's disease (AD), with a higher risk to convert to AD. The information of AD and normal control (NC) subjects can aid the classification between progressive MCI and stable MCI. In this paper, we develop an effective biomarker by combining the auxiliary information of AD and NC subjects with the relationship of brain regions of MCI subject, which makes best of auxiliary information and improves the prediction accuracy of MCI-to-AD conversion. Specifically, a projection vector is first obtained for each MCI subject via graph-guided information propagation. Next, the information of projection vector is integrated using a self-weighting grading method to acquire the novel biomarker. Finally, the self-weighting grading biomarkers derived from multiple morphological features are combined to provide more accurate prediction of MCI-to-AD conversion. Experimental results on the Alzheimer's Disease Neuroimaging Initiative database demonstrate the effectiveness of the proposed biomarkers for the prediction of MCI conversion."}, {"section_title": "I. INTRODUCTION", "text": "Alzheimer's disease (AD) is a common progressive neurodegenerative disease and is likely to affect 1 in 85 people by 2050 [1] . The symptoms associated with AD are memory loss, cognitive decline, language deterioration and so forth, which bring difficulties to patients' daily life [2] , [3] . Mild cognitive impairment (MCI), commonly accompanied by a measurable memory impairment but largely intact cognitive functioning, is referred to as the transition stage between normal aging and AD [4] , [5] . It is reported that more than\nThe associate editor coordinating the review of this article and approving it for publication was Muhammad E. H. Chowdhury. one-third of MCI patients will progress to AD within 5 years [6] . Thus, it is vital to accurately diagnose AD at its prodromal stage, so that an effective and well-targeted treatment can be provided to possibly prevent or delay the transition from MCI to AD [7] . Magnetic resonance imaging (MRI) techniques with completely non-invasive nature, high spatial resolution, wide availability and moderate costs have attracted great attentions in the detection of AD at different stages. Numerous studies [8] - [21] have proposed MRI biomarkers in the past few years. Despite of many efforts, as the variations of brain atrophy for the early AD patients are subtle, establishing efficient biomarkers to predict the MCI progression is still challenging.\nAccording to whether MCI will convert to AD in follow-up time, they can be further categorized into progressive MCI (pMCI) and stable MCI (sMCI). Since the cerebral cortex of pMCI subjects have some similarities with AD subjects and sMCI subjects are more like normal control (NC) subjects, previous studies [22] - [30] have shown that drawing support from the information of AD and NC is beneficial for accurate classification between pMCI and sMCI. Fan et al. [22] and Young et al. [23] used the classifiers trained on AD and NC subjects to distinguish between MCI converters and non-converters directly. Filipovych and Davatzikos [24] , Batmanghelich et al. [25] , Ye et al. [26] trained semi-supervised support vector machine (SVM) to classify MCI patients into NC-like and AD-like groups by taking the AD and NC subjects as labeled samples while MCI subjects as unlabeled samples. Moradi et al. [27] developed a novel MRI biomarker using semi-supervised learning to predict the MCI-to-AD conversion. Cheng et al. [28] proposed a domain-transfer learning method to classify MCI-C and MCI-NC using the domain knowledge learned with AD and NC subjects. Taken AD and NC subjects as auxiliary data, some studies investigated the relationship between each MCI subject and the auxiliary data, so that the information of AD and NC subjects was propagated to MCI subject by new biomarkers. For instance, in [29] , a weighting function was applied to model the relationship between each MCI subject and the auxiliary data, thus two new biomarkers were proposed for early detection of AD. In [30] , Tong et al. regarded that MCI subject lied in the space of the AD and NC subjects and it could be linearly represented by the auxiliary data. Therefore, they used elastic net technique to seek a sparse representation, and then calculated a global grading biomarker for each MCI subject to predict the MCI-to-AD conversion. Although the prediction accuracy of MCI-to-AD conversion was significantly improved, this sparse representation did not consider the relationship between brain regions, which is propitious to project the AD and NC subjects into the space of MCI subject more precisely.\nBrain network has been demonstrated with extraordinary application value to AD and MCI studies. Extensive research suggests that cognitive and memory decline in MCI and AD patients is associated with the alterations in brain networks [31] - [34] . Therefore, growing bodies of studies [8] , [21] , [35] - [38] have focused on investigating the relationship of brain regions and constructing individual-level brain network, aiming to facilitate auto-diagnosis on an individual basis. For instance, Wee et al. [35] and Dai et al. [36] have utilized similar methods that calculated the thickness network by virtue of descripting the between-region correlation using distance and exponential function. Zheng et al. [8] represented the between-region connectivity using a multi-distance combination and inverse-proportional function. These studies demonstrate that correlative morphological information of brain regions significantly improves the performance of MCI and AD diagnosis. However, in regard to the prediction of MCI-to-AD conversion using auxiliary information of AD and NC subjects, the relationship between brain regions on individual basis have not been explored, which may provide critical discriminative information and improve prediction accuracy.\nIn the present study, we propose a new biomarker of MCI subject which can make the best of the information derived from AD and NC subjects, aiming to enhance the MRI-based prediction accuracy of MCI-to-AD conversion. Specifically, we first obtain the projection vector via the mapping from the space of AD and NC subjects into the space of MCI subject, in which we preserve the neighborhood relationship between brain regions by introducing a graph Laplacian regularization term in the optimization function. Secondly, we use a self-weighting grading method to integrate the information of projection vector to calculate the biomarker of MCI subject. Lastly, the self-weighting grading biomarkers derived from multiple morphological features are concatenated into a vector to reflect information propagation of AD and NC subjects from different perspectives. The prediction performance of the integrated biomarkers are examined by cross-validating the results with SVM.\nThe remainder of the paper is organized as follows. Section II gives details on the material and methods, in which the data description and the proposed classification framework are presented. Section III demonstrates the experiments and results. Our findings, limitations and future directions are discussed in Section IV. Finally, Section V concludes the paper."}, {"section_title": "II. MATERIALS AND METHODS", "text": ""}, {"section_title": "A. DATA DESCRIPTION", "text": "Baseline MRI scans (1.5T, 1.25 mm × 1.25 mm in-plane spatial resolution, 1.2-mm-thick slices) of 528 subjects from the Alzheimer's Disease Neuroimaging Initiative (ADNI) database (adni.loni.usc.edu) were used in this work. The subjects included 142 patients with AD, 221 patients with MCI and 165 NC subjects. The AD and NC groups were defined in the light of diagnosis at baseline. In the MCI group, subjects were defined as pMCI if they converted to AD within 3 years from baseline, and subjects were defined as sMCI if they did not convert to AD within the same time period. Detailed demographic and clinical information of the subjects is listed in Table 1 . Fig.1 illustrates the proposed classification framework, which consists of four components: 1) image preprocessing, 2) feature extraction based on graph-guided information propagation, 3) extraction and integration of self-weighting grading biomarkers, and 4) classification."}, {"section_title": "B. CLASSIFICATION FRAMEWORK", "text": ""}, {"section_title": "1) IMAGE PREPROCESSING", "text": "Image preprocessing included motion correction, non-brain tissue removal, coordinate transformation, gray matter (GM) VOLUME 7, 2019 FIGURE 1. The proposed classification framework. segmentation, and reconstruction of GM/white matter boundaries [39] - [41] , all of which were done by FreeSurfer v5.3.0 (http://surfer.nmr.mgh.harvard.edu). FreeSurfer is an open source software that can perform skull stripping, subcortical segmentation, cortical surface reconstruction, and so forth [42] - [44] . Reconstruction and segmentation errors were visually checked in FreeView and manually corrected. After surface inflation and registration, cortical thickness (CT) and volume (VOL) were calculated. The CT shows the closest distance between the white matter and GM surface in each vertex [43] , [45] . Then, a 30-mm full width at half maximum Gaussian kernel was used to smooth the images [46] . Finally, the measures of each anatomical region were calculated using the Automated Anatomical Labeling (AAL) atlas [47] . Notably, 12 AAL subcortical regions were excluded owing to the lack of CT features and the remaining 78 regions were utilized."}, {"section_title": "2) FEATURE EXTRACTION BASED ON GRAPH-GUIDED INFORMATION PROPAGATION", "text": "Since subjects with pMCI are more AD-like while subjects with sMCI are similar to NC subjects, each MCI subject can be represented by a linear combination of AD and NC subjects. Let X = [x 1 , x 2 , . . . , x n ] ∈ R p×n denote the feature matrix of the n images of AD and NC auxiliary subjects, and y ∈ R p×1 denote the feature vector of a single MCI image, where p is the number of brain regions. The representation of y can be obtained by ridge regression [48] :\nwhere w ∈ R n×1 are regression coefficients and λ is a control parameter. The first item is the linear regression from the space of AD and NC subjects to the space of MCI subject, while the second item is used to avoid over-fitting. However, ridge regression is less effective when utilize relation information among brain regions with only l 2 norm, thus the information of AD and NC subjects cannot precisely propagate to MCI subjects according to the regression coefficients.\nTo preserve the neighborhood relationship between brain regions for each MCI subject, we further define a graph regularization term. Let G = (V , S) be an undirected and symmetric graph, where V is a collection of brain regions in y and S is an affinity matrix. Each element s ij in S is defined as:\nwhere y i and y j denote the i th and j th brain region of y, σ is the width of the Gaussian kernel, and N k y j denotes the k nearest neighbors of y j . The k nearest neighbors are calculated using Gaussian kernel. Let a i denote the i th entry of row vector (Xw) T . The graph regularization term is then 116634 VOLUME 7, 2019\nrepresented as:\nwhere L = D−S is the graph Laplacian matrix, and D ∈ R p×p is a diagonal matrix with its diagonal elements\nBy adding the locality preserving constraint in Eq. (3), our objective function is formulated as follows:\nwhere w ∈ R n×1 are regression coefficients, λ 1 and λ 2 are the regularization tuning parameters. It is noteworthy that Eq. (4) preserves the relationship of each brain region with its neighborhoods for MCI subject, which enhances the robustness to noise.\nLet f (w) denote the objective function shown in Eq. (4). By setting the derivative of f (w) with respect to w to zero:\nwe can obtain\nThe coefficient in w represents the weight of the corresponding auxiliary subject propagating its clinical label information to the target MCI subject. In addition, in terms of Eq. (5), the second-order derivative of f (w) can be obtained as follows:\nObviously, ∇ 2 w f is positive definite. Therefore, f (w) is a convex function and Eq. (6) is the global optimal solution of f (w)."}, {"section_title": "3) EXTRACTION AND INTEGRATION OF SELF-WEIGHTING GRADING BIOMARKERS", "text": "Inspired by [30] and [49] , we propose a novel self-weighting grading biomarker which merges the propagated information of auxiliary subjects in vector w for each target MCI. Specifically, the self-weighting grading biomarker is calculated using the coefficient vector w and the clinical flags of auxiliary subjects. Let f j denote the clinical flag of an auxiliary subject. For an AD subject, f j is set to 1; otherwise, it is set to -1 for NC subjects. A self-weighting grading biomarker of the target MCI subject is then given as:\nwhere n is the number of AD and NC images in X, and w j is the coefficient corresponding to the image x j . The rationale behind self-weighting is that the clinical label information propagated by different auxiliary subjects is not balanced, so auxiliary subjects with larger coefficients should possess larger weights. If swg MCI is close to 1, it indicates that the MCI subject is more likely to be pMCI and will probably progress to AD within the given time period. If swg MCI is close to -1, it proves that this MCI subject is stable and will possibly remain at the current stage within the same time period. The space of AD and NC subjects are mapping to the space of MCI subject using CT and VOL features, respectively. Hence, the two coefficient vectors w CT "}, {"section_title": "4) CLASSIFICATION", "text": "Based on the concatenated features above, SVM classifier with radial basis function (RBF) kernel is employed for classification. The SVM is a powerful classifier which seeks the optimal class-separating hyper-plane with maximum margin between two clinical groups in feature space, and it has been widely applied in disease diagnosis [50] - [53] . The RBF kernel is given as\nwhere x i and x j are two feature vectors, and σ is the width of the Gaussian kernel."}, {"section_title": "III. EXPERIMENTS AND RESULTS", "text": "To show the effect of graph regularization term in Eq. (4), we first examined the performance of the coefficient features based on graph-guided information propagation. The classification performance of the proposed coefficient features was compared with three other features, i.e., regional morphological features, features based on ridge regression, and features based on elastic net [30] , [54] . Then the selfweighting grading biomarkers were evaluated by comparing with other two biomarkers. Moreover, the proposed method was compared with three state-of-the-art methods. Finally, the discrimination of self-weighting grading biomarkers was exhibited.\nAll the analyses were conducted under MATLAB R2016b (The MathWorks, Inc., Natick, MA). The implementation of SVM was performed via the LIBSVM toolbox [55] . The parameters in SVM were set to their default values. The sparse coding process of elastic net was implemented using SPAMS toolbox [56] . To calculate the proposed features, we carefully tuned the three parameters, i.e., λ 1 and λ 2 in Eq. (4), as well as the number of the nearest neighbours k during the graph construction. The parameters λ 1 and λ 2 were determined on the logarithmic scale 10 i , i = {−4, −3, . . . 2} and 10 j , j = {−3, −2, . . . 3}, respectively. The value of k was tested from the set {3, 5, 7, 9, 11, 13, 15}. It is worth noting that, for fair comparison, we conducted parameter optimization for each method in comparison as well. Specifically, for ridge regression method, the parameter λ in Eq. (1) was determined on the logarithmic scale 10 j , j = {−3, −2, . . . 3}. For elastic net method, the two parameters λ 1 and λ 2 were optimized in the same range as that in our method.\nTo acquire unbiased estimate of classification performance, we employed 10-fold cross-validation that randomly divided all samples into 10 subsets and thereafter alternately left one subset for testing and the remaining subsets for training. The 10-fold cross-validation was repeated 20 times to report the average results in terms of classification accuracy, sensitivity, specificity and area under the receiver operating characteristic curve (AUC). To assess whether the differences of the results obtained by different methods were statistically significant, paired t-tests at 95% significance level were conducted on the classification accuracies of the 20 runs."}, {"section_title": "A. CLASSIFICATION PERFORMANCE OF COEFFICIENT FEATURES BASED ON GRAPH-GUIDED INFORMATION PROPAGATION", "text": "In this subsection, the performance of the proposed coefficient features was firstly compared with the morphological features, features based on ridge regression and features based on elastic net according to CT and VOL data, respectively. Then each competing feature type was evaluated on integrated features of CT and VOL. Owing to high dimensionality of the coefficient features, a commonly used two-step feature selection strategy was applied to identify optimal feature subset before classification to reduce the risk of overfitting and improve the model performance [35] , [57] , [58] . The two-step feature selection strategy includes: minimum redundancy and maximum relevance (mRMR) [59] , as well as SVM-based recursive feature elimination (SVM-RFE) [60] .We first employed mRMR implemented via Feature Selection Toolbox (FEAST) [61] to exclude two-thirds of the features with less or no discrimination, and further evaluated the remaining features using SVM-RFE. For classification based on morphological features, only SVM-RFE was utilized on account of the small feature dimension. Table 2 provides the mean classification accuracy, sensitivity, specificity and AUC of each competing feature type. We conducted paired t-test on the classification accuracy between the proposed coefficient features and all the other feature types, the computed p values are also shown in Table 2 . These results suggested that the proposed coefficient features significantly outperformed all competing feature types in terms of CT and VOL data, respectively. The original morphological features presented lower performance on both CT and VOL data. For CT data, the performances of features based on ridge regression and elastic net were in par with that of original morphological features. In contrast, for VOL data, the regression-based features derived from morphological features exhibited superiority over their original form, which proved the effectiveness of feature extraction based on information propagation. Compared with features based on ridge regression and elastic net, our proposed coefficient features based on graph construction demonstrated significant improvement on both types of data. These results suggested that the proposed coefficient features were fairly effective and robust to predict MCI conversion and could well characterize the information propagated from AD and NC subjects. Thus, it is reasonable to preserve the neighborhood relationship between brain regions for each MCI subject during the regression, which contributes to enhancing the precision and sufficiency of information propagation. The performance of combining CT and VOL features surpassed that of using each data individually for all competing feature types. Therefore, it indicates that the two morphological features potentially possess complementary information. Notably, the integrated coefficient features based on graph construction achieved the highest accuracy of 65.92% as well as the highest AUC of 0.6675.\nThe parameters' sensitivity is presented in Fig. 2 by changing values of k in graph and (λ 1 ,λ 2 ) in Eq. (4). We can see that our method was sensitive to the parameters within only a small range, and the best parameter combination could be found by experiments. In particular, the highest accuracy in distinguishing pMCI from sMCI using CT data and VOL data both peaked at λ 1 = 0.01, λ 2 = 10, and k = 7.\nThe effects of feature dimensionality on classification accuracy for all competing features were also investigated. We plotted the performance changes in Fig. 3 by varying the dimensionality from 10 to 90 (10 to 70 for original morphological features) with an increment of 10 for CT and VOL, and from 10 to 180 (10 to 150 for original morphological features) with an increment of 10 for CT+VOL, respectively. It is remarkable that the proposed coefficient features exhibited the best performance in most dimensions. The proposed coefficient features improved on average by 1.64% (CT), 2.79% (VOL), and 4.59% (CT+VOL) compared to original morphological features, by 1.45% (CT), 0.72% (VOL), and 1.90% (CT+VOL) compared to features based on ridge regression, and by 1.13% (CT), 0.63% (VOL), and 0.92% (CT +VOL) compared to features based on elastic net."}, {"section_title": "B. CLASSIFICATION PERFORMANCE OF SELF-WEIGHTING GRADING BIOMARKER", "text": "In this subsection, we examined the classification performance of self-weighting grading biomarker based on graph-guided information propagation. The self-weighting grading biomarker was first compared with the grading biomarker proposed in [30] . The method in [30] calculated the coding coefficients using elastic net and obtained the grading biomarker via a method without self-weighting. Then, to evaluate the efficacy of the proposed self-weighting method, we compared the self-weighting grading biomarker with another biomarker which calculated the coefficients also using graph-guided information propagation and obtained the grading biomarker via the method in [30] . The classification results of all competing biomarkers are listed in Table 3 . By taking advantage of both graph-guided information propagation and self-weighting grading, the performance of the proposed biomarker outperformed that of the grading biomarker in [30] . Specifically, the proposed biomarker achieved accuracies of 66.61% (CT) and 68.32% (VOL) with significant improvements of 1.56% (CT) and "}, {"section_title": "FIGURE 4.", "text": "Classification accuracy on different parameters' setting for self-weighting grading biomarker, i.e., k ∈ {3, 5, 7, . . . , 15} (upward), λ 1 ∈ {10 −4 , . . . , 10 2 } (rightward), and λ 2 ∈ {10 −3 , . . . , 10 3 } (leftward).\n1.46% (VOL) over the performance of grading biomarker in [30] . For the comparison with biomarkers based on the same coefficient features and different grading calculation method, the improvements by the self-weighting grading biomarker were 1.64% (CT) and 1.90% (VOL) in terms of the classification accuracy. These suggested that the self-weighting grading biomarkers for MCI subjects had strong discriminative capability as the auxiliary subjects with more information propagated played a more important role in grading calculation. The small p-values in Table 3 indicated statistically significant improvement of our proposed biomarker over each of the other biomarkers in comparison.\nTo further investigate the benefit of feature integration, we illustrated the performance of all competing biomarkers with respect to the concatenation of features based on CT and VOL data. Table 3 summaries the results. For each competing biomarker, the performance of any single feature was lower than that of their integration. Thus, the integration of multiple features with complementary information could help enhance the classification performance. In particular, the integrated self-weighting grading biomarkers achieved the accuracy of 69.08% together with a high AUC of 0.7040, which was significantly superior to that of other integrated biomarkers. Fig. 4 illustrates the parameters' sensitivity of selfweighting grading biomarker by changing values of k in graph and (λ 1 ,λ 2 ) in Eq. (4). We can see that the selfweighting grading biomarker derived from the coefficient features was more robust to the parameter variations compared to its original form. Our method achieved the highest accuracy in distinguishing pMCI from sMCI using CT data when λ 1 = 0.1, λ 2 = 0.01, and k = 3, while the accuracy of the discrimination for the VOL data peaked at λ 1 = 0.01, λ 2 = 1, and k = 3."}, {"section_title": "C. COMPARISON WITH STATE-OF-THE-ART METHODS", "text": "In this subsection, we compared the proposed method with the feature extraction methods presented in [21] and [35] using the same data. Concretely, we first extracted the correlative features using the method proposed in [35] for CT and VOL, respectively. Then the two-step feature selection strategy mRMR and SVM-RFE introduced in section III (A) were employed to select the most relevant features for pMCI and sMCI classification. The same two-step feature selection strategy was also used to find the optimal MFN feature subset in [21] . For fair comparisons, the same classifier and same cross validations were employed for all competing methods. global grading biomarker in [30] were also listed for comparison. We observed that the proposed method achieved competitive performance compared with these state-of-theart methods."}, {"section_title": "D. DISCRIMINATION OF SELF-WEIGHTING GRADING BIOMARKER", "text": "In this subsection, we illustrated the differences between original morphological features and self-weighting grading biomarkers in distinguishing pMCI from sMCI. Since the number of original morphological features was 78, we first applied PCA [62] to converting the original features to a number of uncorrelated features. Here, for each type of morphological features, the first principal component with the largest amount of variance was displayed. The results are shown in Fig. 5 . The distributions of most pMCI and sMCI samples in the original feature space are heavily overlapped and difficult to be distinguished, which could explain the lower classification accuracies of original features shown in Table 2 . In contrast, although a small amount of samples are still overlapped with each other, the distributions of pMCI and sMCI samples in the self-weighting grading feature space are relatively separable. Therefore, the pMCI and sMCI samples are easier to be distinguished in self-weighting grading feature space than that in the original feature space, indicating the good performance of the proposed features."}, {"section_title": "IV. DISCUSSION", "text": "This study introduced a novel feature extraction method that developed a self-weighting grading biomarker for the prediction of MCI-to-AD conversion using information propagated by AD and NC subjects. The self-weighting grading biomarker gave better classification performance than the ROI-based features, coefficient-based features and grading biomarker proposed in previous work. We further improved the classification performance by integrating the self-weighting grading biomarkers based on CT and VOL into a unified framework. Results indicated that the proposed framework could provide an effective way for the prediction and early treatment of AD."}, {"section_title": "A. EFFECTIVENESS ANALYSIS OF THE PROPOSED FRAMEWORK", "text": "The better performance of our proposed framework can be attributed to the following three reasons: (1) The neighborhood relationship between brain regions in the regression was well exploited. Specifically, the mapping from the space of AD and NC subjects into the space of MCI subject preserved the neighborhood relationship between brain regions by using a graph Laplacian regularization term, which made the projection vector better reflect the information propagation of AD and NC subjects to MCI subject. Table 2 shows that the features based on graph-guided information propagation improved the classification accuracies by 1.75% (CT) and 1.11% (VOL), respectively, compared with features based on ridge regression. These results confirmed the efficacy of applying graph Laplacian regularization term in the linear regression model. ( 2) The information of projection vector was integrated by self-weighting grading method. The target MCI subject is more similar to the auxiliary subjects with larger values in projection vector, since they propagate more information to the target MCI subject. The biomarker of the target MCI obtained more characteristics of the auxiliary subjects with larger values in projection vector via self-weighting VOLUME 7, 2019 FIGURE 6. Classification accuracy with respect to the use of different number of auxiliary data.\ngrading method. The results in Table 3 showed the superiority of the self-weighting grading biomarker over other biomarkers. (3) Integration of biomarkers based on multiple morphological features comprehensively represented information propagation of auxiliary data. The satisfactory performance indicated the applicability and robustness of the integrated biomarkers in distinguishing pMCI from sMCI. CT and VOL were powerful morphological characteristics closely related to the progression of MCI [63] - [65] , e.g. the reduction of CT [66] , and the volume loss in certain areas such as entorhinal cortices [67] . Therefore, the integrated self-weighting grading biomarkers provided a more comprehensive description of information propagation, which contributed to the excellent classification performance."}, {"section_title": "B. CLASSIFICATION ACCURACY USING DIFFERENT NUMBER OF AUXILIARY DATA", "text": "In this subsection, we investigated the effect of the number of auxiliary data on classification accuracy. The selfweighting grading biomarker and grading biomarker in [30] were respectively calculated using different number of auxiliary data, and then classification performances were verified. The number of auxiliary data varied from 50 to 250 with an increment of 50, and the proportion of AD and NC subjects was 1:1. In addition, to reduce sampling bias and enable a fair comparison, we carried out the experiments 30 times where we resampled the subjects in each run and calculated the average classification accuracy for each specific number of subjects. In each classification, we conducted the 10-fold cross-validation and parameter optimization followed the same procedure as described in section III (B). Fig.6 illustrates the classification performances of the self-weighting grading biomarker and grading biomarker introduced in [30] with respect to different number of auxiliary data. In particular, the classification performances of features calculated using all auxiliary data were also plotted for comparison. As we can see from Fig.6 , for CT and VOL data, the performance of self-weighting grading biomarker was significantly better than that of grading biomarker in [30] when the number of auxiliary subjects was large, e.g., 250 and 307. This illustrated that the self-weighting grading biomarker exhibited better performance with abundant auxiliary data. Moreover, these results explained the usefulness of adopting graph-guided information propagation and self-weighting grading method to learn AD and NC domain knowledge."}, {"section_title": "C. LIMITATIONS", "text": "There are several limitations that should be addressed in future work. First, during the mapping from the space of auxiliary data into the space of MCI subject, we considered a simple and direct description to preserve the neighborhood relationship between brain regions, where the number of the nearest neighbors was set via experiments. Other methods which can better descript the relationships of brain regions should be further explored. Second, the proposed biomarkers were extracted based on limited morphological features. Since different morphological features could describe the abnormal alterations from different perspectives, more morphologies such as surface area, local gyrification index and sulcal depth, could be utilized to provide complementary information in future work. In addition, the proposed biomarkers based on different morphological features were fused by directly concatenating them into a single vector. More effective feature fusion method should be developed to enhance the classification performance."}, {"section_title": "V. CONCLUSION", "text": "In this work, we proposed a new biomarker based on graphguided information propagation and self-weighting grading for the prediction of MCI-to-AD conversion. Furthermore, two self-weighting grading biomarkers based on CT and VOL were integrated into a framework to improve the performance via the information complementarity. The proposed classification framework significantly outperformed the other methods being compared in discriminating pMCI subjects from sMCI subjects. The promising results strongly suggested the effectiveness of the self-weighting grading biomarkers for the prediction of MCI conversion."}]