[{"section_title": "Abstract", "text": "The apolipoprotein E (APOE) Ɛ4 allele increases Alzheimer's disease (AD) risk and has been linked to a greater risk of sleep-disordered breathing. We investigated the association of APOE genotype with nonrespiratory sleep parameters. Methods: We studied 1264 cognitively normal participants in the Baltimore Longitudinal Study of Aging (mean = 57.5 ± 16.1 years, range 19.9-92.0, 48.2% women, 19.8% African American) with APOE genotyping and self-reported sleep duration (≥9, 7 or 8, ≤6 hours), difficulty falling/staying asleep, and napping. We compared Ɛ4 carriers with all noncarriers and compared persons at reduced (Ɛ2/Ɛ2 or Ɛ2/Ɛ3) or elevated AD risk (≥1 Ɛ4 allele) with those neutral for AD risk (Ɛ3/Ɛ3). Results: In fully adjusted models, those with ≥1 Ɛ4 allele had a greater odds of being in a shorter sleep duration category compared to all noncarriers (odds ratio [OR] = 1.41, 95% confidence interval [CI] 1.06, 1.88) and Ɛ3/Ɛ3 carriers (OR = 1.43, 95% CI 1.06, 1.92). Compared to Ɛ3/Ɛ3 carriers, Ɛ2/Ɛ2 or Ɛ2/Ɛ3 carriers had a lower odds of reporting napping (OR = 0.64, 95% CI 0.43, 0.96). Among participants aged ≥50 years, sleep duration findings remained and Ɛ4 carriers had a greater odds of trouble falling/staying asleep than noncarriers (OR = 1.49, 95% CI 1.02, 2.17). We found some evidence for stronger associations of Ɛ4 with sleep duration among African Americans. Conclusions: Self-reported sleep duration, napping, and trouble falling/staying asleep differ by APOE genotype. Studies are needed to examine whether APOE promotes AD by degrading sleep and to clarify the role of race in these associations."}, {"section_title": "INTRODUCTION", "text": "Sleep disturbance has recently gained attention as a risk factor for Alzheimer's disease (AD). Studies in mice and Drosophila indicate that sleep deprivation promotes β-amyloid (Aβ) deposition in the brain. 1, 2 Further, initial cross-sectional studies in humans demonstrate associations of shorter self-reported sleep duration and poorer sleep quality with greater brain Aβ, measured by positron emission tomography scans. 3, 4 Lower sleep efficiency and greater sleep fragmentation, measured by wrist actigraphy, also have been linked to greater brain Aβ burden, measured in cerebrospinal fluid. 5 Apolipoprotein E (APOE) genotype is associated with risk for late onset AD. The APOE Ɛ4 allele has been linked to a 2-to 3-fold increased risk of AD in heterozygotes (ie, Ɛ2/Ɛ4 or Ɛ3/ Ɛ4 genotypes) and 10 times the risk in Ɛ4/Ɛ4 homozygotes, compared to carriers of the most common APOE genotype, Ɛ3/ Ɛ3. 6 Conversely, the Ɛ2 allele appears to confer some protection against AD. 7 Approximately 20%-30% of the population has one or more Ɛ4 alleles, placing a substantial proportion of the population at elevated AD risk. 8 Importantly, the APOE Ɛ4 allele has also been linked to sleep disturbances. APOE Ɛ4 carriers have been shown to have an increased risk of sleep-disordered breathing (SDB), 9, 10 and studies have found that APOE Ɛ4 and SDB interact, such that SDB severity is more strongly associated with cognitive impairment among Ɛ4 carriers than in noncarriers. [11] [12] [13] Studies have also investigated links between APOE and nonrespiratory sleep parameters but primarily in persons with cognitive impairment. [14] [15] [16] [17] [18] Surprisingly little has been published, however, regarding associations between the Ɛ4 allele and nonrespiratory sleep parameters, such as sleep duration, difficulty falling or staying asleep, and napping, in cognitively intact samples. In a study of 122 participants in the Baltimore Longitudinal Study of Aging (BLSA), we reported that 50% of those with sleep duration <7 hours had at least one Ɛ4 allele, compared to only 21% of those reporting 7 hours sleep, and 24% of those reporting >7 hours (Table 2 of prior paper). 19 Here, we follow-up our initial observation in a sample undergoing neuroimaging assessments and conduct an in-depth study of the association of APOE genotype with self-reported sleep duration, difficulty falling or remaining asleep, and napping in a much larger sample of cognitively unimpaired adults in the BLSA. We hypothesized that those with one or more Ɛ4 alleles would have shorter sleep duration and greater difficulty falling or staying asleep than those without an Ɛ4 allele. Because the Ɛ2 allele is associated with a decreased risk of AD and better sleep may protect against AD, we also investigated whether those with Ɛ2/Ɛ2 or Ɛ2/Ɛ3 genotypes reported longer sleep duration, better quality sleep, and distinct napping habits. SLEEP, Vol. 40 "}, {"section_title": "METHODS", "text": ""}, {"section_title": "Participants", "text": "We studied individuals who participated in the BLSA between 1991 and 2000 (the years when the sleep measures of interest were administered). The BLSA is a cohort study of aging that began in 1958 and is ongoing. 20 BLSA participants are exceptionally healthy on enrollment; eligibility criteria require them to be free of major diseases with the exception of controlled hypertension and to have no cognitive impairment, physical disability, mobility limitations, or conditions that impair functioning or limit life expectancy. Further, they cannot be taking ongoing antibiotics, chronic pain medication, immunosuppressants, corticosteroids, or histamine H2 blockers.\nOf 1742 participants, we excluded 369 who were missing APOE genotype data and two who were missing self-report sleep data (see below). Further, race/ethnic differences exist in links between Ɛ4 genotype and AD risk, with weaker associations between Ɛ4 and AD in African Americans than in whites. 21 The substantial majority of BLSA participants are either white or African American, affording little statistical power to investigate the associations under study in participants who were neither white nor African American. Accordingly, we excluded 64 participants who reported another race/ethnicity. Finally, we excluded 43 participants who were cognitively impaired at the time of sleep assessment (see cognitive assessment details below), leaving a total analytic sample of 1264."}, {"section_title": "APOE Genotype", "text": "Participants underwent blood draws, and APOE genotype was ascertained using standard procedures. Determinations of APOE genotypes were performed during two different epochs over the course of the BLSA. The earlier assays followed the approach of Hixon and Vernier 22 and were based on polymerase chain reaction (PCR) amplification with HhaI restriction isotyping to determine APOE genotype. Sequences that encompass amino acid positions 112 and 158 are amplified by PCR, and an HhaI restriction endonuclease is used to cut the DNA. This results in unique permutations of sizes of HhaI which correspond to specific APOE genotypes. 22 More recent assays used the TaqMan method which is a PCR-based system using oligonucleotide probes specific for particular alleles that have been labeled using fluorogenic reporter dyes."}, {"section_title": "23", "text": ""}, {"section_title": "Sleep Variables", "text": "Our primary sleep measures were self-report indices of sleep duration, sleep quality, and napping habits. As part of the BLSA interview between 1991 and 2000, participants were asked to report the average number of hours of sleep they obtained at night. Responses were recorded as integers and were used as our measure of sleep duration. Participants were also asked whether they \"often have trouble falling asleep at night or awaken in the middle of the night and can't go back to sleep,\" (yes or no). They were also asked if they nap, with response options \"rarely or never,\" \"3-5 times/week,\" \"1-2 times/week,\" or \"daily\"; we recoded responses of \"rarely or never\" as 0 and others as 1.\nIn addition, participants were asked about common symptoms of SDB, which may confound the associations of interest (see Statistical Analyses). Specifically, they reported whether they \"snore often and loudly\" (yes or no) and if they \"often become drowsy or fall asleep during the daytime when you wish to be awake? (e.g. falling asleep watching TV or reading)\" (yes or no)."}, {"section_title": "Other Measures", "text": "At each BLSA visit, participants' height and weight were measured and body mass index (BMI) was calculated in kg/m 2 . Blood pressure was measured by a sphygmomanometer, and fasting blood glucose and cholesterol were measured. Participants also completed a neuropsychological test battery at routine visits, and those screening positive for cognitive impairment (ie, ≥4 errors on the Blessed Information Memory Concentration Test 24 or Clinical Dementia Rating Scale 25 scores ≥0.5) had their test data evaluated at a consensus diagnostic conference, where cognitive status is determined to be normal, mild cognitive impairment (MCI) according to the Petersen criteria, 26 or dementia according to Diagnostic and Statistical Manual of Mental Disorders, Third Edition-Revised criteria. 27 Those who screened negative for potential impairment or screened positive but were determined to be cognitively normal through a consensus conference were considered cognitively intact. 28 Depressive symptomatology was measured by the Center for Epidemiologic Studies-Depression Scale (CES-D). 29 A vascular burden score was calculated by summing the number of the following conditions participants reported: smoking status, hypercholesterolemia; hypertension; diabetes mellitus; myocardial infarction; angina; and stroke or transient ischemic attack. In addition to self-report, diabetes contributed to the vascular burden score if fasting blood glucose was ≥126 mg dl -1 , hypertension contributed if systolic blood pressure was ≥140 mm Hg or diastolic blood pressure was ≥90 mm Hg, and hypercholesterolemia contributed if recorded cholesterol was ≥200 mg dl -1 ."}, {"section_title": "Statistical Analyses", "text": "We fit two sets of ordinal logistic regression models to determine the association between APOE genotype, our primary predictor, and reported sleep duration, which we categorized as ≥9 hours, 7 or 8 hours, and ≤6 hours. Ordinal logistic regression produces odds ratios (ORs), which represent the odds of being in a shorter sleep duration category. The proportional odds assumption was met for these sleep duration analyses. Our selection of sleep duration categories was based on the National Sleep Foundation's recent recommendation of 7-8 hours sleep duration for adults aged 65 and older. 30 We used these cutpoints rather than the recent American Academy of Sleep Medicine and Sleep Research Society recommendations because the latter are restricted to persons aged 18-60 years 31 and would therefore be inappropriate for much of our sample. Next, we fit two sets of logistic regression models to determine the association of APOE genotype with reports of problems falling or staying asleep and reports of napping. For all analyses, we first compared Ɛ4 allele carriers (Ɛ2/Ɛ4, Ɛ3/Ɛ4, or Ɛ4/Ɛ4 genotypes), who are at elevated risk for AD, with noncarriers. Next, we compared participants at lower AD risk (Ɛ2/Ɛ2 or Ɛ2/Ɛ3 genotype) or greater AD risk (Ɛ4 carriers) with those neutral for AD risk (Ɛ3/Ɛ3 genotype). Minimally adjusted models (Model 1) were adjusted for age, age squared, race (African American or white), and sex. Fully adjusted models (Model 2) were further adjusted for years of education, BMI, CES-D scores, vascular burden score, and-because APOE genotype has been linked to SDB which often manifests in snoring and daytime sleepiness-we also adjusted for responses to questions about snoring and excessive daytime sleepiness. To examine whether this association was stronger in older adults, we repeated analyses in participants aged ≥50 years. Importantly, race/ethnic differences appear to exist in the association between Ɛ4 genotype and AD risk, with a weaker link among African Americans than in whites. 21, 32 Thus, we explored potential interactions of APOE Ɛ4 status (≥1 vs. 0 Ɛ4 alleles) with race on sleep variables by adding an interaction term (APOE Ɛ4 status × race) to fully adjusted models. All analyses were conducted using SAS 9.4 (Cary, North Carolina)."}, {"section_title": "RESULTS", "text": "On average, participants were 57.5 ± 16.1 years of age (range 20-92) ( Table 1 ). Approximately 48% were women and 20% were African American. They had a mean educational attainment of 16.7 ± 2.6 years (range 8-21), mean BMI of 26.1 ± 4.3 kg/ m 2 , and mean CES-D scores of 6.6 ± 6.7. Participants' mean sleep duration was 7.1 ± 1.0 hours (range 4-10); 321 (25.6%) reported <7 hours sleep, 874 (69.6%) reported 7-8 hours sleep, and 61 (4.9%) reported >8 hours sleep. Almost 25% reported snoring often or loudly and 31% reported often feeling drowsy or unintentionally falling asleep during the day. Overall, 352 participants (27.8%) were Ɛ4 carriers (Ɛ2/Ɛ4, Ɛ3/Ɛ4, or Ɛ4/Ɛ4 genotype) and 912 (72.2%) were noncarriers ( Table 2) . Of the 912 noncarriers, 750 participants (82.2%) had the Ɛ3/Ɛ3 genotype and 162 (17.8%) had either the Ɛ2/Ɛ2 or Ɛ2/Ɛ3 genotype."}, {"section_title": "All Participants", "text": "In the full sample, compared to participants with no APOE Ɛ4 alleles, those with ≥1 Ɛ4 allele had a 38% greater odds of being in a shorter sleep duration category (OR = 1.38, 95% confidence interval [CI] 1.05, 1.80); this association was similar in the fully adjusted model (OR = 1.41, 95% CI 1.06, 1.88) ( Table 3) . Similarly, in analyses that used the Ɛ3/Ɛ3 genotype as the reference group, those with ≥1 Ɛ4 allele had a 38% greater odds of being in a shorter sleep duration category in Model 1 (OR = 1.38, 95% CI 1.04, 1.82) and a 43% greater odds in Model 2 (OR = 1.43, 95% CI 1.06, 1.92).\nHowever, there was no statistically significant difference in the odds of reporting trouble falling or staying asleep between those with ≥1 Ɛ4 allele and other participants in the full sample, whether the reference group consisted of all other participants CES-D (n = 1225) 6.6 ± 6.7 6.9 ± 6.9 6.6 ± 6. or only those with the Ɛ3/Ɛ3 genotype (Table 4) . Similarly, there was no difference in this domain between those with Ɛ2/ Ɛ2 or Ɛ2/Ɛ3 genotypes and those with the Ɛ3/Ɛ3 genotype. With respect to napping, there was no difference when those with ≥1 Ɛ4 allele were compared to all other participants. Compared to participants with the Ɛ3/Ɛ3 genotype, those with either the Ɛ2/Ɛ2 or Ɛ2/Ɛ3 genotype were 38% less likely to report taking naps in minimally adjusted analyses (OR = 0.62, 95% CI 0.42, 0.90) and 36% less likely in fully adjusted analyses (OR = 0.64, 95% CI 0.43, 0.96) ( Table 4) ."}, {"section_title": "Participants Aged ≥50 Years", "text": "We repeated analyses in the subset of 804 participants aged ≥50 years. They had a mean age of 67.1 ± 10.3 and 16.6 ± 2.7 years of education; 43.3% were women and 18.0% African American. In minimally adjusted analyses, compared to participants without any APOE Ɛ4 alleles, those with ≥1 Ɛ4 allele had a 49% greater odds of being in a shorter sleep duration category (OR = 1.49, 95% CI 1.07, 2.09); this association increased in the fully adjusted model (OR = 1.58, 95% 1.10, 1.25) ( Table 5 ). The same pattern emerged when participants with ≥1 Ɛ4 allele were compared to those with the Ɛ3/Ɛ3 genotype, but there was no significant difference in sleep duration between Ɛ2/Ɛ2 or Ɛ2/Ɛ3 carriers and Ɛ3/Ɛ3 carriers.\nIn addition, in Model 1, participants aged ≥50 years with ≥1 Ɛ4 allele had a 38% greater odds of reporting difficulty falling or staying asleep compared to those with 0 Ɛ4 alleles, but this was at the trend level (Table 6 ). After further adjustment in Model 2, however, a significant association emerged, such that those with ≥1 Ɛ4 allele had almost a 50% greater odds of trouble falling or staying asleep (OR = 1.49, 95% CI 1.02, 2.17). There was a trend-level association in Model 1 between Ɛ2/Ɛ2 or Ɛ2/Ɛ3 genotype and a reduced odds of napping in this older subsample (OR = 0.67, 95% CI 0.43, 1.04) but not after further adjustment in Model 2 (OR = 0.72, 95% CI 0.45, 1.15)."}, {"section_title": "APOE and Race Interactions", "text": "When we examined the APOE Ɛ4 (≥1 vs. 0 Ɛ4 alleles) × race interaction in fully adjusted models, we observed an interaction term p-value = .879 for trouble falling or staying asleep, p = .851 for napping, and p = .155 for sleep duration. Because the interaction for sleep duration approached a statistical trend level, we explored this by stratifying by race. We did so in the minimally adjusted model to avoid overfitting the data and found among the 248 African Americans that those with ≥1 Ɛ4 allele had a 65% greater odds of being in a shorter sleep duration category, but this was at the trend level (OR = 1.65, 95% CI 0.98, 2.78) (Supplemental Table 1 ). Compared to African American participants with the Ɛ3/Ɛ3 genotype, however, those with ≥1 Ɛ4 allele had a statistically significant 83% greater odds of shorter sleep (OR = 1.83, 95% CI 1.05, 3.19) . This association did not reach significance in minimally adjusted models, however, among the 1008 white participants (Supplemental Table 1 )."}, {"section_title": "DISCUSSION", "text": "We examined the association of APOE genotype with self-reported nonrespiratory sleep parameters in 1264 cognitively intact adults aged 20 to 92 years (mean = 58). After adjustment for potential confounders, we found that those with one or more Ɛ4 alleles-and therefore at elevated risk for AD-had a greater odds of reporting shorter sleep duration than those with no Ɛ4 alleles (Ɛ2/Ɛ2, Ɛ2/Ɛ3 and Ɛ3/Ɛ3 genotypes) and those with the Ɛ3/Ɛ3 genotype, which is neutral for AD risk. We also found that those with the Ɛ2/Ɛ2 or Ɛ2/Ɛ3 genotype and thus at reduced risk of AD, had a reduced odds of reporting napping, compared to those with the neutral Ɛ3/Ɛ3 genotype. When we limited analyses to adults aged ≥50 years, the findings concerning sleep duration were stronger, and we found that those with an Ɛ4 allele had a greater odds of difficulty falling or staying asleep than those without; however, the associations with napping were no longer significant. We also found some evidence for an interaction of APOE Ɛ4 with race, with trend-level and significant associations of the Ɛ4 allele with sleep duration among African American but not white participants.\nTo our knowledge, this is the first study to identify associations of APOE genotype with self-reported sleep duration, difficulty initiating or maintaining sleep, and napping habits in cognitively intact individuals. A few prior studies have investigated associations between APOE genotype and nonrespiratory sleep/ wake parameters in persons without dementia, although most have not focused on a potential effect of APOE on these sleep parameters per se. For example, Lim et al. 33 showed that greater consolidation of objectively measured rest/activity rhythms buffered against the risk of AD conferred by the Ɛ4 allele and reduced the effect of Ɛ4 on density of neurofibrillary tangles. Also, Asada et al. 34 showed in a case-control study that napping duration interacted with APOE Ɛ4 genotype. Naps longer than 60 minutes were associated with a greater AD risk among Ɛ4 carriers but not noncarriers, and there was evidence that short naps were associated with reductions in risk of incident AD in both groups. 34 Further, Tsapanou et al. 35 reported that Ɛ4 genotype was associated with self-report measures of SDB-related phenomena (snoring, shortness of breath during sleep/ headache on waking) but found no associations with measures of sleep quality or adequacy or of daytime sleepiness. In a particularly relevant recent pilot study (n = 31), Drogos et al. 36 found that Ɛ4 carriers had poorer sleep efficiency, as measured by actigraphy and polysomnography (PSG) and shorter sleep duration and greater wake after sleep onset and REM sleep, measured by PSG, than noncarriers; they detected no associations, however, of APOE Ɛ4 status with self-reported sleep measures. In addition, it should be noted that a number of genome-wide association studies have been performed examining variants associated with sleep duration. [37] [38] [39] [40] [41] Polymorphisms in or near APOE were not identified in these studies; however, it is worth noting that only some polymorphisms associated with specific genes (eg, Pax8 and ABCC9) were replicated between studies.\nOur results speak to the intriguing possibility that APOE Ɛ4 truncates sleep duration and increases sleep onset latency and fragmentation. In light of prior support for a causal link between sleep deprivation and AD progression, 1,2 if APOE Ɛ4 shortens sleep, it would be plausible that APOE exerts its effect on AD risk at least in part by shortening sleep duration, complementing the aforementioned findings concerning rest/activity consolidation as a moderator of the effect of Ɛ4 on AD risk. 33 It is also plausible that, rather than directly affecting sleep, APOE genotype modulates vulnerability to sleep disturbance. Indeed, findings that anticholinergic medication use is associated with greater sleep disturbance in cognitively normal Ɛ4 carriers than in noncarriers support the notion that the sleep of Ɛ4 carriers is more easily perturbed. 18 If disturbed sleep does promote amyloid burden and AD risk, our findings might suggest that APOE Ɛ4-positive individuals with sleep disturbance receive special clinical attention with the goal of optimizing nighttime sleep duration and thereby reducing the risk of AD. 33 Our findings in analyses that included both younger people and those aged 50 years and older also raise the possibility that the APOE Ɛ2 allele reduces the likelihood of regular napping. If napping has a negative impact on brain health, our findings that the Ɛ2 allele is associated with reduced napping may suggest that reduced napping is a mechanism through which Ɛ2 protects against AD. Although self-report of napping has been linked to a reduced risk of cognitive decline, 42 when naps have been measured by actigraphy, longer naps have been tied to poorer performance on neuropsychological tests, 43, 44 and napping 3 days per week or more has been linked to amyloid deposition. 5 When we limited our analyses to participants aged 50 years and older, however, the association between APOE Ɛ2 and napping was no longer significant. Whether this was due to reduced statistical power or a specific effect of Ɛ2 on napping in younger people only is unclear and could be especially important if an effect of naps on cognition and brain health varies by age. Further research is needed to clarify the role of the Ɛ2 allele in these associations.\nImportantly, we identified a potential interaction between the APOE Ɛ4 allele and race with regard to sleep duration. Although this should be interpreted cautiously given the nonsignificant interaction term in the model, between-race differences have been noted in associations between APOE Ɛ4 genotype and cognitive outcomes, 21 and it is unclear whether sleep disturbance may play a role in these associations. In light of the growing interest in sleep as a potential risk factor for AD and in race/ethnic disparities in AD, further studies in this domain are warranted. This study's strength is its large community-dwelling sample with well-characterized cognitive status and APOE genotyping. However, several limitations warrant consideration. First, our sleep measures were limited to self-report. Studies of APOE and sleep in large samples that include actigraphy or PSG would clarify whether the associations we observed between APOE and nonrespiratory sleep parameters also arise when sleep is measured objectively. Also, although our participants were considered to be free of MCI or dementia, we are unable to rule out the possibility that Ɛ4 carriers had, on average, a higher level of Aβ deposition in their brains. Because Aβ deposition leads to sleep loss in AD mice 45 and Drosophila, 2 observed differences in sleep duration, onset and maintenance difficulties, and napping between Ɛ4 carriers and noncarriers may be explained at least in part by preclinical AD. Moreover, reports of reduced nighttime sleep duration and greater daytime napping may be attributable to SDB. We adjusted for SDB risk factors and markers (BMI, snoring, and excessive daytime sleepiness), but residual confounding by SDB may explain our results. If napping does in fact reflect SDB, this would still be of interest: although the Ɛ4 allele has been linked to a greater risk of SDB, 9,10 it has not yet been established that Ɛ2/Ɛ2 and Ɛ2/ Ɛ3 genotypes protect against SDB. Studies with PSG in large samples with APOE genotyping are needed to further examine this possibility. Additional studies are also needed to clarify the nonrespiratory polysomnographic correlates of APOE genotype in cognitively normal populations. Although a study of persons with MCI found that Ɛ4 carriers obtain less REM sleep than noncarriers, 16 little is known about whether APOE genotype affects REM or slow-wave sleep in those without impairment. Such findings would be important as they might indicate sleep-specific mechanisms by which APOE affects AD risk.\nIn summary, our results indicate an association of APOE genotype with nonrespiratory sleep parameters: sleep duration, difficulty falling or staying asleep, and napping, and suggest that the association with sleep duration may differ between African Americans and whites. Findings provide further support for an important link between sleep and AD risk that warrants further study using objective sleep measures. Investigators from the NIH NIA IRP were involved in all aspects of this manuscript, including the design and conduct of the study; collection, management, analysis, and interpretation of the data; and preparation, review, or approval of the manuscript; and decision to submit the manuscript for publication."}]