[{"section_title": "", "text": "In a recent paper, further develops the mathematical foundation for multiplicative partitioning of species diversity (also see Ricotta 2005 ). Jost suggests that ''existing definitions of alpha and beta must be replaced by a definition that partitions alpha and beta into independent components'' (Jost : 2427 . Jost further states that ''. . . we must develop a new general expression relating alpha, beta, and gamma, and the new expression must ensure that beta is free to vary independently of alpha'' (Jost :2428 . In this paper, we follow and refer to the Shannon and other abundance-based indices as entropies to distinguish them from ''true diversity'' metrics. showed that any abundance-based entropy of any order, q (except q ¼ 1), can be converted into its true diversity or ''numbers equivalent'' (see Eqs. 1 and 2 in . According to , ''Numbers equivalents permit the decomposition of any diversity index H into two independent components'' (Jost :2430 . Throughout his paper, Jost stresses the ''independence'' of alpha and beta but never empirically demonstrates this property. The purpose of this paper is to evaluate the statistical independence of alpha and beta in multiplicative and additive partitions of species diversity. To be clear, we recognize that never explicitly refers to ''independence'' as ''statistical independence''; nonetheless, the issue of ''independence'' in diversity partitioning deserves further examination.\nWe simulated hypothetical data to quantitatively examine claim that the alpha and beta estimates [D(H A ) and D(H B )] obtained using true diversities are independent. defines independence of alpha and beta (Property 1; Jost 2007:2428) as freedom to vary independently: ''Alpha and beta should be free to vary independently; a high value of the alpha component should not, by itself, force the beta component to be high (or low), and vice versa...'' and ''alpha should not put mathematical constraints on the possible values of beta, and vice versa.'' We believe that the definition of independence used by needs to be clarified, particularly with regard to independence being a statistical property of alpha and beta. We show that both the multiplicative decomposition of gamma diversity into D(H A ) and D(H B ) and the additive decomposition into the entropies H A and H B produce estimates of alpha and beta diversity that are dependent on one another. Thus, advocating the use of true diversities over entropies cannot be justified solely on 3 E-mail: joseph.veech@txstate.edu the grounds that the former gives statistically independent estimates of alpha and beta and the latter does not. Alpha, beta, and gamma diversity are related by (Jost 2007: Eq. 4) in the multiplicative decomposition. used this general formula to show that the entropies, H A and H B , can be related to one another in either an additive or multiplicative way (Jost 2007: Eqs. 8a-g ) depending on the particular index being partitioned. states: ''Suppose H A has a numbers equivalent of x equally likely outcomes, and orthogonal H B has a numbers equivalent of y equally likely outcomes. Then if H A and H B are independent and completely determine the total diversity, the diversity index of the combined system must have a numbers equivalent of exactly xy equally likely outcomes.'' (Jost :2430 . The general formula relating D(H A ) and D(H B ) is multiplicative and thus bears resemblance to the well-known product rule for the probability of occurrence of two independent events, P(W and Z ) ¼ P(W )P(Z ). However, Eq. 4 does not ensure that D(H A ) and D(H B ) are statistically independent and Eqs. 8a-g do not ensure that H A and H B are statistically independent. Their independence must be established empirically by thoroughly observing the variables (and events that they represent) or by fundamental knowledge of the variables (or events) involved. For example, we have fundamental knowledge that the event representing a coin flip with the outcome of heads or tails is independent of the event representing the flip of another coin. Fundamental knowledge does not exist for claiming the independence of alpha and beta [or D(H A ) and D(H B )] a priori.\nStatistical independence of two variables is defined as complete or mutual independence of the events that the two variables represent. The events are completely independent if the occurrence of one has no influence on the occurrence of the other. In additive and multiplicative partitioning, alpha and beta diversity are mathematically linked to one another through a third variable, gamma diversity. The presence of this third variable allows us to deduce a priori that alpha, beta, and gamma [D(H A ), D(H B ), and D(H G )] are not mutually independent because knowing the values of two of them completely determines the value of the third. Similarly, H A , H B , and H G are not mutually independent. Indeed, in practice, beta can only be determined by first calculating alpha and gamma. Thus, alpha and beta are not mutually independent because beta is calculated from alpha (and gamma).\nTo quantify the dependence between alpha and beta, we conducted a series of simulations. Each simulation involved generating 1000 ''data sets'' each representing a decomposition of gamma into alpha and beta components. For each data set, gamma was set equal to a random number between 10 and 1000 (these limits had no influence on the outcome described in this paper) drawn from a uniform distribution. Alpha was then set as a random proportion of gamma with a lower limit of 1 (in some instances alpha can be ,1 but this requires data sets that have samples with zero species). This simulation routine produces a random (or independent) association of alpha and gamma. Alternatively we could have first selected alpha as a random number (between 10 and 1000) and then selected gamma as a random number between alpha and 1000. Another alternative would have been to simultaneously select a pair of random numbers with the smaller number being assigned to alpha and the larger number being assigned to gamma. All of these simulation routines produce a random association of alpha and gamma.\nAfter obtaining alpha and gamma, beta was determined as gamma/alpha to simulate D(H B ) (the true diversity of any order q) derived from a multiplicative decomposition and as gamma -alpha to simulate beta (measured as species richness or the entropy for q ¼ 0) derived from an additive partition. Each simulation (or group of 1000 data sets) thus gave distributions of alpha, multiplicative beta, and additive beta. To be clear, this method of simulating gamma and alpha does not specify a value for N (the number of samples) and thus N is not necessarily fixed. For 50% of the simulated data sets (i.e., particular combination of gamma and alpha), the minimum possible value for N was 2, 90% of the data sets had a minimum N , 10. The minimum value of N was obtained as gamma/alpha rounded up to the next highest integer. There is no maximum value for N. Therefore, each group of 1000 data sets generally could have represented almost any N, including an N that was fairly constant.\nAfter producing each group of 1000 data sets, we then expressed alpha, multiplicative beta, and additive beta as random events instead of random variables. To do this, we set i, j, and k to numbers representing random percentiles ( p i , p j , and p k ) in the distributions of alpha and beta respectively. Event A was defined as alpha , i, event B M as multiplicative beta , j, and event B A as additive beta , k. From probability theory, all events have probabilities that can be derived either analytically or through simulation. We derived the probability of each event as the proportion of the 1000 data sets obeying the event. For instance, P(A) was the proportion of data sets in which alpha was less than i. This probability can also be obtained directly as p i ; similarly, P(B M ) ¼ p j and P(B A ) ¼ p k . We then empirically determined the joint probability of A and B M as the proportion of the 1000 data sets in which both events (A and B M ) occurred and the joint probability of A and B A in the same way. The dependence of alpha and multiplicative beta was then assessed by comparing P(A)P(B M ) to P(A, B M ); similarly P(A)P(B A ) was compared to P(A, B A ). If the joint probability equals the product of the two marginal probabilities then the two variables (alpha and multiplicative beta or alpha and additive beta) are mutually independent; if not then the two variables are dependent to some degree. We repeated the simulation process 100 times and then calculated the average and maximum absolute differences between P(A)P(B) and P(A, B) for each beta metric. The difference between P(A)P(B) and P(A, B) serves as an estimate of the dependence between alpha and beta; a greater difference indicates greater dependence.\nWe also conducted the same type of simulation for two random variables (W and Z ) known a priori to be completely and mutually independent. That is, W was set equal to a random number between 10 and 1000 from a uniform distribution. Z was also set equal to a random number between 10 and 1000 from a uniform distribution and without any regard for the value of W. That is, W and Z were not related by any mathematical equation.\nThe results of these simulations were informative. For multiplicative and additive beta, there was a surprising amount of agreement between P(A)P(B) and P(A, B) ( Table 1 ). This indicates that multiplicative beta and additive beta have similar and relatively low levels of conditional dependence on alpha. Multiplicative beta (or beta measured by any true diversity) may actually be slightly more conditionally dependent on alpha in that the average difference between P(A)P(B M ) and P(A, B M ) is greater than the difference between P(A)P(B A ) and P(A, B A ) (Table 1) . For multiplicative beta, there is also a bias toward P(A)P(B M ) almost always being greater than P(A, B M ) as evidenced by the average raw difference (0.310 -0.255 ¼ 0.056) equaling the average absolute difference (Table 1) . On the other hand, there is very little bias in P(A)P(B) for additive beta, average P(A)P(B A ) and P(A, B A ) are very similar (Table 1) . It is important to note that in these simulations, gamma was a random variable and alpha was a random proportion of gamma. When gamma is fixed, rather than drawn at random, there is greater dependence between alpha and beta. We conducted the same simulations with gamma ¼ 300 and found greater discrepancy between P(A)P(B) and P(A, B) (Table 1) with P(A)P(B) always being greater than P(A, B). As expected, there was very little difference between P(W )P(Z ) and P(W, Z ) for the two unrelated random variables, W and Z. On average the difference between the product of the marginal probabilities and the joint probability was only 0.004 with a maximum difference of 0.014 for 100 sets of simulations.\nWhen evaluating the statistical dependence of alpha and beta diversity, it is important to remember that a third variable, gamma diversity, is involved. Additive and multiplicative partitioning, as applied to a set of samples, both specify a decomposition of gamma into alpha (within-sample diversity) and beta (among-sample diversity). Whether using entropies or true diversities, gamma is a known and constant quantity for a given data set. This a priori knowledge of the value of gamma suggests that alpha and beta are not conditionally independent. Beta is completely determined from gamma and alpha. Procedurally, gamma and alpha are calculated first and then beta is calculated as either gammaalpha or gamma/alpha. Alpha and beta would be conditionally independent (as the random variables W and Z are above) if the value of alpha did not determine the value of beta (or vice versa) given a known gamma. Each of the three variables, alpha, beta, and gamma, are pairwise independent. This means that for each of the pairs (alpha, beta), (alpha, gamma), and (beta, gamma), neither variable would determine the other without knowing the value of the third variable not in the pair. Denny and Gaines (2000) and Tijms (2004) provide further discussion of these forms of independence in the context of probability theory.\nThe conditional dependence of alpha and beta can also be assessed empirically by examining the extent to which beta is free to vary for a given value of alpha (and vice versa) . This seems to be the concept of independence described as Property 1 in and Property 4 in . When gamma is fixed then the relationship between alpha and additive beta is completely described by the linear function (beta ¼ Àalpha þ gamma); the slope is negative and equal to alpha and the y intercept equals gamma (Fig. 1A) . The relationship between alpha and multiplicative beta is given by a power function (beta ¼ gamma 3 alpha À1 ) (Fig. 1A) . Thus, when gamma is constant, alpha constrains beta to a single value determined by either a linear or power function. A given value of alpha can have only one value of beta. When gamma is not constant (as in a situation where species are gained or lost from a set of communities), then alpha does not constrain beta as severely, particularly at lower values of alpha (Fig. 1B, C) . Additive beta is no more constrained by alpha than is multiplicative beta (Fig.  1B, C) . In fact, intermediate and high values of alpha seem to constrain multiplicative beta to very low values (Fig. 1B) . In the practical application of additive and multiplicative partitioning (gamma is known), alpha puts mathematical constraints on the possible values of beta, and vice versa. Therefore, neither type of partitioning provides alpha and beta components that obey Jost's independence property (Property 1). None- However, we do agree with Jost that alpha and beta (as derived from additive or multiplicative partitioning) should measure different, although related, aspects of gamma diversity. Beta is intended to measure differentiation among samples (or communities) whereas alpha should measure within-sample diversity. According to , ''If beta depended on alpha, it would be impossible to compare beta diversities of regions whose alpha diversities differed'' (Jost :2428 . Later, he states: ''if beta depends on alpha, the beta values between different hierarchical levels cannot be compared with each other (since each level has a higher alpha than the preceding level) nor with the beta values of other ecosystems'' (Jost :2436 . However, the dependence between alpha and beta (measured as entropies or diversities) is not so strong that this difficulty cannot be overcome. The correlation between alpha and beta is rather weak (particularly for additive beta) when alpha does not vary substantially (Table 2) .\nIn our simulations, alpha was allowed to vary. That is, for a given group of 1000 data sets, alpha could be any value between 1 and gamma. However, if we fix alpha (at any value) then an important difference emerges between additive beta and multiplicative beta. This difference can be explained analytically (without simulation). For any alpha and without knowing gamma, additive beta can vary from 0 to (N À 1) 3 alpha; multiplicative beta can vary from 1 to N. In terms of probability,\nwhen gamma is unknown and x ¼ 1 to N. In the absence of gamma, alpha provides no information as to the value of multiplicative beta. However, alpha does provide information as to the possible value of additive beta, specifically that additive beta cannot be greater than (N À 1) 3 alpha. Alpha and N constrain the range of additive beta; this constraint gets weaker as N and alpha increase (e.g., N ¼ 5, alpha ¼ 10, additive beta can range from 0 to 40; N ¼ 20, alpha ¼ 40, additive beta can range from 0 to 760). However, we emphasize that alpha is FIG. 1. The relationship between alpha and beta for (A) gamma fixed as a constant at 300 with alpha as a random proportion of gamma and beta as gamma/alpha (curved line) or beta as gamma À alpha (straight line). Gamma is a random variable between 10 and 1000, and alpha is a random proportion of gamma for (B) multiplicative beta and (C) additive beta. Notes: Values are correlation coefficients. For each alpha interval, correlation coefficients are based on a linear regression of beta (additive or multiplicative) vs. alpha. A total of 10 000 data sets were randomly generated.\nonly setting a maximum potential value for additive beta. The minimum values for additive beta are not mathematically constrained by alpha. Thus, alpha is not forcing additive beta to be high as stated in Property 1 of .\nFor N ¼ 5 and 20, multiplicative beta ranges from 1 to 5 and 1 to 20 respectively for any alpha value. The range of multiplicative beta is constrained only by N and thus is constant over all alpha values. So in this sense, alpha and multiplicative beta are ''free to vary independently'' (Property 1 of Jost 2007), when gamma is unknown. But this does not mean that alpha and multiplicative beta are statistically independent. In practice, we always know gamma. Because gamma is a known value for a data set and is used along with alpha to calculate multiplicative and additive beta, neither beta is statistically independent of alpha. We agree with that the absence of constraint by alpha on multiplicative beta is a desirable property (and one that additive beta lacks). It assures us that the nonindependence of multiplicative beta and alpha is not due to the potential for positive scaling between the two variables, but rather due to the third variable gamma. This potential positive scaling exists for additive beta and presumably contributes to the nonindependence of additive beta and alpha.\nThe independence of alpha and beta was also recently examined by . He suggested that ''the foremost requirement for a meaningful index of beta diversity is that it has to be independent from species richness,'' where ''species richness'' refers to alpha diversity. defined independence of alpha and beta in terms of what he called the ''replication principle'': alpha and beta are independent if species replication does not change the value of beta. Replication is simply adding an additional group of species to the data set such that the additional group has the same sequence of abundances and presence/absence (among the set of samples) as the first group. The expanded data set has additional species (and thus an increase in alpha) but differentiation among the samples has not changed and thus beta should not change either. The replication principle is an intuitively appealing way of defining independence because presumably any differences in beta estimates (among data sets that also differ in alpha) are due to real biological effects and not the artefactual effect of beta increasing or decreasing just because it is mathematically linked to alpha. also defined independence of alpha and beta in this way, without using the term ''replication.'' Using the replication principle to define independence, recognized that multiplicative beta is independent of alpha but additive beta is not. Nonetheless, Ricotta then demonstrated that additive beta (measured as species richness) can be made to be ''independent'' of alpha (in the sense of satisfying the replication principle) by dividing beta by gamma. In essence, this is a monotonic transformation of multiplicative beta , but it does not establish the statistical independence between alpha and either additive or multiplicative beta. That is, beta/gamma as a variable is not statistically independent of alpha and so the effect of alpha on the variable must be removed (as described above) before comparing multiple beta/ gamma values. Even when a beta metric satisfies the replication principle, it will still be conditionally dependent on alpha and, therefore, correlated with alpha if alpha appears in the formula for the beta metric. One widely used and accepted method of dealing with conditional dependence between two or more variables is to use each as a response variable in a multivariate analysis (e.g., MANOVA; Sokal and Rohlf 1995, Quinn and Keough 2002) . Essentially, multivariate ANOVA treats the response variables as one and tests for an effect on this combined variable. For example, we might want to test for an effect of habitat patch connectivity on alpha and beta. If we have several sets of patches (varying in connectivity within the set) then alpha and beta could be modeled as a multivariate response to the main effect of connectivity.\nThe analyses presented in this paper do not examine the dependence between alpha and beta when beta is measured by entropies (e.g., Shannon and Simpson indices, others given in Table 1 of Jost 2007) other than species richness. Entropies are more constrained in the limits than species richness, with the Shannon index typically ranging between 1 and 5 and the Simpson index ranging from 0 to 1. Our method of simulating data sets (i.e., randomly selecting alpha and gamma values), without actually producing the hypothetical raw data that the values represent, is not amenable to analyzing other entropies because these are scaled differently than species richness, and require species-abundance distributions. However, we suspect that the beta estimates derived from these other entropies are statistically dependent on alpha. has brought attention to some important issues in the application of diversity partitioning, including making researchers aware of the value of using true diversities (numbers equivalent) to measure species diversity. We see value in these ''new'' metrics and the general partitioning approach advocated by . No metric for beta diversity will be statistically independent of alpha and gamma diversity if the beta is calculated directly from alpha and gamma. However, the statistical dependence is not overwhelming and can be handled (e.g., through multivariate analyses) to allow for statistically valid comparisons among multiple beta estimates."}, {"section_title": "Introduction", "text": "Though Veech and Crist's paper deals primarily with species richness, ecologists partitioning diversity generally use multiple diversity measures and compare the beta values among them (e.g., , Couteron and Pelissier 2004 , Stendera and Johnson 2005 , Ribiero et al. 2008 ). This paper therefore takes a more general perspective and treats all standard measures, not just species richness.\nVeech and Crist rightly note that I do not mention ''statistical independence . Statistical independence of alpha and beta is neither necessary nor desirable.\nStatistical independence between alpha and beta is primarily an empirical question; it depends on nature and on our sampling scheme. In some kinds of ecosystems, it is conceivable that high differentiation is associated with high within-group diversity. The reverse is also conceivable. If nature has these regularities, we would want our measures of alpha and beta to be able to reflect them. We would not want a definition of beta that predetermined the kind of regularities we could observe.\nThe meaning of ''independence'' take the experimenter's view; they regard gamma and alpha as the fundamental quantities, and beta as the derived quantity. Conceptually, however, gamma is the compound or derived quantity, produced by the interplay of the two more fundamental quantities, the mean within-group diversity and the between-group diversity. This observation is at the root of all attempts to partition gamma diversity into alpha and beta components.\nMany partitioning schemes have been proposed, and all agree that the within-group or alpha component of diversity depends only on the diversities of each group, not on between-group relationships. Alpha is blind to any sharing of species between the groups. If we measure alpha diversity of a set of samples that all share the same species, and then we rename the species so that none are shared across samples, alpha does not change at all. Alpha is logically and mathematically unrelated to the way that species frequencies are connected across groups. This is what I mean by ''independence'' in Jost (2007) .\nA complete partitioning of gamma diversity would divide gamma into one component that describes this within-group or alpha diversity, and another logically unrelated component that describes how the groups are related to each other. Because these components measure completely different things, they should be defined so that each is free to vary independently of the other. My partitioning theorem shows how to find just the component due to the relations between groups, and it identifies the conditions under which this can be identified with beta diversity (or relative differentiation between groups). Sometimes this partitioning is additive (e.g., Shannon and Renyi entropies), sometimes it is multiplicative (all true diversities sensu The resulting beta component is not mathematically constrained by alpha. Fig. 1 compares this kind of partitioning with additive partitioning of the three most common indices. In the partitioning formulas produced by my theorem, the value of alpha puts no mathematical constraints on the possible values of beta. For a fixed number of groups, any value in the domain of alpha is compatible with any value in the domain of beta, and vice versa. Alpha and beta form a Cartesian product parameter space. The partitioning scheme does not predetermine the kind of relationship that will be observed in nature between alpha and beta.\nThe mathematical independence of alpha and beta is not the same thing as statistical independence, which depends on the particular sampling scheme used and the joint probability distributions of the species. An analogy with vector decomposition may help illustrate the difference. If we knew nothing about the universe except the value of the x component of a vector, we would have absolutely no clue about the value of its y or z components. This shows that the components are logically and mathematically independent (orthogonal). Yet if geologists were using vectors to describe the topography of a mountain, they would observe correlations between the x, y, and z values. The correlations would accurately reflect characteristics of the real topography, and this is what makes vectors useful. Because there are no forced mathematical relations between x, y, and z, we can easily infer the actual topography from these numbers. The same is true of the alpha and beta produced by my partitioning scheme. It might well happen that in some parts of the world, high values of alpha are correlated with high (or low) values of beta. The goal is not to eliminate the possibility of these empirical correlations, but rather to ensure that beta is not confounded mathematically with alpha. Then, if correlations between alpha and beta are observed in the real world, we can confidently attribute this to nature and not to artifacts of our measures."}, {"section_title": "Practical importance of this kind of independence", "text": "The practical importance of mathematical independence is best illustrated using the Gini-Simpson index. In the additive scheme, for any given value of alpha, beta is constrained to be less than (1 À 1/N )(1 À alpha), where N is the number of groups or samples. Therefore, when Gini-Simpson alpha is high (close to unity), the additive Gini-Simpson beta is necessarily close to zero, even when all samples are completely different from each other. Additive Gini-Simpson beta values close to zero may therefore mean either that the samples are nearly identical or completely different. Since ecologists use beta to quantify differentiation between sites or samples, they can be misled by this ambiguity. Table 1 shows how additive Gini-Simpson beta misranks hypothetical insect data sets with respect to their differentiation. Beetles are completely differentiated between samples (no shared species), while butterflies are less differentiated between samples. Yet the beta produced by additive partitioning of the Gini-Simpson index is lower for the highly differentiated beetles than for the butterflies, because beetle beta is mathematically constrained to low values by the high value of beetle alpha. Gini-Simpson additive beta is not a direct measure of compositional differentiation.\nIt is tempting to conclude that these problems are the fault of the Gini-Simpson index itself, perhaps because of its sensitivity to widespread dominant species. Yet the problems just mentioned have nothing to do with dominance; they arise also for completely even communities with no dominance. What these problems really prove is that additive partitioning is not a generally valid framework for producing measures of compositional differentiation. When the Gini-Simpson index is properly partitioned into mathematically independent alpha and beta components, the problems disappear. For the case of N equally weighted communities, the beta component of the Gini-Simpson index is then constrained between 0 and (1 À 1/N). These constraints do not contain alpha. Values close to (1 À 1/N) unambiguously indicate high relative compositional differentiation among groups, regardless of the value of alpha.\nAs noted in their paper, mathematical independence of alpha and beta makes beta ''replication invariant.'' Merging of distinct copies of a population, each copy with different species but with the same relative abundances and hence the same amount of relative differentiation, increases alpha without changing beta. This principle, and a stronger version which holds when all samples are given equal weights, is illustrated in Table 2 . While mention it in the context of species richness, replication invariance is a property of the pure betweengroup component of any measure of diversity or Notes: For beetles, additive Gini-Simpson beta ¼ 0.09, GiniSimpson similarity alpha/gamma ¼ 90%. For butterflies, additive Gini-Simpson beta ¼ 0.23, Gini-Simpson similarity alpha/gamma ¼ 64%. Beetles are more differentiated between sites than butterflies, but additive beta is higher for the butterflies. Beetle communities are less similar to each other than the butterfly communities, yet the additive similarity measure alpha/gamma is higher for beetles than for butterflies. The correct partition of the Gini-Simpson index gives beta of 0.5 for beetles and 0.39 for the butterflies; the ratio alpha/gamma using true diversities is 0.50 for beetles and 0.60 for butterflies. Notes: Values are number of individuals of four taxonomic groups sampled from three sites. On the left, species group 2 is a duplicate of species group 1, but with different species. When Gini-Simpson beta is calculated as in Eq. 15d of , using unweighted species relative abundances in the calculation of alpha and gamma, the beta of the combined set is the same as the beta of the subsets. This is replication invariance. This beta also obeys the stronger property demonstrated at right. When any two subsets of species with the same beta are pooled, the beta of the pooled set is the same as the beta of the subsets. As long as equal sample weights are used in the calculation of alpha and gamma, it is not necessary for the sample sizes to be equal, and the mixing proportions of the two subsets can also be arbitrary. compositional complexity derived from my partitioning theorem. For example, the between-group component of the correctly-partitioned Gini-Simpson index is replication-invariant, as shown in Table 2 .\nFor these measures, lumping two nonoverlapping sets of species (e.g., Set 1 is made up of Morpho butterfly species and Set 2 is made up of Caligo butterfly species) with the same degree of differentiation among sites results in a new group with the same value of differentiation among sites. Pooling per se does not change the value of beta. This property is essential if ecologists want to compare the beta diversity of a subset of species to the beta diversity of the whole, or to the complement of the subset. Otherwise such comparisons make no sense. The beta of has this property when all samples are given equal weights, but additive GiniSimpson beta lacks it.\nDiscussion of partitioning schemes usually revolves around the definition of beta. However, we must also consider whether a scheme's alpha, beta, and gamma work together coherently. This is important, since partitioning studies often combine alpha, beta, and gamma into the ratios beta/gamma and alpha/gamma, to facilitate interpretation (Nei 1973 . Even in studies which do not use these ratios explicitly, results are often expressed as bar graphs displaying alpha and beta as proportions of gamma , Stendera and Johnson 2005 . Unfortunately, for Shannon entropy and the Gini-Simpson index the ratio alpha/gamma (which is supposed to reflect community similarity) is constrained by the value of alpha. It necessarily approaches unity when alpha diversity is high, even if samples or communities share no species . Likewise, for these measures the ratio beta/gamma necessarily approaches zero when alpha diversity is high (Jost 2008) . Table 1 illustrates this for the Gini-Simpson index; the completely distinct beetle communities have a ''similarity'' (alpha/gamma) of 90%, suggesting high similarity even though the beetle communities share no species. The butterfly communities, which are more similar to each other than the beetle communities, have a lower similarity, 64%. Alpha, beta, and gamma based on Shannon entropy and the Gini-Simpson index lack the mathematical properties needed for these ratios to be informative about the similarity or differentiation among communities.\nThe misleading behavior of these ratios is more extreme for the Gini-Simpson index than in Shannon entropy. This is why the bar graphs in additive partitioning studies of high-diversity ecosystems generally show much smaller beta contributions for the GiniSimpson index than for Shannon entropy (e.g., . This is also why bar graphs of Shannon entropy or the Gini-Simpson index for high-diversity systems will generally show smaller beta contributions than the corresponding bar graphs of low-diversity systems, even if differentiation is greater for the high-diversity system. This occurs for example in Fig. 3 of for the Gini-Simpson index. The similarity measure alpha/gamma for earlyseason moths (92%) is lower than for late-season moths (98%), seemingly indicating more differentiation between sites in the early season. This is just a mathematical artifact due to the greater alpha diversity of lateseason moths. For the observed late-season alpha diversity of 0.972, the ''similarity'' measure alpha/gamma is mathematically constrained to be between 97.2% and 100%, no matter how differentiated the samples. Biological conclusions should not be drawn from such bar graphs.\nIf the ratio alpha/gamma is to be interpretable as a similarity measure, for a given set of N communities or samples, it must vary over a fixed range that does not depend on the species frequencies of the samples. Only then will it be a useful stand-alone descriptive statistic for the samples. The ratio alpha/gamma will have fixed upper and lower limits, independent of species frequencies, if alpha is defined as in Jost (2007) and the diversity measure possesses the ''doubling'' property first discussed by Hill (1973) . The slightly stronger version of this property used by states that if we pool N equally diverse, equally large, completely distinct samples, each with diversity X, then the diversity of the pooled samples must be N 3 X. The ratio alpha/gamma for these samples would be X/(N 3 X ) ¼ 1/N, independent of alpha. This sets the minimum possible value of the ratio for N equally large communities. The maximum value of unity occurs when all communities are identical. Thus if the diversity measure has the special property just mentioned, the ratio alpha/gamma varies over a fixed range that depends only on the number and sizes of the samples, not on the species frequencies of the samples. For any given set of samples, we can easily judge whether its ratio alpha/ gamma is near to one or the other of these limits, and from this we can judge the relative similarity of the samples.\nThis same ''doubling'' property also makes diversity measures behave intuitively in other contexts. Measures without this property lead to logical contradictions when used in conservation biology (Appendix, Jost 2009 ). Shannon entropy and the Gini-Simpson index lack this property, so conclusions based on these measures are often invalid. This is why I call measures that possess this property ''true diversities.'' Shannon entropy and the Gini-Simpson index should be called something else. I suggest the umbrella term ''measures of compositional complexity'' (Jost 2009) Since these are now in the same units, they can be compared with each other, and valid conclusions can be drawn about the differentiation of rare vs. common moth species, or between early and late moth differentiation. (My correction to the published data is only approximate, since it assumes all sites have equal statistical weights.) Note the close agreement between Shannon and Simpson beta in the corrected versions. The species richness differentiation is greater than the other two because there were many singleton species in the data. This correction can alter conclusions; the uncorrected Gini-Simpson beta drops from early to late season, while in the corrected GiniSimpson beta increases from early to late season. This latter behavior agrees with the behavior of the beta values of the other indices from early to late season. By inventing numerical examples where the right answer is obvious, the reader can easily convince himself that when conclusions differ based on additive and multiplicative Shannon or Simpson beta values, the multiplicative scheme always gives the biologically sensible and mathematically consistent conclusion about relative differentiation."}, {"section_title": "Veech and Crist's notions of statistical independence", "text": "As discussed above, the kind of independence that underlies my partitioning scheme is not the same thing as statistical independence. Therefore Veech and Crist's (2010) discussion of statistical independence, and their simulations, are not closely related to the real issues underlying partitioning. Nevertheless it is necessary to comment briefly on some of their statements about statistical independence.\nFirst, Veech and Crist point out that for any particular data set and any particular partitioning scheme, the values of alpha, beta, and gamma are all completely determined if we know the true values of any two of them. Veech and Crist use this to claim that beta is necessarily mathematically constrained by alpha even under my partitioning scheme. This statement confuses functional relationships with a particular set of function values. Many aspects of nature are the result of the combined effects of multiple independent variables. The existence of a formula for the combined effect has no bearing on the independence of the underlying variables. Using their example of flipping two fair coins, we could find the total number of heads for each experiment (an experiment being a flip of the two coins). For any instance of the experiment, if someone told us the outcome of one of the flipped coins and also told us the total number of heads, we could determine if the other coin gave a head or a tail. This does not change the fact that the outcomes of flipping the two coins were statistically and logically independent of each other.\nThe authors also claim that alpha, beta, and gamma are pairwise independent. Gamma is not independent of alpha or beta. If one knows nothing else about the world, except that alpha ¼ 50, this lets us infer that gamma is greater than or equal to 50. Likewise, in additive partitioning of species richness, if one knows that beta is 10, then gamma is necessarily greater than 10. Note how different this is from the relation between alpha and beta using either additive partitioning of Shannon entropy, or multiplicative partitioning of any true diversity. If someone tells us the value of alpha, and nothing else, this knowledge by itself tells us absolutely nothing additional about the value of beta.\nMost of the authors' article is devoted to a simulation intended to test the independence of alpha and beta. However, Veech and Crist use a simulation procedure that does not fix the number of communities N. In multiplicative partitioning, the value of N explicitly determines the range of beta. The authors' simulation therefore confounds two effects: the known effect of N on beta, and the influence of alpha on beta. Had they used a fixed N (which is the normal situation in a real ecological investigation), they would have found that multiplicative beta was independent of alpha. This is explained in detail by in this Forum. In any case, statistical relations between alpha and beta are empirical issues, which depend on the nature of the ecosystems under study and the sampling scheme. They are irrelevant to investigating the mathematical relationships between alpha and beta. The mathematical independence of within-and between-group diversity is shown by proofs and algebra (e.g., Jost 2007), not simulations."}, {"section_title": "Conclusion", "text": "When the additive partitioning framework is applied to Shannon entropy and the Gini-Simpson index, mathematical artifacts often masquerade as ecologically meaningful results. The complete partitioning of true diversities into mathematically independent alpha and beta components lets us study within-and betweengroup diversity without distortion, in a mathematically rigorous and self-consistent framework. This same mathematics resolves problems created by additive partitioning of diversity in other sciences, such as population genetic (Jost 2008) .\nPractical applications of this approach need to account for biases caused by small samples. Chao et al. (2008) recently generalized some of the similarity measures in and developed nearly unbiased small-sample estimators for some of them. Anne Chao and her collaborators continue to develop new estimators for true alpha, beta, and gamma diversity; these and the unbiased similarity estimators are implemented in the freely-downloadable program, SPADE (Chao and Shen 2009 The need for a measure of beta diversity independent of alpha diversity was stressed long time ago , in order to ensure a ''useful application of a measure [of beta diversity] to systems with different alpha diversities.'' It should be noted that this requirement refers to the independence of beta diversity of mean alpha diversity, and not to the independence of beta diversity with regard to differences in alpha diversity between sites. The latter issue was addressed by several authors (Harrison et al. 1992 , Lennon et al. 2001 , Baselga 2007 ) because beta diversity measures that are dependent on the variation in alpha diversity consider spatial turnover and nestedness patterns as being equivalent ). However, the dependence of beta diversity on the mean value of alpha diversity is even more critical because it compromises the comparability of beta diversity showed that different formulations (multiplicative, additive, and others) are required to partition the different diversity indices (i.e., species richness, Shannon, Gini-Simpson) into independent alpha and beta components. Jost writes that ''when these new alpha and beta components are transformed into their numbers equivalents (effective numbers of elements), Whittaker's multiplicative law (alpha 3 beta ¼ gamma) is necessarily true for all indices.'' I follow in using the term ''true diversity'' for diversity measured in terms of species counts, since species richness is its own numbers equivalent. Thus, when referring to true diversity, the only way to obtain independent alpha and beta components involves using the multiplicative partition. Although the rationale behind this assertion is not explicit in Jost's paper, it runs as follows. By using this multiplicative law for groups of communities sharing the same proportion of species, we will obtain the same value of beta diversity regardless of the number of species in these groups. In other words, beta diversity will be computed to be equal for (1) a set of two communities with alpha ¼ 10 and 5 species in common and for (2) a set of two communities with alpha ¼ 100 and 50 species in common. This is because multiplicative beta diversity depends on the proportion of shared species. Thus, if we replicate the species composition of the analyzed communities, the beta value should not change if it is independent of richness. termed this requirement the ''replication principle,'' proposing it as a test for the independence of a beta diversity measure with regard to richness. Ricotta showed that additive beta diversity based on species counts suffers the major drawback of being dependent on species richness, in contrast to multiplicative beta. The dependence of additive beta on species richness was also recently noted by Zeleny (2009) and Manthey and Fridley (2009) in a different context.  referred as VC throughout the text) proposed an evaluation of the assumed independence of multiplicative beta diversity on alpha diversity, going beyond theoretical discussion and aiming to provide empirical evidence for the dependence or independence of beta diversity measures. In a simulation procedure, they compared the performance of the additive and multiplicative partition of true diversity. Veech and Crist concluded that neither additive nor multiplicative beta diversity is independent of alpha diversity, and that the dependence of multiplicative beta is even greater than that of additive beta. Here, I evaluate their simulation procedure and provide new approaches. All computations were performed in R (R Development Core Team 2006). I will show that (1) the patterns of dependence between multiplicative beta and alpha are the outcome of the particular conditions of VC's simulation procedure, which imposed severe restrictions on the possible values of alpha and gamma, and therefore beta; (2) when these restrictions are eliminated, multiplicative beta is completely independent of alpha but additive beta is not.\nThe empirical tests demonstrated that multiplicative partition of true diversity yields independent alpha and beta components, but additive partitioning does not. As stressed by , this conclusion is not particular for species richness but can be generalized to any diversity measure. The appropriate partitioning for different diversity measures (Shannon, Gini-Simpson) is that which is equivalent to the multiplicative partitioning of its number equivalents . Therefore, the point raised here is independent of the inclusion of incidence or abundance measures in the diversity index, and should be taken into account prior to other considerations, such as the effect of sample size and undetected species (Chao et al. 2005 (Chao et al. , 2006 or discrimination between turnover and nestedness patterns . As a conclusion, using the additive partition of true diversity, one would always find a correlation between alpha and beta diversity patterns derived from the intrinsic dependence between both measures. In contrast, using multiplicative partitioning, one can assess if there is any relationship between alpha and beta diversity patterns. If found, this relationship could be analyzed as a meaningful biological pattern . As reported previously by , alpha and beta diversity patterns are the result of different ecological and biogeographical processes. Thus, if we are to understand the mechanisms underlying biodiversity we need to assess alpha and beta patterns using truly independent measures. These measures are provided by the multiplicative partitioning of true diversities, or the equivalent formulations for other diversity measures The concept of beta diversity was first introduced by as the proportion by which the pooled species richness in a set of plots of some arbitrary size exceeds the average richness of species in individual plots. According to Whittaker's multiplicative approach, for species presence and absence data, beta diversity is computed as b ¼ c/ā, whereā is the average alpha diversity of single plots. In an alternative approach originally proposed by McArthur et al. (1966) and recently ''rediscovered'' by , beta diversity is computed additively as b ¼ c Àā. In both cases, as beta diversity increases, individual plots differ more markedly from one another and sample a smaller proportion of the species occurring in the region .\nThough initially developed for dealing with species richness, both diversity decomposition methods can be usually extended to traditional diversity indices, like the Shannon entropy or the Simpson diversity, that are based on species relative abundances. Unfortunately, unlike the alpha and gamma components of diversity, beta diversity is not a genuine measure of ''compositional diversity'' . Rather, as shown by , it is conceptually closer to a measure of multivariate plot-toplot dissimilarity. This ambiguity in the very meaning of beta diversity has ensured that its measurement remains ''capricious'' (sensu Sarkar and Margules 2002) .\nAccordingly, a number of alternative methods for measuring beta diversity have been proposed by several authors. For instance, the classical reviews by and list 8 and 24 different measures of beta diversity, respectively. Izsak and Price (2001) suggested that the mean of the dissimilarities among plots may be used as a genuine measure of beta differentiation (see also . also showed that the variance of the species 3 plots matrix is another meaningful measure of beta diversity. More recently, Anderson et al. (2006) proposed measuring beta diversity as the average dissimilarity from individual plots to their group centroid in multivariate space, while Ricotta and Burrascano (2009) used instead the mean asymmetric dissimilarity between the individual plots and the pooled set of plots.\nAll these measures have the merit of summarizing the variability in species composition among sampling units based on distinct objectives and motivations; from a statistical viewpoint, by reducing a multivariate data set of high dimension like plot-to-plot species heterogeneity into a single index, information is necessarily lost, and there is no ideal function capable of uniquely characterizing all aspects of beta diversity.\nIn this framework, Jost (2007) went a step further in developing the mathematical foundation for multiplicative partitioning of species diversity. noted that if the ratio c/ā is computed directly from traditional diversity indices, it necessarily approaches unity when diversity is high, apparently indicating complete similarity, even if the plots sampled are completely differentiated (no species in common). Jost also showed that for the Simpson index 1 À R 1 E-mail: carlo.ricotta@uniroma1.it total species richness), the beta produced by additive partitioning necessarily approaches zero when diversity is high, apparently indicating no differentiation, even if the plots do not share any species. This is because the existing definitions of multiplicative and additive beta diversity produce a beta with a hidden dependence on alpha. suggested that a solution consists in converting alpha and gamma diversities to their ''equivalent number of species'' or ''numbers equivalent'' D before taking the ratio between gamma diversity and average alpha diversity such that\nAs shown by , for all diversity indices that are functions of R \nwhile D b embodies the effective number of distinct communities or plots in the region, thus reconciling the notion of beta with compositional diversity. further demonstrated that numbers equivalents allow the multiplicative decomposition of any diversity index D into two independent components, D a and D b that are free to vary independently and that completely determine D c . Based on simulated data, Veech and Crist (2010) contest this result and argue that: ''When evaluating the statistical dependence of alpha and beta diversity, it is important to remember that a third variable, gamma diversity, is involved [. . .] . This a priori knowledge of the value of gamma suggests that alpha and beta are not conditionally independent. Beta is completely determined from gamma and alpha. Procedurally, gamma and alpha are calculated first and then beta is calculated as either gamma -alpha or gamma/alpha. Alpha and beta would be conditionally independent [. . .] if the value of alpha did not determine the value of beta (or vice versa) given a known gamma. Each of the three variables, alpha, beta, and gamma are pairwise independent. This means that for each of the pairs [(alpha, beta), (alpha, gamma), and (beta, gamma)] neither variable would determine the other without knowing the value of the third variable not in the pair.'' Though Veech and Crist correctly note that, given the data, all the metrics are determined, exactly because they are calculated from the data, I cannot fully agree with their approach. The problem here is in recognizing what these metrics really are conditional upon. For instance, the ''design'' of a study (as opposed to its results) only constrains the total number of plots we sample, not the total number of species sampled or their occurrences. Consequently, before we get the data, alpha, beta, and gamma could potentially assume any values (within the constraints of their definitions; e.g., alpha must be less than or equal to gamma, and so forth). In the present debate, what seems to be of interest is the values that beta can take, conditional on the value of alpha in the data. Given this objective, the only information we should use is the number of plots sampled (N), which is set before we have the data in hand, and the quantity we are conditioning on (alpha).\nIn this view, for species presences and absences, multiplicative beta can be expressed as\nwhereN i is the mean number of species presences in the N plots. This latter way of expressing beta also immediately tells us that in multiplicative diversity partition maximum beta is necessarily constrained by N such that b N. Accordingly, a null model that first chooses the number of plots, then alpha at random, then beta at random within the possible values defined by Eq. 2, and then determines what gamma should be, would not have the correlations obtained by Veech and Crist (because they constrain beta based on alpha and gamma). Also, gamma is in no way independent on alpha, as for a given N, gamma is constrained within the valuesā c N 3ā. This dependence of gamma on alpha is a basic component of the doubling property of and of the replication principle of . For instance, both conditions require that, under some circumstances, there is a linear dependence of gamma on alpha. According to the doubling property, given two equally large and completely distinct species assemblages, each with diversity D, if these assemblages are combined, the diversity of the combined assemblages should be 2D.\nThis semi-additive property is at the core of the independence between alpha and beta demonstrated by . Most diversity indices violate this property, but their numbers equivalents do not. Therefore, apart from species richness that represents its own numbers equivalent, we can confidently conclude that the multiplicative partitioning of numbers equivalents is the best possible choice for getting independent alpha and beta components; the next step will now consist in extending this partitioning scheme to diversity measures that incorporate information about the degree of ecological dissimilarity between species, such as, e.g., the Rao (1982) quadratic entropy. For a short review on such measures see Schmera et al. (2009) and references therein.\nYet, this is not the end of the history; as noted by one anonymous referee, independence of beta on alpha is not a good reason for ''letting the tail of statistical convenience wag the dog of ecological inquiry.'' In particular, different beta metrics are measuring different quantities (i.e. average number of species not observed for additive beta, or ''effective number of communities'' for multiplicative beta). Therefore, the key question we should ask of a beta metric is: does it measure the thing we are biologically interested in? If the metric has statistical properties that make patterns in beta easy to analyze and interpret, so much the better. But if not, this is not necessarily a good reason to abandon it in favor of something statistically well behaved that is not actually the quantity we are most interested in. Rather, as covariances between statistics calculated from the same data ought to be something that can be handled by generating the appropriate statistical expectations (either via analytical probability theory or possibly by bootstrapping or Monte Carlo methods), we simply need to do the hard work of coming up with valid tests for patterns in that beta metric.\nFinally, in spite of the many advantages offered by the multiplicative diversity decomposition of numbers equivalents, we should ask what is lost in transforming raw diversity measures to their numbers equivalents. Many authors have proposed a set of basic criteria that an index of diversity should meet to reasonably behave in ecological research (e.g., Patil and Taillie 1982 , Routledge 1983 . However, the usual outcome is that no single index can satisfy even the most basic of these criteria. This is because as diversity theory mirrors the intrinsically complex and nonlinear essence of ecological processes, it is also a fundamentally complex and nonlinear discipline. In this view, a desirable property of an ecologically meaningful (beta) diversity index is the so-called sum property. In simple terms, the diversity index needs to be decomposable into specieslevel patterns such that, given a diversity measure H that conforms to the sum property, the measure is decomposable into species-level patterns and the sum of single species diversities gives the pooled diversity of the species collection. That is, H ¼ R S i¼1 H i , where H i is the contribution of species i to H.\nIn this way, the sum of single species diversities gives the pooled diversity of the species assemblage (see Ricotta et al. 2004) . In a similar context, Patil and Taillie (1982) termed this property ''dichotomy'' because the diversity of species i would be unchanged if the other species were grouped into a single complementary category.\nWhen dealing with beta diversity, a usual question to ask is which species contribute more to plot-to-plot heterogeneity? From Eq. 2, it is easily shown that for species presence and absence data, the contribution of species i to beta is proportional to the inverse of its number of presences in the N plots. Unfortunately, this simple result cannot be generalized to numbers equivalents. Due to the non-linearity of the transformation of raw diversities to numbers equivalents (see Eq. 1), these latter ones cannot be decomposed into single-species contributions. In this case, to capture the importance of single species or species groups in shaping the compositional heterogeneity of a given set of plots, different measures of beta diversity need to be used.\nTo conclude, though the Jost definition of beta behaves better than previous measures as concerns its independence on within-plot diversity, a perfect measure of beta diversity does not exist and none of the measures proposed to date is entirely satisfactory. Therefore, as we do not leave in a perfect world, we are forced to use the type of beta diversity measure that is less inadequate to solve a specific problem. first proposed the idea that species diversity has spatial components, with alpha diversity estimating diversity within individual stands (or communities) and beta diversity estimating the number of community types in an area (or in Whittaker's terminology, ''differentiation of communities along gradients''). These two values combined make up gamma diversity. Beta diversity is important because it provides the conceptual link between local and regional diversity, more directly measures how soil types, disturbance, and dispersal affect diversity, and is helpful in understanding why species loss is sometimes smaller than predicted by theory . Many interesting and longstanding questions are applied across scales, such as how much diversity is found within islands vs. across islands? Is the number of habitat types (i.e., beta) within islands key to explaining diversity at larger scales or is it the greater population sizes found on large islands? Furthermore, a consideration of both alpha and beta is necessary for understanding how diversity arises and is maintained in diverse systems. For example, in the northern Great Plains, we have found that remnant prairies can contain over 120 plant species within a small area ; this occurs because of high diversity at the neighborhood scale where 20-25 species are found per square meter , and from species accumulation across neighborhoods (i.e., beta).\nMany different approaches to estimating beta have been forwarded since Whittaker introduced the concept, and many sampling and statistical issues have been discussed. To an empirical ecologist, the key question when deciding which approach to use is ''Will we get different answers to a question depending on the beta measure that we use?'' Here, I address this question by testing whether commonly used indices (multiplicative and additive measures) differ in their response to a common set of ecological treatments.\nWhittaker proposed a multiplicative form for beta (mb) as b ¼ c/a. A simple way to describe this equation is that alpha is species diversity within communities, and beta is the number of community types in the region . A major issue with the among-vs. withincommunity approach is that the scale at which a is sampled varies so that alpha is used to estimate point diversity in some studies (e.g., at the scale of a sampling station or quadrat) and is used to estimate something larger (e.g., an island in an island biogeography study) in other studies. This makes sense in that beta describes a general concept of species accumulation across lower levels of organization, but it creates a problem in that one person's alpha (e.g., an island) is another person's gamma (e.g., an island, if alpha is at the scale of neighborhoods within the island). The additive form of beta (ab), b ¼ c À (mean a), has become popular in recent years because it can easily be applied at different spatial scales to address these issues in an effective manner. The additive form has the following advantages over the multiplicative form: (1) alpha and beta are in the same units, and (2) it enables estimates of beta even when the boundaries between communities are hard to discern, and thus, (3) it more easily allows multiple levels of beta. With additive beta, one can ask questions about how beta changes with the scale of measurement, and it fits in well with other topics in the popular field of landscape ecology.\nHowever, and Riccota (2007) correctly point out that ab is not mathematically independent of additive a. They recommend using multiplicative forms of beta, alternative forms of additive beta based on numbers equivalents , or proportions of additive alpha and beta to gamma (a/c and b/c [or propB]; Riccota 2007). To provide a simple ecological example that illustrates their point about a lack of independence: imagine a relatively homogenous field of herbaceous plants surrounded by a very large regional species pool with a consistent amount of species turnover throughout. Three studies are conducted in this same field, each group uses a different sized quadrat to sample, and all have the same sample size. Let us assume that they all sample the field without error. The first uses the smallest-sized quadrat and finds a mean alpha of 20 and gamma of 30. The second uses a medium-sized quadrat and finds a mean alpha of 40 and gamma of 60. The third uses a large-sized quadrat and 1 E-mail: bwilsey@iastate.edu finds alpha of 60 and gamma of 90. Since the field is the same and it has a consistent amount of turnover throughout, the three groups should come up with the same estimates of beta diversity. This is true of multiplicative beta and proportion of beta using the additive partitioning, but not with the absolute measures of additive beta. That is, the first group finds a mb of 30/20 ¼ 1.5, and a propB of (30 À 20)/30 ¼ 0.333, the second a mb of 60/40 ¼ 1.5 and a propB of (60 À 40)/60 ¼ 0.333, and the third a mb of 90/60 ¼ 1.5 and a propB of (90 À 60)/90 ¼ 0.333. This can be interpreted to mean that there are 1.5 community types in this field . So far so good. However, ab is not the same across studies, and alpha is not independent of beta and gamma, even though the field is homogenous and should give the same beta values. Making the calculations, the first group finds ab of 30 À 20 ¼ 10, the second 60 À 40 ¼ 20, and the third 90 À 60 ¼ 30. Now, let's say that people later compare the results from these studies, perhaps in a meta-analysis. Comparing these ab estimates would give the metaanalyst the false impression that beta ranges from 10 À 30 when it does not (they all accurately sampled the same field). However, the mb and propB would give an accurate description of the difference among the three studies. What about comparing multiple sites (giving multiple cs) with the same sized quadrat or sampling scheme? If alpha varies across sites, then ab is going to rise and fall with alpha in the same manner with the same problems previously described. This dependence of beta on alpha is different from the dependence within sites that was discussed by . Within sites, the relationship between alpha and additive beta can be negative when raw values and not means are used, because the closer alpha is to gamma, the lower beta will be . However, the partitioning approach advocated by and reviewed by uses mean alpha, which should be positively related to beta when alpha varies across sites.\nData from a thought experiment are one thing, but what about a real-life example? We have been conducting a long-term restoration experiment in Iowa that consists of seed additions of 30 native prairie species to bare-ground plots in former brome (Bromus inermis) fields. Seed mixes were added independently to 120 plots within each of two sites in a manner that would provide multiple independent values of alpha, beta, and gamma. The experiment involved establishing treatments that vary species arrival order and disturbance history, overseeding all plots with a common seed mix, and then sampling the resulting communities to test how treatments affected plant community assembly. An abbreviated set of results will be presented here to test whether conclusions vary depending on which beta measures are used. Beta was calculated using the most commonly recommended measures of diversity, species richness (R p\nand Gini-Simpson's (1 À R p 2 i ), where p i is the relative abundance of each (ith) species in the sample or combined samples."}, {"section_title": "The number of communities does matter", "text": "The first drawback of the VC simulation is its failure to specify the number of communities (N ). As they acknowledge in their paper, N is not consistent across the simulated cases (pairs of alpha and gamma). For example, a possible pair of values in VC simulation is gamma ¼ 1000, alpha ¼ 10. This combination is only possible for N . 100 (i.e., you cannot obtain a gamma ¼ 1000 with a lower number of communities when mean alpha ¼ 10). Another possible pair of values yielded by the VC simulation routine could be gamma ¼ 100, alpha ¼ 10, and this is only possible for N . 10. However, N should be a fixed parameter because for a given value of gamma (which is the first variable sampled by the VC procedure) the distribution of possible alpha values is determined by N. For example, for gamma ¼ 1000 the maximum value of alpha is always 1000 (all the communities have identical composition) but the minimum value of alpha is 1000/N (i.e., 200, 20, 2 for N ¼ 5, 50, 500, respectively). Therefore, to ensure that the simulation procedure randomly takes into account all the possible combinations of alpha and gamma, it is strictly necessary to set a defined N. Fig. 1 shows the pair-wise relationships between alpha, beta and gamma derived from three simulations for N ¼ 5, 50, and 500. This simulation procedure (Procedure 1; see R script in Supplement) follows VC in that gamma was set equal to a random number between 10 and 1000 drawn from a uniform distribution, but differs in that alpha was set equal to a random number between gamma/N and gamma drawn from a uniform distribution. Thus, the only difference is the fixed N. The number of replications (pairs of gamma and alpha) was set to 10 000. As reported by VC, multiplicative beta showed a pattern of dependence on alpha diversity, although the pattern was quite different depending on N. The most conspicuous result was, however, that multiplicative beta showed no pattern when plotted against gamma, whereas additive beta showed clear patterns of dependence on both alpha and gamma."}, {"section_title": "The order of simulation routines does matter", "text": "A second and more critical drawback of the VC simulation is the assumption that different routines are equivalent, in that the order in which alpha and gamma distributions are generated has no influence in the outcome. I have tested this assumption by performing a new simulation procedure that began by setting the value of alpha randomly (Procedure 2; see R script in Supplement). Fig. 2 shows the pair-wise relationships between alpha, beta, and gamma derived from three simulations for N ¼ 5, 50, and 500. In these new simulations, alpha was set equal to a random number "}, {"section_title": "FORUM", "text": "between 1 and 100 drawn from a uniform distribution, and gamma was set equal to a random number between alpha and alpha 3 N drawn from a uniform distribution. The number of samples (pairs of alpha and gamma) was set to 10 000. The most striking result of these new simulations was that, in contrast with Procedure 1, no pattern of dependence appeared between multiplicative beta and alpha. Instead, a pattern of dependence between multiplicative beta and gamma was found. Dependence of additive beta diversity on both alpha and gamma was found again, but using Procedure 2 the pattern is extremely marked in the case of gamma. Therefore, it seems clear that dependence patterns of multiplicative beta diversity are related to the simulation procedure selected. Multiplicative beta seemed to be dependent on the variable (alpha or gamma) determined second during each simulation. When random values of gamma are set first, and thereafter random values of alpha (consistent with the selected gamma and N values) are set, then multiplicative beta shows dependence on alpha. However, when random values of alpha are set first, and thereafter random values of gamma (consistent with the selected alpha and N values) are set, then multiplicative beta shows dependence on gamma."}, {"section_title": "Reasons for the dependence patterns", "text": "At this point, elements are available to interpret the results reported here as well as those published by VC. Firstly, the influence of the order of simulations on the dependence patterns results from the arbitrary limits of the distribution of the variable set in first place in the simulation (gamma or alpha). Secondly, the higher the number of communities, the higher the influence of the former arbitrary limits.\nThe limits of the first distribution are arbitrarily selected. In the first set of simulations, Procedure 1 bounds gamma between 10 and 1000. Each value of gamma is then randomly associated with any of all the possible values of alpha consistent with the specified N. For this reason, not all possible values of gamma consistent with the specified N are available for certain values of alpha, since we have arbitrarily limited gamma to be between 10 and 1000. For example, for N ¼ 5 and gamma ¼ 1000, one possible value is alpha ¼ 1000 (as any other value between 200 and 1000). However, for alpha ¼ 1000, the only possible value of gamma in this simulation is 1000, hence the dependence pattern between multiplicative beta and alpha in Procedure 1. However the limit of gamma and the forced low value of multiplicative beta are arbitrary and not caused by a real association between alpha and multiplicative beta. There is no reason to exclude the possibility of a value of alpha ¼ 1000 associated with any value of gamma . 1000. In fact, it is much more unlikely to observe five different communities with exactly the same set of 1000 species. The shape of the pattern depends on N because below the limit of alpha ¼ maximum gamma/N, for any given alpha all the possible values of gamma are permitted by the simulation procedure. Thus, no dependence pattern appears below 200, 20, and 2 for N ¼ 5, 50, and 500, respectively (Fig. 1) . However, for values of alpha . maximum gamma/N, the possible values of gamma are increasingly restricted with increasing alpha. Thus the distribution of multiplicative beta is artificially bounded to decreasing low values.\nIn Procedure 2, alpha is bounded between 1 and 100. Thereafter each value of alpha is randomly associated to any of all the possible values of gamma consistent with the specified N. Using this method, not all the possible values of alpha consistent with the specified N are available for some values of gamma, since we have arbitrarily limited alpha to be between 1 and 100. For example, for N ¼ 5 and alpha ¼ 100, one possible value is gamma ¼ 500 (among many others between 100 and 500). However, for gamma ¼ 500, the only possible value of alpha in this simulation is 100, hence the dependence pattern between multiplicative beta and gamma in Procedure 2. However, this is again an arbitrary constraint of the simulation. As found in Procedure 1, the pattern depends on N because below the limit of gamma ¼ maximum alpha, for any given gamma all the possible values of alpha are permitted by the simulation procedure (no pattern appears below gamma ¼ 100). Since gamma ¼ 100 is a different proportion of maximum gamma for N ¼ 5, 50, and 500, respectively, the dependence patterns exhibit different shapes (Fig. 2) . For values of gamma . maximum alpha, the possible values of alpha are increasingly restricted to high values with increasing gamma. Thus the distribution of multiplicative beta is artificially bounded to increasing high values."}, {"section_title": "An appropriate test for each question", "text": "The problem generated by the arbitrary limits of distributions cannot be solved if one aims to test the independence of beta simultaneously on alpha and gamma. Once the range of the first variable is fixed and all the possible values of the second variable are included, then, unavoidably, all the possible values of the first variable are not available for some values of the second one. But this difficulty is only an apparent one. If one wants to test the independence between beta and alpha, the correct procedure is to consider a range of possible values of alpha, and then include in the simulation all the possible values of gamma consistent with the distribution of alpha. This is Procedure 2. On the other hand, if one wants to test the independence between beta and gamma, the correct procedure is to consider a range of possible values of gamma, and then include in the simulation all the possible values of alpha consistent with the distribution of gamma. This is Procedure 1. In sum, each simulation is appropriate to test for the dependence of beta on only gamma FIG. 3 . Relationship between joint probabilities (P) and the products of marginal probabilities for multiplicative (solid circles) and additive beta diversity (open circles). Marginal and joint probabilities were computed for random events involving pairs of beta and gamma values in Procedure 1 and pairs of alpha and beta values in Procedure 2. The diagonal lines mark the 1:1 relationship (perfect fit between joint P and the product of marginal P). Histograms show the distribution of differences between joint P and the product of marginal P for multiplicative beta diversity (black) and additive beta diversity (gray).\n(Procedure 1) or alpha (Procedure 2), but not on both. In both cases, multiplicative beta passes the test, as no pattern of dependence was detected between beta and alpha (Fig. 2) or gamma (Fig. 1) . In contrast, additive beta is shown to be dependent on alpha and gamma, as previously known .\nIn my opinion, the plots shown in Figs. 1 and 2 are conclusive. However, for comparability with VC results, I computed the marginal and joint probabilities of random events involving pairs of multiplicative beta or additive beta and gamma or alpha to assess their dependence. Thus, for Procedure 1, I selected two random probability, P, values between 0.1 and 0.9 (i.e., P(G) and P(B)) and computed the quantile of gamma corresponding to P(G) (G), as well as the quantiles of multiplicative beta and additive beta corresponding to P(B) (B M and B A , respectively). The joint probabilities of gamma , G and multiplicative beta , B M (P(G, B M )), as well as gamma , G and additive beta , B A (P(G, B A )), were computed empirically as the proportion of pairs in which gamma was lower than the selected quantile of gamma, and beta was lower than the selected quantile of beta. If the measure of beta is independent of gamma, the joint probability of a pair of random events (P(G, B M ) or P(G, B A )) should be equal to the product of the marginal probabilities (P(G)P(B)). For Procedure 2, the same was done but using a random probability P(A) corresponding to a quantile of alpha, instead of P(G). As can be observed in Fig. 3 , when assessing the independence of beta with regard to alpha or gamma using the appropriate procedure, joint probabilities are almost equal to the products of marginal probabilities for multiplicative beta (mean absolute difference , 0.0017, maximum absolute difference , 0.0047 in all simulations). Moreover, differences have an unbiased distribution centered at zero (see histograms in Fig. 3 ). On the contrary, for additive beta, joint probabilities are markedly different from the products of marginal probabilities (mean absolute difference between 0.062 and 0.069, maximum absolute difference between 0.12 and 0.13 in all simulations). Differences have a positively biased distribution (see histograms in Fig.  3 ). In sum, multiplicative beta diversity is methodologically independent of gamma and alpha diversity, whereas additive beta diversity is intrinsically dependent on both gamma and alpha diversity (Figs. 1 and 2, respectively)."}, {"section_title": "Experimental Design", "text": "The experiment was established between April 2005 and April 2006 using a split-plot design at two sites that differed in their net primary productivity with five earlyemerging species treatments applied to main plots, and four history treatments applied to subplots. In 5 3 5 m main plots, seeds of early-emerging species were established as six single-species treatments at a rate of 11.5 kg/ha: (1) the perennial C 3 grass Elymus canadensis, (2) the perennial C 4 grass Bouteloua curtipendula, (3) the annual C 3 legume Chaemacrista fasciculata, (4) the biennial C 3 forb Rudbeckia hirta, (5) a mix of all four species, and (6) controls with no early-emerging species added. Species were selected because they emerge early in the establishment period compared to other members of their functional groups. The key prediction is that species will admit members of other functional groups more readily than members of their own functional groups, and that this will lead to enhanced beta diversity among plots. In 2 3 2 m subplots within each main plot, the following history treatments were applied using a seed mix of 30 native prairie species: (1) early-spring seeding of both the early-emerging species and the seed mix, (2) early-spring seeding of the early-emerging species with the seed mix added the following year in the spring, (3) late-summer seeding of both the earlyemerging species and the seed mix, and (4) late-summer seeding of the early-emerging species with the seed mix added the following year in the spring. These history treatments were predicted to lead to enhanced beta diversity due to priority effects (seed mix added at the beginning vs. the growing season after early-emerging species had established) and timing of disturbance (spring vs. fall for seedling emergence). Timing was predicted to affect the establishment of functional groups differently due to either increasing soil temperatures and day lengths (early spring seeding favoring C 4 plant species) or decreasing soil temperatures and day lengths (late summer seeding favoring C 3 species). The original design had 30 main plots at each of the two sites, and 4 subplots per main plot for 2 sites 3 6 species treatments 3 5 replicates 3 4 subplot treatments ¼ 240 total. Thus, each of the 240 plots received a separate seed mix, and a total of 60 independent gamma and mean alpha values could be calculated at the subplot to main-plot level. One plot at one site had to be dropped due to an accidental mowing event, for 236 subplots total, and 59 gamma values.\nAbundances of each plant species were estimated in the center of each subplot with point intercept sampling in mid-July of the second growing season (July 2007). All hits were counted per pin so that data would be more strongly correlated with biomass. Relative abundance was calculated as abundance of each species by the total number of hits. Pins were dropped 20 times per plot from a 50 3 100 cm frame in a systematic manner. Occasionally, there were species in the plot that did not receive any hits. These were given a value of one hit and were included in the estimates of species richness."}, {"section_title": "RESULTS AND DISCUSSION", "text": "Relationships between alpha and beta depended greatly on which measure was considered (Fig. 1, Table  1 ). As in our thought experiment, and in accordance with a mathematical dependence between alpha and beta, the alpha and additive beta measures were strongly positively correlated for all measures considered except for the Gini-Simpson's index. Additive richness was strongly related to alpha values (slope ¼ 1.3, r 2 ¼ 0.65, P , 0.001). However, multiplicative richness and the proportion of additive beta were statistically independent of alpha (all P values . 0.05). Additive e H 0 (slope ¼ 1.2, r 2 ¼ 0.67, P , 0.001) was much more strongly related to alpha e H 0 than were multiplicative e H 0 (slope ¼ 0.17, r 2 ¼ 0.38, P , 0.001) and proportion of additive beta (slope ¼ 0.08, r 2 ¼ 0.40, P , 0.001). Interestingly, and as predicted by , the Gini-Simpson's index was not independent of alpha, and the slope depended on how close alpha was to 1. In the more mesic site, the relationship between alpha and the Gini index was negative (slope ¼À0.29, P , 0.001, r 2 ¼ 0.34).\nThis site had higher alpha values. At the more xeric site, the relationship was weakly positive (slope ¼ 0.16, P ¼ 0.018, r 2 ¼ 0.18). Thus, values from both sites converged as alpha neared 1, and the ratio alpha/gamma approaches unity . These results suggest that the Gini-Simpson's index should be avoided in beta diversity studies, contrary to what was recommended by and .\nA very large amount of beta diversity was found when subplots were combined across history treatments regardless of the early-emerging species treatments (Table 1) . Greater than half of the species richness and 17-49% of Shannon's diversity at this level was from beta, and there were on average about two different community types within each main plot as a result of history treatments. This is ecologically very interesting because it was associated with the proportions of native/exotic species and C 3 /C 4 species across history treatments; this will be developed further for a future publication. At the across-site level, there was less beta than at the across-history-treatment level (mb and propB), even though the sites were orders of magnitude further apart and on different soil types with different precipitation levels. However, notice that ab for richness was much higher at the across-site level (20) across-history-treatment level (4.4 À 11.0) again due to the dependence of additive beta and alpha. These empirical results suggest that it does matter which index is used in beta diversity studies. This statistical dependence of the absolute measure of additive beta on alpha creates problems with interpretation and I suggest that the raw additive beta measure should be avoided when there are differences in alpha (and gamma) between sites or samples. However, there are many studies in the literature that have analyzed the absolute measure of beta since the additive partitioning method was advocated (e.g., Polley et al. 2005 , Hendrickx et al. 2007 , Brudvig 2009 ). Ecologists may be reluctant to see these types of comparisons of ab across sites as a problem because alpha and gamma are important variables. They may intuitively sense that the sites that they are studying do indeed have different alphas and gammas. In fact, the first and most important step in any study is to compare alpha and/or gamma diversities. However, beta should provide a value that is not mathematically related to alpha or gamma . With beta values that are mathematically independent of alpha, we can compare sites with different levels of alpha diversities across scales, and we can more effectively compare and contrast different studies. The absolute measure of additive beta is only useful in comparing plots/sites when the alpha values do not vary across the units that are being compared . Sites/ samples can be compared more effectively by not analyzing the absolute measure of beta, but instead by using the propB, the mb, or by using ANCOVA or other statistical techniques that take into account this codependence .\nThe Gini-Simpson's index should be avoided in diverse sites when its values approach 1. As pointed out, this will be most problematic in the most diverse sites. For example, we commonly record a values of the Gini-Simpson index of 0.9 in diverse tallgrass prairie plots . In this situation, b can not exceed 0.1 regardless of how much species turnover there is. This problem can be remedied by using diversity measures (e.g., Shannon's or Simpson's 1/D) that do not have an upper limit of one.\nFinally, some flexibility is needed in deciding among the recommended indices used to estimate beta diversity. We will need to continue to interpret across study systems and to compare results to earlier time periods. The approaches in comparing beta diversity discussed here (proportion of additive beta or multiplicative beta indices), or using approaches not discussed (similarityindex-based ordination ] and rarefaction-curve-based approaches [Olszewski 2004]) are all valid ways to proceed. The general approach to use will depend on the objectives of the investigation. For example, if an experiment on diversity maintenance is designed to compare alpha and gamma diversity indices, then using the approaches discussed in this paper are logical ways to proceed. Converting ''entropy'' values to their numbers equivalents before interpreting them is helpful for the reasons pointed out by Hill (1973) and . If analyses of species composition differences or species-area curves are being conducted, then the logical choice is to use one of the latter choices that were not discussed here. We can then move beyond these discussions on how to calculate beta diversity to the important task of discerning what processes underlie observed patterns of beta. Notes: Subplot means are alpha (a diversity in subplots), additive and multiplicative beta (ab and mb) and proportion of beta diversity (propb) across four history treatments that varied timing of seeding and priority effects. Beta was calculated using the most commonly recommended measures of diversity: species richness (R p The debate on the properties and use of additive and multiplicative partitioning of species diversity exemplified in this forum reflects the broader challenge of quantifying and interpreting alpha, beta, and gamma diversity at multiple scales of sampling. As noted by Wilsey and Ricotta in their contributions, ecologists use a wide range of measures of beta diversity, partly because of differences in study questions of the investigators and partly because of the differences in their statistical properties. The lack of agreement on the numerous dimensionless measures of community turnover and dissimilarity is a longstanding problem in community ecology , Magurran 2004 . So, too, there has been some disagreement on the statistical properties and applicability of the alpha and beta components of diversity partitioning.\nThe popularity of multiplicative partition of diversity, and subsequent additive partitions by MacArthur et al. (1966) , Allan (1975), and , is that they provide a single set of values of alpha and beta diversity for a given sampling scale and therefore give a simple, intuitive measure of species diversity and composition. For this reason, we believe that partitioning methods are a powerful tool for quantifying spatial and temporal variation in biodiversity in a manner that is accessible to ecologists, managers, and non-scientists. The cost of simplicity is that partitioning methods discard information on sitespecific composition retained in pairwise dissimilarity and ordination that may be important to the underlying biophysical or land-use gradients that produce beta diversity (but see Hofer et al. 2008 aggregate decomposition of diversity, both additive and multiplicative diversity partitions share the same strengths and limitations. As is clear from the foregoing contributions, however, additive and multiplicative partitions differ in their properties, expression, and interpretation of beta diversity. Here, we address several key points raised in the forum papers including the independence of alpha, beta, and gamma components of diversity, the randomization procedures used to evaluate independence, the use of entropies vs. true diversities, and the relationships between diversity partitioning and other community analyses. We conclude with a set of recommendations on the use of diversity partitioning.\nIn the past 5-10 years, diversity partitioning has become an increasingly common way of analyzing patterns of alpha and beta diversity. In addition to the contributions of this Forum, there have been other critiques of additive diversity partitioning. A common feature of some of these critiques (and some of the forum contributions) is to criticize additive partitioning because the beta component derived from additive partitioning (for some indices, notably species richness) is not independent of alpha. At the same time, the critics emphasize the ''independence'' of beta and alpha as derived from multiplicative partitioning (e.g., , Ricotta 2010 ). referred to ''independence'' of multiplicative beta and alpha several times, without explicitly using the term ''statistical independence.'' In our opening paper of this forum, we explicitly evaluated the statistical independence of beta (multiplicative and additive) and alpha. We don't agree with Jost that ''Statistical independence of alpha and beta is neither necessary nor desirable,'' and ''Therefore, Veech and Crist's discussion of statistical independence, and their simulations, are not closely related to the real issues underlying partitioning.'' Statistical independence (or the lack thereof) of alpha and beta is the main issue with respect to evaluating the potential benefits of additive and multiplicative partitioning. A researcher's ability to recognize and account for the non-independence of two or more variables is crucial for proper statistical practice.\nIn his contribution to this forum series, Jost now refers to multiplicative beta and alpha as being ''mathematically independent.'' However, ''mathematical independence'' does not exist as a property of two empirical variables. We conducted a keyword abstract search in ISI Web of Science on ''mathematical independence'' and ''mathematically independent'' and obtained 3 and 32 citations respectively, as of 1 June 2009. Virtually all of these papers were using ''mathematically independent'' as a synonym for ''statistically independent.'' By comparison, ''statistical independence'' and ''statistically independent'' returned 470 and 1243 citations, respectively. Contrary to Jost, mathematical independence is not a synonym for orthogonality. Two variables (X and Y, portrayed as matrices) are orthogonal if and only if X 0 Y ¼ 0 (Rodgers et al. 1984) . Moreover, orthogonality of two variables is a separate condition from whether the variables are statistically independent (uncorrelated); that is, two variables can be orthogonal and either correlated or not correlated (Rodgers et al. 1984) . If two variables are each represented as elements in a onedimensional matrix or vector then the vectors must be perpendicular in order to be orthogonal; alpha and beta are not orthogonal.\nThe remainder of the paper is mostly focused on further evaluating the statistical independence of alpha and beta, particularly in the light of Baselga's contribution. Baselga (2010) presents a thorough and insightful examination of statistical independence of beta and alpha. Baselga simulated pairs of alpha and gamma values and then derived additive and multiplicative beta from these paired values. This general approach follows our approach but the simulations differ (Table 1) . Procedure 1 of Baselga and our simulation procedure do not demonstrate statistical independence of multiplicative beta and alpha; however, Procedure 2 of Baselga does (Table 1) . In Procedure 2, the constraints on gamma are set directly by alpha and N (the number of samples in the data set). In Procedure 1 and our procedure, gamma is constrained to be between 10 and 1000 (or some other predefined limits); alpha does not constrain gamma. Rather gamma constrains alpha in Procedure 1 and in our procedure. In Procedure 2, gamma does not constrain alpha (except that alpha cannot be greater than gamma); alpha is constrained between 1 and 100 (or some other predefined limits) (Table 1) . In Procedure 2, gamma is selected from all possible values for a given alpha (and N ) whereas in Procedure 1 (and our procedure) alpha is selected from all possible values for a given gamma. Most applications of diversity partitioning (additive and multiplicative) assume that gamma is set (a given value for a data set) and Note: RND represents a random variable selected from a uniform distribution with the given limits; N ¼ number of samples in the data set (5, 50, or 500).\nwith alpha being a variable confined to the limit set by gamma (i.e., Procedure 1). Gamma is not assumed to be a variable whose upper limit must always increase with alpha and N (i.e., Procedure 2).\nPrevious studies by and the contributions to this forum by Baselga and Jost suggest that multiplicative beta is measuring some aspect of gamma diversity that is completely separate from the aspect measured by alpha diversity. This may be correct, but this view needs clarification. One assumption of this view is that completely different ecological and evolutionary processes produce alpha and beta-diversity. states: ''As previously reported by , alpha and beta diversity patterns are the result of different ecological and biogeographical processes.'' Our own perspective on alpha and beta diversity is that some of the same ecological and evolutionary processes affect both alpha and beta, and that alpha and beta together determine gamma-diversity, whether the partitioning is additive or multiplicative. The lack of complete statistical independence is not problematic as there are ways to account for the dependence between alpha and beta (as we explain in the lead forum paper; also see Wilsey 2010) .\nIn his forum paper, Jost (2010) disputes or misunderstands our explanation of statistical independence. He states: ''Many aspects of nature are the result of the combined effects of multiple independent variables. The existence of a formula for the combined effect has no bearing on the independence of the underlying variables.'' Although this statement is true for many variables that scientists measure, it is not true for gamma diversity. Gamma diversity is completely determined by the combined effect of just two variables. Moreover, the two variables (alpha and beta) combine in a known and constant way (either alpha þ beta or alpha 3 beta) in determining gamma. A third variable is not in the equation for gamma. Because alpha, beta, and gamma are random variables with a non-zero covariance, they are not conditionally independent. Knowing the values of any two of them allows for the exact determination of the third. This is true for additive and multiplicative beta. Jost states: ''If someone tells us the value of alpha, and nothing else, this knowledge by itself tells us absolutely nothing additional about the value of beta.'' This is indeed true, for both additive and multiplicative beta. In fact, if we only know alpha and nothing else, we cannot even calculate beta. Our main point here is that in the additive and multiplicative partitioning schemes, beta can only be determined by first determining alpha and gamma (which are directly measured). Moreover, as with most species responses measured at multiple sampling scales, these three quantities will generally have a non-zero covariance, which indicates that the variables are linearly correlated (Rodgers et al. 1984) .\nContrary to Jost (2010), we have not confused the functional relationships among alpha, beta, and gamma. Continuing with the coin toss analogy, Jost correctly states that the outcomes of flipping two coins are statistically independent of each other. This is their functional relationship (actually the absence of a relationship): the outcome of one toss in no way affects the outcome of the other toss. If we flip two coins (or flip one coin two times) then we could determine the frequency of heads (or tails) solely based on knowing the frequency of tails (or heads). The complete set of possible values are [(0, 2), (1, 1), and (2, 0)]; these are relationships between empirical values. However, alpha and beta do not have this type of functional or empirical relationship. The frequency of heads (or tails) could be directly determined by counting the number of times that the event occurs; that is, the value of each variable can be determined with direct observation and without knowledge of the value of the other variable. In diversity partitioning, beta is not and cannot be determined by direct observation or measurement; it can only be determined by knowing alpha and gamma. Many other (but not all) metrics for measuring beta also require that alpha be calculated . Thus, alpha and beta may not have an underlying functional relationship: beta as a property or characteristic of a set of samples (data set) may only exist with reference to an observed and measured alpha.\nThere are several limitations of diversity partitioning. As Wilsey demonstrates with empirical data, additive beta richness must be corrected when comparing beta values that derive from two different partitions (data sets) that differ in either alpha or gamma ). An outright misuse of diversity partitioning is the use of entropies to calculate beta as alpha/gamma; there are serious mathematical problems in doing this and these problems can lead to erroneous inferences , Ricotta 2010 . The alpha/gamma ratio has much better mathematical properties when alpha and gamma are expressed as true diversities or numbers equivalent . For any set of species abundance data, alpha, beta, and gamma can be calculated as true diversities of any order q . However, the units for alpha and beta are not the same when using true diversities. Alpha is measured or interpreted as the number of equally common species whereas beta is interpreted as the effective number of distinct communities . We agree with Ricotta (2010) that a ''statistically well behaved'' metric for beta diversity is desirable but not at the expense that it measures (or interprets) a quantity in a way that is not useful or is nonsensical. For instance, a multiplicative partition of species richness (q ¼ 0) from data of the North American Breeding Bird Survey revealed that in one ecoregion of 700 000 km 2 there were only 2.85 distinct bird communities, even though the data set consisted of 263 spatially distinct survey routes scattered throughout the ecoregion. Lastly, the beta derived from diversity partitioning does not directly measure differences in species composition among individual samples or communities, but instead is an overall average of the diversity not found in any one sample Veech 2006) .\nWe believe that both additive and multiplicative partitioning can be very useful for studies of species diversity, despite their limitations. Perhaps their greatest value is that, as an overall decomposition of beta diversity, additive and multiplicative partitioning can be applied to multiple scales of sampling (Wagner et al. 2000 , Crist and Veech 2006 . Similarly, studies on the local-regional relationships of species have benefited from multi-scale perspectives of diversity partitioning (Loreau 2000 , Cornell et al. 2007 ). Diversity partitioning can also decompose the alpha and beta components of the species-area relationship, additively or multiplicatively, and determine the fraction of the total beta component of richness that is due to changes in habitat area (Crist and Veech 2006) . Lastly, diversity partitioning has been used to determine the contributions of different habitats to overall landscape diversity Edwards 2001, Lu et al. 2007) .\nTo some extent, additive vs. multiplicative partitioning is a false dichotomy. Ricotta (2005) showed that there is substantial similarity between the two approaches and further demonstrated that when some entropies are converted into true diversities the resulting mathematical relationship between alpha, beta, and gamma is additive. The greatest value of diversity partitioning is in simultaneously analyzing alpha and beta, and not in solely measuring beta diversity. As Ricotta (2010) notes there is no perfect and completely satisfactory metric for measuring beta. The measurement of beta has received much attention in the past five years. Ecologists have and continue to develop methods that also measure differences in species composition, take into account differences in sampling effort, and differences in species detectability.\nWe suggest the following recommendations for researchers using diversity partitioning. Use either additive or multiplicative species richness (q ¼ 0) to measure beta (alpha at q ¼ 0 is the same in the additive and multiplicative framework). If there is a benefit or desire to weigh the alpha and beta values by species abundances, favoring either common or rare species, then also calculate q-diversity metrics. The latest release of our software (PARTITION 3.0) partitions additive and multiplicative species richness as well as any q metric (program available online).\n4 Do not use entropies in diversity partitioning; true diversities are superior alternatives for many reasons. Avoid the labels ''additive'' and ''multiplicative'' when referring to diversity partitioning. Be aware of the de facto but relatively minor statistical dependence between alpha and beta that exists simply because beta must be calculated from alpha and gamma. Use appropriate statistical adjustments to remove the dependence (as demonstrated in Crist 2010, Wilsey 2010) . As Wilsey notes, the general approach and metric used in analyzing a diversity pattern will depend on the goals of the investigation. Diversity partitioning is particularly well suited for analyzing multi-scale patterns of species diversity; it will continue to play an important role in this active area of research in the future.\nLITERATURE CITED"}]