[{"section_title": "Abstract", "text": "We develop an approach for estimating net ecosystem exchange (NEE) using inventory-based information over North America (NA) for a recent 7-year period (ca. 2000-2006). The approach notably retains information on the spatial distribution of NEE, or the vertical exchange between land and atmosphere of all non-fossil fuel sources and sinks of CO 2 , while accounting for lateral transfers of forest and crop products as well as their eventual emissions. The total NEE estimate of a À327 ± 252 TgC yr À1 sink for NA was driven primarily by CO 2 uptake in the Forest Lands sector (À248 TgC yr\n), largely in the Northwest and Southeast regions of the US, and in the Crop Lands sector (À297 TgC yr À1 ), predominantly in the Midwest US states. These sinks are counteracted by the carbon source estimated for the Other Lands sector (+218 TgC yr À1 ), where much of the forest and crop products are assumed to be returned to the atmosphere (through livestock and human consumption). The ecosystems of Mexico are estimated to be a small net source (+18 TgC yr\n) due to land use change between 1993 and 2002. We compare these inventorybased estimates with results from a suite of terrestrial biosphere and atmospheric inversion models, where the mean continental-scale NEE estimate for each ensemble is À511 TgC yr À1 and À931 TgC yr À1 , respectively. In the modeling approaches, all sectors, including Other Lands, were generally estimated to be a carbon sink, driven in part by assumed CO 2 fertilization and/or lack of consideration of carbon sources from disturbances and product emissions. Additional fluxes not measured by the inventories, although highly uncertain, could add an additional À239 TgC yr\nto the inventory-based NA sink estimate, thus suggesting some convergence with the modeling approaches."}, {"section_title": "Introduction", "text": "North American ecosystems have had a significant influence on the global carbon budget by acting as a large sink of atmospheric CO 2 in recent decades (Fan et al., 1998; Myneni et al., 2001; Butler et al., 2010) . Although the exact contribution is uncertain, analyses of the global C budget suggest that this North Correspondence: D.J. Hayes, tel. + 865 574 7322, fax + 865 241 3685, American terrestrial sink may be responsible for nearly a third of the combined global land and ocean sink of atmospheric CO 2 (Pacala et al., 2007) . A recent review of late 20th Century carbon balance estimates for terrestrial ecosystems in North America (NA) compiled for the State of the Carbon Cycle Report (SOCCR) found a wide range of results, with estimates of the magnitude of the continental-scale CO 2 sink extending between 0.1 and 2.0 PgC yr À1 , although the terrestrial sink based on inventories reported in this document was 0.5 PgC yr À1 with uncertainty of about 50% 1 (Pacala et al., 2007) . By comparison, fossil fuel emissions over NA (from Canada, the US and Mexico combined) in the early 21st Century are estimated to be approximately 1.8 PgC yr À1 (Boden et al., 2010) .\nAlthough fossil fuel emissions are calculated with relatively high precision, understanding the fate of those emissions with respect to sequestration in terrestrial ecosystems requires data and methods that can reduce uncertainties in the diagnosis of land-based CO 2 sinks. The wide range in the land surface flux estimates is related to a number of factors, but most generally because of the different methodologies used to develop estimates of carbon stocks and flux, and the uncertainties inherent in each approach. The alternative approaches to estimating continental scale carbon fluxes that we explored herein can be broadly classified as applying a top-down or bottom-up perspective. Topdown approaches calculate land-atmosphere carbon fluxes based on atmospheric budgets and inverse modeling. Bottom-up approaches rely primarily on measurements of carbon stock changes (the 'inventory' approach) or on spatially distributed simulations of carbon stocks and/or fluxes using process-based modeling (the 'forward model' approach).\nAtmospheric inversion models (AIMs) infer surface fluxes by reference to a sample of atmospheric CO 2 concentration (mixing ratio) measurements coupled with models of surface flux and atmospheric transport (Gurney et al., 2002; Ciais et al., 2010) . These inverse analyses provide constraints on estimates of land-atmosphere carbon exchange at a detailed temporal resolution, relying on the strong diurnal and seasonal cycles in CO 2 concentration in the observations. However, these estimates are associated with large uncertainties from the limited density of observation networks, uncertainty in the transport models, and errors in the inversion process (Gurney et al., 2004; Baker et al., 2006) . Further, AIMs typically operate at a coarse spatial resolution and provide limited detail on the processes controlling the carbon sources and sinks.\nBiomass inventories provide valuable constraints on changes in the size of carbon pools over years to decades (e.g. Pacala et al., 2001; Peylin et al., 2005) . Inventories are designed to precisely measure standing stocks in forests on longer time scales, and to estimate and analyze the dynamics of growth, harvest, and mortality. However, the inventory measurement approach can only detect measurable changes in vegetation which usually occurs over a number of years, and therefore re-measurements in most inventory programs are taken periodically. There is a high likelihood that dynamics and fluxes will be under-sampled or missed altogether; for instance, inventory sampling can produce reliable estimates of biomass, but other carbon pools (e.g. litter and soil C stocks) are not sampled at the same intensity in all areas. Inventory-based modeling can be used to estimate growth and disturbance impacts, but does not yet provide full capability in partitioning the forcing brought about by non-disturbance factors (Stinson et al., 2011) . On the other hand, inventory and commerce data sets can often be used to quantify the storage, emissions and/or lateral movement of carbon in product pools, which are typically not wellcharacterized in modeling approaches.\nThe forward model approach builds from understanding the underlying processes controlling carbon dynamics and can be used to simulate the dynamics of multiple ecosystem components through a class of models referred to as terrestrial biosphere models (TBMs). However, TBMs contain substantial uncertainty due to the sheer number of often poorly understood underlying processes simulated. They also vary widely in the data used to drive them, in the particular processes simulated, and in their level of detail (Schwalm et al., 2010, Huntzinger et al., in press ). Yet, TBMs simulate the impacts of multiple driving forces and controlling mechanisms of land-atmosphere CO 2 exchange, incorporate non-linear system behaviors, make predictions at spatial and temporal scales relevant to global and regional carbon cycles, and allow for exploration of the impacts of underlying processes.\nEach of the three general approaches (inventory, forward and inverse modeling) build on different knowledge foundations and employ different driver data. A suite of results on NA ecosystem carbon flux from extant model simulations (based on both TBMs and AIMs) have been organized by the North American Carbon Program (NACP; Denning, 2005; Wofsy and Harris, 2002) under the regional and continental interim-synthesis (RCIS) activities (Huntzinger et al., in press ). The RCIS activities focus on 'off-the-shelf' model simulations and other recently published studies as a pre-cursor to more formal model inter-comparison activities. Here, we assembled and analyzed available inventory-based data on NA ecosystem carbon cycle components as an additional perspective alongside the forward and inverse approaches avail-able from the RCIS. We developed novel techniques for comparison of the inventory-based data against results from the TBMs and AIMs at common spatiotemporal scales and flux indicators."}, {"section_title": "Materials and methods", "text": "The magnitude of carbon sources and sinks is defined as the vertical exchange of CO 2 between the surface (land or ocean) and the atmosphere, hereafter referred to as net ecosystem exchange (NEE) . In this analysis, we used estimates of NEE for the biosphere where fossil fuel emissions are excluded from the calculation. From the land perspective, NEE is primarily the balance between CO 2 uptake in vegetation though net primary production (NPP) and release via the heterotrophic respiration (Rh) of dead organic matter, plus emissions from fires and the decay of harvested forest and agricultural products (Chapin et al., 2006) . Here we used the sign convention from an atmospheric reference point whereby a negative value of NEE represents land surface uptake (a sink) and a positive value represents CO 2 emissions to the atmosphere (a source).\nThe geographic domain of this study included the three countries of NA (Canada, the US, and Mexico) and the reference time period was approximately 2000-2006. NEE estimates were made at an annual time step and considered lateral in addition to vertical transfers of carbon. Spatial scale became important where a relatively large amount of carbon is transported laterally (as harvested biomass products transferred offsite or as dissolved carbon transported in rivers, for example). In these cases, the CO 2 was considered a sink at the location where it was taken up, but became a source at the location where it was eventually returned to the atmosphere (through product decay or in-stream decomposition, for example). In this analysis, carbon flux was estimated at the scale allowable by the various inventory-based data sets (i.e., by inventory 'reporting zones'). We distinguished three sectors (Forest Lands, Crop Lands, and 'Other' Lands) within 97 spatial units (total number of 'reporting zones' across the three countries) in each (Table 1) . The 97 'reporting zones' refer to the sum of US states, Canadian managed ecoregions, and Mexican states for which inventory data were available. The carbon flux estimates from 7 inverse and 17 forward models were compiled from those submitted to the NACP-RCIS activity (http://nacarbon. org/nacp; Huntzinger et al., in press ). Here we focused on ecosystem carbon fluxes, whereas fossil fuel emissions are discussed for comparison but were not included in the budgets."}, {"section_title": "Inventory-based estimates of NEE", "text": "For the national-level reporting of greenhouse gas (GHG) inventories in the context of the Framework Convention on Climate Change (FCCC), the protocol is generally to track changes in pool sizes using data collected or modeled for carbon pools of different key land-based sectors, such as forest and agricultural lands along with other non-forest (e.g., grasslands), settled (developed and built-up) lands, and areas of land use change (Parson et al., 1992) . In this study, we compiled GHG inventory-based data on productivity, ecosystem carbon stock change and harvested product stock change for managed Forest Lands and Crop Lands in Canada and the United States. Additional information was used to fill in data on carbon balance in Other Lands, including data on human and livestock use/consumption of harvested products. For Mexico, our analysis accounted primarily for carbon flux due to land use change. Data on carbon exchange for each sector were summarized by reporting zone, with spatial and temporal coverage of the data sets noted in Table 1a and details on methods by country and sector described in the Supporting Information.\nThe conceptual model used to organize the various sectorspecific data sets is illustrated by Fig. 1 . The data for both the Forest Lands and Crop Lands sectors (left side of diagram) were based upon estimated stock changes within the vegetation and soil carbon pools. According to the conceptual model, all the stock changes in these pools represented vertical exchange of CO 2 with the atmosphere (i.e., NEE) except for (1) the vertical exchange of non-CO 2 trace gases, (2) the leaching of carbon from the system via river export and (3) the 'lateral' movement of carbon between sectors and reporting zones. Lateral movement occurs via changes in land use as well as the harvest and transport of forest and agricultural products. Where available, data on these fluxes were used to produce more precise estimates of NEE for each sector in each reporting zone from the stock change information. Total average annual NEE (NEE TOT ) is the combination of NEE estimated for the Forest Lands (NEE F ), Crop Lands (NEE C ) and Other Lands (NEE O ) sectors for each reporting zone:\nWhich and how the underlying component fluxes, and their inventory-based data sources, were used to estimate NEE F , NEE C , and NEE O are described in the sections below. Note that, in the equations given, not only NEE but also all component flux values were treated with the atmospheric reference sign convention whereby a negative value represents a CO 2 sink effect and a positive value a source effect of that component. By this definition, fire emissions have positive values, harvest removals have negative, and positive values of stock change represent losses in different C pools and vice versa."}, {"section_title": "Forest lands sector inventories", "text": "Although the equations differ depending on the data source, our calculations of NEE F were, in general, based on inventory estimates of stock changes adjusted for the lateral transfer of harvest removals:\nThe change in C stocks in live biomass (DLive) included overstory trees, understory vegetation and roots, whereas change in dead organic matter stocks (DDOM) included dead trees, down woody debris, litter and soil organic carbon pools. Carbon removed in wood harvest (H R ) was considered as a sink from the stand where to wood was grown. However, an additional variable was calculated to represent the proportion Prescribed fire Bondeau et al. (2007) Published 2011 This article is a US Government work and is in the public domain in the USA, Global Change Biology, doi: 10.1111/j.1365-2486.2011.02627.x of H R that was emitted during the processing of harvested wood into products (H E ). This processing, or 'primary consumption', was assumed to occur largely at the mill, and so we allocated this source term within the Forest Lands sector of the reporting zone in which the wood was harvested. The remainder (i.e., H R -H E ) was assumed to be transported offsite and added to the national-level forest product pool that resides in the Other Lands sector (described below).\nThe data set on forest carbon accounting in Canada's Managed Forest Area used here employed the 'stock-plus-flow' approach, which starts with data from a compiled set of inventories and then models the components of change. Flux data were produced using the Carbon Budget Model of the Canadian Forest Sector (CBM-CFS3), which uses stand-level growth data to estimate annual carbon uptake along with detailed annual natural disturbance (e.g., fire, insects) and harvest data to track carbon transfers through the system (Kurz et al., 2009; Stinson et al., 2011) . Natural disturbance and harvest removals data were from various provincial-level reporting sources in Canada (Stinson et al., 2011) . The stock change terms (DLive + DDOM) as shown in Eqn (2) also included non-CO 2 /non-vertical exchanges and these fluxes were separated out of the NEE F calculation. These more detailed component fluxes were estimated by CBM-CFS3, and so NEE F for Canada was calculated from the available indicator variables as: Fig. 1 Conceptual diagram of the continental-scale carbon budget, including the land-atmosphere exchange of CO 2 (NEE), based on data available from the inventory-based approaches that estimate carbon stock changes, fluxes and transfers among forest, crop, and other lands.\nwhere the carbon remaining in harvested products after primary consumption (i.e., H R -H E ) and the non-CO 2 component of fire emissions (i.e., FireC -FireCO 2 ) were excluded from the vertical flux component of the overall stock change. For Canada, we used 30% as the proportion of H R emitted in primary consumption, based on an analysis of 2010 FAO statistics (FAOStat; http://faostat.fao.org/) and Canadian harvest data for the period 2000-2006. Therefore: H E is equal to 0.3 9 H R for each reporting zone. The forest inventory data sets for the US were based on the forest surveys of the U.S. Department of Agriculture (USDA) Forest Service's Forest Inventory and Analysis (FIA) program (Bechtold & Patterson, 2005) . These estimates were coupled with carbon expansion factors (Bechtold & Patterson, 2005; Smith et al., 2006; Heath et al., 2011) and estimates of carbon stock changes were derived from the Carbon Calculation Tool (CCT; Smith et al., 2010) , which is used to produce the GHG inventory for US forest lands in the UNFCCC reports (EPA, 2011). Harvest removals (H R ) were from published US Forest Service data sets (Smith et al., 2009) . Estimates of the proportion of H R emitted in primary consumption (H E ) were provided by Smith et al. (2006) , who showed that the proportion lost within the first year following harvest (which we assumed occurs primarily at the mill) ranges from 20% to 40% across species group and region in the US. As such, we used 30% as a representative emissions (from primary consumption) fraction, which is the same as that used for the Canada data set. State-level data on fire emissions from US forests were not available for the time period of this study; however, in terms of our NEE calculation, fire emissions were implicit in the total stock change (i.e. fire emissions would have accumulated as biomass had there been no fire) and considered a source of carbon to the atmosphere. The US forest data represents net stock change, meaning that fluxes stemming from land use change (LUC; i.e. forest land area converted to other land use, and other land converted to forest land) were also implicit (i.e. integrated in) in the stock change data. The corresponding change in carbon stocks directly attributed to fire and LUC cannot be explicitly separated from the total stock change. Therefore, NEE F for the US Forest Lands sector used exactly that as shown in Eqn (2), without the modification for non-CO 2 fire emissions as used in Canada.\nAs with the Canada forest data set, the Mexico inventory data can be described as being based on the 'stock-plus-flow' approach. For Mexican forests, the data set was based on a carbon accounting methodology in which mean carbon stock density by forest type was distributed according the areal extent of each type at an initial point in time, and stock change was estimated according to the biomass increment (growth) and harvest amount in managed forests, and area of forest conversion over a subsequent period of time. Using this methodology, the study by deJong et al. (2010) calculated for the 1993-2002 time period: (1) biomass losses resulting from the conversion of forests to other land use (DLive LUC ); (2) the associated change in soil carbon stocks resulting from LUC (DSoil LUC ); (3) carbon uptake due to the regrowth of forests on abandoned agricultural or other lands (DLive ABND ); and (4) the net carbon balance between uptake (growth) and emissions (harvest) in managed forests (DLive MNGD ). Fire emissions were included with respect to burning in forest conversion, but the reporting methodology does not take into account fire emissions or other natural carbon fluxes (growth, mortality) from unmanaged land. NEE F was calculated by summing the four average annual stock change components from the study by deJong et al. (2010):\nFor this study, we distributed the magnitude of each component flux proportionately by an estimate of the relative area of each LU/LC class contained in each state, as described in the Supporting Information. Without more detailed data, we assumed that commercial harvest and fuelwood harvest occurred proportional to the relative area of each forest type."}, {"section_title": "Crop lands sector inventories", "text": "To estimate NEE for croplands for this study, we collected estimates of crop productivity (NPP), harvest (H R ) and changes in soil carbon stocks (DSoil) over the 2000-2006 time period for Canada (Environment Canada, 2011 ) and the US (West et al., 2011) . The detail regarding the source and methodologies used in the crop inventories are provided in the Supporting Information as well as by those references cited. NEE C was calculated for each reporting zone in Canada and the US as:\nwhere all crop harvest removals (i.e., H R ) were considered a Crop Lands sector sink in the reporting zone where they were harvested; unlike the treatment of harvested wood products, we assumed no primary consumption emissions within the Crop Lands sector. We considered DLive in croplands to be equal to zero on an annual basis since the assumption of the data was that NPP is equal to the crop harvest plus residue. We then assumed that, within the same year, the residue carbon was returned to the atmosphere (via combustion or decomposition) or incorporated into the soil C pool. Data specific to crop productivity and harvest in Mexico were not available for this study, and croplands were not mapped separate from other agricultural lands and forest plantations in the study by deJong et al. (2010) . As such, we were not able to report estimates of sources and sinks for the Mexican cropland sector separately in this study, but rather included the contribution of soil carbon stock changes from agricultural establishment and abandonment in the Other Lands sector for Mexico."}, {"section_title": "Other lands sector inventories", "text": "The Other Lands sector was used in this study to include two additional fluxes: (1) net surface carbon fluxes from lands not included in Forest Land or Crop Land sectors (i.e. grasslands, settlements and other lands) and (2) CO 2 emissions from the combustion, decay, and respiration of carbon in harvested forest and crop products. NEE O was calculated for Canada and the US by combining various component fluxes according to the following equation:\nwhich considered the net carbon balance of grassland areas (NEE G ), the net carbon balance of human settlement areas (NEE S ), CO 2 emissions from human respiration (E H ), CO 2 emissions from livestock respiration (E L ) and CO 2 emissions from the decay of harvested forest products (E F ). For NEE G and NEE S we used general, area-weighted estimates of 'Grassland' and per-capita estimates of 'Settlements/Other' sink categories reported in the EPA GHG inventory for years (EPA, 2011 . We then extrapolated area-weighted NEE G and per-capita NEE S according to the area or human population represented by each category in each reporting zone. The area of Other Lands in each reporting zone of Canada and the US is calculated as the remainder of the total area of each zone after subtracting the Forest Land and Crop Land areas from the inventory data sets. The estimates of the product emission terms (E H + E L + E F ) are described in the next section and in the Supporting Information.\nThe data set containing state-level estimates of carbon flux from the Other Lands sector in Mexico was developed using the same Eqn (4) "}, {"section_title": "Lateral transfer and emissions of harvested products", "text": "In this analysis, the key to linking the Forest Lands and Crop Lands sectors with the Other Lands sector was through data on harvested products (both forest and agricultural), thereby allowing for tracking the movement of carbon between sector and reporting zone. Here, we used the 'atmospheric flow' approach that, according to IPCC Guidelines, accounts for net emissions or removals within national -or, in our case, reporting zone -boundaries (Eggelston et al., 2006) . Carbon removal due to growth and emissions due to primary consumption were accounted for in the Forest Land or Crop Land sector of the 'producing' zone. The carbon emissions from secondary consumption were attributed to the Other Lands sector, redistributed proportionately among the reporting zones of the relevant country according to simple assumptions about where the products are likely to be consumed (and thus where the carbon there-in will be returned to the atmosphere as CO 2 ). Our accounting reflects the assumption that some amount of the carbon in harvested products was not likely to be emitted directly from within the sector (Forest Lands or Crop Lands) that it originates from, but rather in the 'other' lands that the consumers (i.e., humans and livestock) occupy.\nHarvested product emissions occurred via the combustion, decay and respiration of harvested wood products (HWP) and harvested crop products (HCP) through secondary consumption by humans (HWP and HCP) and livestock (HCP). Based on the forest and crop inventory data sets, harvested products were summed to national-level pools and adjusted for international imports and exports. Foreign trade of HWP was determined from the FAOStat database for Canada and the Environmental Protection Agency (EPA) GHG Inventory (EPA, 2011) for the US. Foreign trade of HCP was based on the Canadian Socio-Economic Information Management System (Statistics Canada) and the USDA Economic Research Service's 'Foreign Agricultural Trade of the United States' 2010 report. Our simple assumption for allocating the tradeadjusted remaining pools was based on distributing product emissions to the level of the reporting zones proportionally according to human population (HWP and HCP) and data on livestock emissions (HCP). The national-level total HCP from this study was allocated to both human and livestock consumption. The human portion was calculated based on percapita consumption and emissions (West et al., 2009 ). The remaining HCP was then allocated to livestock emissions (i.e. assuming no net annual storage of HCP) considering emissions factors for different species, rather than population counts directly. CO 2 emissions from livestock consumption of HCP were distributed proportional to year 2006 methane emissions through enteric fermentation per reporting zone for the US from the USDA Greenhouse Gas Inventory (2008) and for Canada from the Statistics Canada (2006) Census of Agriculture. In the case of longer lived HWP, we used data on stock change in national wood product pools (EPA, 2011) to account for both carbon storage and emissions. Since wood products can be longer lived than our study period, the product pools included 'inherited' stocks and emissions from wood products harvested prior to our study period. Details for the collection and analysis of HWP and HCP carbon data and flux estimates are provided in the Supporting Information."}, {"section_title": "Uncertainty in inventories and additional fluxes", "text": "We characterized the uncertainty of the inventory-based estimates of NEE presented herein by attaching previous analyses of the major components of the carbon budget of each sector considered in this study (Table S11) . We represented the uncertainty around each component in relative terms (as% of the estimate) based on the relevant Monte-Carlo analysis reported in national-level GHG inventories, where available, as well as expert judgment based on previous studies. The ranges of uncertainty on the sector-level mean estimates were calculated by summing the upper and lower bounds for each component flux of the sector; the percent uncertainty, then, was the range between the bounds relative to the mean total flux estimate of the sector.\nWith respect to the aggregate estimate of continental-scale NEE, another major source of uncertainty came from those components of the carbon budget that are potentially important, but were not measured or estimated by the GHG inventories. These components included fluxes from unmanaged/ not inventoried lands (wetlands), potentially important mechanisms not captured (woody encroachment on non-forest landscapes), other potential carbon storage pools (rivers and reservoirs) and lateral fluxes (dissolved organic carbon export from soil through rivers to the ocean) not measured in the inventories (Table S12 ). The 'best estimate' flux for each of these components was reported in the SOCCR (Chapter 3; Pacala et al., 2007) , where expert judgment suggests that these estimates are essentially 100% uncertain."}, {"section_title": "Inventory and model data comparison", "text": "To compare flux estimates at the national and sub-national scales, we included here results based on the inverse modeling approach from among the suite of NACP-participating AIMs that submitted surface flux estimates at 1 9 1 degree grid cell resolution to the RCIS activity. The models within this set of seven (Table 1b ) differ in their various formulations and methodologies, including the spatial/temporal resolution, the land model for generating the a priori surface fluxes, and the atmospheric transport model employed in the inversion. In two cases (Peters et al., 2007; Lokupitiya et al., 2008) , emissions from biomass burning were prescribed and the reported NEE is the sum of the residual land flux (done by inversion) and the prescribed biomass burning flux.\nWe included in this study a set of 17 NACP-participating TBMs that contributed regional or continental scale results of recent-era (~2000 to 2006) simulations based on the forward modeling approach. All models were required to submit their best estimate of NEE, which included different component fluxes depending on the particular model (Table 1c) . Most models contributed results that cover all the reporting zones for NA used in this study (n = 97), whereas some models (CanIBIS, MC1, TEM6) covered subsets of the region. The individual models were based on different simplifying assumptions, used different environmental driving data and initial conditions, and formulated the processes controlling carbon exchange in different ways. Most broadly they were differentiated into prognostic models, which are self-regulating with respect to leaf area index, and diagnostic models in which leaf area (or a surrogate) is prescribed from remote sensing imagery. Among the prognostic models there were significant differences with respect to treatment of fire and other disturbances. Details of these model differences are described by Schwalm et al. (2010) and Huntzinger et al. (in press ).\nThe contributed results from TBMs and AIMs for the NACP-RCIS were standardized to monthly flux estimates at 1 9 1 degree resolution over the NA land area. To allow comparison at the temporal and spatial scales of the inventories, monthly data were first aggregated to annual flux estimates. These annual flux estimates were then translated from the 1 9 1 degree grid to an estimate for each sector within each reporting zone (Fig. 2) . The map of reporting zones consisted of 97 analysis polygons that matched the resolution of the GHG inventory-based data, as described above. The coverage of sectors (Forest Lands, Crop Lands, and Other Lands) was based on a 1 km 2 grid using aggregation of land cover classes from the GLC2000 data set (Bartholome & Belward, 2005) . Juxtaposing these data layers permitted the TBMs and AIMs simulated fluxes to be summed by reporting zone and sector. Note that this approach meant that there could be discrepancies between how an inventory or model analysis might label the land surface and how we reported it (based on GLC-2000), but that compromise was necessary to accomplish the comparison."}, {"section_title": "Results", "text": ""}, {"section_title": "Inventory estimates", "text": "Overall, the data and methodology used herein for combining GHG inventory-based data on surface fluxes and carbon transfers across each sector and country suggest a À327 TgC yr À1 (NEE) sink as the continental-scale car- ) whereas the data show a net sink effect from the Other Lands sector (À9.1 TgC yr"}, {"section_title": "À1", "text": "). The detail on the inventory-based estimates of component fluxes that produce the patterns of NEE in the Forest Lands sector is illustrated in Fig. 3 , and estimates for each reporting zone are provided in the Supporting Information (Tables S1, Canada; S2, the US; and S3, Mexico respectively). The concentration of the Crop Land NEE sink in the mid-continent region is illustrated in Fig. 3 . The magnitude of the contribution of forest and crop products to the national-/continental-scale net sink is a function of the relative amount of harvest that is stored over the time period, exported internationally, or returned to the atmosphere as non-CO 2 emissions. Most of the forest harvest contribution to the continental-scale sink (Table S6 ) is attributed to carbon storage in the US product pool (À39 TgC yr\n) and the net export of forest harvest from Canada (À25 TgC yr À1 ).\nOn the fate of Canada and US harvested crop products, 79% is emitted as CO 2 on the continent, with another 20% accounted for by international exports (a small amount is emitted as CH 4 from livestock plus the contribution to stock increase in the human population). The contribution of harvested wood and crop products to the spatial pattern of NEE was assessed by calculating, for reporting zone, the net balance between product harvest and emissions (Fig. 4) . This measure of each reporting zone's net product balance (NBP) highlights the large producers of forest (Northwest and Southeast) and crop (mid-West) products next to the (Table S9 ). The net sink effect estimated for the other lands sector of Mexico over this time period is driven by carbon storage in the soil pool (À16 TgC yr\n) in agriculture, pasture, and forest plantation lands. Some of this sink is offset by CO 2 emissions attributed to fuelwood harvest (+6.8 TgC yr À1 ), which is assumed here to be used within the same reporting zone that it was harvested.\n) approaches suggest a larger continental-scale total sink than does the result of our analysis of the various inventory-based data sets (À327 TgC yr\n, from Table 2 ). At the level of the reporting zone, different patterns among the three scaling approaches were compared by showing area-weighted NEE estimates for each sector in map format (Fig. 5) . The range for mean annual NEE over North America among the inverse models was from a + 15 TgC yr À1 source to a À2190\nTgC yr À1 sink, with the five mid-range estimates clustering around a mean of À869 ± 223 TgC yr À1 . The range of forward model estimates was from a small source (+29 TgC yr À1 ) to a large sink (À3210 TgC yr À1 ), with no real central tendency.\nThe mean modeled NEE estimates from the forward and inverse approaches (Table 4) ) from the TBMs, although it should be noted that the time period covered by the inventory data (1993) (1994) (1995) (1996) (1997) (1998) (1999) (2000) (2001) (2002) is different than that of the model estimates (~2000-2006). Beyond the Forest Lands and Crop Table 3 The continental-scale, aggregate uncertainty around the inventory-based mean estimates of sector-level fluxes analyzed in this study, along with 'additional fluxes' not represented by the inventories. The detailed uncertainty estimates and additional fluxes for the various underlying components are provided in the Supporting Information (Tables S11 and  S12 Lands sector comparisons, it is primarily the difference in NEE estimates for the Other Lands sector that is responsible for the larger continental-scale sink estimates from the model means vs. the inventory-based data. At the continental-scale, the model mean NEE estimates from the AIMs (À333 TgC yr À1 ) and TBMs (À131 TgC yr\n) show a large sink in the Other Lands sector, whereas the results of the inventory-based methodology used herein suggests a large source (+218 TgC yr À1 ).\n; Table 4 ). The mean NEE estimate of the AIMs ensemble (À931 TgC yr À1 ; Table 4 ) is found only near the extreme lower bound of the uncertainty around the inventory-based NEE estimate for the 'continental total w/'additional fluxes' (À1051 TgC yr À1 ; Table 3 ). However, given that this analysis highlights the (1) uncertainties in component fluxes, (2) mismatches in spatial patterns, and (3) large spread in estimates across models, any convergence between the approaches would not necessarily occur for the 'right' reasons. Rather, this study draws attention to those components of the NA carbon budget that require more careful study through measurement and inventory methods. Regarding the modeling approaches, the comparisons here strongly suggest the need to better understand the causes underlying the large spread in estimates, most likely achieved through formal and controlled (i.e. common protocol) model inter-comparison studies informed by benchmarking frameworks based on reliable measurements and observational data sets. This study highlights the differences in three general scaling approaches to NEE (inventory, forward and inverse modeling), and by comparing and evaluating their estimates several strengths and weaknesses emerge (Table 5 ). Our study suggests that, even considering the data gaps and uncertainties, the inventory-based approach to estimating NEE can still provide a substantial amount of important information at the sub-continental scale, and help inform estimates of both vertical and lateral transfers of most key carbon budget components. The strength of the inventory-based measurement approach is primarily its reliance on a large number of ground-based measurements of components useful to estimate carbon stocks and stock changes. Although there are benefits in retaining independence among approaches for estimating carbon fluxes, progress can also be made by more formally integrating them. For example, TBMs are increasingly making use of inventory and remote sensing data for model drivers, parameterization, calibration, and validation (e.g. Hurtt et al., 2002; Running et al., 2004) . Such integrated 'bottom up' modeling frameworks could provide the initial land surface flux estimates for inversion analyses and, in turn, information about errors in predicted CO 2 concentration would inform further model development. Furthermore, observations and inventory-based measurements can provide critical benchmarking data sets for model evaluation (Randerson et al., 2009) . Ultimately, confidence in our ability to understand and predict the role of the NA carbon cycle in the global climate system will increase as the estimates from these different approaches begin to more closely converge and are combined in more fully integrated modeling systems."}, {"section_title": "Uncertainties and additional fluxes", "text": "Based on summing the upper and lower bounds on the range of uncertainty for each major component flux of the three sectors, the aggregate percent uncertainty on the inventory-based, continental-scale NEE estimate is approximately 77%, giving a range of À76 to À556 TgC yr À1 (Table 3 ). At the sector-level, percent uncertainty on the inventory-based NEE estimates range from 17% for Crop Lands to 41% and 45% for Forest Lands and Other Lands, respectively. More detail on the uncertainty estimates for individual components, and the sources of these estimates, are given in the Supporting Information (Table S11) . We also considered an additional À239 TgC yr À1 NEE from 'best estimates' of additional components of the NA carbon budget that are not measured or estimated by the inventories, which are potentially significant but highly uncertain mostly due to the lack of available data. These estimates, primarily from those reported in the SOCCR (Pacala et al., 2007) , include additions to the continental-scale NEE of À120 TgC yr À1 in woody encroachment in the US, À49 TgC yr À1 for wetland ecosystems across NA, À25 TgC yr À1 for sequestration in rivers and reservoirs of the US, and À45 TgC yr À1 for DOC export from Canada and US rivers ( Table S12 ). Given that each of these estimates carries at least 100% uncertainty, the aggregate additional flux could add anywhere from 0 to À573 TgC yr À1 to our overall inventory-based estimate of continental-scale NEE."}, {"section_title": "Comparing inventory estimates to alternative scaling approaches", "text": "The mean model estimates (Table 4 ) from both the inverse (À931 TgC yr À1 NEE) and forward (À511"}, {"section_title": "TgC yr", "text": ""}, {"section_title": "Discussion", "text": ""}, {"section_title": "Inventory-based estimates", "text": "Our GHG inventory-based results are derived from, and so are generally consistent with, recent inventorybased updates of the carbon budgets reported for Canada forests (Pan et al., 2011; Stinson et al., 2011) , US forests (Heath et al., 2011; Pan et al., 2011) and agriculture (West et al., 2011) , and the agriculture and forest sector in Mexico (deJong et al., 2010) . The new information provided in this study comes from the combination of those national-and sector-specific estimates into a continental-scale analysis, while using a novel conceptual model to estimate land-atmosphere exchange of CO 2 at the sub-national scale. As a result, the inventory-based data and the methodology used in this study suggest considerable spatial variability in NEE estimates across sectors and reporting zones (Fig. 3) . The spatial patterns are driven both by the estimated direct, vertical surface fluxes as well as the lateral transfer of carbon between sectors in the form of harvested products (Fig. 4) . The spatial patterns show a negative balance (i.e., sink effect) between product emissions and harvest in reporting zones that have relatively smaller human and livestock populations but productive forests and croplands with high harvest rates (and vice versa). The largest Forest Lands sector CO 2 sinks are located primarily on the west coast and in the southeast of the US, and these estimates are similar in magnitude to sub-regional analyses by Turner et al. (2011) and Masek & Collatz (2006) . Despite covering roughly similar area, Canada shows a much smaller magnitude sink in the Forest Lands sector than does the US. Although some of this difference could be related to methodology (Kurz et al., 2009; Heath et al., 2011 ), Canada's forests are likely to be storing less carbon than US forests due to older age class structure, lower growth rates and higher frequency and severity of disturbances in boreal forests vs. temperate forests Stinson et al., 2011) . All the reporting zones for Mexico show a small source from the forest sector, with the largest sources in southern states that have higher proportions of lowland tropical forest, where most of the forest clearing has occurred (deJong et al., 2010) . The analysis of the net Table 4 The count (n), mean and standard deviation (SD) of average annual NEE estimates (TgC yr À1 ), 2000-2006 by country and sector, for the sets of inverse and forward models. The mean estimates from the inventory-based approach (from Table 2 land use change impact implies that, at the nationallevel, emissions from biomass conversion across Mexico are outpacing uptake from forests re-growing after agricultural abandonment. The continental-scale mapping of NEE for the Crop Lands sector reflects the pattern of strong net carbon uptake over the mid-western US, as discussed in other studies West et al., 2010) . Although we assign this uptake to the Crop Lands sector sink, most (79%) of this carbon is returned to the atmosphere after consumption and respiration by humans and livestock (West et al., 2009) within North America, which we attribute to the Other Lands sector source. Nearly all the remaining balance of harvested crop product C is exported internationally. Although emissions of this remaining balance are not counted from the atmospheric perspective over North America, these emissions will occur in other countries. Thus, from a global atmospheric perspective, the net contribution of harvested crop product C to NEE is near neutral."}, {"section_title": "Comparison to model estimates", "text": "The mean model estimates from both the forward (TBMs) and inverse (AIMs) approaches suggest a much stronger overall NA sink than the inventory-based estimate. Yet model estimates generally do follow similar spatial patterns as the inventory-based data where the strongest sinks are found in US forests on the east and west coasts and in croplands of the mid continent, with a smaller source from the tropical area of southern Mexico (Fig. 5) . However, the model vs. inventory differences are mostly in the magnitude of the estimates, where the sector-specific model means suggest (1) a larger sink over forested regions, (2) a smaller sink over crop land areas, and (3) a substantial contribution of non-forest/non-cropland areas to the continental-scale sink (Table 4 ).\nAt the national-level, the breakdown of model means for the Forest Lands sectors show good agreement with the inventory-based estimate for the US, but a much along with all land (total), in each reporting zone, from inventory-based estimates against mean results from the sets of terrestrial biosphere (forward) models and inverse models.\nlarger sink than that estimated by inventory-based modeling for the Forest Lands sector in Canada. Inventory-based studies indicate that CO 2 uptake in Canada's forests is being increasingly offset by emissions due to disturbance (Kurz & Apps, 1999; Kurz et al., 2008; Stinson et al., 2011) , but our comparisons here suggest that the impacts of these disturbances are not being resolved by the model approaches. In contrast to the Forest Lands sector comparison, the model means estimate less than half of the sink strength compared to the inventory-based estimate for the US Crop Lands sector. There is clearly information in the CO 2 observations indicating a strong drawdown in the crop intensive region of the US Crevoisier et al., 2010) , but the model ensembles analyzed herein appear to be underestimating its strength, relative to the inventory estimates. The difference in the sign and magnitude between the inventory and model approaches in the case of the Other Lands sector highlights (1) our inventory-based approach for allocating product respiration and decomposition based on populations of humans and livestock and (2) the data gaps and uncertainties associated with GHG inventory-based estimates of carbon stocks and fluxes outside of managed forest and agricultural lands. Although a subset of the TBMs included herein considers forest and/or crop product emissions, none considers the lateral transfer of these products (i.e. product emissions occur in the same grid cell as growth and harvest). AIMs derive the 'land flux' after prescribing the fossil fuel and fire emissions. In practice, the land flux thus includes the product sources. However, it is generally acknowledged that uncertainty remains high for inversion-based flux estimates at the sub-continental scale (Butler et al., 2010; Bruhwiler et al., 2011) . As such, source areas associated with the respiration of harvested products may not be spatially resolved. On the other hand, potential sinks in the Other Lands sector that may be included in the model estimates could be missing or are of highly uncertain magnitude based on GHG inventory methods. For example, the SOCCR reports an additional 120 TgC yr À1 of uptake through woody encroachment in the US, but other field-based studies (Goodale & Davidson, 2002b; Jackson et al., 2002) do not support a sink of that magnitude. Further, it is not clear how much of this mechanism is captured in the inventory sampling if and where it is occurring. It is evident in the US forest statistics that a large proportion of the increase in US forest land has occurred in the West. Due to long re-measurement periods and changes in methods over recent time periods, however, it is not possible determine how much of that increase is directly attributable to woody encroachment."}, {"section_title": "Synthesis", "text": "Multi-method flux comparisons over other large regions are similar to our comparison in several respects. In both Europe (Janssens et al., 2003) and China (Piao et al., 2009) , the land base was a sink for carbon and represented a significant proportion of fossil fuel emissions (7-12% in Europe and 28-37% in China). In both cases the inversion-based sink estimate was about double the inventory or process modelbased sink estimates. An updated, multi-sector study of the European C balance (Schulze et al., 2010) , based primarily on inventory methods, suggests that C sinks (e.g., forests and grassland) are largely offset by emissions (e.g., from croplands). As with our North American study, the lateral movement of harvested products was also considered to be a large influence on the spatial distribution of sources and sinks in Europe (Ciais et al., 2006; Luyssaert et al., 2010 ). A large land-based CO 2 sink over NA has been a persistent feature of inversion analyses and comparisons of inversions to bottom-up estimates at the regional (Hayes et al., 2011; Turner et al., 2011) and continental (Pacala et al., 2001) scales have suggested that it is an overestimate. First, the biases in vertical mixing in the transport models could lead to the overestimates of the source strength in tropical latitudes and overestimates of the sink strength in mid latitudes (Stephens et al., 2007; Gatti et al., 2010) . Second, overestimates of NA west coast boundary conditions for CO 2 concentration may force the AIMs to create an artificial sink to maintain consistency with the measured CO 2 observations encountered further east (Göckede et al., 2010; Schuh et al., 2010) . With respect to the forward modeling approach, the extremely large range in the flux estimates from the TBMs can be attributed to variation in model formulation and process representation along with differences in the climate and land use data sets used as model drivers (Schwalm et al., 2010; Huntzin-ger et al., in press ). In many cases, the large estimated sinks in TBMs are associated with assumptions of robust favorable effects of rising CO 2 on vegetation growth, but the magnitude of the effect of this mechanism remains highly uncertain (Joos et al., 2002; Girardin et al., 2011) . The relative impact of any CO 2 fertilization effect is generally not possible to ascertain from the inventory data. In the Canada forest inventory approach, the species and site specific yield curves used to model NPP would not likely capture this effect. The US forest inventory should, in theory, capture this effect between re-measurement periods, but it is impossible to separate it from all other effects on growth.\nThis study's inventory-based, continental-scale NEE estimate of À327 TgC yr À1 for the early 21st Century is generally lower than estimates from previous decades, which range from À350 to À750 TgC yr À1 (Houghton et al., 1999; Pacala et al., 2001 Pacala et al., , 2007 Goodale et al., 2002a) . The SOCCR is the most recent and comprehensive study, which yielded a NEE estimate of À500 ± 250 TgC yr À1 for NA in ca. 2003 (Pacala et al., 2007 ). Although the sector-level NEE estimates presented herein are generally consistent with those reported for 'forests' and 'agricultural soils' in the SOC-CR, the largest difference contributing to the lower continental carbon sink estimate here is that we did not include the large but highly uncertain additional fluxes associated with land-based sinks of atmospheric CO 2 (Table 3) . We would need to assume a large contribution of these non-inventoried 'additional fluxes' on top of the inventory-based sink estimate to approach the magnitude suggested by the means of the model ensembles analyzed in this study. For example, adding the 'best guess' of these non-inventoried 'additional fluxes' gives an estimate of NEE (À564 TgC yr À1 ; Table 3 ) that is similar to the mean of the TBMs ensemble (À511 TgC yr"}]