[{"section_title": "Abstract", "text": "Purpose of the study is to analyze the student successes in Transition from Elementary Education to Secondary Education (TEOG) Examination through some non-school variables. The study was designed using relational screening model. The study employed questionnaire as data collection tool. The TEOG examination scores of the students were obtained from the school administrations. The participants of the study, consisting of 527 parents of eighth grade students, were selected using layered sampling method. The results of the study indicated that the TEOG examination successes of the students increase with the increase in the socio-economic and socio-cultural variables. It was observed through the indicators related to socio-economic and socio-cultural variables that the education level and annual education expenditure for the child were important. The study results showed that the academic successes of the students increase with the increase in the education levels of the parents and the annual education expenditure for the child. The results of the multiple linear regression analysis indicated that the house income, annual education expenditure for the child, and education levels of the parents predicted the TEOG scores of the students. It is necessary in the long-term to change these variables in favor of the disadvantaged groups for the academic successes of the students.\nTEOG examination\nSocio-economic and socio-cultural structure of family Turkey Article Info"}, {"section_title": "Introduction", "text": "School is a social institution which provides opportunities for children to learn and socialize, and also to realize themselves by improving their skills. School has significant contribution for the sustainability and existences along with its contribution to the individual goals. Growing up of individuals with desired qualities is closely related to the schools to reach the determined goals (Balcı, 2014) . These goals find their expressions in social, cultural, political and economic functions of education. The formation of the relationship between those functions and education took place in different periods. For example, it could be said that the economic function of education was shaped largely with the Industrial Revolution. The strong relationship formed between education and the economic system since the Industrial Revolution provided the institutionalization of the education widely. On the other hand, the most significant contributions to the shaping of the political and social functions of education were made by the French Revolution. Rising of the nation states and the expectation of the national identity formation function of education, and the emphasis put upon the individual rights through freedom, equality, and brotherhood were other significant developments to open way to the proliferation of education at the institutional level (Ercan, 1998, pp. 59) .\nTheories of education economics that explain the relationship between education and economic system has brought explanations to the function of education. One of those theories is the Screening Hypothesis. According to the Screening Hypothesis, the function of education is to screen, select, or classify the individuals preparing themselves for the labor market. Educational system realizes the screening function by distributing the individuals coming from various socio-economic levels and social classes into types and levels of education in accordance with the social groups they come from. Thus, the educational system reproduces the society both as vocational structure and class structure (Ünal, 1996, pp. 108) . In this process, education realizes its screening function while including the individual into the system, graduating from the system, or excluding from the system. In this respect, education grades and certifies the successes of the individuals while declaring the individuals as successful or unsuccessful (Aksoy, Aras, Çankaya, & Karakul, 2011; Kurul, 2012, pp. 80; Özsoy, 2013; Ünal, 1991) When examining the educational systems of countries, it could be seen that the transition between grades has been organized differently. Although the national assessment systems differ from country to country, transition to secondary education is organized with three different models which take into account transition by examination, transition without examination, and with examination and school success. There is not a single examination type between the countries that organize transition with examination. Those examinations are diversified as central, school completion, or school entrance examination. In Japan, South Korea, France, Singapore, and Germany, school scores are also effective along with the examinations. On the other hand, there is not any criterion in the transition to the secondary education in Scotland. In the United States of America, criteria for transition to the secondary education change from state to state such that there are high schools accepting students based on the home address, and there are also high schools taking students through examinations (World Bank [WB], 2013; Yavuz & Derinbay, 2014) .\nIn Turkey, transition to secondary education is predominantly realized by a model which selects the students through a central examination, and partially taking into account the school success. Transition to the secondary education started to be conducted by Transition from Elementary Education to Secondary Education Examination 1 (TEOGS) which has been carried out at central level since 2013-2014 academic year. This examination is not the first screening and selecting examination that organizes the transition to secondary education in Turkey. There have been different applications regulating the transition to secondary education. Transition to secondary education had been conducted by central examinations from fifth grade until 1997, and from eighth grade from 1997 with the eight-year continuous and compulsory primary education. However, not all secondary education institutions were within the scope of transition with examination in this period. At that period, while transition to some of the departments of the Science high schools, Anatolian high schools, Military high schools, Vocational and Technical high schools were conducted through examinations, placement to other high schools were without examination. This application continued until 2008, and left its place to Level Determination Examination (SBS) starting from 2008. Turkish Ministry of National Education (MONE) stated one of the reasons for this change as to decrease the need for test preparation centers (MONE, 2008) . MONE transformed the examination that regulates the transition process to secondary education into three central examinations applied at the end of the academic year and in accordance with the 6th, 7th, and 8th grade curricula. Despite the prediction by the MONE about the demand for test preparation centers, central examinations in general and SBS in particular increased this demand (Gündoğdu, Kızıltaş, & Çimen, 2010; MONE, 2010; Ocak, Akgül, & Yıldız, 2010; Sarıer, 2010; Şad & Şahiner; Şahin, Uz Baş, Şahin Fırat, & Sucuoğlu, 2012) . However, the SBS examinations were short-lived, and MONE announced that the SBS was going to be gradually terminated starting from 2010. The SBS examination to which only the 8 th grade students took in 2012 left its place to another central examination: TEOGS.\nWith TEOGS, transition to almost all of the secondary education institutions, except for private education and special education institutions and some high school types 2 , started to be conducted through TEOG examination. It could be seen that the basic application that organizes the transition between grades in Turkey is the large-scale examinations applied at central level. However, in TEOG Examination, 30% of the academic success at 6 th , 7 th , 8 th grades is included in the assessment process when calculating the score that is basis for placement. Thus, it could be said that the academic success of the student is also taken into account in transition to secondary education in Turkey. Besides, the 6 th Article about guidance under the orientation part of Basic Law of National Education, Law Number 1739 states \"During the course of his education, the individual shall be provided with various programs or are directed to schools in the direction of his interests, abilities and skills\". However, there are a number of studies related to the results that the orientation system in Turkey does not work effectively, and there are issues in identifying and developing the skills of the children as well as issues in vocational guidance (Dinç, Uzun, & Çoban, 2014; Yılmaz, 2004) .\nThis grading/leveling, conducted by the educational system mainly through central examinations, is not a simple grouping process. The limitations in the quota of the institutions that provide quality education cause a keen competition between families and students. In this competition, socio-economically and socio-culturally more advantaged families come into view. In Turkey, going to a quality secondary education institution is a significant variable to determine whether or not the individual would be able to go to the university. In fact, there are data revealing that there is a relationship between different high school types and transition to university. According to the results of the 2007 Student Selection and Placement Examination (ÖSYS), 43% of the Anatolian high school students, 2.5% of the general high school students, and 1.7% of vocational high school students were placed into an undergraduate program. The secondary education institution that a student enters after completing primary school may determine her/his chance of transition to the university and even the income potential in future life (ERG, 2009) . It was found that 61% of the variance in the PISA 2012 Mathematics scores of the Turkish students was resulted from the difference between schools. This percentage is 37% according to the average of OECD countries. It could be said that the difference in the Mathematics scores according to the school types is above the OECD average, and a high value (Anıl, Özer Özkan, & Demir, 2012, pp. 88) , and the score differences between the most successful and least successful high school type are significantly high.\nIn this respect, does education classify individuals as successful or unsuccessful according to only their \"skills\", or are some other factors apart from skills also effective in this process? According to Bourdieu, the success of an individual in the education process is a product of the social class she/he belongs to rather than being a product of her/his skills. Education system transfers to a great extent the culture of the higher social class. Thus, individuals coming from upper social class families come to school with the knowledge of some practices which will be learned in a long education process by the individuals grown up with the culture codes of the lower social classes. Bourdieu, thus, states that the individuals with powerful cultural capital have greater chance in success at school. He argues that there is a relationship between the social class and academic success of an individual. According to him, education is also an arena. The individual fights in this arena not only against the economic capital but also the cultural and social capital forms she/he feeds on (Güllüpınar & İnce, 2014) . While Bourdieu describes the academic success with the concept of class through capital, Coleman emphasizes factors coming from school and family. Coleman claimed that schools could not make a difference for the majority of the students, but could make very little improvement for the minority and disadvantaged students (Balcı, 2014, pp. 16) . According to him (1988 ( , as cited in Güllüpınar & İnce, 2014 , the main factor that plays a role in academic success is the 'family background'. The family background has three different forms which are financial capital, human capital, and social capital. Financial capital includes every kind of financial possibilities to be provided to the child through the family income. Human capital means a cognitive environment that makes it easy for the child to learn, and is measured by the education levels of the parents. The efforts, interests the parents show for their child, and their communication etc. with the child are defined as the social capital form. Coleman states that the economic and human capitals are not sufficient to explain the educational success of the child, thus those capitals need to be changed into social capital form. Advantaged families are the ones that have economic, human, and social capitals, and that are able to use those effectively.\nThere are also studies about the relationship between the academic success of the student and school. Those studies are named as \"effective school\" studies historically, and \"equality of opportunities\" studies in education. They examined the school originated variables in terms of their effect on success. Among these, there are studies that showed the school has very little or no effect, and that non-school variables, especially the socio-economic status of children were more effective (Coleman, 1998; Gregg & Machin, 1999; McNeal, 1999; Parcel & Dufur, 2001; Schiller, Khmelko, & Wang, 2002) . However, there are also studies stating that the academic success may increase by improving the school facilities or by controlling the school variables. The most important study among those is the study by Heyneman and Loxley (1983) . The researchers, in their study conducted with the data from 29 countries in the high and low income groups, found that the opportunities provided by the school were more determining in the academic success of the children than the individual characteristics. The researchers explained this result with the limitations of the educational opportunities, and the inequality between schools in those low income countries. A significant result produced by the effective school studies was that the effect of school and non-school factors on student success may differentiate with the development level of the country. It was found that, the school-related factors are more important than non-school factors in the explanation of the difference in student success in poor countries. Thus, the poorer the country is, the greater its predictivity of the school on academic success (Balcı, 2014, pp. 20) .\nAlong with the studies explaining the academic success of the student with personal variables such as her/his gender (Keskin & Sezgin, 2009; Kılıç & Karadeniz, 2004) , school starting age (Küçüker, 2016) , intelligence, skills (Yıldırım, 2000) , self-confidence, motivation, personal characteristics (Keskin & Sezgin, 2009; Nartgün & Çakır, 2014; Yıldırım, 2000) , attitude towards a subject (Oliver & Simpson, 1988; Pamuk & Kiraz, 2016; Pehlivan & Köseoğlu, 2010; Skouras, 2014) , study habits (Smith & Niemi, 2001) , and the relationship with the family members and teachers (Harding, 2003; Huang, 2008) , there are also studies explaining it with teacher competencies (Darling-Hammond, 2000; Kavak, Aydın, & Akbaba Altun, 2007) , and educational environment and opportunities (Aydoğan, 2012; Sawkins, 2002; Türnüklü, Zoraloğlu, & Gemici, 2001; Yanpar, 1998) , instructional leadership skills of the school administrators (Şahin, 2011a) , and school culture (Şahin, 2011b) . Also, it is salient that there are large number of studies examining the relationship between the academic success of the students and examination anxiety (Akın, 2008; Austin & Partridge, 1985; Benjamin, 1991; Birenbaum & Nasser, 1994; Cassady, 2004; Culler & Holahan, 1980; Hancock, 2001; Sullivan, 2002) .\nIt could be seen in the review of literature that there are significant numbers of literature related to academic success. However, a large part of those studies examine the academic success through individual or institutional factors. It is also noticeable that the number of studies examining the nonschool factors regarding academic success is small. It is hoped that the present study could make a contribution to fill this gap, and be guiding for the policy makers of the educational policies. The study would fulfill its purpose to the extent it contributes to increasing the academic success of a single student, and formation of a more equalitarian education system."}, {"section_title": "Purpose of the Study", "text": "The purpose of the study is to analyze the TEOG examination success of the students through various non-school variables. The following questions were tried to be answered within the scope of this purpose: (i) what is the level of the average examination scores (successes) of the students? (ii) Do those scores differentiate according to various characteristics of the students (gender, residence, education and working condition/employment status of the parents, social security of the family, professions of the parents, pre-school experience of the child, cram schools or after-school club, whether the child used bussed system, had a private room, had somebody to receive help in her/his studies, had computer and internet facilities at home, number of children and the number of children going to school, house income, annual education expenditure for the child)? (iii) Is there a significant relationship between the TEOG scores of the students and the house income, annual education expenditure for the child, and educational status of the parents? (iv) Do house income, annual education expenditure for the child, and educational status of the parents predict the TEOG scores of the students?"}, {"section_title": "Method", "text": "The present study is of a descriptive one and aims to analyze the TEOG examination scores of the students in terms of various variables. Thus, it was designed in relational screening model which is one of the screening models. Relational screening model is a kind of model that provides opportunity to determine the presence and/or degree of covariance between two or more variables (Karasar, 2011, pp. 81) . In the study, the relationship between the TEOG scores of the students and a large number of non-school variables such as genders of the students, place they live, education levels of their parents, working condition of the parents, social security of the family, professions of the parents, pre-school experience of the child, prep course, or an after-school club, and change of school in the last three years, whether used bussed education, facilities provided to the child at home, number of children at home, number of children going to school at home, total house income, and educational expenditure on the child were examined."}, {"section_title": "Population and Sample", "text": "The target population of the study comprised of 9730 eighth grade students who took the TEOG examination in 2014-2015 academic year, and their parents (Tokat Provincial Education Directorate, 2015) . Sampling size to represent the population of 9730 with an error margin of 1% is at least 624 (Büyüköztürk, Çakmak, Akgün, Karadeniz, & Demirel, 2012, pp. 98) . Variables of gender and residence were used in the determination of the sampling, and they were selected by stratified sampling method from the population. The study was conducted in Tokat province. Three layers were formed according to the places students lived as the city center, town center, and village. The reason for taking the residences as layers was because of the students who were coming from the town centers and villages using bussed system. Care was taken to include the schools that receive students from different socioeconomic backgrounds, and were bussed system centers in the sampling when the schools in the layers were selected. In order to reach the related sampling size, 650 parents were given questionnaires, and 568 of those were returned. The returning rate was 87%. Of the returned questionnaires, 527 were included in the analyses. Some of the personal characteristics of the participants were given in Table 1 . Average education length of mother 6,9 years Average education length of father 9,7 years"}, {"section_title": "Data Collection Tool", "text": "In the study, a literature review on non-school variables affecting academic successes of students was done, and a draft version of the questionnaire consisting of 30 questions was prepared. In the determination of the non-school variables affecting academic success in TEOG examination, the questionnaire developed was given to education practitioners (teacher, school director, deputy school director/manager) as it was thought that they would be the ones to have more knowledge and experience about the topic. Three different focus group meetings each consisting of ten people who were voluntary participants invited to the Education Faculty by the researcher were conducted under the supervision of the researcher. In those focus group meetings, the 30-question questionnaire was opened to discussion in which the appropriateness of each question, clarity of the questions by parents from different education level, and possible new variables that were thought to have effect on students' academic success. The questions that those three groups agreed on were put together by the researcher, and the questionnaire was developed. As a last step, the questionnaire was given to expert opinion, and given its last form according to the opinions of the experts. Questions were prepared as simple as the parents from different education levels would be able to understand with reference to the opinions of executers and experts. A preliminary application was conducted to test the clarity of the questionnaire with a parent group of 50 at a middle school that was not included in the sampling. Some of the statements were changed according to the results of this application. A significant number of the questions were prepared in the form of Yes/No or Present/Absent because of the reasons mentioned above. As a result, the questionnaire consisted of 40 questions, 3 of which were related to personal information, 13 directed to obtain information about the parents, 24 about the facilities and opportunities provided to the child, and the educational life of the child. The second data set of the study comprised of the TEOG examination scores of the students whose parents were given questionnaire. In this study, the measurement the academic success was the scores students obtained in the TEOG examination. TEOG score is calculated according to not only the scores the students get in the examination but also their end-of-year averages of the subjects Turkish, Mathematics, Science and Technology, TR Revolution History, Second Language, Religious Studies at 6 h , 7 h , and 8 th grades (\"TEOG Puanı Nasıl Hesaplanır?,\" n.d.). Placement scores of those students were obtained with the permission of the school administration after the TEOG examination results were announced at the schools where questionnaire was given. The questionnaire was applied by the researchers to the parents through the students at the same time at all of the schools in the first three weeks of May 2015."}, {"section_title": "Data Analysis", "text": "Questionnaires obtained from the participants were coded by the researchers, and were transferred to computer. TEOG examination placement scores obtained from the schools were included in the data set from the name, surname and school numbers of the students participated in the study. Data analysis was performed using SPSS 18 program. The following procedure was followed in the analysis: (i) Relevance of the responses to the questionnaires to the instructions was controlled, and the questionnaires which were filled incorrectly or not answered were excluded from the evaluation. In the questionnaire, the parents were asked to write the name, surname, and the school number of their children in order to be able to make comparison with their TEOG scores. It was asked from the parents who were unwilling to give that information to not fill in the questionnaire. Of the questionnaires collected, 41 were not included in the analysis because of the reasons such as incomplete filling the questionnaire and leaving out the name and surname of the child. Thus, the number of questionnaires included in the study became 527. (ii) From the information obtained through questionnaires, the ones in nominal scale were analyzed using frequency and percentage. (iii) As the TEOG placement scores of the students were continuous and in interval scale, the academic successes of the students were determined by calculating the arithmetic average and standard deviation. (iv) In order to determine whether the academic successes of the students differentiated in terms of some of the personal variables, Independent Samples t-Test if there were two variables, and One-Way ANOVA if there were more than two variables were utilized. When the F test as a result of the variance analysis was significant, Scheffé test was utilized to determine the group the difference resulted from. According to Büyüköztürk (2012, pp. 39-48) , if the measurements or scores of the dependent variable are in interval scale or ratio scale, two or more group average of the comparison belongs to the same variable, measurement distribution of the dependent variable is normal in each group, and the groups of which the average scores to be compared are unrelated, then it is suitable to use t-test for determining the significance of the difference for two unrelated samples, and One-Way Variance Analysis (ANOVA) when there are more than two groups. (v) For the relationship between the TEOG scores of the students and the house income and the annual education expenditure for the student, normality of the distribution and homogeneity of the variances were tested, and Pearson Correlation coefficient was preferred; for the relationship between TEOG scores and education levels of the parents, Point Double Series correlation coefficient was preferred. Phi correlation coefficient was calculated for the relationships within the education levels of the mothers and education levels of fathers. All of these data were given in a single table. (vi) Multiple Linear Regression Analysis was performed for how much of the TEOG sores of the students were predicted by the house income, annual education expenditure for the child, and education levels of the parents. (vii) As the Multiple Linear Regression Analysis requires variables measured in minimum interval scale, the education levels of the parents were described as \"dummy\" variable according to whether they were university graduates or not (university graduate=1, below university= 0). (viii) Before performing Multiple Linear Regression Analysis, its assumptions were tested. First, the researcher of the study examined whether there was a linear relationship between the predictive variables and dependent variable, and whether the variables showed a multivariate normal distribution. To do this, graphics between the standardized estimated values and error values were examined and found that the variables were linear while the values of house income and annual education expenditure did not show normal distribution. Extreme values were determined for both variables. According to Tabanchnick and Fidel (2007, as cited in Başol & Zabun, 2014) , in continuous variables, values which has the standard value above + 3.29 are potential extreme values. According to that, 18 observations above the extreme value were cancelled from the data set. Also, in order to determine the extreme values at multiple levels, Mahalonobis distance values were calculated and compared with x2 table values, and four more observations were cancelled. (ix) The presence or absence of Multi-colinearity between predictive variables was also checked. Multi-colinearity is the presence of high level relationship between independent variables (Büyüköztürk, 2012, pp. 100) . For this, biserial correlation between the variables was calculated. It was concluded that there was no multi-colinearity. It was seen that the tolerance value (1-R 2 ) was .73 which was greater than .20 and close to one; and all of the variance inflation factor (VIF) values were below two. Also, condition indices (CI) were examined and concluded that all of them were below 5 and there was no problem. It was concluded from the overall evaluation of those results that there was no multi-colinearity. Level of significance in the statistical analyses used in the study was taken .01."}, {"section_title": "Results", "text": "In this section, the questions which were tried to be answered within the scope of the study are presented parallel to the purpose statements. The first question of the study was what the TEOG scores of the students were. In order to answer this question, mean and standard deviation of the TEOG scores of the students were calculated, and the results were given in Table 2 . In TEOG examination, scores of the students as basis for placement were calculated on the scale of 500. Average score of 526 students who participated in the study was 319. When scores for placement were taken into account, it could be said that the scores of the students were generally above average."}, {"section_title": "Results Related to the Analysis of TEOG Scores of the Students According to Some Variables", "text": "In this sub-section, the second question of the study which was about whether or not the TEOG Scores of the Students differentiate according to some variables was answered. Discussions in the literature, and focus group meetings with school administrators and teachers on determining the independent variables were effective on according to which variables would the differentiation analyses are done. The variables of gender, residence, working, education and profession statuses of parents, social security of the family, condition of the child about preschooling, private schooling, and attending school courses, etc. were examined. Since the number of independent variables was high, the variable close to each other were grouped and presented for the ease of following by the reader."}, {"section_title": "Results Related to the Analysis of TEOG Scores of the Students According to Gender and Place of Residence", "text": "The results of the t-test related to whether student scores differentiated according to gender were given in Table 3 . According to Table 3 , TEOG Scores of the students [t(524)=2.84, p< .01] did not show a significant difference. However, it could be seen that the scores of the female students were about 23 points higher than the scores of the male students (XFemale= 328.64; XMale =305.83). From this, it could be said that the females were more successful than males.\nANOVA results related to whether TEOG scores of the students differentiated according to the residence were given in Table 4 . Results of the analysis showed that there is a significant difference between the scores of the students in terms of residence F(2-522)=40.50, p< .01]. According to the results of the Scheffé test employed to find out between which groups the between-groups difference was, it was seen that the students living in city centers obtained higher scores (Xprovince=343.89) than the students living in town centers (Xtown=287.45) and villages(Xvillage=269.68). It was seen that the students living in city centers obtained 56 points higher than the students living in towns, and 74 points higher than the students living in villages. Although there is not a significant difference between the town centers and villages (p< .01), the scores of the students living in towns (18 points) were higher compared to the scores of the students living in villages."}, {"section_title": "Results Related to the Analysis of Scores of the Students According to Education Levels of the Parents", "text": "ANOVA Results Related to whether or not the Scores of the Students differentiate According to the Education Levels of the Parents was given in Table 5 . (Table 5 ). Children whose mothers were secondary education graduates (X= 373.45) obtained 76 points higher than the children whose mothers were illiterate (X= 297.31), 70 points higher than the children whose mothers were primary school graduates (X= 303.87) while the children whose mothers were university graduates (X= 400.97) obtained 104 points higher than the children whose mothers were illiterate, and 97 points higher than the children whose mothers were primary school graduates. None of the children had illiterate father. It was seen that the children whose fathers were secondary education graduates (X= 323.97) obtained scores 37 points higher than the children with fathers primary school graduates (X= 286.91) whereas the university graduates (X= 396.81) obtained scores 110 points higher than those graduated from primary school, and 73 points higher than those graduated from secondary school. Data showed that with the increase in the education level of the parents the academic successes of the children increase."}, {"section_title": "Results Related to the Analysis of Scores of the Students According to the working condition of the Parents, and Social Security Status of the Family", "text": "T-test results related to whether or not the student scores differentiated according to the working condition/employment status of the parents, and the social security status of the families were given in Table 6 . TEOG scores of the students created a significant difference according to the working condition of the mother [t(523)=3,17, p< .01], and the social security status of the family t(511)=7,26, p< .01] (Table 6 ). It was found that the students with working mother obtained scores 35 points higher than the students with non-working mothers (XWorking= 349,93; XNot working =314,53), and students with social security obtained scores 66 points higher than the students without social security (XHave= 335,09; XDo not have=268,85). Working condition of the father did not reveal a significant difference [t(518)=2,27, p< .01]. However, the average scores of the students whose fathers work were higher (26 points)."}, {"section_title": "Results Related to the Analysis of the Student Scores According to the Professions of Parents", "text": "ANOVA results related to whether or not the student scores differentiate according to the parents' professions were given in Table 7 . A significant difference was found between the scores of the students and the professions of the mothers [F(2-512)=11.95, p< .01] and fathers [F(3-496)=34.72, p< .01]. Profession of the mothers was examined under three groups: housewife, government officer, and other professions. According to the results of the analysis, the scores of the students whose mothers were government officers (X= 411.39) were 97 points higher than the housewives (X= 314.80), and 88 points higher than the other professions X= 323.37). On the other hand, the professions of the fathers were examined under four groups: workers-farmers, craftsmen, government officers, and other professions. In the fathers' profession comparisons, a significant difference was found between the government officers and the other groups. The scores of the students whose fathers were government officers were 97 points higher than the workers-farmers, 64 point he higher than the craftsmen, and 56 points higher than the other professions. On the other hand, the scores of the children of the other professions and craftsmen were 41 and 33 points higher than the scores of the children of the workers-farmers respectively. As could be seen from these results, the most disadvantaged children have mothers who are housewives, and fathers whom are workers-farmers."}, {"section_title": "Results Related to the Analysis of the TEOG Scores of the Students According to the Condition of the Students to have gone to Preschool, School Courses, Private Courses, Being in Bussed School, Change of School Status", "text": "T-test results related to the TEOG scores of the students according to the condition of the students to have gone to preschool, school courses, private courses, being in bussed school, change of school status were given in Table 8 . According to the results of the analysis, a significant difference was found according to the states of the children having pre-school history [t(521)=4.11, p< .01], private school or etude history [t(521)=9.03, p< .01], using bussed education [t(517)=7.03, p< .01]. Children who went to preschool obtained scores 33 points higher than the ones who did not go to preschool, ones who went to private teaching institutions or after-school club s obtained scores 69 points higher than those who did not go to those, and children without bussed school application obtained scores 71 points higher than those with bussed school application. There was no significant difference between the students who went/did not goes to school courses, and students who changed/did not change school in the last three years (p< .01)."}, {"section_title": "Results Related to the Analysis of the TEOG Scores of the Students According to Various Facilities Provided to the Child at Home", "text": "T-test results related to the TEOG scores of the students according to various facilities provided to the child at home were given in Table 9 . From the results of the analysis, a significant difference was found according to whether child had a room [t(521)=6.39, p< .01], heating condition of the house [t(523)=9.67, p< .01], whether there was a computer at home [t(520)=6.94, p< .01], and whether there was internet connection at home [t(519)=7.29, p< .01]. From this, the students who had a room obtained 51 points higher than those without a room, students who lived in centrally heated houses obtained 71 points higher than those living in hose heated with stove, students living in a house with computer had 54 points higher than those who did not, and the students living in houses with internet connection had 55 points higher than those without. Presence or absence of somebody to help the student with her/his studies at home did not create a significant difference."}, {"section_title": "Results Related to the Analysis of the TEOG Scores of the Students According to the Total Number of Children and Number of Children Going to School at Home", "text": "ANOVA results related to the TEOG scores of the students according to the total number of children and number of children going to school at home were given in table 10. There was a significant difference between the scores of the students according to the number of children at home [F(2-519)=16.72, p< .01], and number of children going to school [F(3-517)=7.06, p< .01]. Analyses were performed through three groups. Scores of the children of the families with one or two children at home (X= 350.33), were 35 points greater than those with three children (X= 315.15) 35, and 58 points greater than those with four or more children (X= 314.80) . Scores of the children of the families with two children going to school (X= 337.80) were 48 points greater than those with one child going to school (X= 289.61)."}, {"section_title": "Results Related to the Analysis of the TEOG Scores of the Students According to the Total House Income and the Annual Education Expenditure for the Student", "text": "ANOVA results related to the TEOG scores of the students according to the total house income and the annual education expenditure for the student were given in Table 11 . According to the data, house income [F(2-508)=43.79, p< .01] and the annual education expenditure on the child [F(2-484)=45.18, p< .01] created a significant difference between the groups. House income was grouped into three as low (1300 TL and below), average (1301-2999), and high (3000 TL and above). According to this, the students in the high income group (X= 369.63) obtained 39 points higher than the average (X= 330.18), 88 points higher than the low (X= 281.15) income groups whereas the students in average income groups obtained 49 points higher than the low income groups according to the annual education expenditure on the child was also formed on the basis of three groups (first 1-999 TL; second 1000-1999 TL, third 2000 TL and above). The students in the third group (X= 384.02) obtained 93 points higher than the first group (X= 291.05), and 45 points higher than the second group (X= 339.37) . The difference between the second and first group (48 points) was also found to be significant. Data showed that the TEOG scores increased with the increase in the house income and the annual education expenditure on the child."}, {"section_title": "Results Related to the Relationship Between TEOG Scores of the Students, House Income, and the Annual Education Expenditure for the Student, and Education Levels of the Parents", "text": "As seen in Table 12 , there was a positive significant difference between the TEOG scores of the students and the house income and the annual education expenditure for the student (p< .01). It could be seen that the academic successes of the students increase with the increase in the annual educational expenditure for the children. There is also a positive relationship between the TEOG scores of the students and whether or not their parents were university graduates. Students with parents graduated from university had higher TEOG scores. Their correlation coefficients change between .20 and .50. Correlation coefficient being between .70 and 1 as absolute value is considered as high, between .70 and .30 as medium, and below .30 as low level (Büyüköztürk, 2012, pp. 32) . Accordingly, it was seen that the relationship between the TEOG scores of the students and the house income, annual education expenditure for the child, and education status of father was positive and at medium level, and with the education status of mother was positive and at low level."}, {"section_title": "Multiple Linear Regression Analysis Results Related to the Extent to Which the House Income, Annual Education Expenditure for the Child, and Education Status of Parents Predict the TEOG Scores of the Students", "text": "The last question to be answered within the scope of the study was whether or not the house income, annual education expenditure for the child, and education status of parents predict the TEOG scores of the students significantly. Linear regression analysis was conducted to find the answer to this question. Multiple regression analysis results related to the extent to which the house income, annual education expenditure for the child, and education status of parents predict the TEOG scores of the students were given in Table 13 . .55, R²= .30, F=49.25, p< .01 As seen in Table 13 , the model testing the prediction condition of the house income and the annual education expenditure on the child and the TEOG scores was significant (F= 49.25, p< .01) . It is seen that the house income, annual education expenditure for the child, and the education condition of the parents predicted 30% of the TEOG scores (R 2 =.301). When the T values were examined, it is seen that the variables except the education condition of the mother were the significant predictors of the TEOG scores of the students (p< .01). When considering β coefficients, the relative importance order of the predictive variables on the TEOG scores were seen to be annual education expenditure for the child (β= .30), education condition of father (β=.27), and house income (β= .11)."}, {"section_title": "R=", "text": ""}, {"section_title": "Discussion, Conclusion, and Recommendations", "text": "Various variables are discussed in the literature to explain the academic success differences of students. In this study, the academic successes of the students were analyzed through TEOG scores focusing on non-school variables. The TEOG examination successes of the students participated in the study were at moderate level. However, the female students had greater success than the male students. This result may be because of two reasons which are related with each other. First, the probability of moving out of the system for the female students when unsuccessful, and the second, with the same perception, the girls growing in patriarchal families and living in rural areas being aware of the smaller chance they would have to remain in the system when unsuccessful. This may mean that the girls use more effort to be able to continue their education, have greater motivation, and thus have greater academic success. In fact, there are other studies regarding female students having greater academic success than male students (Bahar, 2006; Büyüköztürk & Denizkulu, 2002; Duckvvorth & Seligman, 2006; Durmuşçelebi, 2013; Koç, Avşaroğlu, & Sezer, 2004; Mau & Lynn, 2001; Pomerantz, Altermatt, & Saxon, 2002) . For example, according to the results of 2011 'Trends in International Mathematics and Science Study' (TIMSS), it was found that there was a significant difference to advantage of female students in the Science and Technology success averages between the female and male eighth-year students who took the examination (Büyüköztürk, Çakan, Tan, & Atar, 2014) . On the other hand, there are also studies with results that there was no difference in academic success in terms of gender (Sadi, Uyar, & Yalçın, 2014) .\nThe residential area the family lived may have an effect on the educational opportunities to be provided to the child. In fact, in the analysis, the TEOG scores of the students showed differentiation/difference according to their residential area. The students living in province centers obtained higher scores than the students living in town centers and villages. Similarly, there was a positive difference in scores of the students living in town centers and villages to the advantage of the students living in towns. From this, the group of students with the least/en low academic success rate comprised the students living in villages. This is significant in showing the opportunities provided to the students by both the schools and the families. Although it would be wrong to suggest that all of the school in provincial centers provide similar features and opportunities to students, when they are compared with the village schools categorically, it is commonly known that they are better than village schools in terms of educational opportunities. Thus, the students living in villages comprise the most disadvantaged group in terms of education. A similar result was found in 2011 TIMSS Mathematics 8 th grade Examination. According to the TIMSS Turkey Report, 60 points difference in favor of the students whose schools were in the province centers was found between the Mathematics success averages of the students going to the schools in the provinces and towns (Büyüköztürk et al., 2014) . Besides, a study conducted by Ünal et al. (2010) concluded that the students were separated into groups within the same school in favor of the advantaged social classes even if the educational facilities and opportunities of the primary schools in the provincial centers were similar. The study showed that there is a long social distance even in the state schools close to each other because of the socio-economic and socio-cultural structures of the families.\nWithin the scope of the study, it could be said that not all of the children living in villages went to village schools as a significant part of those children went to the bussed schools in the provincial and town centers. However, it would not be possible to say that this application diminished the inequalities created by the indicators related to the families because it was found in the comparison that the academic success was lower in the bussed education students than the others. It could be said that the low academic success of those students was affected by the opportunities provided to the child by the parents and also the issues in the bussed education system. The results related to the issues experienced in the bussed education (Büyükboyacı, 1998; Kabaş, 2006; Karakütük, 1998; Küçüksüleymanoğlu, 2006; Özgün, 2007) have a potential to negatively affect the successes of the students.\nThe study results revealed that the education level of the parents is an important variable in the academic success of the child which was explained with the concepts of \"cultural\" by Bourdieu, and \"humane\" by Coleman. A significant difference was found between the TEOG scores of the students according to the education level of mothers and education level of fathers. The study results showed that as the education levels of the parents increase, the academic successes of the students increase overtly. There are other studies also confirming this relationship (Akyol, Sungur, & Tekkaya, 2010; DeGarmo, Forgatch, & Martinez, 1999; Hall, Davis, Bolen, & Chia, 1999; Hortaçsu, 1994; Kuyper, Van der Werf, & Lubbers, 2000; Öksüzler & Sürekçi, 2010; Yılmaz, 2000) . Some of those studies found that mother was more effective in the academic success of the student (Hall et al., 1999; Hortaçsu, 1994; Öksüzler & Sürekçi, 2010; Yılmaz, 2000) while some others found that father was more effective (Alomar, 2006; Anıl, 2009; Hortaçsu, 1995; Keskin & Sezgin, 2009; Özer & Anıl, 2011) . The education level of the parents is an important predictor variable of the academic success of the child (Kuyper et al., 2000) . Results of the study revealed that the education level of father is more important in predicting the academic success of the child. The education level of the parents was determined as one of the characteristics explaining the PISA 2012 Mathematics literacy of the students in Turkey at a significant level. According to the estimations obtained through constructive model, 1 unit increase in the education level of parents corresponds to 0.12 unit increase in the student performances. In other words, the higher the education levels of parents, the greater the academic success of the students (Anıl et al., 2012) .\nWorking condition and profession of the parents, and social security of the family are also nonschool indicators. The academic success of the child showed significant difference according to the working condition of the mother and the presence or absence of the social security of the family. It was found in the study that the children whose mothers were working and family had social security obtained higher scores than those without these. The working condition of the fathers did not make a significant difference. Nevertheless, the average scores of the children with working fathers were higher than those with unemployed fathers. In the study, it could be seen that there was a positive relationship between the working condition of the mother and the academic success of the child. This result did not coincide with the results of the study conducted by Öksüzler and Sürekçi (2010) on the basis of Secondary Education Institutions Examination (OKS) data. The researchers found that the working mothers had negative effect on the student success compared to unemployed mothers. On the other hand, the presence of social security in the family created a significant score difference in the academic success of the student. This result is supported by the study conducted by Bakış et al. (2009) . In that study, in the homes where there was an umbrella of social security covering all of the individuals, the probability of male children to participate in education increased. When the results of those two studies were considered together, it could be seen that the presence of social security umbrella was a variable that increases not only the participation but also the academic success.\nAccording to the results of the study, there was a significant difference between the scores of the students according to the professions of parents. From the analysis, the scores of the students whose mothers are government workers were higher than the scores of the students whose mothers were house wives and from other professions. On the other hand, the scores of the children of the fathers employed as state workers were higher than workers and farmers, craftsmen, and other professions respectively. Also, the scores of the children of the craftsmen and other professions were higher than the scores of the children of worker-farmer. Results showed that both parents to be working as government officers is important. This may actually be related to a regular income entering the house, and this income being relatively higher than the other working groups. On the other hand, it could also be seen that the most unlucky group in terms of TEOG examination success comprised of the children of the workers-farmers. Bakış, Levent, İnsel, and Polat (2009) found in their study that the rate of the probability of inclusion of girls to education was lower in the homes which obtain more than half of their income from agriculture. On the other hand, there are also studies that found no relationship between the profession of the mother and the academic success of the child (DeGarmo et al., 1999) .\nThe child's having gone to pre-school education institutions also created a significant difference in her/his academic success. It was seen that the children who went to nursery school obtained higher scores than those who did not go. According to Finn-Stevenson, Desimone, and Chung (1998) , quality preschool education positively affects the academic successes of students. Hence, in an analysis conducted through PISA 2013 data revealed that one year of preschool education had a positive contribution equal to two-years education on the results obtained in a Mathematics test taken at the age of 15 (Schleicher, 2004 , as cited in ERG, 2009 . The study also found that the children who went to cram school or after-school club obtained higher scores than those who did not. According to Beidel, Turner, and Taylor-Ferreira (1999) , learning some tactics related to working on the questions, and using time effectively in the examinations, and practicing on test questions affect examination successes of the students positively. There are also other studies examining the relationship of academic success of the students in central examinations with whether or not going to cram school, and research that support the results of the present study. For example, Yıldırım (2013) found that cram schools were determinative in the scores of the students; and Baran and Altun (2014) found that cram schools increased the school successes of the students. In another study Başol and Zabun conducted with eighth grade students, scores of the students in sixth and seventh grade Placement Tests were examined according to the students' going or not going to cram school. It was found that there was a significant difference of above 60 points for each grade level in favor of the students who went to cram school. There are also other studies determined that the success of the students was affected positively by the length of the cram school education (Öksüzler & Sürekçi, 2010) . With the closure of the cram schools starting from the 2014-2015 academic year, courses were started to be organized in schools during the week and at the weekends. The effects of those courses were also tried to be seen in the present study and not a statistically significant difference was found although the students who went to those courses had higher scores than those who did not. Experiences of teachers working in cram schools and schools on the strategies for placement examinations may differ -experiences of teachers working in schools may be less than those working in cram schools-, and that might have had an effect on this result as the instruction is subject-centered in school while the strategies of solving tests and answering questions are predominant in cram schools.\nThere was not a significant difference on the academic success of the child regarding the change of school in the last three years. Here, the expectation was that the children who do not change school would have higher academic success due to reasons such as getting to know the teacher, and getting used to the school climate. However, it was seen in the study that the students who changed schools had higher scores contrary to expectations. This result could be interpreted as the reasons for school change were inevitable changes due to address change in some, and changes in search of better quality schools in others. Hence, in PISA 2013 Mathematics literacy examinations, Turkey came first among the OECD countries in terms of inequality between schools (Dinçer & Kolaşin, 2009 ). These inequalities may be among the reasons for families to change schools.\nOther variables that thought to affect the academic success were the variables regarding opportunities provided to the child by the family at home. All of those variables were related to the economic condition of the family. For example, computer is a good with the highest correlation with the socio-economic condition index of PISA (Dinçer & Kolaşin, 2009) . In this study, having a room for the child, presence of central heating, presence of a computer at home, and presence of an internet connection at home created a statistically significant difference in student success. In some studies, positive relationship was found between the education materials, computer and internet connection students have and the Science course successes of those students (Christman & Badgett, 1999; Özer & Anıl, 2011) . Another study supporting the results of the present study was conducted by Oral and Mcgivney (2014) who compared two groups they classified according to some characteristics using the results of the TIMMS 8 th grade Mathematics examination results. The first group consisted of students who have internet room, more than one hundred books and parents one of whom at least high school graduate. The second group consisted of students who do not has internet or a room, and have less than 25 books, and parents one of whom at least below high school graduate. In the comparison of the successes of two groups, the students in the first group had 179 points higher performance probability than the students in the second group. According to the results of 2006 PISA, PISA tests results of the students who had computer at home were 15 -24 points higher than the others (Dinçer & Kolaşin, 2009 ). According to Van der Berg (2010 , as cited in Oral & Mcgivney, 2014 shortage in house resources and insufficient diet in poor children limit their learning, so they learn slower than their peers. This might mean that the children coming from low income families need to make more effort to be able to continue school, and to have success even when they are able to access school. On the other hand this result did not coincide with the results of the study conducted by Akyol et al. conducted in 2010 with seventh grade students. In that study, a negative relationship was found between the presence of a room, computer and internet and the students' success. However, in another study conducted by Sadi et al. (2014) , students having the opportunities of room, internet and library, did not make a significant difference in their biology course success.\nIn the present study, another valuable which was thought to be worth examining was the effect of the presence of somebody to help child in his/her study at home on his/her academic success. It did not create a significant difference in the TEOG scores of the students. However, although statistically insignificant, the students who had somebody to help in study had scores 21 points higher than the others. This situation at could be defined as family support is one of the variables generally examined among the valuables affecting the academic success. For example, in a study by Diaz (1989 , as cited in Sadi et al., 2014 it was found that the most significant characteristic differentiating the students who had low academic success and risk of failing was the absence of family support.\nThere was a significant difference in the TEOG scores of the students according to the total number of children and the number of children going to school. Scores of the children whose families had one or two children were 35 points higher than the families with three children, and 58 points higher than the families with four or more children. As it could be seen, there is a negative relationship between academic success and the increase in the number of children in the family. The higher the number of children in the family is, the lower the academic success of the students becomes. There are other studies related to the big families affecting the inclusion of the child to education negatively (Knodel & Wongsith, 1991 , as cited in Öksüzler & Sürekçi, 2010 . In the analysis conducted through the number of children going to school, a significant difference was found between the families who had one child going to school and the families who had two children going to school. Contrary to the expectations, scores of the families with two children going to school were higher than the families with one child going to school which could be explained by the interaction between two children or the experience of the parents in terms of education of their children. On the other hand, if the number of children going to school is more than two, then the academic success decreases. The reason for the decrease in the academic success when the total number of children and children going to school are more than two maybe because of the house income being shared by more children and thus the education expenditure for children becoming less. Çam (2006) also found that the increase in the number of people in the family decreased the academic success.\nA significant part of the non-school variables are related to the socio-cultural and socioeconomic status of family. The family income comes first among them. According to the analysis result a significant difference was found between the groups in terms of house income and annual education expenditure on the child. The academic successes of the students differentiated according to the income groups. Accordingly, the students in the upper income groups obtained higher scores than the middle and low income groups. The middle income group students obtained higher scores than the low income group. This difference was found to be statistically significant. A similar result was found in the study by Öksüzler and Sürekçi (2010) . They found that the student success in OKS increased with the increase in family income level, and the largest and the most statistically significant effect was in the highest income group. There are other studies on the relationship between the socio-economic status of the family and the academic success of the child (Acemoğlu & Pischke, 2000; Eamon, 2005; Gelbal, 2008; Hochschild, 2003; Jeynes, 2013; Johanningmeier, 2008; Köse, 2007; McNeal, 1999; Oral & McGivney, 2014; Sirin, 2005; WB, 2013; White, 1982; White, Reynolds, Thomas, & Gitzlaff, 1993) . For example, Yelgün and Karaman (2015) found in a case study that one of the preliminary factors affecting the academic success negatively was the socio-economic status of the families. On the other hand, there are also studies that found no relationship between the socio-economic status of the family and the academic success of the child (DeGarmo et al., 1999; Catsambis, 2001) .\nAnother variable to be examined according to the income was the annual education expenditure on the child. According to the annual education expenditure amount on the child, the students in the high level expenditure group obtained higher scores than the ones in the middle and low levels. A significant difference was found between the middle level expenditure group and the low level expenditure group. Accordingly, the scores of the students in middle level were higher compared to the scores of the students in low level group. As the house income and the annual education expenditure for the child increase, the TEOG scores of the students increase significantly. Families with high income level can provide better learning environments for their children with their expenditure on education. When the distribution of household consumption expenditures in 2012 is examined according to the orderly twenty percent groups in Turkey, the share of the lowest income group in total education expenditures was 2.3% while the share of the highest income group was 66.8%. This deviancy is a determining factor in the formation of the inequalities such as children's access to education, school success, continuing education, and the quality of education (Aslan, 2015) . According to Bourdeiu, children growing up in families with high socio-economic level become more successful, because they come with cultural capital codes given in school.\nOn the other hand it is difficult to manifest clearly the effect of the house income and expenditure on the academic success of the child. Although house income is an important variable to be examined on its own, it has a potential to affect the other variables that thought to have an effect on the academic success of the child. Thus, it could be seen that almost all of the non-school variables related to the family are interrelated variables which are related to the socio-economic and socio-cultural status of family. For example, a room for the child, presence of computer and internet connection, the heating system of the house, going to cram school or after-school club/center, professions of the parents, working condition and education levels of parents, the residential area, expenditure for the child's education, etc. are some of the variables related to family. It is incontrovertible that the house income is a determiner on those variables. Thus, every effect defined through the related variables could also be interpreted as the effect of income, thereby the effect of expenditure. In fact, significant differences were found in the study related to almost all of the related variables.\nIn the analyses conducted through the income level and the variables affected by the income level, a significant and positive relationship between the academic success of the child and house income and annual educational expenditure was found; that is, the higher the income, the higher the academic success. Hence, multiple linear regression analysis results show that house income, annual education expenditure for the child, and the education levels of parents predicted the TEOG scores of the students. Results revealed that the most important prediction variable was the annual educational expenditure for the child. According to Abbott and Fouts (2003) , the share the families allocate for the education of their child contributes to the success of the child to a significant level. Turkey is one of the three countries among the OECD countries where there is a strong relationship between academic success and socioeconomic level (OECD, 2010).\nThe following suggestions could be forwarded according to the results of the study: The study results showed that the non-school variables are determinative on the academic success of the students. It was seen that education level of the parents and family income are determinative in terms of affecting the other variables. The study results revealed that the academic successes of the students increased with the increase in the education levels of parents. Thus, it could be suggested that the education level of the parents could be increased through distance education or mass communication vehicles. In addition, organizing educational programs in both formal and non-formal institutions for the parents to strengthen their education perceptions may be effective. In the long-term, education levels of futureparents could be increased by banning child-marriages, preventing the exclusion of children from the system before completing their education, and taking necessary measures to decrease the grade repetition and dropouts.\nAnother long term determinant of the academic success was determined as the family income. It could be said that policies/applications addressing the parent characteristic and family income could be successful to decrease the inequality coming out in academic success in the long term. Especially, systematic and regular income and employment generating policies for the families with low socioeconomic level may increase the academic success of their children. Because of this, it is necessary to stop the subsidies provided to children of the low-income families to be subsidies that are irregular, arbitrary, and affiliated to the school's conditions. These applications need to be transformed into systematic and regular social policies.\nResults according to the residential area showed that the academic success of the students differentiate also spatially. This result could be explained by the difference in the environment and facilities of the town and village schools. Thus, the minimum quality standard valid for all of the schools needs to be determined, effort should be made to provide this Standard, and the Standard indicators should be continuously watched. Especially, positive discriminative policies should be followed in the distribution of the resources allocated for the schools especially in the areas with low socio-economic and socio-culture level. In addition, \"social capitals\" of the students could be increased by ways such as social activities and school trips in those schools. Another way to increase social capital of children could be to include the pre-school education in compulsory education. Hence, in this study, pre-school education was determined as a significant variable of the academic success. Through pre-school education, disadvantages created by the families could be decreased. On the other hand, it is seen that the children are in a keen competition for quality education. The most effective way to demolish this competition would be to change all of the educational institutions into quality institutions, and end the view of quality schools being privileged. In addition, it is crucial to provide a well-regulated placement system in which every student could perceive her/his interests and aptitudes, and proceed accordingly.\nThe following suggestions could be proposed to researches: Detailed qualitative research could be conducted related to increase the academic success especially with the disadvantaged groups. Subjective reasons for failure could be examined through the individual education histories of students with low academic success. The study could be repeated in the private schools where the socioeconomic and socio-cultural level is higher."}]