[{"section_title": "Introduction", "text": "The use of locally-produced food in U.S. school meal programs has grown from a few pilot projects in the 1990s to over 42,500 schools participating during the 2014-2015 school year (USDA FNS 2016a). The motivations for these purchases are multifaceted, and include educating children about agriculture, promoting rural development, developing markets for local farmers, and improving child nutrition (Benson 2014). However, the linkages between school food purchases and the characteristics of local agricultural production are not yet well understood. On the one hand, local food purchasing programs may be more likely to be implemented by schools in regions where local agricultural sectors are struggling and are highly incentivized to develop new market opportunities. On the other hand, schools may purchase local foods in greater quantities when it is more readily available from local farmers. Understanding the relationship between school food purchases and local agricultural production can inform how governments and private funders can effectively implement programs that bolster local and regional food systems. In this paper, we merge data from a 2015 Farm to School Census with Census of Agriculture data to estimate double hurdle models exploring how local food purchases by schools is influenced by the characteristics of local agricultural production. We find that local agricultural production marketed as direct-to-consumer (DTC) sales and local milk production have a positive impact on the probability that schools purchase local non-milk foods and local fluid milk, respectively. We further find that local agricultural production has a positive impact on the level of such purchases among schools buying local foods. Since the movement to encourage schools to purchase local foods did not exist until the mid to late 1990s, we test for endogeneity of local agricultural production by using lagged values of the independent variables as instruments. We find that our results hold regardless of whether we assume local agricultural production to be endogenous or exogenous. A critical contribution of our research is that we distinctly estimate factors that influence local school food purchases for two distinct market segments: fluid milk, which comprise 61% of local school food expenditures, and non-milk expenditures for other local food products. Previous research that has examined the characteristics associated with local food school purchases have estimated discrete choice models that do not capture variation in the level of expenditures among schools, and have also not explored the impact of the value of local agricultural production (Vo and Holcomb 2011;Dimitri, Hanson, and Oberholtzer 2012;Botkins and Roe 2015). Our results provide insight into how trends in agricultural market activity influence the viability of school food purchases. For instance, the significant consolidation of the dairy sector could adversely affect the ability of schools to source fluid milk locally, while also providing a greater motivation for schools to explicitly seek local sources. Also, whether the sales of local foods in DTC markets, like farmers markets, is a substitute or complement for local food purchases by schools is unclear a priori. For instance, developing entrepreneurial and management skills in DTC markets (e.g., Feenstra et al. 2003) could result in knowledge spillovers that enable farmers to sell local foods in greater quantities. This could increase school food purchases, as management skills are critical for selling local foods to intermediated markets (Park, Mishra, and Wozniak 2014). However, DTC and intermediated markets may be substitutes for each other, as greater DTC market activity may reduce the incentives for local farmers to sell in other markets (e.g., Low et al. 2015). Overall, our findings underscore the importance of taking local agricultural conditions into account when implementing programs and policies that support the use of local foods in schools."}, {"section_title": "Background", "text": "Local and regional food systems have become prominent in recent decades in the United States, with local food sales by farmers estimated to equal $8.7 billion in 2015 (USDA NASS 2016). \"Local\" foods are often defined by the supply chain utilized and/or the branding of the product. Direct-to-consumer (DTC) agricultural markets for local foods can include farmers markets, roadside stands, community supported agriculture (CSA) programs, and pick-your-own operations. Local food sales can also occur when a farmer sells products to retail institutions, such as schools, colleges, and hospitals, or other intermediaries that market locally branded products, such as grocery stores, restaurants, distributors, and processors. Intermediated (non-direct) market sales comprise a larger segment of local food sales than DTC sales (USDA NASS 2016). One intermediated market segment of local foods that has received particular attention in recent years is the purchase of local foods by schools. Schools are a large potential market for local foods, as approximately 30.5 million students participate annually in the National School Lunch Program (USDA FNS, 2016c). While schools' purchases of local foods directly from farmers was common in the United States through the early 1970s, by the 1980s and 1990s this practice had effectively ceased to exist (Joshi et al. 2014). These local food purchases, in addition to the creation of school gardens and development of agricultural, food, and nutrition-based educational curriculum, became known as \"farm to school\" activities. Between 1997 and 2009, the number of farm to school programs in the U.S. increased from two to approximately 2,051 (Martinez et al. 2010, Feenstra andOhmart 2012). States concurrently implemented legislation to support farm to school programs, such as creating state-based grant programs and/or hiring farm to school coordinators (National Farm to School Network and Vermont Law School Center for Agriculture and Food Systems 2015 Within the 2015 Farm to School Census questionnaire, SFAs are asked to estimate the total dollars that they spent on all food for school meals, as well as the total dollars spent on local food including and excluding fluid milk. 1 \"Local\" is self-defined by survey respondents, with the geographic distance of being within 100 miles of the SFA cited as a frequent response. 2 The Census indicated that SFAs could consider local food purchases that they made either directly from farmers or farmer cooperatives, as well as from intermediaries such as distributors or food service management companies. Aggregate local food expenditures for the 2013-14 year were equal to $789 million, which comprised 11% of the value of total food expenditures for responding schools (USDA FNS 2016a). Fluid milk accounted for 61% of the value of local food purchases. The 2015 Farm to School Census found that the lack of year-round availability of key items (39%), local items not available from primary vendors (29%), and higher prices (21%) were among the top challenges of responding SFAs that were not purchasing local foods. However, responding SFAs participating in farm to school programs also identified these factors as impediments to purchasing local foods, with respective percentages of 57%, 27%, and 38%. This indicates that some schools already participating in farm to school programs desired to purchase a greater amount of local foods than existing levels. The impact that local agricultural production has on SFAs purchasing local foods is likely to vary by food product. For example, local fluid milk purchases by a SFA are unlikely to depend on local DTC agricultural production. This is because fluid milk sales are uncommon in DTC markets since the product is relatively heavy and must be kept both sealed and cool. Fruits, vegetables, and nuts are among the predominate food groups sold locally (Low et al. 2015), and only 2% of vendors at farmers markets sell milk or dairy products (Ragland and Tropp 2009). 2 Of the SFAs participating in a farm to school program in 2013-2014, 45% that provided a usable response to their definition of local indicated that they considered local to be either within the same city/county, within 50 miles, or within 100 miles. Six percent of respondents indicated that they considered local to be within 200 miles, 1% indicated it was a day's drive, 27% indicated it was within their state, 14% indicated that it was within their (selfdefined) region, and 7% defined local in other ways. However, local fluid milk purchases by SFAs may be influenced by local milk production, since fluid milk markets tend to be local (MacDonald et al. 2007). Nonetheless, it is unclear a priori if schools are more likely to purchase local milk in regions in order to support a more modest local dairy sector that might be struggling or losing market share, or instead if local purchases are a response to greater level of supply, which is more likely in regions with a prominent dairy sector. In contrast, the purchase of local non-milk foods by schools may depend on local DTC agricultural production. However, the extent to which DTC agricultural production is a substitute or complement for local food purchases by school districts is unclear. DTC agricultural markets can complement purchases of local foods by schools by increasing the awareness and demand of local residents for local foods. They could also result in farmers and local food organizations acquiring experience and increasing their engagement with local intermediaries, such as schools, that may procure local foods. These two market segments also have the capability of being substitutes if purchases of local foods in one of the market segments saturates the ability of the other to develop (Low et al. 2015)."}, {"section_title": "Literature Review", "text": "Characteristics of Farmers in Local Food Markets DTC agricultural markets can provide a critical opportunity for farms that are unwilling or unable to sell products in conventional markets, as farms selling through DTC agricultural markets tend to be small and medium-sized (Detre et al. 2011;Low and Vogel 2011;Ahearn and Sterns 2013). However, the prominence of local food markets varies throughout the United States. Brown et al. (2014) found that per capita DTC sales had a positive impact on changes in per capita farm sales in New England and the mid-Atlantic, although they had a negative impact in the Southeast. Feenstra et al. (2003) found that vendors selling products in DTC agricultural markets can improve their entrepreneurial skills by expanding product lines and processing, establishing new business contacts, and improving marketing techniques. Management skills are particularly important for local farmers. Park, Mishra, and Wozniak (2014) found that local food farmers that sell to intermediated markets had higher management skills than farmers that do not sell locally, and that marketing skills had a positive impact on farm sales. Also, farms with DTC sales had a higher survival rate between 2007 and 2012 relative to other farms (Low et al. 2015). Whether DTC agricultural markets can provide a gateway to selling local foods to intermediaries is of interest since the average sales of local food farms selling exclusively to intermediaries is 15 times greater than those selling exclusively in DTC markets (Low et al. 2015). Selling products to intermediated markets may increase the profitability of local food farms vis-à-vis selling exclusively in DTC agricultural markets (Bauman, Jablonski, and McFadden 2016). However, research on whether selling local foods to intermediaries compared to DTC markets impacts income is mixed. Bauman, Jablonski, and McFadden (2016) found no impact on income. In contrast, Uematsu and Mishra (2011) found that two classifications of intermediated local food market channels (sales to regional distributors and to local grocery stores, restaurants, and other retailers) and one DTC marketing channel (on-farm stores) had a positive impact on farm income for at least some farms, and also found that three DTC market channels (farmers markets, roadside stores, and CSA programs) had a negative impact. Factors Influencing Schools Purchasing Local Foods Conner et al. (2012) found that farm to school programs are more likely to be successful when there are strong relationships and a set of shared values, particularly a desire to support local farmers, among the supply chain participants. Several studies have examined the characteristics of school districts in purchasing local foods. Vo and Holcomb (2011) found in Oklahoma that the size of the school district (i.e., the number of students), school meal procurement characteristics, and school lunchroom characteristics were associated with farm to school participation. Dimitri, Hanson, and Oberholtzer (2012) found in Maryland that county income and the percentage of students eligible for free lunch were among variables that were associated schools purchasing local foods. Vo and Holcomb (2011) found scheduling delivery as the largest obstacle to schools purchasing local foods, whereas Dimitri, Hanson, and Oberholtzer (2012) found seasonal availability as the most frequently identified impediment. Lyson (2016) undertook a state-level analysis, and found that the income level of a state and farm to school adoption rates in nearby states in their region were significant predictors of the percentage of districts implementing a farm to school program in a state. Botkins and Roe (2015) use the results of the 2013 Farm to School Census to estimate discrete choice models exploring which factors influence whether a school district participates in a farm to school program and/or serves local food. They found that the proportion of local farms involved in DTC marketing, number of farmers markets per capita, and farm income all had a positive impact on the probability that a school district serves local food. The characteristics of DTC agricultural markets on the purchases of local foods by intermediaries has also been examined for other (non-school) institutions. Smith II, Kaiser, and Gomez (2013) found that a higher proportion of farms participating in a CSA program within the same county as a hospital increased the probability of that hospital undertaking a farm to hospital program in the Northeast. Despite this research, there are several shortcomings in our understanding of how local school food purchases depend on local agricultural characteristics. Many studies have employed discrete choice models, and have not examined variation in the level of expenditures among participating schools. Also, the models are not estimated distinctly for different kinds of foods, even though there could be considerable regional variation in the relative availability of different kinds of food products. Further, while proxies for local agricultural production have been used (such as the ratio of farms selling locally, number of farms selling locally, or number of farmers markets per capita), these variables do not represent the sales level of local agricultural production. Some of these variables may also be endogenous, and endogeneity has not been rigorously considered in the literature to-date."}, {"section_title": "Methods", "text": ""}, {"section_title": "Model", "text": "The relative importance of factors that influence whether a SFA purchases local foods may vary from the level of expenditures once a SFA elects to purchase local foods. Since local food expenditures by SFAs are censored at zero, we estimate a double hurdle model following the methodology in Wooldridge (2002). We express the first tier equation in (1): In (1), Φ is the standard normal cumulative distribution function, 2 is a binary dependent variable with a value equal to one if a SFA purchases local foods and equal to zero if they do not, and is a matrix of explanatory variables. We estimate the parameter in equation ( 1) using a probit model. For the second tier equation, 1 is the level of local food expenditures. We make the distributional assumption expressed in equation ( 2): We estimate the parameters and 2 with an ordinary least squares regression of log ( 1) on 1 for the observations in which 1 > 0. We estimate separate double hurdle models using local fluid milk and local non-milk food products as the dependent variables in ( 1) and (2). The independent variable of interest is local milk sales from cows when the dependent variables are an indicator variable of whether a SFA purchased local fluid milk in the first tier equation and the level of local fluid milk expenditures in the second tier equation. Local DTC agricultural sales is the dependent variable of interest for the local non-milk food product regressions. We calculate the value of local agricultural production as the sum of agricultural sales in counties within 100 miles of the respective SFA. We select 100 miles as a definition of proximity based on the preponderance of responses indicating that such distance was considered \"local\", and explore the sensitivity of this assumption in the results section. We calculate the distance between SFAs and counties using the population centroids of the county in which the SFA resides and the corresponding population centroids of the comparison county (Census Bureau 2015a). 3 We include the same county-specific and school-specific control variables in both tiers of the double hurdle regressions. We include population, per capita income, the percentage of the population with a bachelor's degree, and the percentage of the population in poverty in the county in which the SFA resides to control for county-specific sociodemographic characteristics. O'Hara and Low (2016) found that per capita income was exogenous with regard to DTC agricultural sales in the northeast, which is a region of the country in which DTC agricultural sales are concentrated. Thus, we assume per capita income is exogenous with regard to local school food expenditures as well, since the value of local school food purchases in school year 2013-2014 is less than that of 2012 DTC agricultural sales. SFA-specific controls include the number of students enrolled in the SFA and the percentage of students eligible for free or reduced-priced school meals. We include dummy variables that correspond to FNS regional office territories (USDA FNS 2016b) in both probit and OLS regressions. We also use state-level dummy variables as control variables in the OLS regressions. 4 Table 1 presents the list of variables and data sources used in the regressions. We scaled the variables so that the algorithms converged for the probit specifications. We convert pecuniary data into 2014 U.S. dollars using the consumer price index (BLS 2016). Local agricultural production could be endogenous for several reasons. Simultaneity is a possibility, since the purchases of local fluid milk by schools would increase revenue to local dairy producers. Also, there may be unobserved omitted variables that are correlated with local DTC production and local non-milk food expenditures. We use fifteen year lags of DTC agricultural production and milk production (i.e., agricultural sales in 1997) as instruments to test for the possibility of endogeneity. We assume that lags of this duration are exogenous with regard to 2013-2014 local food expenditures by SFAs since farm to school initiatives did not began until the late 1990's. We test for endogeneity in both the first-tier probit regression and in the second-tier OLS regression. For the probit regressions, we test whether the value of agricultural sales is exogenous using the two-step Rivers-Vuong approach outlined in Wooldridge ( 2002). If the value of agricultural sales is not exogenous, we then estimate the parameters using conditional maximum likelihood. We perform the Hausman endogeneity test for the OLS regression. To do so, we regress agricultural sales on the instruments and other control variables. We then use the residuals from this first-stage regression as an independent variable in specifications in which the log of local food expenditures is also regressed on all of the explanatory variables included in the population model. A statistically significant coefficient corresponding to the first-stage residuals in the second-stage regression indicates that agricultural production is endogenous (Wooldridge, 2002). We employ instrumental variables in order to avoid the resulting bias. Not all of the respondents that purchased local foods reported the level of local food expenditures in the 2015 Farm to School Census. We estimate a type II Tobit / Heckit model to test whether there are systematic differences between SFAs that purchased local foods but did not report their level of expenditures and SFAs buying local foods that reported their expenditure levels. We did not find selection bias due to item non-response to be present. We present further details of this test in the Appendix."}, {"section_title": "Descriptive Statistics", "text": "The percentage of respondents purchasing local non-milk foods is 26%, and the percentage of respondents purchasing local milk is 18% (Table 2). Average respondent-level expenditures for local non-milk foods is $9,799, whereas average expenditures for local fluid milk is $36,680. There is a high degree of variation in DTC non-milk sales and milk sales, with average sales within 100 miles of a SFA equal to $23 million and $438 million, respectively."}, {"section_title": "Results", "text": ""}, {"section_title": "First Tier Probit Regressions", "text": "Table 3 shows that the value of local DTC agricultural production has a positive and statistically significant impact on the probability that a SFA purchases local non-milk food products (P<0.1), while local milk sales has a positive impact on the probability that a SFA buys fluid milk locally (P<0.01). We calculate the marginal effects of these variables by evaluating the mean values of the explanatory variables at their parameter estimates. We find that a doubling of local DTC agricultural production increases the predicted probability of a SFA purchasing local non-milk products by 0.01, and that a doubling of local dairy production increases the probability that a SFA purchases local milk products by 0.02. The number of students enrolled in the SFA has a positive impact on both local non-milk and local milk purchases (P<0.01), while the percentage of residents living in poverty in the county has a negative impact (P<0.01). Also, the county's population (P<0.01) and the percentage of students eligible for free or reduced-price meals (P<0.1) have a negative impact on the probability of purchasing local non-milk foods. The Rivers-Vuong p-value indicates that DTC agricultural production is exogenous with regard to the probability that a SFA purchases local non-milk foods (Table 4). In contrast, milk production is endogenous regarding whether a SFA purchases local fluid milk. The second-stage milk sales coefficient is positive and statistically significant with a similar coefficient magnitude as in Table 3. Thus, the finding that local milk production impacts the probability that a SFA buys local milk is robust to whether milk production is assumed to be endogenous or exogenous."}, {"section_title": "Second Tier OLS Regressions", "text": "Table 5 shows that DTC agricultural sales and milk sales both are positive and statically significant in explaining the expenditure levels of local non-milk foods and local milk, respectively. These parameter estimates correspond to elasticities of 0.3 for DTC agricultural production and 0.1 for milk production when using average values of the independent variables reported in Table 2. Population of the county that the SFA is located in and the number of students enrolled in the SFA are positive and statistically significant in both specifications (P<0.01). The population coefficient corresponds to elasticities of 0.09 for local non-milk food purchases and 0.08 for local milk purchases. Similarly, school enrollment coefficients correspond to elasticities of 0.13 and 0.16, respectively. The percentage of students eligible for free and reduced price meals is positive and statistically significant in both of the OLS regressions (P<0.01), which is the opposite sign that this variable had in the probit regressions reported in Table 3. The percentage of residents living in poverty of the county that the SFA is located in is negative and significant in the local milk specification (P<0.1). Per capita income is statistically significant and positive when local non-milk expenditures is the dependent variable (P<0.01), while the percentage of residents with a bachelor's degree is negative (P<0.05). Thus, the finding that local DTC agricultural production and local milk production have a positive impact on local non-milk and local milk purchases by schools, respectively, holds regardless of whether these variables are assumed to be endogenous or exogenous."}, {"section_title": "Sensitivity Analysis 5", "text": "We calculate a sensitivity analysis using 200 miles, instead of 100 miles, as a definition of proximity. In these scenarios, both DTC agricultural production and milk production are exogenous in both the first tier and second tier regressions. We find that local DTC agricultural production is statistically insignificant in the first tier probit regression, but is positive and statistically significant in the second tier regression (P<0.01). In contrast, local milk production is positive and statistically significant in the first tier regression (P<0.01), but is statistically insignificant in the second tier regression."}, {"section_title": "Discussion", "text": "Our results show that local DTC agricultural production and local milk production had a positive impact on the probability that a school purchases local non-milk and milk products, respectively. Our results also show that local production had a positive impact on the level of such purchases. These findings suggest that DTC agricultural production could be critical in providing local farms market outlets that can complement sales to intermediaries. Such an interpretation is consistent with research finding that DTC markets foster entrepreneurial skills (Feenstra et al. 2003) and that intermediated markets of local foods require a high degree of managerial skills (Park, Mishra, and Wozniak 2014). The positive impact of local milk production on local fluid milk expenditures indicates that a high degree of agricultural production is a significant factor in influencing schools purchases of local foods, and that purchases of local fluid milk by schools are not undertaken to provide a market outlet for milk in regions where dairy production is modest. We find that the impact of local agricultural production on the likelihood of a SFA buying local non-milk foods and the level of fluid milk expenditures by SFAs decreases at a 200 mile distance. However, the results from the 200 mile scenario should be interpreted cautiously, particular if SFAs do not consider foods produced in excess of 100 miles to be \"local\" and would not be reporting such purchases in the survey as such. Thus, there may not be a meaningful relationship between agricultural production at a distance from 100 to 200 miles of a SFA and food purchases considered to be \"local\". We find that the marginal effects of local DTC agricultural production and local milk production on the predicted probability that a school purchases local foods to be modest. We also found the impact of local milk production on local fluid milk to be highly inelastic. This may be because there may not be opportunities for schools to expand local fluid milk purchases beyond existing levels if they are already buying a significant component of fluid milk locally and there is not a demand among students to drink milk in greater quantities. Our finding of a greater elasticity with regard to local DTC agricultural production, however, implies that nonmilk products may represent a more promising opportunity for local food purchases by schools to increase. Our county-level controls for average income and the percentage of residents in poverty, when statistically significant, had positive and negative signs, respectively. This suggests that schools in more prosperous regions are more likely to purchase local foods, which is a finding consistent with Lyson (2016) and Dimitri, Hanson, and Oberholtzer (2012). While the percentage of students eligible for free and reduced-price meals decreases the predicted probability of a school making local non-milk purchases, it has a positive impact on the level of expenditures. A partial explanation for this finding is the positive correlation that the number of eligible students for free or reduced-price meals has with county-level income and percentage of residents in poverty, since eligible-meal students is statistically insignificant in the fluid milk OLS regression when these latter two variables are removed as controls. Another explanation is that while it may be challenging for less prosperous schools to purchase local foods due to fixed administrative costs, there may be greater opportunities to purchase local foods in poorer schools where property values are lower and activities like urban agriculture are more pronounced once such schools are able to source locally. We also found that the number of students had a positive impact on local food expenditures, which is consistent with the expected sign and with Botkins and Roe (2015). Population had a positive impact on expenditures, although it had a negative impact on the predicted probability that a school district sources local non-milk products. Again, a positive correlation between county-level population and school district size could cause this finding, as population was statistically insignificant in this specification when school size was removed as a control."}, {"section_title": "Conclusion", "text": "Enhancing the purchases of local foods by SFAs is a critical way to expand local food and regional food systems, particularly given the evidence suggesting that they would make greater local food purchases if supply were available. However, local agricultural market conditions can determine the extent to which policy support may be valuable to improving school participation in farm to school. Our study is one of the first papers to examine how local food purchases by intermediaries interact with local agricultural market sales. We show that while both the probability of purchasing local foods by schools and the level of purchases schools are influenced by local agricultural sales, it is challenging to draw overarching generalizations about the nature of such relationships since the impacts vary by type of product. In particular, we demonstrate that local non-milk food purchases are more elastic with respect to local DTC production than the relationship between local milk purchases and local dairy production. The Farm to School Census is one of the most comprehensive efforts to-date in measuring market activity for local food products purchased by intermediaries. Since the survey was covering a new subject matter and had an objective of attaining a high response rate, some of the responses to questions were non-standardized (e.g., respondents self-defined \"local\") and the expenditure levels were self-reported estimates among two basic categories. Further data collection efforts that solicit more detailed information about the types of products purchased and supply chains utilized would allow researchers to estimate more specific relationships between how local food purchases by intermediaries are influenced by local supply conditions. Additionally, further research that includes different community or socio-demographic data or that utilize different methodological approaches may uncover additional information about determinants related to schools use of local foods. Also, similar data collection efforts with grocery stores, restaurants, hospitals, distributors, and other food service providers would inform the viability of enhancing local food purchases among different types of institutions.      Also, we include the estimated inverse Mills ratios from the first-stage regression as an independent variable in the second-stage regression. A statistically significant coefficient on the inverse Mills ratio coefficient in the second-stage regression indicates that selection bias is present. However, we found the inverse Mills ratio be statistically insignificant when we used either local milk expenditures or local non-milk expenditures as the second-stage dependent variable. Specifically, we found the corresponding second stage p-values to be 0.33 and 0.51, respectively. Thus, these results suggest that selection bias is not a concern."}]