[{"section_title": "Abstract", "text": "The lack of Indonesian students achievement in the international assessment is due to several factors. Students are not familiar with the problems requiring reasoning, in particular the proportional reasoning. This research aims to identify the distribution and the Level of Cognitive Demands (LCD) of the proportional reasoning problems found in the Year 7 and Year 8 mathematics textbooks based on the 2013 curriculum (revised edition 2014). The data collection was conducted by identifying the proportional reasoning problems found in the whole chapters of the textbooks which are then analysed and classified using the Smiths and Stein's criteria of LCD (1998). The results reveal that the proportional reasoning problems were only found in the three of 17 chapters namely ratio and proportion, rectangle and triangle, and Pythagorean Theorem, which represent different LCD including Lower-LCD (Low-M and Low-P) and Higher-LCD (High-P). Out of 69 proportional reasoning problem found in the textbooks, the percentage of higher-LCD problems (n=29 ; 42.03%) is less than lower-LCD (n=40;57.97%). In addition, the higher-LCD problems found were only the high-P type. None was found to meet the requirement of High-DM demanding students to conduct 'doing mathematics', complex approach and self-monitoring or self regulation of students' cognitive process. It is recommended that the proportional reasoning problems, including some High-DM problems, should be provided in each topic in Indonesian mathematics textbooks.\nKeywords: Text Book, Proportional Reasoning Problems, The 2013 Curriculum, Level of Cognitive Demands\nRendahnya prestasi siswa Indonesia pada assesmen internasional dipengaruhi oleh beberapa faktor. SiswaIndonesia tidak terbiasa dengan bentuk soal-soal yang menuntut penalaran, khususnya penalaran proporsional. Penelitian ini bertujuan untuk mengidentifikasi distribusi dan Level of Cognitive Demands (LCD) dari soal-soal penalaran proporsional yang terdapat pada buku teks Kurikulum 2013 kelas VII dan VIII (edisi revisi 2014). Pengumpulan data dilakukan dengan cara mengidentifikasi soal-soal penalaran proporsional yang terdapat pada keseluruhan bab pada buku teks tersebut yang selanjutnya dianalisis dan diklasifikasikan menggunakan kriteria LCD yang dikemukkan oleh Smith dan Stein (1998). Hasil penelitian menunjukkan bahwa soal penalaran proporsional hanya terdapat pada tiga dari 17 pokok bahasan, yaitu perbandingan, Segiempat dan Segitiga, dan Teorema Pythagoras, yang mewakili tingkatan LCD yang berbeda, yaitu Lower-LCD (Low-M dan Low-P) dan Higher-LCD (High-P). Dari 69 soal penalaran proporsional pada buku teks, soal yang memenuhi higher LCD (n=29;42,03%) lebih sedikit dari soal lower LCD (n=40;57,97%). Soal Higher LCD yang ditemukan hanya jenis High-P, tidak ada yang memenuhi jenis High-DM yang menuntut siswa melakukan doing mathematics.,menggunakan pendekatan penyelesaian yang kompleks, dan membutuhkan self-monitoring atau self regulation dari proses kognitif. Sebaiknya pada buku teks matematika Indonesia disediakan soal penalaran proporsional di setiap pokok bahasan dan juga ada soal yang memenuhi level paling tinggi yaitu High-DM."}, {"section_title": "", "text": "internal challenges are related to the current situation of education with eight standard of education and the growth of Indonesian population. The external challenges are the quality of education, infestation and transformation at the educational sector and international assessment such as PISA and TIMSS. The results of PISA 2011 show that nearly 95 percent of Indonesian students are at the intermediate level of the four levels of Advanced, High, Intermediate and Low. On the other hand, 40 percent of Taiwanese students are able to achieve at the high and advanced level (Kemdikbud, 2014) .\nThe problems used to measure students' cognitive ability in the international assessment are divided into four categories including: (i) low, measuring the ability up to the level of knowing, (ii) intermediate, measuring the ability up to the level of applying, (iii) high, measuring the ability up to the level of reasoning and (iv) advance, measuring the ability up to the level of reasoning with incomplete information. The problems used in the international assessment are not only from the low cognitive level such as remembering, understanding and applying but also from the high cognitive level such as reasoning including the ability to analyze, generalize, synthesize, assess, and solve nonroutine problems (OECD,2015) . These are considered by the government in the evaluation of the educational system which results in the change of curriculum.\nThe change of curriculum in Indonesia leads to the change of textbooks as the content of the textbook should be in line with the standard content of the curriculum. A good book should follow the development of knowledge and technology. Textbooks are one of the main resources used at schools which results in teachers' teaching strategies are often based on the content of the textbooks used (Freeman & Porter, 1989; Reys, Reys, & Chavez, 2004) . Therefore, a textbook plays an important role in determining students' involvement and opportunities. In addition, mathematics textbooks have a significant role in assisting teachers in planning the lesson (Alajmi, 2012) . Textbooks are strongly related to students' performance (Tornroos, 2005; Xin, 2007) . In conclusion, textbooks are expected to help students in learning in order to improve the education.\nThere were a number study about analysis of mathematics textbook. Kolovou et al. (2009) mentioned that the problems provided in textbooks in the Netherlands mainly consist of procedural problems. Vincent and Stacey (2008) found that some best seller books in Australia emphasized more on memorization and procedures without connection. Bergvist (in Boesen, Lithner and Palm, 2010) showed that most of the learning environment such as teaching, textbooks and the test created by teachers were focused on the procedural algorithm without giving students enough opportunities for students to learn various reasoning.Related to Indonesian textbook, there was only 10 percent of context based problems that give students freedom to solve while the other 85 percent give students the required information to solve the problem without giving students opportunities to choose their own relevant information (Wijaya, 2015) . It means most of problems in Indonesian mathematics textbook were focused on the clear procedural or algorithm.\nEspecially on the topic of ratio and proportion, Marie (2016) mentioned that textbooks in Swedish provided less opportunity for students in problems related to ratio problems using both additive and multiplicative strategies, identifying the structure of multiplication and proportional thinking, and using meaning from representation symbol. Shield and Dole (2002) analyzed Australian junior high school textbook and found the limitation definition of the topic of ratio and proportion. Furthermore, Shield and Dole (2013) also found that the limitation of the textbook in introducing the understanding related to the proportional reasoning including the understanding in connecting the relation of mathematics structure to solve problems of various situations related to the context of proportional reasoning. Some studies found the limitation of mathematics textbook for developing students' proportional reasoning, except study of Bayazit (2013) . His exploration concluded that in Turkish mathematics textbook had included different level of proportional reasoning tasks, even 75 percent of the proportional reasoning tasks are classified as the higher-level problems. It means the tasks need connection among mathematical representation or between mathematics and non-mathematics topic,required non algorithmic thinking, and asked students doing mathematics A proportion is a statement of equality of two ratios, i.e., (Tourniaire and Pulos, 1985) . While the reasoning used to show that two numbers are similar in proportional relationship known as proportional reasoning (Post, Behr, & Lesh, 1988; van de Walle, 2008) . Such reasoning is crucial for both solving everyday problems and understanding the higher level of mathematics; it also used across other dicipline, such as natural and social science (Post, Behr, & Lesh, 1988) .\nThere are three types of proportional reasoning tasks developed by the Rational Number Project, namely missing value, numerical comparison, and quatlitative prediction/comparison. Karplus' Tall-ManShort Man is one of the example of missing value problems. The problem is in the figure, it is given that the Mr. Short height 6 paper clips when it is measured by paper clips and is 4 buttons when measured by buttons. On the other hand, the height of Mr Tall is 6 buttons when measured by button, what is the height of Mr. Tall when measured using paper clips. One of the example of numerical comparison is the orange juice task. The students are provided with the information that the orange-juice mix in the glass is marked by shaded area and the water is not shaded. Then, the student are required to imagine then the orange-juice mix is put into the jug followed by the water. Students are then asked to evaluate which jug has the highest level of orange juice flavor or whether the mixtures in the jug would have the same flavour. One of the example of qualitative comparison is when there is two friends hammered a line of nails into different boards. Bill hammered more nails than Greg. Bill's board was shorter than Greg's. On which board are the nails hammered closer together? (Cramer & Post, 1993) .\nA direct proportion and inverse proportion are parts of proportional relationship. The difference between these proportion is indicated by the direction of change, whether it is the same or the opposite. It is called a direct proportion when change is occurred at the same direction or it is called an inverse direction when the change goes into different direction. The examples mentioned earlier are the examples of a direct proportion. The example of inverse proportion is that when there are 6 labors, the time spent to harvest the apples is 6 days, how long the work will done if the number of the labors increased to 8? (Lamon, 2008) .\nThe proportional reasoning is considered to lead students to the early formal operation in the Piaget cognitive development steps (Allain, 2000) . The proportional reasoning problems are also one of the reasoning problems in the international assessment. For instance, the problem of the Trends in International Mathematics and Science Study (TIMSS) consists of three dimensions including knowing (35%), applying (35%) and reasoning (30%) (Jones, Wheeler & Centurino, 2015) . Those information argued that it is important to develop students proportional reasoning in learning mathematics. Proportional reasoning problems are inserted in some mathematics topics namely: fraction, algebra, symmetry, graph, probability, etc. The proportional reasoning is not only in mathematics but also in other subject such as physics related to speed, momentum, etc ( Stein (1998) due to this criteria is complete and relevance to Bloom's Taxonomysuch as knowledge, comprehension, application, analysis, sinthesis, and evaluation.\nWe summarized that LCD was divided into two categories including Lower-LCD and Higher-LCD.\nThe category of lower-LCD is divided into two categories. First, Lower-level demand (memorization/Low-M), the characteristics include: (i) remembering the fact, rules, formula or definition learned before, (ii) not being able to solved using procedures because the procedures have not learned yetand (iii) there is no connection between concept and definition including facts, rules, formulas and definition that are currently learned and the ones that will be learned. Second, Lower-level demand (procedures without connection/Low-P), the characteristics include: (i) the algorithm used is the simple algorithm that has been found daily, (ii) no connection between concept and meaning which are the base of the procedures used, (iii) focusing on the correct answer in developing mathematical understanding and (iv) other explanations focused on the description of the procedures used are not required.\nThe category of Higher-LCD is divided into two categories. First, Higher-level demands (Procedures with connections/High-P),the characteristics are: (i) students' attention is focused on the use of procedures to be developed to the higher level of understanding mathematical concepts and ideas; (ii) it is suggested to use procedures that are in general connected to the based conceptual ideas in order to narrow the unclear algorithm of the basic concepts, (iii) it is usually described in various ways, such as visual diagram, manipulative symbol and problem situation to assist the representation in solving problems Second, the Higher-level demands (doings mathematics/High-DM), the characteristics are: (i) more thinking is needed in analyzing, well-trained, complex approach and nonalgorithmic thinking-a predictable, or the solution which is not immediately given in the task, task instruction or the work-out example, (ii) demanding self-monitoring or self regulation of one's cognitive process, (iii) students are required to connect the knowledge and relevant experience, and use them to solve the task, , and (iv) major cognitive efforts are needed and may involve some level of students' anxiety because of unexpected characteristics of the required solution.\nThe second stage is presenting data that is conducted by tabulation. Tabulation "}, {"section_title": "RESULT AND DISCUSSION", "text": ""}, {"section_title": "The distribution of proportional reasoning problems", "text": "The results shows that there are four chapters in the Year 7 textbook of semester 1 and only one chapter has the proportional reasoning problems namely the chapter of Ratio and proportion.\nSimilarly, the Year 7 textbook of semester 2 also has four chapters and the proportional reasoning problems are only found in one chapter namely, the chapter of rectangle and triangle. In the Year 8 textbook of semester 1, one out of six chapters has the proportional reasoning problems, namely the chapter of pythagorean theorem. The proportional reasoning problems are also found in only one chapter out of five chapter of the Year 8 textbook of semester 2, namely the chapter of proportion.\nOne of the example of the application of proportional reasoning in the topic of pythagorean theorem is presented in Figure 1 . The students use ratio of the length of the opposite side of the angle 30 0 to the length of hyphotenuse to solve the problem. This ratio is proved by the students in the activities provided in the textbooks, i.e,. 1:2. Apart from using the ratio, the students also connect the pythagorean theorem to determine the length of the requested sides.\nDetermine the length of AF, CE, dan CD in the figure.\nSource: Year 8 textbook (As'ari et al., 2014c, p. 158 ) Source: Mullis et al. (2012, p. 131) Figure 3 . The example proportional reasoning problem related to topic of algebra If you are going to travel or study overseas, you need to know about the currency exchange system. Complete the following table to show some currency exchange to identify how much money needed to exchange to Indonesian Rupiah (IDR). The proportional reasoning problems are located in different chapters in the text book and therefore there is the connection between the concepts of proportional reasoning problems and different mathematics topics involving materials such as fraction, algebra, symmetry, etc Van de Walle, 2008) . A good mathematics curriculum integrates different topics in order to assist students to enrich their knowledge and skills. For instance, the proportional reasoning problems should be provided in many contexts, such as percentage, symmetry, scale, equation of lines, gradient, relative frequency histogram and probability problem (NCTM, 2000) . This is due to the fact that the proportional reasoning problem is considered to be able to lead student to the formal operation stage (Allain, 2000) ."}, {"section_title": "Kurs Penukaran Mata Uang", "text": ""}, {"section_title": "The classification of the problems based on Level of Cognitive Demands (LCD)", "text": "The proportional reasoning problems in each chapter of Year 7 and Year 8 textbooks is The classification of the proportional reasoning problems of the authors and the participants of FGD was different for 12 proportional reasoning problems. Therefore, discussion is conducted between the researchers and the participants of FGD to re-examine the problems based on the criteria of LCD. For instances, authors identified that one of the problems (presented in Figure 4 ) is a proportional reasoning problem but FGD participants think that the problem is not proportional reasoning problem. After reviewing the problem together, it was then decided that the problem is not proportional reasoning problem but a comparison problem. Thus, it is decided that there are 69 problems identified as the proportional reasoning problems in the textbooks.\nLook at the figures below. Which plane is the widest? Explain.\nSource: Year 7 textbook, competency test 1 (As'ari et al., 2014b, p. 56) Figure 4. Not a proportional reasoning problem Another problem discussed and the level changed is presented in Figure 5 . The authors considered the problem as Low-P (Procedures without connection) based on the criteria of LCD.\nWhile FGD participants think the problem was categorized as the High-P (Procedures with connection) as they argued that Low-P problems do not require explanation. In fact, the most significant problem of Low-P and High-P level problems is not based on the demand of explanation of the procedures but based on the demand of the problems for connection among mathematics, or between mathematics, and non-mathematics topic. Finally, both the researcher and the FGD participants agreed that the problems as presented in Figure 5 is classified as Low-P problem.\nSalma wants to make a cup of coffee for her father. She knows that to make a cup of coffee she need 2 spoons of coffee. Salma said 'I am sure that the amount of coffee is always one more from the number of cups I need to serve'. Do you agree with Selma? Explain your answer.\nSource: Year 7 textbook, exercise 3.3 (As'ari et al., 2014a, p. 191) Choose the fastest pedestrian.  Rosi walk 4.8 km in an hour  Endang walk 9.8 km in 2 hours  Rosuli walk 9.6 km in 1.5 hours  Rina walk 14.4 km in 2 hours Source: Year 7 textbook, exercise 3.2 (As'ari et al., 2014a, p. 183 ) Figure 6 . The example of low-M level of proportional reasoning problem\nThe example of Low-P level problem (procedures without connection) is presented in Figure 7 . This problem can be solved by using a simple algorithm, namely . This problem focusing on the correct answer in developing mathematical understanding and there is no reasoning for using the procedures.\nUlus is a cook in a hotel. He is modifying the recipe to serve the guests that are increasing during holiday. The previous recipe is 2 measurement glasses of flour makes 3 dozen of 'kue pukis'. If he changes the recipe to be 12 measurement glasses of flour, how many dozens of 'kue pukis' can be made?\nSource: Year 7 textbook, exercise 3.3 (As'ari et al., 2014a, p. 191) Figure 7. The example of Low-P level proportional reasoning problem\nThe example of High-P level problem (procedures with connection) is presented in Figure 8 .\nThis problem described in visual representation and manipulative symbol. The use of procedures at this level to be developed to the higher level of understanding mathematical concepts and ideas. This level required connecting knowledge such as R, k, and d."}, {"section_title": "Pulley", "text": "The relation between the size of pulley and the rotation speed is the opposite as figure below.\nThe diameter of the pulley A is twice the diameter of the pulley B. So, if the pulley A rotates once, the pulley B will rotates twice. If the diameter of the pulley is triple the diameter of the pulley B, so if A rotates once, the pulley B will rotates three times. The diameter of the pulley B is smaller than the diameter of the pulley A. The rotation speed of the pulley is the opposite of the diameter. We can express it in the equation below: Source: Year 8 textbook, competency test 5 (As'ari et al., 2014d, p. 151-152) Figure 8. The example of High-P level of proportional reasoning problem\nBased on the analysis of 69 proportional reasoning problems in the Year 7 and 8 textbooks, the summary of the results and the classification of the problems are presented in Table 1 . higher-LCD problems. This might be because the proportion chapter in year 8 is a continuation of the chapter in Year 7. In addition, the proportional reasoning in Year 8 is related to the chapter of Pythagorean Theorem as presented in Figure 1 above. However, in total the percentage of higher-LCD problems (42.03%) is less than lower-LCD problems (57.97%).\nThere are two types of higher-LCD, namely: High-P and High-DM. Based on the textbook analysis, there is no High-DM problem found. High-DM problemsrequire students to conduct doing mathematics, using complex approach and demanding self-monitoring or self regulation of students' cognitive process. One of the example of the proportional reasoning problemsof High-DM level inthe\nTurkish textbook is presented in Figure 9 .\nSource : Mathematics Textbook Grade 7, p. 97 (Toker in Bayazit, 2013) Figure 9 . The example of High-DM level proportional reasoning problem in Turkish textbook Such problem at Figure 9 should be inserted in mathematics textbooks so that students can utilize can use mathematics to solve everyday problems and develop their reasoning. Book authors an teachers also should look for other contexts that integrate mathematics with topics outside mathematics. This is because this reasoning is crucial for both solving everyday problems and understanding a higher level of mathematicals subjects across diciplines such as natural and social science (Post, Behr, & Lesh, 1988) . In relation to the type of the proportional task proposed by Cramer and Post (1993) , the proportional problems in the textbook are classified as missing values tasks and numerical comparison tasks, no qualitative comparison task was found. Though the type of qualitative comparison is important to develop students' ability in predicting qualitatively.\nThe finding that the number of Higher-LCD is less than the Lower-LCD is in line with Wijaya (2015) reporting that most of problems in Indonesian mathematics textbook were focused on the fix procedural or algorithm and the finding of Marie (2016) regarding Swedish mathematics textbooks that provide less opportunity for students in problems related to proportional reasoning. In contrast to the finding of the study conducted on Turkish mathematics textbooks conducted by Bayazit (2013) indicated that all cognitive level are available in the books with approximately 75% of the  Place your index and second fingers on the palm side of your left wrist as it is shown in the figure.  Count the beats you feel for 15 seconds.  Estimate how many pulses you can feel in 1 minutes, 5 minutes and 60 minutes.  Find out the relationship between the number of pulses and the time span? Discuss it with your friends.  Sketch the graphs of the rate of heart beats of four students in your class.\nproportional reasoning problem included are Higher-LCD problems. This indicates that the textbooks used in Turkey support the students' reasoning."}, {"section_title": "CONCLUSION", "text": "Based on the results, it can be concluded that the distribution of the proportional reasoning problems in the Year 7 and Year 8 textbooks of the 2013 curriculum is not equal. There are only three chapters out of 17 chapters in the four textbooks (Year 7 semester 1, Year 7 semester 2, Year 8 semester 1 and Year 8 semester 2) consisting of the proportional reasoning problems, namely ratio, rectangle and triangle, and pythagorean theorem. It is recommended that Indonesian textbooks should provide proportional reasoning problems in each topic. Furthermore, the Year 8 textbook generally has more problems of the higher level of cognitive demands (higher-LCD) problems compared to Year 7 textbook based on the cognitive demand of proportional reasoning problems. However, the Higher-LCD problems found are only High-P problems, none of the problems are at the level of High-DM requiring students to do mathematics through activities. It is expected that the problems of various cognitive levels can help students in developing their reasoning skill. Teachers should provide more problems requiring reasoning skill by creating their own or adopting problems from different resources. Van de Walle, J.A. (2008 "}]