[{"section_title": "Introduction", "text": "Deposition of amyloid-b in the brain is thought to be a necessary early step in the development of Alzheimer's disease, a progressive and highly prevalent neurodegenerative disorder with substantial societal burdens (Karran et al., 2011; Jack et al., 2013a) . Existing prospective studies suggest that brain amyloid accumulation occurs over decades, preceding the onset of clinical symptoms and subsequently contributing to clinical progression (Villemagne et al., 2013; Doraiswamy et al., 2014; Huijbers et al., 2015) . However, the mechanisms underlying amyloid accumulation and clearance in Alzheimer's disease are not fully understood.\nPathogenic mutations causing rare, early-onset forms of Alzheimer's disease have been described in three genes involved in amyloidogenesis, APP (amyloid precursor protein), PSEN1 (presenilin 1), and PSEN2 (presenilin 2) (Bettens et al., 2013) . For late-onset Alzheimer's disease, the strongest known genetic risk factor is the APOE \"4 allele (Corder et al., 1993) . Several mechanisms have been proposed relating APOE \"4 to enhanced aggregation and reduced clearance of brain amyloid (Kim et al., 2009 ). However, APOE \"4 is neither necessary nor sufficient for development of amyloid pathology or incident Alzheimer's disease, suggesting that other contributing factors remain to be discovered.\nWith the development of radiotracers allowing for noninvasive in vivo detection of amyloid plaque burden in large samples (Clark et al., 2012) , amyloid PET has become an established endophenotype used in crosssectional studies to relate genetic variants to Alzheimer's disease pathology (Swaminathan et al., 2012; Rhinn et al., 2013; Shulman et al., 2013; Lim et al., 2014; Ramanan et al., 2014b) . We hypothesized that genetic factors would also modulate the rate of amyloid accumulation over time. We therefore performed a genome-wide association study (GWAS) of longitudinal change in brain amyloid burden measured by 18 F-florbetapir PET to identify novel genetic influences on the pathogenesis and trajectory of Alzheimer's disease."}, {"section_title": "Materials and methods", "text": ""}, {"section_title": "Subjects and phenotypes", "text": "The Alzheimer's Disease Neuroimaging Initiative (ADNI, Weiner et al., 2010) , Indiana Memory and Aging Study (IMAS; Ramanan et al., 2014a) , Rush Memory and Aging Project (MAP, Bennett et al., 2012b) , and Religious Orders Study (ROS; Bennett et al., 2012a) are longitudinal studies of older adults representing clinical stages along the continuum from normal ageing to Alzheimer's disease. All participants provided written informed consent, and study protocols were approved by each site's institutional review board.\n18 F-Florbetapir PET imaging was performed at baseline and 2-year follow-up for participants enrolled in the ADNI GO and 2 phases. Image acquisition and preprocessing were performed as described previously . Tracer uptake was normalized to average uptake values from an atlas-based composite reference region expected not to exhibit amyloid pathology (composed of the cerebral white matter degraded to 0.7, brainstem, and whole cerebellum). This normalization yielded standardized uptake value ratio (SUVR) images (Schmidt et al., 2014) . As described previously, the mean SUVR for a customized composite region was obtained to represent a global cortical measure of amyloid burden at each time point . The annualized per cent change in global cortical SUVR at 2-year follow-up compared to baseline was used as the main quantitative phenotype for genetic analysis. Extreme outliers (annualized per cent change 4 three standard deviations from the sample mean) were excluded to limit the potential for spurious associations.\nFor post hoc analyses, baseline amyloid status (positive versus negative) was determined for each participant as described previously ."}, {"section_title": "11", "text": "C-PBR28 PET imaging was performed for a subset of IMAS participants as described previously (Yoder et al., 2013) . The sample analysed included cognitively normal older adults (n = 7), older adults with cognitive complaints in the absence of significant cognitive deficits (n = 5), participants with mild cognitive impairment (MCI, n = 7), and clinical Alzheimer's disease participants (n = 6). SUV images were created by normalizing each voxel by the injected dose of 11 C-PBR28 per total body weight. Mean SUV data were extracted for the frontal, parietal, temporal, limbic, and occipital lobes. The average SUV for these five regions was calculated to represent a global cortical index of activated microglia for use as a quantitative phenotype. TSPO (translocator protein, 18 kDa) rs6971 genotype was used to delineate participants with high, mixed, and low affinity states of the TSPO binding site, as 11 C-PBR28 is highly sensitive to these states (Kreisl et al., 2013) . For genetic analyses, participants with low affinity TSPO binding sites (rs6971-TT) were excluded and rs6971 genotype (CC versus TC) was included as a covariate (Yoder et al., 2013) .\nFor ADNI participants, structural MRI scans from baseline and 2-year follow-up visits were downloaded (www.adni.loni. usc.edu) and processed as described previously (Risacher et al., 2010) using FreeSurfer, version 5.1. For each scan, mean thickness values from the left and right temporal cortex regions were averaged to create a measure of bilateral temporal cortex thickness. The annualized per cent change in bilateral temporal cortex thickness at 2-year follow-up compared to baseline was calculated for use in genetic analyses.\nVerbal episodic memory performance was assessed at baseline and 2-year follow-up for participants from ADNI, MAP and ROS using delayed recall of logical memory prose passages from the Wechsler Memory Scale-Revised. For genetic analyses, the 2-year difference in delayed recall score was used as the phenotype and baseline age, gender and education were included as covariates."}, {"section_title": "Genotyping and imputation", "text": "GWAS data for ADNI participants were obtained and processed as described previously (Ramanan et al., 2014b) . Briefly, genotyping was performed per manufacturer's protocol using blood genomic DNA samples and Illumina GWAS arrays (610-Quad, OmniExpress, or HumanOmni2.5-4v1). The single nucleotide polymorphisms (SNPs) characterizing APOE \"2/\"3/ \"4 status (rs429358 and rs7412) were genotyped separately and merged with the array data sets as described previously (Saykin et al., 2010 (Saykin et al., , 2015 . Genotype data underwent stringent quality control including identity checks, sample exclusion for call rate 595%, and SNP exclusion for call rate 595%, Hardy-Weinberg P 5 1 Â 10 À6 , or minor allele frequency (MAF) 51%.\nMaCH , Minimac (Howie et al., 2012) , and haplotype patterns from the 1000 Genomes Project reference panel were used to impute SNP genotypes not directly assayed by the GWAS arrays. Imputation was performed as described previously Ramanan et al., 2014b) . Following additional quality control (SNP call rate 5 95%, Hardy-Weinberg P 5 1 Â 10 À6 ) and frequency filtering (MAF 5 5%), 6 112 217 genotyped and imputed SNPs were available for analysis. Six participant pairs exhibited significant relatedness (PI_HAT 4 0.5) and therefore one individual from each pair was randomly selected for exclusion. For additional studies in IMAS, MAP and ROS, identical procedures were used to impute the specific SNPs required for analysis (Chibnik et al., 2011; Ramanan et al., 2014a) .\nWhole genome sequencing was obtained from blood genomic DNA samples for a subset of the ADNI sample. Sequencing was performed using the Illumina HiSeq2000 system through paired-end read chemistry and read lengths of 100 base pairs. The resulting Illumina GSEQ files were converted into FASTQ files for introductory evaluation using FastQC (Andrews, 2010) . Initial alignment to the reference human genome (NCBI build 37.72) for bases with Phred quality 4 15 was completed using the Burrows-Wheeler Alignment tool (Li and Durbin, 2009) . Suspicious reads were locally realigned and the Illumina base calling quality scores were recalibrated to account for effects of sequencing technology and machine cycle. These realigned reads were written to a BAM file to be used for multi-sample variant calling using the GATK HaplotypeCaller (DePristo et al., 2011) . ANNOVAR (Wang et al., 2010b) was used to annotate variants passing recommended quality criteria (Van der Auwera et al., 2013) . Participants with poor quality variant calls (concordance rate 5 99% for SNPs genotyped through both sequencing and the Illumina HumanOmni2.5-4v1 array) were excluded from further analysis.\nTo limit potential effects of population stratification, all genetic analyses were restricted to non-Hispanic white participants as determined by multidimensional clustering using PLINK. To verify appropriate control for population structure, EIGENSTRAT was used to generate principal component eigenvectors for use as covariates in post hoc analyses."}, {"section_title": "Statistical analysis", "text": "GWAS was performed using linear regression under an additive genetic model in PLINK. Baseline age and gender were included as covariates in the GWAS. A conservative significance threshold (P 5 5 Â 10"}, {"section_title": "À8", "text": ") was used based on a Bonferroni correction of one million independent tests (Pe'er et al., 2008) . Manhattan and Q-Q plots were generated with Haploview and regional association plots were generated with LocusZoom. The genome partitioning algorithm GCTA (Yang et al., 2011) was used to estimate the proportion of phenotypic variance explained by all SNPs in the GWAS. Power calculations and curves were obtained using GWAPower (Feng et al., 2011) .\nSignificant associations were further investigated using sequence data from a subset of the GWAS sample. Common variants in IL1RAP, defined as having MAF 5 1 /ˇ(2n) = 0.034 (Ionita-Laza et al., 2013) , were analysed using linear regression under an additive genetic model in PLINK. SKAT (Ionita-Laza et al., 2013) was used to perform association testing of low-frequency and rare IL1RAP variants (MAF 5 0.034). Pairwise linkage disequilibrium calculations were obtained for selected SNP pairs using PLINK.\nComplementary approaches were used to extend the GWAS findings. GATES (KGG software version 2.5) was used to calculate a summary P-value for each gene (including a default AE 5 kb window to account for putative regulatory regions) based on its size, linkage disequilibrium structure and constituent GWAS SNP associations. GSA-SNP (Nam et al., 2010; Ramanan et al., 2012a ) was used to identify biological pathways exhibiting enrichment of association in the GWAS. Pathway definitions from three resources (Biocarta, KEGG and Reactome) were downloaded from the Molecular Signatures Database, version 4.0 and analysis was restricted to pathways containing 5-100 genes to limit the potential for size-influenced spurious associations (Ramanan et al., 2012b) . Pathways with false discovery rate (FDR)-corrected P 5 0.05 were considered as significant.\nStatistical Parametric Mapping 8 (Wellcome Trust Centre for Neuroimaging) was used to perform voxel-wise analysis of the effect of IL1RAP rs12053868 on longitudinal change in 18 F-florbetapir PET amyloid burden. A two-way ANCOVA was performed using rs12053868 genotype and scan visit (baseline versus 2-year follow-up) as the independent variables and age, gender, baseline diagnosis, APOE \"4 status (positive versus negative), and time between PET scans as covariates. To specify an additive model, we a priori (based on the GWAS results) coded the analysis vector as [positive change in AA] 5 [positive change in GA] 5 [positive change in GG], corresponding to a vector of [À1, 0, À1, 1, À1, 2]. A grey matter mask was used and results were displayed at a voxel-wise threshold of P 5 0.001 (uncorrected) with minimum cluster size (k) = 175 voxels. These voxel-wise parameters were selected to approximately correspond to a cluster-wise threshold of P 5 0.05 (FDR-corrected). Only the GG 4 GA 4 AA results are shown, as no significant clusters were observed from the reciprocal model of AA 4 GA 4 GG.\nAdditional analyses were performed using IBM SPSS Statistics, Version 22.0. Following the GWAS, post hoc models including additional covariates were used to assess the robustness of the association of IL1RAP rs12053868 with higher rates of amyloid accumulation. Baseline 18 F-florbetapir PET SUVR and the square of this value were both included among the additional covariates in these post hoc analyses to account for the sigmoidal relationship of cortical amyloid PET burden to time (Jack et al., 2013b) . Consistent with previous data (Jack et al., 2013b) , the rate of amyloid accumulation as a function of baseline amyloid burden displayed an inverted U relationship ( Supplementary Fig. 1 ). A one-way ANCOVA was used to assess the effect of rs12053868 genotype (AA versus GA/GG) on annualized per cent change in bilateral temporal cortex thickness, including baseline age, gender, total intracranial volume, and MRI scanner type (1.5 T versus 3.0 T field strength) as covariates. A subsequent two-way ANCOVA was performed to further explore the potential interaction of rs12053868 genotype with baseline diagnosis (cognitively normal versus MCI versus Alzheimer's disease). Logistic regression was used to test the association of rs12053868 genotype (AA versus GA/GG) with progression from MCI to Alzheimer's disease, including baseline age and gender as covariates. The associations of rs12053868 with 11 C-PBR28 PET SUV and longitudinal change in memory performance were tested using linear regression under an additive genetic model. As described above, baseline age, gender, and TSPO rs6971 genotype were included as covariates in the 11 C-PBR28 PET analysis. Baseline age, gender, and education were included as covariates in the memory analysis. METAL was used to perform inverse-variance weighted meta-analysis of the withincohort memory studies."}, {"section_title": "Results", "text": ""}, {"section_title": "Longitudinal change in brain amyloid PET burden in ADNI participants", "text": "Primary phenotype (annualized per cent change in global cortical amyloid burden) and GWAS data passing stringent quality control were available for 495 ADNI participants (Table 1) . Baseline age and gender were included as covariates in all analyses. The annualized per cent change in cortical amyloid burden was approximately normally distributed across the full sample ( Supplementary Fig. 2 ). Mean annualized rates of amyloid accumulation were higher in Alzheimer's disease (1.36%; n = 41) than in MCI (0.79%; P = 0.02; n = 294) or cognitively normal (0.66%; P = 5.47 Â 10 À3 ; n = 160) participants.\nAPOE \"4 is associated with higher rates of amyloid accumulation Because of its well-known association with Alzheimer's disease, prior to GWAS we investigated the effect of the APOE locus on longitudinal change in amyloid burden. Genotypes for APOE rs429358 and rs7412 were obtained for all but one participant. APOE \"4 carriers showed larger increases in amyloid burden over time compared to noncarriers (P = 9.00 Â 10 À6 ; Cohen's d = 0.42; Fig. 1A ). APOE \"2/\"3 participants displayed lower rates of amyloid accumulation compared to \"3/\"3 (P = 0.01; Cohen's d = 0.41), \"3/\"4 (P = 1.42 Â 10 À5 ; Cohen's d = 0.75), and \"4/\"4 (P = 1.57 Â 10 À4 ; Cohen's d = 0.84) participants (Fig. 1B) ."}, {"section_title": "GWAS of longitudinal change in amyloid PET burden", "text": "To identify additional genetic modulators of longitudinal change in amyloid burden, we performed a GWAS testing 6 112 217 SNPs, with baseline age and gender included as covariates (Fig. 2) . No evidence of systematic inflation of P-values was observed ( = 1.016; Supplementary Fig. 3) .\nA genome-wide significant association was identified on chromosome 3 for rs12053868, an intronic SNP in IL1RAP (P = 1.38 Â 10"}, {"section_title": "À9", "text": "; Fig. 3A) . The rs12053868-G allele was associated with higher rates of amyloid accumulation compared to the major (A) allele (Fig. 3B) . A large effect size was observed in homozygous GG participants (Cohen's d = 1.20) equivalent to an odds ratio of 8.79 (Borenstein, 2009) . Using stepwise linear regression with forward selection, this SNP explained 7.1% of the phenotypic variance in addition to, and independent from, the 3.4% explained by APOE \"4 status ( Supplementary Fig.  4 ). This association remained genome-wide significant (P = 5.80 Â 10\n) after the inclusion of APOE \"4 status, baseline diagnosis, years of education, baseline cortical amyloid PET burden (modelled as described in the 'Materials and methods' section), and the first three principal components from population structure analysis. No significant interactions were identified between rs12053868 and any of these factors, or age or gender. The effect of the G allele on higher rates of amyloid accumulation was present in both amyloid-negative and amyloid-positive participants as classified by the baseline PET scan ( Supplementary Fig. 5 ). Using voxel-wise analysis to further characterize the spatial effect of this SNP in the brain, we again observed an association of rs12053868-G with higher rates of amyloid accumulation, with significant clusters for this effect observed primarily in the bilateral frontal, medial, and lateral parietal, and lateral temporal lobes, as well as throughout the posterior and anterior cingulate cortex (Fig. 3C ).\nSuggestive associations with longitudinal change in amyloid burden (P 5 5 Â 10 À6 ) were also identified ( Fig. 2 and Table 2 ). These included additional SNPs in IL1RAP, as well as SNPs on other chromosomes within or near KCNG1 (potassium voltage-gated channel, subfamily G, member 1), UBR3 (ubiquitin protein ligase E3, component n-recognin 3, putative), and JAM2 (junctional adhesion molecule 2). Variants in BIN1 (bridging integrator 1) and CASS4 (cas scaffolding protein family member 4) which were identified in recent Alzheimer's disease case-control GWAS (Hollingworth et al., 2011; Naj et al., 2011; Lambert et al., 2013) Table 1) . Collectively, all SNPs tested in the GWAS (including the IL1RAP and APOE SNPs described previously) were estimated to explain 34% of the phenotypic variance based on a genome partitioning analysis (Yang et al., 2011) .\n; Cohen's d = 1.18 for GG versus AA). Although six additional common variants displayed strong association (P 5 5 Â 10 À4 ), pairwise linkage disequilibrium calculations (Supplementary Table 3 ) and conditional analyses suggested that these SNPs, while not complete proxies for rs12053868, were not independent from rs12053868. Using SKAT (Ionita-Laza et al., 2013), we identified a collective association of low-frequency and rare variants with rate of change in amyloid burden (P = 7.74 Â 10\n) and dominant (P = 5.26 Â 10 À9 ) genetic models. (C) Selected crosssectional slices (top) and surface renderings (bottom) from voxel-wise analysis of the effect of rs12053868 on longitudinal amyloid accumulation measured by 18 F-florbetapir PET. The colour scale indicates regions where the rs12053868-G allele was associated with higher rates of amyloid accumulation (GG 4 GA 4 AA). All comparisons are displayed at a voxel-wise threshold of P 5 0.001 (uncorrected) with minimum cluster size (k) = 175 voxels (approximately corresponding to a cluster-wise threshold of FDR-corrected P 5 0.05). Where applicable, the left and right cerebral hemispheres are labelled for orientation. As displayed, the most significant clusters (identifying regions where rs12053868-G exhibited the greatest effect on rates of amyloid accumulation) were observed in the bilateral frontal lobes, medial parietal lobes, lateral parietal lobes, lateral temporal lobes, and the anterior and posterior cingulate cortex.\nWe hypothesized that rs12053868-G would be associated with a greater likelihood of progression from MCI to Alzheimer's disease. Within the GWAS sample, 269/294 participants diagnosed with MCI at baseline had diagnosis information at 2-year follow-up, including 42 who progressed to clinical Alzheimer's disease and 227 who did not. Using logistic regression with age and gender included as covariates, rs12053868-G carriers were more likely to convert to Alzheimer's disease within the follow-up period than non-carriers [P = 0.025, odds ratio (OR) = 2.32 (1.11-4.87)] (Supplementary Fig. 8 )."}, {"section_title": "Gene-and pathway-based GWAS extensions", "text": "Using gene-based GWAS analysis, IL1RAP displayed genome-wide significant association with longitudinal change in amyloid burden [P 5 2.17 Â 10 À6 (0.05/23 000 genes)]. Additional genes not initially uncovered through single SNP analysis displayed strong gene-level associations (Table 3) . We also identified 83 biological pathways displaying enrichment of GWAS association, including numerous pathways related to cell adhesion and the complement system (Supplementary Table 2 ). ). (B) APOE \"2/\"3 participants displayed lower rates of amyloid accumulation compared to \"3/\"3 (P = 0.01), \"3/\"4 (P = 1.42 Â 10 À5 ), and \"4/\"4 (P = 1.57 Â 10 À4 )\nparticipants. Deep sequence analysis of IL1RAP\nTo further investigate the IL1RAP locus, we analysed gene sequence data for a subset of the GWAS sample (n = 435). Following stringent quality control, 1311 base pairs with at least one alternative allele present in the sample were available for analysis. Testing of 406 common variants confirmed a peak association with higher rates of amyloid accumulation for rs12053868 (P = 8.18 Â 10"}, {"section_title": "À3", "text": ").\nIL1RAP rs12053868 is associated with a marker of cortical microglial activation IL1RAP encodes a necessary component of the IL-1 (interleukin-1) receptor complex and its downstream signalling pathway (Gabay et al., 2010) . IL-1 is a potent pro-inflammatory cytokine known to promote activation of microglia, the resident phagocytes in the brain (Ghosh et al., 2013; Doens and Fernandez, 2014) . Recent reports have suggested that microglia may be crucial in clearing brain amyloid and limiting plaque growth (Chakrabarty et al., 2015; Condello et al., 2015; Johansson et al., 2015) . We hypothesized that the IL1RAP SNP associated with higher rates of amyloid accumulation would also be associated with lower microglial activation. We tested this in vivo in IMAS using PET and 11 C-PBR28, a radioligand considered to be a marker of microglial activity (Brown et al., 2007) . Controlling for age, gender, and TSPO rs6971 genotype, IL1RAP rs12053868-G was associated with lower cortical 11 C-PBR28 signal, indicative of lower cortical microglial activation (P = 0.031; Cohen's d = 1.33; Supplementary Fig. 6 )."}, {"section_title": "IL1RAP rs12053868-G carriers exhibit greater temporal cortex atrophy over 2 years", "text": "Amyloid deposition has been associated with increased rates of brain atrophy in cognitively normal older adults and in Alzheimer's disease (Storandt et al., 2009; Chetelat et al., 2010; Dore et al., 2013) . We hypothesized that IL1RAP rs12053868-G would be associated with higher rates of atrophy in Alzheimer's disease-specific regions (the bilateral temporal cortex) (Dore et al., 2013) . Using structural MRI in a subset of the GWAS sample (n = 358), rs12053868-G carriers exhibited greater declines in temporal cortex thickness compared to non-carriers (P = 0.035; Cohen's d = 0.28; Supplementary Fig. 7A ). This effect was observed across all diagnostic groups ( Supplementary Fig. 7B ) and remained significant (P = 0.042) after the inclusion of diagnosis (P 5 0.001) as an independent predictor variable."}, {"section_title": "IL1RAP rs12053868-G carriers exhibit greater likelihood of progression from MCI to Alzheimer's disease", "text": "Amyloid deposition in MCI is a predictor of clinical progression to Alzheimer's disease (Huijbers et al., 2015) . F-florbetapir SUVR (adjusted for age and gender) AE standard errors are displayed based on rs12053868 genotype. The minor allele (G) of rs12053868 was associated with a 0.8% increase per allele copy per year in cortical amyloid PET burden. The association of rs12053868 was genome-wide significant under additive (P = 1.38 Â 10"}, {"section_title": "IL1RAP rs12053868 is associated with accelerated cognitive decline in high risk individuals", "text": "Memory impairment is the cardinal early symptom of Alzheimer's disease (Ballard et al., 2011) and amyloid deposition is known to be related to memory impairment and longitudinal cognitive decline (Sperling et al., 2013; Villemagne et al., 2013) . We hypothesized that rs12053868-G would be associated with accelerated decline of memory in participants at high risk for amyloid pathology (defined as being APOE \"4 positive or having a baseline diagnosis of clinical Alzheimer's disease). In a meta-analysis of 579 participants from three independent cohorts (ADNI, MAP and ROS), rs12053868-G was associated with faster 2-year decline in verbal episodic memory performance (P = 7.72 Â 10 À4 ), with each copy of the G allele adding approximately one-quarter of a standard deviation to the rate of decline (Supplementary Fig. 9 ). The heterogeneity statistic (I 2 = 0, P = 0.37) indicated no significant heterogeneity across the individual cohort studies used for meta-analysis (Higgins et al., 2003) ."}, {"section_title": "Discussion", "text": "To our knowledge, this is the first reported GWAS of longitudinal change in brain amyloid load measured by 18 Fflorbetapir PET. Our findings support IL1RAP as a novel potential Alzheimer's disease target and highlight the use of amyloid PET as a valuable Alzheimer's disease endophenotype, particularly in a longitudinal framework.\nIL1RAP encodes a necessary and potentially rate-limiting component of the pro-inflammatory IL-1 signalling pathway (Gabay et al., 2010) . Activation of this pathway requires binding of IL1RAP to the IL-1/IL-1 receptor complex (Wang et al., 2010a) . IL1RAP splice variants, including one isoform expressed only in the CNS as well as a different soluble variant, exert inhibitory effects on the IL-1 pathway (Smith et al., 2009) . More broadly, the IL-1 pathway and its component genes have long been foci of interest in genetic and other studies of the Alzheimer's disease spectrum (Green et al., 2002; Wang et al., 2005; Tsai et al., 2010; Latz et al., 2013) . These studies, and recent findings from Alzheimer's disease mouse models revealing that IL-1 overexpression leads to increased plaque-associated activated microglia, decreased amyloid burden, and increased tau phosphorylation (Prinz et al., 2011; Ghosh et al., 2013) highlight the potentially crucial roles of the IL-1/IL1RAP pathway in modulating Alzheimer's disease pathology.\nMicroglial activation pathways are leading candidates for promoting amyloid clearance and limiting plaque development. Variants in TREM2 (triggering receptor expressed on myeloid cells 2) thought to impair microglial phagocytic function have been associated with increased Alzheimer's disease risk (Guerreiro et al., 2013; Jonsson et al., 2013) and large-scale pathway and network analyses have also implicated activated microglia in Alzheimer's disease pathogenesis Zhang et al., 2013) . Along with recent studies relating loss of microglial function to worsening amyloid pathology (Bradshaw et al., 2013; Chakrabarty et al., 2015; Condello et al., 2015; Johansson et al., 2015) , the discovery that IL1RAP is associated with higher rates of amyloid accumulation and lower signal of a PET marker for microglial activation provides strong reinforcement for this hypothesis.\nIL1RAP is a known therapeutic target for leukaemia (Barreyro et al., 2012; Askmyr et al., 2013) and chronic inflammatory diseases such as rheumatoid arthritis (Gabay et al., 2010; Dinarello, 2011) . Pathway analysis of a large Alzheimer's disease case-control GWAS (Harold et al., 2009 ) (n = 11 789) identified association of immune-related pathways with a significant contribution from IL1RAP, including a top Alzheimer's disease risk SNP (rs4571225; P = 1.26 Â 10"}, {"section_title": "À5", "text": ") which is not a proxy for, but is in moderate linkage disequilibrium with rs12053868 (r 2 = 0.003; D' = 0.63) ). An intergenic SNP (rs9877502) 290 kb downstream of IL1RAP also displayed genome-wide significant association with cross-sectional CSF tau levels (Cruchaga et al., 2013) , but this SNP is not in linkage disequilibrium with rs12053868 (r 2 = 0.003; D' = 0.10). Prior to our study, IL1RAP rs12053868 had not been previously reported in an Alzheimer's disease genetic association study. Our new association for this SNP may reflect a relative specificity for amyloid accumulation versus the more heterogeneous casecontrol status (Kendler and Neale, 2010) , increased power obtained via endophenotype analysis (Potkin et al., 2009) , or previous suggestive association below reporting thresholds.\nIL1RAP is highly expressed in the brain but seems to be downregulated in prefrontal cortex with increasing age (Kang et al., 2011; Primiani et al., 2014) . Although it is not a coding SNP, rs12053868 may be associated with decreased IL1RAP expression in the cortex and hippocampus based on preliminary data ( Supplementary Fig. 10 ). There is substantial precedent for non-coding SNPs to have functional effects (Kapranov et al., 2007; Consortium, 2012; De Jager et al., 2014) , and intronic IL1RAP SNPs have previously been associated with plasma levels of soluble IL1RAP, including a top SNP (rs724608; P = 8.81 Â 10 À13 ) which is in moderate linkage disequilibrium with rs12053868 (r 2 = 0.005; D' = 0.45) (Lourdusamy et al., 2012) . However, functional genomics studies in brain tissue will be needed to further characterize the IL1RAP locus and its potential impact on Alzheimer's disease pathogenesis.\nFollowing the GWAS discovery, we related IL1RAP rs12053868-G to other longitudinal Alzheimer's disease endophenotypes. In particular, the observed effect of rs12053868 on clinical progression in MCI argues for further study of the impact of IL1RAP on clinical trajectories in pre-MCI states. This result also suggests that in combination with APOE, other known Alzheimer's disease risk genes, and family history, IL1RAP might be useful for risk enrichment in clinical trial design and risk stratification in study analysis or as part of personalized genetic susceptibility tests for Alzheimer's disease onset or progression.\nUsing gene sequence data from a subset of the GWAS sample, we identified a pooled association of low-frequency and rare IL1RAP variants with the rate of amyloid accumulation. Although larger samples will facilitate assessment of the effects of individual rare variants, this finding bolsters the initial GWAS discovery of IL1RAP, as genes truly related to disease pathogenesis are likely to contain associated common and rare variants (Zuk et al., 2014) . Suggestive associations were identified through GWAS and may have reached genome-wide significance with a larger sample. These included SNPs in JAM2, adjacent to APP on chromosome 21. Mutations in APP are among the causes of early-onset Alzheimer's disease (Bettens et al., 2013) and a rare variant in APP was found to be protective against late-onset Alzheimer's disease (Jonsson et al., 2012) . SNPs near APP were also associated with amyloid plaque burden in a neuropathological study of post-mortem brain tissue (Shulman et al., 2013) . Notably, the top SNP from that study (rs2829887) is in strong linkage disequilibrium with the top JAM2 SNP (rs8129913) from our analysis of longitudinal amyloid PET (r 2 = 0.57; D' = 0.91). In addition, JAM2 (P = 1.59 Â 10"}, {"section_title": "À4", "text": ") and APP (P = 0.048) each displayed uncorrected gene-level P 5 0.05 in our study. These suggestive findings argue for further investigation of the JAM2-APP locus to clarify the potential functional gene(s) and causal variant(s) related to amyloid pathology.\nComplementary gene-and pathway-based analyses were used to test for collective effects of multiple variants within shared functional units (Ramanan et al., 2012b) . Genebased analysis uniquely identified additional candidates for further study, and enrichment of GWAS association was identified in pathways related to the complement system, cell adhesion, and Notch transcription, as well as the IL-1 pathway overall. Activation of cell adhesion and complement receptors are crucial for microglia to recognize, aggregate around, and ultimately clear amyloid deposits (Ramanan and Saykin, 2013; Doens and Fernandez, 2014) . Notch has key roles in regulating neuronal plasticity but these activities depend on its initial cleavage by -secretase, the enzyme also responsible for generating amyloid-b (Mattson, 2003) .\nAll SNPs tested in the GWAS were estimated to collectively explain 34% of the variance in 2-year change in brain amyloid PET burden, a considerable proportion given the modest sample used for GWAS. Although amyloid deposition and clearance are dynamic processes with unknown heritability, our findings indicate that the rate of amyloid accumulation has a substantial genetic component and suggest that additional genetic variants, as well as gene-gene and gene-environment interactions, may be discovered in future using larger samples and complementary analytical approaches.\nThis work has several limitations. Although we leveraged publicly available ADNI genetics and longitudinal amyloid PET data to perform this original study, our sample size had limited power for a GWAS ( Supplementary Fig. 11 ). The future availability of comparable data from larger samples will allow for suitable replication testing and additional discovery. Functional genomics experiments not performed here, including microglial immunohistochemistry and analyses of IL1RAP knockout and antibody-and siRNA-based knockdown models, will also be needed to characterize our novel finding. In particular, studies of brain tissue, rather than blood genomic DNA, will be better able to assess for epigenetic and transcriptomic events that may elucidate the mechanistic relationship between IL1RAP and amyloid accumulation. Further, while it could not be appropriately addressed with presently available data, analyses of serial CSF samples would help assess whether IL1RAP impacts soluble and oligomeric forms of amyloid. Finally, candidate PET radiotracers selective for tau aggregation in the brain are also now in clinical trials (Villemagne et al., 2015) , and if validated, would aid investigation of the potential relationship between the IL-1/ IL1RAP pathway and tau pathology.\nIn conclusion, we discovered a new association of IL1RAP rs12053868 with higher rates of amyloid accumulation on longitudinal 18 F-florbetapir PET and we related this SNP to other Alzheimer's disease endophenotypes, including clinical progression, cognitive decline, temporal cortex atrophy on MRI, and lower signal of a PET marker of microglial activation. The biological roles of IL1RAP in amyloid deposition and clearance, particularly in relation to microglial function, merit further investigation and may have significant implications for risk stratification and therapeutic development in Alzheimer's disease. Heald, and Nathan Lavender, for their assistance with genome sequencing analyses. For IMAS, we acknowledge the support of NIH R01 AG19771 and P30 AG10133, as well as the Indiana CTSI (NIH grants U54 RR025761, RR027710-01, and RR020128) and also thank the radiochemistry team, Kevin Perry, Michele Beal, and Courtney Robbins for scan acquisition. For ROS and MAP, the authors acknowledge the support of the Rush Alzheimer's Disease Center and NIH R01 AG15819, AG17917, AG34374, P30 AG10161, and P01 AG09466. Data management and the specific analyses reported here were also supported by NIH R01 LM011360 and R00 LM011384, as well as NSF IIS-1117335. The authors declare no conflicts of interest."}]