[{"section_title": "", "text": "any data on student race and ethnicity (e.g., California's \"Racial Privacy Initiative,\" Adversity.net, 2003) , and when accurate assessment of the effects of national education policies related to the No Child Left Behind (NCLB) Act is needed, the ways in which data on student race and ethnicity are collected, aggregated, and reported have never been more important. As well, the movement among students of mixed heritage to self-report data on race and ethnicity (see Campus Awareness and Compliance Initiative, 2005 ) cannot be ignored by policymakers and researchers who believe that individuals can and should have the right to determine how they will be counted in data that bear upon their educational and social experiences. At an individual level, the ability to self-identify in categories that accurately represent one's heritages and lived identity has been shown to promote positive psychological outcomes, for example higher self-esteem, higher efficacy possible selves, and lower stereotype vulnerability (Binning, Unzueta, Huo, & Molina, 2009; Shih et al., 2007; Shih & Sanchez, 2004; Townsend, Markus, & Bergsieker, 2009 ), which may be linked to learning.\nThough states bear primary responsibility for educational policy, federal policies affect how data on student race and ethnicity are collected, reported, and aggregated. In 1996, 73% of public schools surveyed by the National Center for Education Statistics (NCES) and Department of Education's Office of Civil Rights (OCR) reported collecting data on student race and ethnicity using only the federal government's \"choose one only\" four-category system 1 then in place (NCES, 1996) ; by 2007, a full decade after the adoption of the Office of Management and Budget (OMB) Directive 15 that stipulates a \"Two or more races\" option in federal data on race, 2 the Department of Education (DOE) continued to report elementary and secondary pupil data in the four \"choose one only\" categories used before Directive 15 (see Sable & Garafano, 2007) . And although individual 1 From 1977 to 1997, the four minimum categories for race were American Indian or Alaskan Native, Asian or Pacific Islander, Black, and White. Ethnicity was \"Hispanic Origin\" or \"Not of Hispanic Origin\" (Office of Management and Budget, 1977) . Census respondents were not permitted to choose more than one racial category.\n2 As of October 1997, the five minimum categories for race are American Indian or Alaska Native, Asian, Black or African American, Native Hawaiian or Other Pacific Islander, and White. The two options for ethnicity are: Hispanic or Latino and Not Hispanic or Latino (Office of Management and Budget, 1997) . Census respondents were permitted to choose more than one racial category, and all federal agencies were required to permit two-or-more-race reporting by January 1, 2003. It is important to know how the statistics change when Hispanic or Latino origin is included and excluded from the data, as colloquial understanding of la raza (literally, \"the race\") as a racial group runs counter to the federal definition of Hispanic or Latino ethnicity. And when researchers recruit biracial, multiracial, and mixed heritage individuals to participate in studies (see Renn, 2004; Wallace, 2001) , high school and college students with a Latino or Latina parent respond, seeing themselves as part of a mixed race student movement that includes \"Blaxicans\" (Black and Mexican), \"Mexipinos\" (Mexican and Filipino), and \"Japoricans\" (Japanese and Puerto Rican) (MixedFolks.com, n.d.) . See also Brown, Hitlin, and Elder (2006) on latino identity among adolescents. In lived experience, if not in policy, some young people identify as multiracial when the federal government might define them as multiethnic. In this article, I will specify when and how I am using the Hispanic/Latino category in my arguments.\npostsecondary institutions can collect data in categories of their choice, federal policies that dictate the racial and ethnic categories in which institutions must report the data in mandatory surveys (e.g., IPEDS, the Integrated Postsecondary Education Data System) remain the standard for racial/ethnic data collection, reporting, and aggregation in higher education (Renn & Lunceford, 2004) .\nMandatory adoption of the 1997 OMB standards in education will not occur until the 2010-2011 school year (DOE, 2007) . The result is that although the OMB specifically noted that self-identification of race and ethnicity was a critical aspect of the data collection process (Office of Management and Budget, 1997), many students-and the parents who may report on behalf of school-age children-do not yet have the ability to identify in more than one category. A further result is that data from different reporting bodies (state systems, individual institutions, etc.) is not comparable; the national picture cannot be made clear because data are collected, aggregated, and reported in divergent ways that cannot be mapped across K-12 systems into higher education, or even across grade levels within systems. In 10 years, the federal directive that \"The racial and ethnic categories should be comprehensive in coverage and produce compatible, nonduplicative, exchangeable data across Federal agencies\" (Office of Management and Budget, 1997) has not been met, while critical education policy decisions (e.g., school desegregation and college admissions) that rest on accurate data on student race and ethnicity have been made.\nIn this article, I discuss the development of K-12 and postsecondary education data policies and analyze the influence of these policies on education systems and multiracial students. While there have been a few studies of K-12 school policies related to multiracial students (e.g., Lopez, 2003) and some work on postsecondary policies (e.g., Padilla, 2005; Renn & Lunceford, 2004; Smith, Moreno, Clayton-Pedersen, Parker, & Teraguchi, 2005) , there has yet to be an integrated synthesis of educational policy and policy implications for individuals of more than one race. This work is complicated by the nature of U.S. education data policy, which is largely a state-by-state matter, but which intersects at critical points with data policy of the U.S. DOE, the NCES, and the U.S. Census Bureau. Although data policy operates at a distance from the everyday lives of students, its effects permeate the educational system from kindergarten through graduate school, affecting the learning environment and potentially the development of multiracial students."}, {"section_title": "Data on Race and Ethnicity in Public K-12 Schools", "text": "K-12 education data on race and ethnicity has been regulated on a state level, leading to a diversity in ways that these data are collected, aggregated, and reported by schools, school systems, and state departments of education. Public school data on student race and ethnicity are maintained at a minimum of four levels: school, district, state, and federal. Varying degrees of freedom may be permitted for identification of multiracial students at each level, though it is rare for individuals providing information to be told how their data will be aggregated and reported. So while a school district, or local education agency (LEA), may collect data in, for example, the five new standard racial categories with the option to choose more than one, the State Education Agency (SEA), to whom the LEA reports data, must in turn report the data to the NCES via the Common Core of Data system (CCD), which follows the DOE guidelines and reports only one race per pupil, in the four old categories. At least two concerns arise from the K-12 data status quo: (a) There are no accurate data of the multiracial population in K-12 public schools that could be used in policy decisions that will affect these-and other-children, and (b) The rights of individuals to self-identify racially are being abridged in practice, if not in policy. I will discuss multiple implications that flow from each of these concerns."}, {"section_title": "Mixed-Race Schoolchildren in the United States", "text": "Before addressing these concerns, however, I will provide an overview of what is known of the population of mixed-race schoolchildren in the United States. Lopez (2003) crafted a very useful national picture of mixed-race schoolchildren. Lopez based her analyses on data from Census 2000, which while they must be acknowledged for limitations related to how Census data are collected (e.g., one adult per household completes form) and how parents choose to report data on multiracial children (see Brunsma, 2005) represent the best national picture of the U.S. population. She disaggregates the 2.4% of the total population (see Jones & Smith, 2001 ) responding as Two or more races by 5-year age groups, demonstrating that the younger the individual, the more likely he or she is to be of more than one race. Excluding respondents who indicated Latino or Hispanic ethnicity, Lopez revealed that 3.08% of 15-to 19-year-olds, 3.43% of 10-to 14-year-olds, 4.04% of 5-to 9-year-olds, and 4.94% of those under age 5 were more than one race. So the school-age population (5-19) is between 3% and 4% mixed race, with a larger percentage (nearly 5%) of preschool children following them. Lopez (2003) provided an even more striking picture by isolating data by state and including individuals-both school-age and total population-who reported Latino ethnicity. These tables reveal regional trends in the Two or more races population (with Pacific/West, Southwest, and Mountain/West regions generally having larger percentages than other regions). They also make clear the disproportionate need for some states to address the question of education data policy at the level of SEA. For example, Hawaii's under age 18 population is 37% two or more races, 39% mixed race including Latino and one non-White race, or 41% mixed race including Latino and one race (the adult populations are 21%, 23%, and 24%, respectively). Alaska's school-age population is 10% Two or more races, not including Latinos (5% of adults). Seven percent of California's school-age population is Two or more races, but 9% mixed race including Latino and one non-White race or 25% mixed race including Latino and one race. Mixed race including Latino and one race populations among schoolchildren in Nevada was 21%, in New Mexico was 32%, in Arizona was 22%, in Texas was 27%, and in Colorado and Florida were 17%. Even in the Northeast, where there is a relatively low percentage of mixed-race census respondents, Rhode Island and Connecticut were 11% and 10%, respectively, when Latino was included.\nAlthough these numbers may not seem large, especially when Latinos are excluded from the calculation of the Two or more races population, consider that mixed-race individuals are currently reported in some single-race category by SEA to the NCES CCD. If they were removed from those single-race categories and placed into a \"Two or more races\" category, the numbers might begin to affect policy decisions and resource allocation based on racial distribution of pupils. Examples of such implications include OCR monitoring of school segregation and \"possible racial discrimination in ability grouping, discipline, athletics, financial aid, and programs for special populations\" (NCES, 1996, p. 13) . Lopez (2003, p. 33) pointed to additional areas where racial/ethnic data are used, including funding for programs designed to promote equal opportunity and the planning needs of schools serving Native American children on or adjacent to reservations. In short, the numbers matter, and being able to account accurately for the Two or more races population will matter increasingly."}, {"section_title": "Collecting and Reporting Data on Race/Ethnicity of K-12 Pupils", "text": "Data collection, aggregation, and reporting on K-12 student race and ethnicity starts at the school level for such purposes as reporting Adequate Yearly Progress (AYP) for the NCLB Act, and moves up through the LEA to SEA to the CCD of the NCES. At each point, policies guide what categories are available and how individuals should be reported. In 1995, as part of the process that led to the 1997 changes in OMB Directive 15, NCES conducted a survey to learn how schools were collecting data (NCES, 1996) . They determined that 55% of schools collected data on student race and ethnicity only at the time the student registered in the school district; nearly all asked parents to identify their children, though \"observation\" (i.e., teachers or administrators looking at the children's-and possibly also their parents'-physical characteristics) is the norm in 22% of schools (44% in the Northeast).\nNCES further determined that 73% of schools used only the five standard federal categories for race and ethnicity, yet 41% of schools indicated that the five standard categories were not sufficient to describe their students. Of the 27% that did not use only the five standard categories, 10% used \"other\" or \"undesignated\" with a space for indicating heritage, 5% used \"other\" without a space for indicating heritage, and 5% used a general \"multiracial\" category. The remaining 7% included a specific heritage such as Filipino. Critically, about half of the 27% allowed the district to determine how to report students from these nonstandard categories, and about half allocated the students to the standard categories before reporting the data to the district, which then would report the data up through the SEA to the NCES.\nA 1997 follow-up study (NCES, 1998) examined the SEA-level data collection, aggregation, and reporting. Thirty-eight states used the five standard categories and 12 used or were considering using modifications, usually as a result of complaints or comments from parents or school districts (NCES, 1998, pp. 10-12) . A few states (e.g., Alaska, California) with high percentages of multiracial children were among those twelve, but Hawaii noticeably was not. Thirty-six states reported that they had no procedure for dealing with \"nonconforming data\" (i.e., other than the five categories) because \"the data they receive from the school districts always conform because their systems of data collection do not permit any variation from these categories\" (p. 8). Twelve states contacted districts with missing or nonconforming data and ask them to put data into one of the five categories or another state-approved other category. Three states submitted nonconforming data to NCES as missing, unidentified, or other. These findings reinforce the concern that individual-level data from multiracial children is not transferred up through the data reporting system.\nAnnounced after these two studies were conducted, OMB's Directive 15 (1997) required collecting and reporting multiple races in the 2000 Census and in all other federal data by January 1, 2003, but in practice the directive has not yet been fully implemented in K-12 or postsecondary education. After substantial discussion and debate among federal agencies, competing plans were put forward (see Renn & Lunceford, 2004 , for description of the policy process). In September 2006, the DOE OCR closed comments on Proposed Guidance on Maintaining, Collecting, and Reporting Data on Race and Ethnicity to the U.S. DOE (DOE, 2006) . Rather than include proposals that came up through the education community and that might best reflect the needs and interests of schools and schoolchildren, the DOE (2006) adopted the guidelines and implementation plan of the Equal Employment Opportunity Commission (EEOC), explaining\nThe Department repeatedly has heard from educational institutions that they would prefer that the various Federal agencies involved in data collection all use the same aggregate categories so that the burden of implementing changes is minimized and educational institutions are not forced to provide different and/or inconsistent data on race and ethnicity to Federal agencies. In response to these repeated requests, the Department decided to wait to propose its implementation plan until after the EEOC announced its final implementation plan, which was published in November 2005, because the EEOC collects data on race and ethnicity for staff in elementary and secondary schools and districts. (p. 44,868) This desire to adhere to the EEOC plan was reiterated in the Final Guidance on Maintaining, Collecting, and Reporting Data on Race and Ethnicity to the U.S. DOE (DOE, 2007) . The plan requires a two-question format in which the first question asks whether the respondent is Hispanic or Latino and the second question asks the respondents to choose one or more races from the five groups identified in OMB Directive 15 (1997): American Indian or Alaska Native, Asian, Black or African American, Native Hawaiian or Other Pacific Islander, and White. From these categories, the proposal was to have seven aggregated categories for reporting race and ethnicity: The DOE guidance provides the option for states (and presumably schools) to define racial and ethnic groups using different (more, less, or different) categories from those above; data must be aggregated into these seven categories for federal reporting. Elementary and secondary schools are not permitted to use an \"unknown\" category, although postsecondary institutions may continue to do so. Students-and in the case of elementary and secondary schools, their parents on their behalf-should be allowed to self-identity, although observer identification is still permitted and is, in fact, required for K-12 pupils whose parents refuse to identify them in the official categories. The NCES National Forum on Education Statistics has convened a Race/Ethnicity Working Group to develop a tool to help SEAs and LEAs implement these changes in data collection and aggregation (NCES, 2007) .\nThere are at least three troubling outcomes of adopting the EEOC guidelines. First, although the plan allows LEAs and SEAs to collect data in additional or different categories, the requirement to report to NCES in these seven categories will likely have two effects that restrict this flexibility in practice and in intent: (a) Many LEAs and SEAs will conform as a practical matter to the federal categories and (b) Even if LEAs and SEAs collect data in different categories, they will violate the \"self-identification\" intent when they aggregate data for reporting to NCES. Second, the guidance from NCES leaves off the ability to report specific racial/ethnic combinations, which was a key component of earlier NCES proposals (see Renn & Lunceford, 2004) , and a hotly debated issue leading up to the OMB decision not to include a \"multiracial\" category in the 1997 revised guidelines. Multiracial children will be represented in the \"Two or more races\" category-and this is surely better than having them disappear into the monoracial categories as they did before-but differences in racial/ethnic composition of schools and in student achievement will be masked under the new guidelines. Of course, at the local and state levels, individual records could be used to understand the composition of the \"two or more races\" population. At the federal level, however, self-identification in more than one racial category will lose much of its meaning to those individuals who seek accurate representation of individual heritages (e.g., Asian and Black) rather than a nonspecific, multiracial category (e.g., two or more races).\nFinally, the DOE recognized \"the creation of a multiple race aggregation category has implications for several requirements under the (Elementary and Secondary Education Act) as reauthorized by NCLB regarding race and ethnicity\" (2007, p. 59,277) . These implications include AYP reports that hold schools accountable for such outcomes as percentage of students in each major racial and ethnic group who are proficient in reading/language arts and math. Schools have been permitted-and will remain so under the 2007 Final Guidance-to identify locally relevant \"major racial groups\" for AYP reporting. Schools will have the option of reidentifying these groups to align with the new standards for collecting and reporting pupil race and ethnicity or of bridging data from the new categories back into the old ones (e.g., by combining the new Asian and Native Hawaiian or other Pacific Islander categories into the old Asian/Pacific Islander group). Unless schools align \"major racial groups\" to the new aggregated categories, the spirit of self-identification and multiple race reporting will be lost when multiracial children are assigned to a single-race group. The high-stakes nature of changing AYP major racial groups may dissuade school leaders from honoring the spirit of the new DOE guidelines."}, {"section_title": "Data on Race and Ethnicity in U.S. Postsecondary Education", "text": "Postsecondary education policy on race and ethnicity data is also in transition, with the NCES still collecting institution-level data using the 1977-not the 1997-OMB choose-one-only racial and ethnic categories. The primary means of data collection at the national level is the IPEDS, roughly analogous to the CCD for K-12 schools but without the intervening layer of LEA and SEA where data may be aggregated according to policies outside the control of the individual school. Once a year, every postsecondary institution-public and private-in the United States reports directly to IPEDS on student enrollment, including data on student race and ethnicity. Postsecondary institutions have the option to report \"Race/ethnicity unknown,\" as well as \"Nonresident alien\" (for international students). There are no accurate data on or even very good estimates of the number of mixed-race college students, although as the percentage of multiracial youth grows, it seems probable that the number of multiracial college students will also increase.\nThe road to implementing the 1997 OMB Directive 15 in postsecondary education has involved multiple turns and switchbacks. A variety of interest groups contributed to the 10-year delay in implementation, the procedures of which are not yet in place. Postsecondary institutions, represented through national associations (e.g., American Association of Collegiate Registrars and Admissions Officers, American Council on Education, Association for Institutional Research) weighed in, seeking clear guidance before institutions made changes in data collection and record keeping. Government agencies (e.g., DOE Office of Civil Rights, OMB) made proposals and counter proposals. And individuals with particular interests (e.g., multiracial individuals and their parents) sought input through organizations of biracial and multiracial people (e.g., Association of MultiEthnic Americans, MAVIN Foundation). Although multiple stakeholders were involved, the delays in implementation centered mainly on interagency disagreements (Renn & Lunceford, 2004) , and the national interest in having compatible data across government agencies appears to have trumped the interests of the education community, as evidenced in the NCES capitulation to the EEOC guidelines for aggregation and reporting. Earlier proposals from NCES favored a two-table system for reporting duplicated and unduplicated counts of students, and the OCR favored reporting specific combinations of races (see Renn & Lunceford, 2004) . Either of these plans would provide more detailed information for students, institutions, and researchers interested in the racial composition of colleges and universities and would have more closely adhered to the philosophy of self-identification from initial response through data aggregation.\nNearly all (98%) postsecondary institutions collect data on student race and ethnicity only at the time of the student's application (Renn & Lunceford, 2004) . Within this group, there is wide variation in how data are collected; many institutions use the \"choose one only\" old categories, some include Latino or Hispanic as a racial category, and some even ask the question differently on different forms of application (e.g., paper application or online application) (Padilla, 2005 ). An increasing number of students do not indicate their race/ethnicity, and this group is composed mainly of white students and multiracial students (Smith et al., 2005) . Some institutions provide a wide range of ethnic identity options, especially for Asian and Latino identities, and then consolidate that information into the five standard categories for state system and IPEDS reporting (Renn & Lunceford, 2004) . The result of this variation is that, at a time when racial data matter as much as ever, it is nearly impossible to provide an accurate analysis of the state of multiracial individuals in postsecondary education, even when comparing trend data from a single institution. In order not to make the situation even worse, a number of institutions that might have changed to allow multiple race reporting in the last 10 years have held off changes to their data collection practices since 1997, awaiting guidance from IPEDS (Renn & Lunceford, 2004) "}, {"section_title": "Effect of Changes on Policy, Practice, and Multiracial Individuals", "text": "K-12 and higher education data policies regarding multiracial students have implications for individuals, institutions, and K-16 education in the United States. There is evidence that how racial and ethnic data are collected influences students' identity choices (see Padilla, 2005; Renn, 2004 : Townsend et al., 2009 , and choice of identification influences identity development processes and self-esteem (Shih, Bonam, Sanchez, & Peck, 2007; Suzuki-Crumly & Hyers, 2004; Shih & Sanchez, 2005) . There is also evidence that how institutions collect data influences the quality of those data (Smith et al., 2005) and their usefulness in crafting institutional programs. And as much as K-16 education can be called a \"system\" in the United States, there is evidence to suggest that the inconsistency of data collection, aggregation, and reporting at all levels of education influences what can be known about the status of multiracial individuals in it (NCES, 1998; Renn & Lunceford, 2004; Smith et al., 2005) ."}, {"section_title": "Implications for Multiracial Individuals", "text": "The issue of self-identification (or parental identification of school children) in reporting race and ethnicity is often stated but frequently lost in the discussion of data policy, and it has implications for identity and identification of multiracial individuals (Binning et al., 2009; Townsend et al., 2009) . From the start of the movement for multiple race reporting in the early 1990s, accurate self-identification has been a motivating force for change (Pittinsky & Montoya, 2009) , in no small part because multiracial people and their families recognize the ways that the act of reporting racial identity is closely tied to psychological and sociological constructions of those identities (Renn & Lunceford, 2004; Townsend et al., 2009) .\nThe theme of \"checking boxes\" to identify race-and the dilemma of having no box to represent them-has been persistent in the literature by and about multiracial schoolchildren and college students (e.g., Bracey, Bamaca, & UmanaTaylor, 2004; O'Hearn, 1998; Renn, 2004; Rockquemore & Laszloffy, 2005; Shih & Sanchez, 2004; Townsend et al., 2009; Wallace, 2001) . In this literature, young people repeatedly describe how they feel left out, invisible, and/or angry when faced with a school (or camp or sports) form that requires them to choose one race from the four or five presented to them. If they live in an area with few other multiracial children, they may feel especially challenged to explain their family's heritage and may experience peer pressure to fit in by electing to identify with one racial group or another; often physical features (skin color, hair texture and color, etc.) play a substantial role in determining with which group the young person will publicly identify (AhnAllen, Suyemoto, & Carter, 2006; Bracey et al., 2004; Renn, 2004; Rockquemore, 2002; Shih et al., 2007; Townsend et al., 2009) . But time and again, the issue of institutional recognition of identity arises, often in relation to schooling and to college applications. The degree of impact that data collection format has on individual identities has not been subject to broad empirical testing, but it is a clear, persistent, and ongoing theme in research related to multiracial identity and there is clear evidence that having a multiracial identity is psychologically beneficial to individuals from mixed heritage backgrounds (see Binning et al., 2009 , Bracey et al., 2004 Shih et al., 2007; Shih & Sanchez, 2005) and that how data are collected influences, at a minimum, motivation, self-esteem, and task performance in an experimental setting (Townsend et al., 2009) .\nOn an institutional level, accurate self-identification of multiracial students allows for the provision of programs and services that might be useful for student success, learning, and development. For example, colleges and universities offer a variety of academic, social, and support systems for students from underrepresented groups (e.g., racial groups, first-generation college goers, students with disabilities). A small but increasing number of institutions offer activities such as student organizations or cultural events specifically for multiracial students (see Campus Awareness and Compliance Initiative, 2005) ; with no easy way to identify multiracial students, organizers rely on announcing programs via already cacophonous campus communication formats of flyers, email, and online social networking (e.g., Facebook.com). Fledgling student groups at many institutions rely on word of mouth, resulting in student groups that may reflect some heritage combinations at an institution, but not all (Renn, 2004) . Because college has been identified by a number of multiracial adults as the place where they first encountered other biracial individuals (Kilson, 2001) , and because student groups have been found to play a role in biracial identity development (Renn, 2000 (Renn, , 2003 university efforts to increase the probability of students encountering these groups would seem like a good strategy. Collecting data in a way that allows institutions to identify these students would facilitate this process, and the plan to collect data allowing respondents to check more than one category will be a useful step in this direction, even if the data are later conflated into one \"two or more races\" category for IPEDS.\nIt is not clear how the ability to self-identify in multiple categories might affect student learning outcomes in the K-12 schools, though there is evidence that being able to choose to identify with more than one race has positive psychological outcomes such as higher self-esteem, higher efficacy possible selves, and lower stereotype vulnerability (Binning et al., 2009; Shih et al., 2007; Shih & Sanchez, 2004; Townsend et al., 2009 ) that are related to higher academic achievement. Importantly, the change in data collection and reporting-especially when schools choose to include multiple race groupings in their NCLB AYP reports-will make it easier to understand multiracial students' academic achievement in local, regional, and national contexts. For the first time, it will be possible to construct a national picture of multiracial schoolchildren.\nThere is no evidence to explain how the diverse data collection methods currently in place across states affect student learning, development, achievement, or college access. The pending change in data collection and reporting provides a rare opportunity for quasiexperimental research on a large scale. If, for example, individuals are given the opportunity to reidentify themselves (as recommended by the DOE, 2007), a very interesting \"snapshot\" of pre-and postmultiple race data collection could provide some additional insight into the phenomenon of adolescents identifying differently at home and at school (Brown, Hitlin, & Elder, 2006; Harris & Sim, 2002) and college students identifying \"situationally\" (Renn, 2003 (Renn, , 2004 Wallace, 2001) ."}, {"section_title": "Implications for Data Quality and Utility", "text": "Even before the 1997 changes were to have taken effect, members of the education data community expressed concern about the quality of data obtained under a new system and the ability to use data from before and after the change. There is evidence to suggest that the quality of data, at least with regard to understanding the multiple race population, was never all that strong; the NCES (1998) study of how states dealt with missing or nonconforming information revealed that SEAs were already making decisions that would affect the accuracy of data on K-12 student race and ethnicity. Postsecondary education data are no better, except that there is no intervening agency between institutions and the NCES; the provision of an \"Unknown\" category at least provides a catchall descriptor should institutions choose to allow more than one race responses and not aggregate them into the singular categories. Given the data policy status quo, there is a possibility that the quality of data will actually improve under the new guidelines; debates can be had over the wisdom of adopting the EEOC reporting guidelines that include a \"Two or more races\" category instead of specific combinations, but schools and universities will be expected to allow students and parents to indicate more than one race, an improvement for multiracial individuals and for administrators and policy analysts who seek more accurate information on student demographics.\nThe utility of the new data-and the ability to create trend data from before and after the change-has also been a concern. The 1997 NCES study asked states about the transition, and one third of the states (17) reported that changes would impede comparisons across time and/or affect enrollment projections (NCES, 1998, p. 14) . Thirteen additional states responded that the extent of the impact would depend on the exact nature of the changes, and only 10 states indicated the impact would be \"none or minimal.\" The postsecondary sector has not been asked this question in a systematic fashion, but predictions of the impact on trend data are serious at an aggregated level. Individual institutions, however, could create their own data crosswalks and bridges to portray with some accuracy how multiracial students appear in the data before and after the change (DOE, 2007; Renn & Lunceford, 2004) . A critical aspect of such portrayal will be institutional attempts to resurvey all students, which would result in data that could be used to create bridging formulas sensitive to local racial/ethnic dynamics (Renn & Lunceford, 2004) . The DOE (2007) Final Guidance strongly recommends that educational institutions and school systems provide the opportunity for all students and staff to identify themselves under the new guidelines.\nTo a great extent, the utility of the data for trend analyses will depend on how old and new data are linked. There have been multiple proposals for bridging old and new data (e.g., Allen & Turner, 2001; Grieco, 2002; Renn & Lunceford, 2004) , including recommendations from the Office of Management and Budget (2000) . NCES will permit states and educational institutions to create their own bridging plans to, for example, collapse the new race/ethnicity data collected under the two-question, five race, choose-all-that-apply format into the five old categories (Department of Education, 2006) . Allocation may be proportional to the overall population, or might reflect some other local formula. Bridging policies must be available to the NCES and NCES recommends making them available to respondents as well. Of course, these methods still do not make the data fully compatible, and if institutions and states continue the practice of collapsing the data into the old categories-which could continue ad infinitum-both the spirit of Directive 15 and the accuracy of the data will suffer.\nA final caveat for data quality is that self-identification in racial and ethnic categories has been found to be fluid and situational (Brown et al., 2006; Harris & Sim, 2002; Renn, 2003 Renn, , 2004 . So it may always be the case that whatever data on student race and ethnicity that education leaders, policymakers, and researchers captures only the moment in time when a student or a students' parent checked one or more boxes on a school registration form or college application. Honoring the spirit of Directive 15 and the DOE (2007) Final Guidance in terms of selfidentification and multiple race reporting is important, but it is equally important to remember that the entire business of collecting and reporting data on race and ethnicity is a slippery one."}, {"section_title": "Implications across Education System", "text": "Policy concerns arise from the incompatibility of data for the past decade, a decade that has seen the implementation of the NCLB Act of 2001, arguably the federal education policy initiative with the greatest impact on schools (if not children) in decades. The emphasis on school-level accountability in NCLB has promulgated the creation of extensive data sets of pupil-and classroom-level data, which may have policy and research uses of interest beyond NCLB itself. Examples include comparisons of academic progress across racial/ethnic groups or following racial/ethnic groups through the educational pipeline. But researchers and policy analysts will run quickly into trouble when trying to compare groups over time; local variations in data collection and state-and national-level changes in reporting and aggregating racial/ethnic data have created data that cannot be tracked without returning to the LEA data sets, and even then, must be understood with caveats clearly in mind. NCLB, as a matter of policy and practice, is named specifically in the DOE (2007) guidance on collecting and reporting race, and states are given some leeway in determining what constitutes \"major racial and ethnic groups of students\" (p. 59,277) .\nIn addition to NCLB accountability measures, data on student race and ethnicity have been used in efforts to desegregate public schools and to keep them from resegregating, an increasing trend (Frankenberg & Lee, 2002) . The June 2007 decision by the U.S. Supreme Court (Parents Involved in Community Schools, 2007) to end the use of race as a factor in assigning children to schools-a tool that was being used voluntarily to avoid (re)segregation of schools in Seattle, Washington and Jefferson County, Kentucky-will substantially alter these efforts in many school districts, but the ability to understand district-wide student demographics and to have accurate portraits of school-level demographics will remain critical tools for policymakers and educational leaders. The ability under new guidelines to tailor collecting and reporting at the local and state levels will be an important vehicle for local and state decisions.\nOn a larger scale, individuals seeking a national portrait of education demographics may be frustrated by SEA data as reported to NCES. When Hawaii, for example, reports all of its multiracial students (37% of the total) as Two or More Races, the single-race categories will be substantially disrupted, no matter how bridging is accomplished. Arguments that the number of multiracial students is so small that it will not have a major effect on national data can be countered with the reminder that the multiracial population in schools is growing and will continue to grow, and that when including students with Latino heritage, the numbers are quite substantial in some of the largest states in the nation (e.g., California, Texas, New York).\nThe student population of postsecondary education is both smaller than the K-12 school population and, for now, less diverse racially and ethnically. The demographics of the multiracial population are such that a smaller percentage of adults than of children identify as more than one race. Yet policy initiativesaffirmative action and others-to increase access to higher education, especially to members of groups that have been historically underrepresented in postcompulsory education, often rely on demographic data to assess effectiveness and progress. The assumption that those data accurately reflect both the actual heritage and the self-identification of college students has gone unquestioned, and the transition to Directive 15 implementation could have unanticipated consequences for institutional research, statewide assessment, and national trend data. For example, shifting multiracial students from underrepresented single-race category Black/African American into the Two or more races category will make it more difficult to know whether efforts to recruit and retain students with Black/AfricanAmerican heritage are effective.\nEven though the transition to the new standards may disrupt data in K-12 and postsecondary systems, attempts to link K-12 and postsecondary data, an increasing area of state education policy and practice, may be facilitated by the new guidelines. A positive outcome of the attention to collecting and reporting data on student race and ethnicity may be a more uniform approach across all levels of education. At a minimum, the need to reconfigure data collection and tracking processes and software may trigger states to coordinate public school and higher education systems. It is possible that within-state data may become more useful information for policymakers and the interested public.\nIt is also possible that the change to multiple race reporting will facilitate a more clear understanding of academic achievement across monoracial and multiracial groups. There are no current data in the CCD or IPEDS on the K-12 academic progress or postsecondary participation of multiracial students. There is no evidence to support claims that multiracial students perform better or worse than monoracial children, but pulling multiracial students out of the monoracial categories may show that they have been. What will not be clear from the use of a combined Two or more races category is how students from different heritage backgrounds perform compared to one another. So while the change may facilitate improved programs and services for monoracial students in need of support, they may not provide enough information to identify multiracial students from different backgrounds in need of assistance. Or needs of some groups of multiracial children may be masked by better achievement among students from other groups."}, {"section_title": "Implications for Researchers", "text": "Education researchers frequently work from national data sets such as IPEDS and the CCD. Local and state-level analyses rely on data maintained by state departments of education. Under the Final Guidance (DOE, 2007) , these data sets may continue to include whatever data on race and ethnicity are locally appropriate and useful. The transition to the new data policy creates opportunities and challenges for researchers working with local, state, and national data. Researchers may have openings to influence the practices used to collect and aggregate data on the local and state levels, prior to aggregation for national reporting. Maintaining access to, for example, data on specific combinations of heritages (akin to the OCR model for reporting four most common multiple race responses) could enable analyses of demographic change among school-age children, academic progress, and college access for multiracial youth. Furthermore, the opportunity to have for the first time national data that reflect the presence of multiracial youth in schools and higher education, even though these data will not be accessible at the level of specific heritage combinations, should facilitate research on this population.\nResearchers will need to take particular care with data that are collected in the first few years of the new system and to attend carefully to bridging methods used to crosswalk from \"old\" to \"new\" data. Because the DOE did not stipulate what bridging method should be used-and there is not consensus on one best method, as the Office of Management and Budget (2000) provided several-there is unlikely to be a consensus among states for how to accomplish bridging. Withinstate comparisons of old and new data will be reasonably easy, but comparing across states will require researchers to take care that bridging methods result in compatible data for trend analyses."}, {"section_title": "Conclusion", "text": "The full implications of the transition to the new collection and reporting guidelines for education are not clear and are unlikely to be clear for some time. The option for self-identification in more than one racial category is a positive step for multiracial students and their parents, yet the plans for data collected and aggregated before and after the transition may yield unanticipated consequences that negate self-identification and produce data that do not accurately reflect the student population. I do not argue that the consequences of the transition outweigh the intent of Directive 15; indeed, I argue that the intent of Directive 15 far outweighs the consequences of the transition. But students, parents, school leaders, and policymakers should not assume that implementation of the \"choose all that apply\" standard automatically assures representation of multiracial students in educational systems and decisions.\nWhen, how, and by whom data on race and ethnicity are collected matters to many people, across the political spectrum; schools, colleges, and universities represent one of the most pervasive systems for data collection and aggregation in the United States, thus they have a special role to play in the lives of individuals and groups. The long delay in implementing OMB Directive 15 in K-12 and postsecondary data collecting, aggregation, and reporting resulted in part from interagency disagreement (see Renn & Lunceford, 2004) and may also be a result of the decentralization of education in the United States, where decisions about local and state K-12 issues are left to LEAs and SEAs, and higher education institutions operate individually or as members of state systems. In fact, only the central data systems (CCD and IPEDS) were required as part of a federal agency (NCES) to enact Directive 15, yet changes to CCD and IPEDS data collection affect SEAs and higher education institutions, as well as school districts and schools.\nAlthough I and others have questioned the length of time to implement Directive 15 in education data, when considering all of the organizations, institutions, and stakeholders involved, it is perhaps more surprising that the 2010-2011 academic year implementation seems near than that it has not yet occurred. But in real time, the delay is harder to understand. The multiracial children who entered kindergarten in 1997 when Directive 15 was issued will enter college before IPEDS complies with the directive (NCES, n.d.) . No matter how their school has collected and reported data on race and ethnicity, according to NCES they have grown up and will enter college officially as one race. If no further developments delay implementation of Directive 15, it is possible that they will have the option to reidentify themselves to colleges and to be counted among the first classes in the nation that officially include multiracial graduates. For K-12 and college students who have waited their entire lives to have their identities accounted for, to be able to identify in school records the way they identify as people, it will be a celebration of more than their graduation day."}]