[{"section_title": "Abstract", "text": "exacerbating effects on Aβ pathology. In contrast and unexpectedly, PGRN deficiency significantly reduces diffuse Aβ plaque growth in these APP/PS1 mice. This protective effect is due, at least in part, to enhanced microglial Aβ phagocytosis caused by PGRN deficiency-induced expression of TYROBP network genes (TNG) including an AD risk factor Trem2. PGRN-deficient APP/PS1 mice also exhibit less severe axonal dystrophy and partially improved behavior phenotypes. While PGRN deficiency reduces these amyloidosis-related phenotypes, other neuronal injury mechanisms are increased by loss of PGRN, revealing a multidimensional interaction of GRN with AD. For example, C1q complement deposition at synapses is enhanced in APP/PS1 mice lacking PGRN. Moreover, PGRN deficiency increases tau AT8 and AT180 pathologies in human P301L tau-expressing mice. These human and rodent data suggest that global PGRN reduction induces microglial TNG expression and increases AD risk by exacerbating neuronal injury and tau pathology, rather than by accelerating Aβ pathology."}, {"section_title": "Introduction", "text": "Progranulin (PGRN) is a secreted glycoprotein widely expressed in several tissues and plays a critical role in a variety of biological processes including development, wound healing, and tumorigenesis. In the central nervous system, PGRN is expressed in neurons and microglial cells and is thought to have neurotrophic and anti-inflammatory properties [11, 60] .\nMutations in the PGRN gene (GRN) that result in its haploinsufficiency cause frontotemporal lobar degeneration Abstract Progranulin (PGRN) is implicated in Alzheimer's disease (AD) as well as frontotemporal lobar degeneration. Genetic studies demonstrate an association of the common GRN rs5848 variant that results in reduced PGRN levels with increased risk for AD. However, the mechanisms by which PGRN reduction from the GRN AD risk variant or mutation exacerbates AD pathophysiology remain ill defined. Here, we show that the GRN AD risk variant has no significant effects on florbetapir positron emission tomographic amyloid imaging and cerebrospinal fluid (CSF) Aβ levels, whereas it is associated with increased CSF tau levels in human subjects of the Alzheimer's disease neuroimaging initiative studies. Consistent with the human data, subsequent analyses using the APPswe/PS1ΔE9 (APP/PS1) mouse model of cerebral amyloidosis show that PGRN deficiency has no (FTLD) with ubiquitin-positive inclusions containing TAR DNA-binding protein [11, 60] . However, genetic studies have also suggested a role of PGRN in other neurodegenerative disorders. Homozygous loss-of-function mutation in GRN was found to cause neuronal ceroid lipofuscinosis (NCL) [71] . In addition, PGRN has been implicated in Alzheimer's disease (AD). Several studies have reported GRN mutation carriers with an AD clinical presentation [7, 17, 41, 43, 59, 62] . Common GRN haplotypes were associated with increased risk for AD in a Belgian late-onset AD patient group [8] . The rs5848 T allele of GRN, which causes at least 10-20% reduction of PGRN protein levels in plasma and cerebrospinal fluid (CSF) [57, 63] , increases risk for AD as well as FTLD [50, 63, 70, 81] .\nThe mechanism(s) by which GRN variation or mutation modifies AD pathophysiology is(are) poorly defined. AD is pathologically characterized by extracellular senile plaques composed of amyloid-β (Aβ) peptides (Aβ plaques) and intracellular neurofibrillary tangles composed of hyperphosphorylated tau. Synapse loss is widespread and pronounced. In AD, the chronic Aβ accumulation causes cerebral neuroinflammation by activating microglia [35] . PGRN expression has been shown to correlate with densecore plaques [58] , and is increased in activated microglia around Aβ plaques [3, 58] and peripheral blood [16] . A previous study has described greater Aβ plaque and worsened behavioral impairment in transgenic AD mice with conditional PGRN deletion using LysM-cre mice [56] . However, a recent study as well as earlier publications raises concerns about the efficient and specific targeting using the LysMcre mice and cautions against conclusions drawn from the experiments with the mouse line [5, 79] .\nIn the present study, we investigate the mechanism by which PGRN reduction from the GRN rs5848 T allele as well as GRN mutations increase AD risk and modify AD pathophysiology. To this end, we first analyze florbetapir positron emission tomographic (PET) amyloid imaging and CSF biomarkers in human subjects with the GRN AD risk variant using Alzheimer's disease neuroimaging initiative (ADNI) database. In addition, we examine the APPswe/ PS1ΔE9 (APP/PS1) mouse model of cerebral amyloidosis and human P301L tau-expressing mice with global PGRN reduction. Previous studies have suggested that there is a different level of vulnerability in the human versus mouse brain to PGRN reduction. Although PGRN null (Grn −/− ) mice recapitulate some of pathological features of FTLD such as microgliosis and retinal degeneration, Grn heterozygous (Grn +/− ) mice do not, and both fail to show TDP-43-positive inclusions, a key pathological hallmark of FTLD. Therefore, Grn −/− mice have been studied as the best available mouse model for human PGRN haploinsufficiency-related FTLD [1, 27, 29, 42, 47, 53, 61, 78, 80] . Given this evidence, although GRN rs5848 T allele causes 10-20% reduction of PGRN in humans and GRN mutation carriers with AD clinical presentation are all heterozygotes, we utilize Grn −/− as well as Grn +/− mice. Our human and rodent data show that PGRN reduction has minimal effect on dense-core amyloid plaques and is protective against diffuse Aβ plaque growth, while it is associated with increased tau pathology. Thus, PGRN reduction may affect AD pathophysiology by causing tau dysfunction, distinct from Aβ pathology."}, {"section_title": "Methods", "text": ""}, {"section_title": "Mice", "text": "All animal studies were conducted with approval of the Yale Institutional Animal Care and Use Committee. APP/ PS1 mice and Grn −/− mice were described previously [26, 38] . All strains were extensively backcrossed onto the C57BL6 background and were maintained on this background."}, {"section_title": "Brain tissue collection", "text": "Six-and sixteen-month-old WT, Grn , and APP/PS1 Grn −/− mice were killed and immediately perfused with ice-cold PBS. The brains were then dissected out. One hemisphere was immediately frozen using liquid nitrogen and stored at −80 °C for biochemical or RNA analysis and the other was fixed in freshly prepared 4% paraformaldehyde (PFA) (ACROS ORGANICS 416780030 or Sigma 158127) in PBS (pH 7.4) overnight for immunohistochemistry."}, {"section_title": "Brain protein extraction", "text": "Brain protein extraction was performed as previously reported [26] , with slight modifications. The brain hemispheres were homogenized in threefold volume (w/v) of 50 mM Tris-HCl, 150 mM NaCl, pH 7.6 (TBS) containing a protease inhibitor cocktail (Roche complete Mini EDTAfree 11 836 170 001) and a phosphatase inhibitor cocktail (Roche phosSTOP 04 906 837 001). After ultracentrifugation at 100,000×g for 20 min at 4 °C, the supernatant was collected and frozen as the TBS-soluble fraction. The pellet was resuspended to the same volume as the original homogenate in TBS with 1% Triton X-100 (TBST) containing a protease inhibitor cocktail and a phosphatase inhibitor cocktail. The homogenates were ultracentrifuged at 100,000×g for 20 min. The supernatant was collected and frozen as the TBST-soluble fraction. The remaining pellet was then resuspended to the same volume in 70% formic acid (FA), homogenized, and ultracentrifuged. The supernatant was frozen as the FA-soluble fraction."}, {"section_title": "Immunoblot", "text": "Immunoblot was performed as previously reported [26] , with slight modification. Precast 4-20% Tris-glycine or 10-20% Tris-tricine gels were used (Bio-Rad). The iBlot™ Gel transfer device (Invitrogen) was used for transfer. The membranes were incubated in blocking buffer (Blocking Buffer for Fluorescent Western Blotting Rockland MB-070) for 1 h at room temperature. The following primary antibodies were used: 6E10 (Covance SIG-39300, 1:1000), APP, C-terminal (Sigma A8717, 1:1000), actin (Sigma A2066, 1:1000), actin (Sigma A3853, 1:1000), phospho-tau Ser404 (Thermo Fisher Scientific #44-758G, 1:2000), phospho-tau pThr181 (Thermo Fisher Scientific #701530, 1:1000), tau (Thermo Fisher Scientific #AHB0042, 1:2000). Antibodies were diluted in the blocking buffer, and membranes were incubated overnight at 4 °C. The membranes were washed three times with TBST and secondary antibodies (Odyssey IRDye 680 or 800, all 1:10,000) were applied for 1 h at room temperature. After washing four times, proteins were visualized using a Licor Odyssey Infrared imaging system. Blots were analyzed using ImageJ 1.47v software (National Institutes of Health). For the detection of Aβ, the membranes were microwaved in PBS to unmask the epitopes and increase the immunoblot sensitivity before blocking [69] ."}, {"section_title": "Immunohistochemistry", "text": "Immunohistochemistry was performed as previously reported [26] , with slight modification. The fixed brain hemispheres were embedded in 10% gelatin (Sigma G1896) and placed in 4% PFA for 3 days at 4 °C. Sagittal sections (30 μm) were then cut using a Leica WT1000S vibratome. The following steps were performed at room temperature. For AT8 and AT180 staining, the free-floating sections were treated with 10% formic acid for 20 min for antigen retrieval before blocking. The sections were blocked with 10% normal goat or donkey serum, 0.2% Triton X-100 in PBS for 1 h, followed by incubation with primary antibody overnight. Primary antibodies were diluted in 1% normal goat or donkey serum, 0.2% Triton X-100 in PBS. The following antibodies were used: β-amyloid (Cell Signaling Technology #2454, 1:500), CD68 (AbD Serotec MCA1957, 1:1000), Iba1 (Wako 019-19741 for immunocytochemistry, 1:600), LAMP-1 (Santa Cruz sc-8334, 1:250), C1q (Abcam ab11861, 1:50), C1q (Abcam ab182451, 1:1000), PSD-95 (Thermo Fisher Scientific 51-6900, 1:200) AT8 (Thermo Fisher Scientific MN1020, 1:500), AT180 (Thermo Fisher Scientific MN1040, 1:500), HT7 (Thermo Fisher Scientific MN1000, 1:500), GFP (Santa Cruz sc-8334, 1:500). The sections were washed three times with PBS, incubated in secondary fluorescent antibody (Invitrogen Alexa Fluor, all 1:500) for 2 h. To quench autofluorescence, the sections were treated with 10 mM CuSO 4 in ammonium acetate for 15 min [66] . The images were taken using the Zeiss AxioImager Z1 microscopy with a 5× objective lens. To obtain high-magnification images, we utilized the Zeiss LSM710 confocal microscopy using 63× objective lens. To take images in Supplementary Figure 3 , we used 40× objective lens and \"tile scan\" function in Zen software. The maximum intensity projection function was used in all confocal images."}, {"section_title": "Thioflavin S (ThioS) staining", "text": "The free-floating sagittal sections were stained with 0.01% ThioS (Sigma T1892) in PBS for 15 min, followed by washing three times with PBS. For double and triple staining with antibodies, after secondary antibody incubation, the free-floating sections were stained with 0.01% thioflavin S in PBS, followed by treatment with 10 mM CuSO 4 ."}, {"section_title": "Image quantification", "text": "Quantitative analyses of ThioS-positive plaque, Aβ, CD68, Iba1, C1q, and LAMP-1-positive dystrophic neurite areas and AT8, AT180, and HT7 signals were done using ImageJ 1.47v software (National Institutes of Health). All images taken using the Zeiss AxioImager Z1 microscopy with a 5× objective lens were uniformly thresholded and binarized. For CD68, Iba1, and LAMP-1-positive dystrophic neurite staining, background was subtracted (Rolling ball radius: 200 pixels for CD68 and Iba1, 50 pixels for LAMP-1) before binarization. Aβ, CD68, Iba1, and LAMP-1-positive dystrophic neurite areas were calculated using the \"analyze particles\" of ImageJ. For ThioS-positive plaques, plaque area, and plaque number were calculated with the \"watershed\" algorithm and \"include holes\" function. Only male was used for Aβ and ThioS analyses with 6-monthold mice to avoid a potential gender effect previously reported [45] . For the other analyses, both male and female were used with similar ratio between genotypes and no significant difference between male and female was observed. Three brain sections per mouse, each separated by 150 μm, were used for quantification. The mean of three sections was used to represent for each mouse. For the cortical analysis, frontal cortex, the cortex dorsal to the hippocampus, and occipital cortex were assessed and sums of the areas were used to calculate area percentages. In Supplementary  Figure 4b , whether microgliosis (>3 Iba1-positive microglia) occurs around ThioS(+) or ThioS(−) Aβ plaques was manually examined under the Zeiss AxioImager Z1 microscopy. The area occupied by PSD-95-immunoreactive puncta from the layer III of FC was measured as described previously [26] . PSD-95 and C1q colocalization was determined after background subtraction and binarization of C1q-immunoreactive area. For AT8, AT180, and HT7 analyses, the images were taken using Zeiss AxioImager Z1 microscopy and \"MosaiX acquisition\" function in AxioVision Rel. 4.8 software as shown in Supplementary Figure 8a and uniformly thresholded GFP-positive area was used for quantification. The mean signal of five sections from lateral ~2.76 to ~3.25 mm (~0.12 mm interval) was used to represent for each mouse. All analyses were performed in a blinded manner."}, {"section_title": "Aβ42 ELISA", "text": "For mouse samples, Aβ42 ELISA (Invitrogen KHB3441) was performed according to the manufacturer's manual. The optimal dilution for the FA fraction was empirically determined to be 1:20,000. The absorbance at 450 nm was measured using Victor 3V plate reader (Perkin Elmer). GraphPad Prism (version 5.0d) was used to generate the standard curve (four-parameter dose-response curve) and to interpolate the concentrations of unknown samples."}, {"section_title": "Primary microglial cell culture", "text": "Primary cultured microglia were prepared from the brains of postnatal day 3 WT or Grn −/− mice. Meninges were removed mechanically, and the cells were dissociated and cultured in DMEM supplemented with 10% heat-inactivated (65 °C, 30 min) FBS (hiFBS) and penicillin/streptomycin. After 14 days (DIV14), the culture flasks were shaken (190 rpm) for 3 h to collect microglial cells."}, {"section_title": "Phagocytosis assay", "text": "Primary microglia (DIV16 or 17) from WT and Grn −/− mice were plated on PDL-coated eight-well slides (LabTek, 154941) (8 × 10 7 cells/well) using DMEM with 8% hiFBS 3 days before experiments. The cells were incubated with FluoSpheres carboxylate, 1.0 μm, red (580/605) (Invitrogen F8821) diluted in DMEM with hiFBS at a final dilution 1:400 or 1:800 for 90 min at 37 °C, washed once with PBS, and fixed with 4% formaldehyde in PBS. The cells were then stained with anti-Iba1 antibody (Abcam ab107159, 1:500) as described above. Three images per wells were taken in one independent experiment using the Zeiss AxioImager Z1 microscopy with a 10× objective lens and the total area from the three images was used for quantification. Quantitative analyses of fluorescent beads and Iba1 areas were performed using ImageJ 1.47v software (National Institutes of Health)."}, {"section_title": "RNA isolation and quantitative real-time PCR (qRT-PCR)", "text": "Total RNA was purified from snap-frozen frontal cortex using TRIzol reagent (Ambion 15596026) and the PureLink RNA Mini kit (Ambion 12183018A) and reverse transcribed using the SuperScript III first-strand synthesis system (Invitrogen 18080-051) according to the manufacturer's instructions. Real-time quantitative PCR was performed using the C1000 Thermal Cycler and quantified using CFX96 Real-Time System (Bio-Rad). The TaqMan gene expression assay and iQ supermix (Bio-rad 170-8862) was used for PCR amplification and real-time detection of PCR products. mRNA expression values were normalized to the level of GAPDH expression. The following probes from Invitrogen were used:"}, {"section_title": "Behavior test", "text": "Morris water maze testing was performed over a 6-day period, consisted of a 3-day learning trial and a 3-day reversal trial, as previously reported [26] . Both trials were performed in a ~1-m diameter open-water pool and used a submerged, nonvisible escape platform located in the center of one of the pool's four quadrants. This location remained constant for each 3-day trial; for the reversal trial, the platform was placed, for the duration of the trial, in the quadrant diagonally across from its original location in the learning trial. Over the course of each day, the mice swam in the pool a total of eight times which were divided into two blocks of four attempts. One block took place during the morning while the second block took place during the afternoon. Over the course of a block, each mouse would begin its swim in each of four distinct locations around the wall of the pool, and was timed for its latency to reach the escape platform for a maximum time of 60 s. In the event that a mouse did not find the submerged platform within the time limit, the mouse would be gently guided to the platform and allowed ~10 s on the platform before being taken from the pool.\nThe water maze probe trial was performed 24 h after the last day of the forward and reversal trials, and in the same pool described above. During the probe trial, the platform was removed from the pool. All mice were started from a location along the pool wall diagonally opposed to the location of the platform in the reversal trial and permitted to swim for 60 s. The probe trials were recorded on a JVC Everio, G-series camcorder and analyzed using Panlab's Smart tracking and analysis program, v2.5. The observer was blinded to genotype for the duration of behavioral testing."}, {"section_title": "Florbetapir-PET scan and CSF biomarker analysis", "text": "Data used in the preparation of this article were obtained from the Alzheimer's Disease Neuroimaging Initiative (ADNI) database (http://adni.loni.usc.edu). The ADNI was launched in 2003 by the National Institute on Aging (NIA), the National Institute of Biomedical Imaging and Bioengineering (NIBIB), the Food and Drug Administration (FDA), private pharmaceutical companies and non-profit organizations, as a $60 million, 5-year public-private partnership. The primary goal of ADNI has been to test whether serial magnetic resonance imaging (MRI), positron emission tomography (PET), other biological markers, and clinical and neuropsychological assessment can be combined to measure the progression of mild cognitive impairment (MCI) and early Alzheimer's disease (AD). Determination of sensitive and specific markers of very early AD progression is intended to aid researchers and clinicians to develop new treatments and monitor their effectiveness, as well as lessen the time and cost of clinical trials.\nThe Principal Investigator of this initiative is Michael W. Weiner, MD, VA Medical Center and University of California, San Francisco. ADNI is the result of efforts of many co-investigators from a broad range of academic institutions and private corporations, and subjects have been recruited from over 50 sites across the US and Canada. The initial goal of ADNI was to recruit 800 subjects but ADNI has been followed by ADNI-GO and ADNI-2. To date these three protocols have recruited over 1500 adults, ages 55-90, to participate in the research, consisting of cognitively normal older individuals, people with early or late MCI, and people with early AD. The follow-up duration of each group is specified in the protocols for ADNI-1, ADNI-2 and ADNI-GO. Subjects originally recruited for ADNI-1 and ADNI-GO had the option to be followed in ADNI-2. For up-to-date information, see http://www.adniinfo.org.\nFor Fig. 1 , Table 1, and Supplementary Table 1 , data from ADNI-GO and ADNI-2 participants were analyzed, as GRN rs5848 genotype was available in these groups (ADNIGO2_GWAS_Set_1-15 files). APOE ε4 genotypes and diagnostic categories were examined using APOERES and ARM files, respectively. ADNI florbetapir summary data (UCBERKELEYAV45_7_30_14 file) including standardized uptake value ratio (SUVr) results normalized by whole cerebellum region were downloaded and analyzed. CSF biomarker data in ADNI-GO and ADNI-2 (UPENN-BIOMK5, UPENNBIOMK6, and UPPENNBIOMK7 data files) were used for this study. This cross-sectional analysis across the three files was performed by combining all baseline results, as recommended (ADNI_Methods_UPENN_ Third_Batch_Analysis_ of CSF_Biomarker_20140611)."}, {"section_title": "Adeno-associated virus (AAV) and surgery", "text": "Stereotaxic AAV injection was performed as previously described [2, 4] , with modification. An AAV vector that expresses human P301L tau 1-441 or GFP under the control of the neuron-specific synapsin-1 promoter was prepared as previously described [2] . Both male and female WT and Grn −/− mice at 6-8 months of age were used for this analysis. Briefly, mice were anesthetized with an intraperitoneal injection of ketamine (100 mg/kg) and xylazine (10 mg/kg). After mice were head-fixed on a stereotaxic frame, AAV was unilaterally injected into entorhinal cortex via the following coordinates: anteroposterior, −4.7 mm; lateral, 3.0 mm; dorsoventral, −4.6 mm. Twenty-eight days post-infection, mice were perfused with ice-cold PBS followed by 4% PFA in PBS. All surgeries were performed in a blinded manner."}, {"section_title": "Statistical analysis", "text": "For animal studies, two-tailed t test (to compare two groups) and one-way ANOVA followed by Tukey's multiple comparison test (to compare three and more groups) were prepared using GraphPad Prism (version 5.0d). For human data that did not follow a normal distribution, nonparametric Mann-Whitney (to compare two groups) and Kruskal-Wallis (to compare three and more groups) were performed using GraphPad Prism (version 5.0d). Chisquare test was used for comparison of differences in categorical variables. For GRN rs5848 genotypes analysis, the CSF and PET variables were log-transformed and evaluated by ANCOVA to control for effects of potential confounders (age, gender, diagnosis, and APOE ε4 genotypes), using the Statistical Package for the Social Science 21.0 (SPSS Inc.)."}, {"section_title": "Results", "text": ""}, {"section_title": "GRN rs5848 T allele does not alter florbetapir-PET signal and CSF Aβ 42 levels", "text": "We first sought to assess how GRN rs5848 T allele might alter AD pathophysiology in the clinical setting. The ADNI database includes SNP genotypes, PET measurement of florbetapir binding to amyloid deposits in the brain [13] , and CSF biomarker analyses of individuals with no neurological disease (NL), with significant memory concern (SMC), with early mild cognitive impairment (EMCI) and with mild cognitive impairment (MCI) and with AD. The combined sample size is more than 700 cases. We first analyzed the florbetapir-PET amyloid imaging data. There is progressive increase of the PET radioactive amyloid ligand florbetapir uptake (SUVr) across the clinical spectrum ( Table 1) . As expected, the APOE ε4 allele modifies the extent of florbetapir-PET signal, as previously described (Table 1 ) [64] . We segregated the florbetapir-PET results by the GRN rs5848 genotype, which is reportedly linked with decreased PGRN level and increased AD/FTLD risk [8, 22, 50, 57, 63, 70] . Characteristics of the ADNI participants with different GRN rs5848 genotypes are summarized in Supplementary Table 1 . With or without correction for covariates (age, sex, diagnosis, and APOE ε4 copy number), there was no detectable difference in florbetapir-PET signal for those individuals with different GRN rs5848 genotypes ( Fig. 1a ; Table 1 ).\nCSF Aβ 42 levels are lower in AD patients compared to age-matched cognitively healthy controls, and the inverse correlation of CSF levels with plaque deposition is likely due to Aβ 42 sequestration in plaques [20, 35, 73] . We observed the expected progressive decrease of CSF Aβ 42 levels across the clinical spectrum and APOE ε4 gene dosage (Table 1) . However, consistent with the florbetapir-PET data analysis, the GRN rs5848 T allele had no effect on CSF Aβ 42 levels with or without correction for covariates ( Fig. 1b; Table 1 ). Thus, our analyses of ADNI florbetapir-PET and CSF Aβ 42 dataset suggest that the GRN rs5848 T allele has no detectable influence on amyloid pathology in AD. Fig. 1 GRN rs5848 AD risk variant has no effect on florbetapir-PET amyloid imaging or CSF Aß 42 levels while it increases CSF tau levels in humans. a Mean cortical Aβ levels (SUVr) as quantified by florbetapir-PET in the ADNI participants are segregated by GRN rs5848 genotypes. Log scale is used for X-axis. Red vertical bars indicate mean. See Table 1 for the statistical analyses used in this figure. b CSF Aβ 42 levels in the ADNI participants are segregated by GRN rs5848 genotypes. Log scale is used for X-axis. Red vertical bars indicate mean. See Table 1 for the statistical analyses used in this figure. c CSF tau levels in the ADNI participants are segregated by GRN rs5848 genotypes. Log scale is used for X-axis. Red vertical bars indicate mean. See Table 1 for the statistical analyses used in this figure GRN rs5848 T allele increases CSF tau levels CSF tau and tau phosphorylated at T181 (p-tau 181 ) levels are increased in AD patients [21, 31, 74] . The CSF increases are thought to reflect neuronal damage accompanied by neurofibrillary tangles in AD [35] . As we did not observe an effect of GRN rs5848 T allele on Aβ pathology, we analyzed ADNI dataset to examine whether the GRN AD risk allele might affect CSF tau and p-tau 181 levels. As previously described [18, 32, 46] , there are progressive increases of CSF tau and p-tau 181 levels across the clinical spectrum and the APOE ε4 gene dosage (Table 1 ). In addition, we observed a difference in CSF tau levels between male and female in this ADNI dataset (Table 1) . Strikingly, there is a GRN rs5848 T allele gene dosage-dependent increase of CSF tau levels ( Fig. 1c ; Table 1 ). In addition, there is a statistically significant difference between GRN rs5848 genotypes after correction for covariates (age, sex, diagnosis, and APOE ε4 copy number) ( Fig. 1c; Table 1 ). Importantly, the difference in CSF tau between GRN rs5848 genotypes (CC vs. TT) is greater than the one between NL and EMCI in the ADNI dataset (Table 1) . GRN variation does not have a significant effect on CSF p-tau 181 in this cohort (Table 1) . Thus, GRN variation has detectable effects on CSF tau levels in this ADNI group without alterations in amyloid pathology."}, {"section_title": "PGRN deficiency prevents diffuse Aβ plaque growth in APP/PS1 mice", "text": "While the human data show no effect of GRN variation, which causes at least 10-20% reduction of PGRN protein, on amyloid pathology, a previous study reported greater Aβ accumulation using 7-month-old APP (J20) mice with conditional PGRN deletion [56] . In addition, potential effects of further global PGRN reduction, which may occur by GRN mutations in humans, on Aβ accumulation are unclear. We, therefore, examined whether PGRN haploinsufficiency or complete absence affects Aβ pathology using the APP/PS1 mouse model of cerebral amyloidosis. As the APP/PS1 mice begin to develop Aβ deposition from 4 to 6 months of age with progressive increases up to 12 months [24, 39] , we performed thioflavin S (ThioS) staining of dense-core amyloid plaques and anti-Aβ (2454) antibody staining of diffuse Aβ plaques using 6-and 16-month-old animals. Only male mice were used for Aβ and ThioS analyses at 6 months of age, to avoid a potential gender effect previously reported in the APP/PS1 strain [45] . The ThioS staining of dense-core amyloid plaques shows either no change, or a slight decrease, in different regions and with different plaque metrics in the 6-month-old and 16-monthold APP/PS1 mice ( Fig. 2a-d; Supplementary Figure 1) . Anti-Aβ antibody staining shows no significant difference between Grn genotypes in 6-month-old mice (Fig. 2a, e) , but reveals a significant reduction in the area of diffuse Aβ plaque pathology in 16-month-old APP/PS1 Grn −/− mice ( Fig. 2b, e; Supplementary Figure 1) . Co-staining with ThioS and anti-Aβ antibody shows that PGRN deficiency significantly decreases the ratio of diffuse Aβ plaques to dense-core amyloid plaques in 16-month-old APP/PS1 mice ( Fig. 2f, g; Supplementary Figure 1) . The histological analysis was confirmed by ELISA analysis of tissue from these mice. The insoluble fractions from APP/PS1 Grn −/− mice yield significantly less Aβ 42 after extraction with formic acid (Fig. 2h) . Immunoblot analysis shows that TBSsoluble Aβ or APP fragments are equal with and without PGRN expression (Fig. 2i, j) , suggesting that the reduction of diffuse Aβ plaques in 16-month-old APP/PS1 Grn −/− mice is not due to changes of APP metabolism. Thus, neither PGRN haploinsufficiency nor its absence accelerates the onset of Aβ plaque in 6-month-old mice. In contrast, PGRN absence reduces diffuse Aβ plaque significantly and selectively, compared to dense-core amyloid plaques in 16-month-old APP/PS1 mice."}, {"section_title": "PGRN deficiency increases CD68-positive microglia near Aβ plaques in APP/PS1 mice", "text": "As a reduction in diffuse Aβ plaque in APP/PS1 Grn −/− mice is unexpected and inconsistent with a previous study [56] , we sought to examine how PGRN deficiency prevents diffuse Aβ plaque growth. PGRN is involved in neuroinflammation in the brain and an increase in CD68, a common marker for activated microglia, has been reported in several aged Grn −/− strains as well as human PGRN-deficient FTLD cases [48, 55, 56, 75, 82] . In addition, accumulating evidence suggests that microglia paly an important role in Aβ clearance in AD [49] . We thus first examined whether PGRN deficiency affects microglial phenotypes using anti-CD68 antibody in 6-and 16-month-old WT, Grn\n, and APP/ PS1 Grn −/− mice (6 genotypes). CD68 immunohistochemistry shows a significant increase in CD68-immunoreactive "}, {"section_title": "area for Grn", "text": "−/− mice, and an even greater increase for APP/PS1 Grn −/− mice in both hippocampus and cortex of 6-and 16-month-old animals although the increase in hippocampus at 16 months of age does not reach statistical significance (Fig. 3a-c) . At 6 months, the Grn −/− phenotype is substantially more prominent than the APP/PS1 single gene increase of threefold magnitude (Fig. 3a, b) . The CD68 increase is present at 6 months of age, when Aβ plaques are first forming, and at 16 months, when Aβ plaque density is maximal, the increase reaches 30-fold WT levels in APP/PS1 and 50-fold WT levels in APP/PS1 Grn −/− mice (Fig. 3c, g ). For APP/PS1 hippocampus and cerebral cortex, the increase of CD68-positive microglia is most prominent near Aβ plaques. High-resolution confocal microscopy confirms that the enhanced CD68-immunoreactive microglial processes interdigitate with Aβ plaques in APP/PS1 Grn −/− mice (Fig. 3a, e) . Quantitatively, the CD68-positive area colocalized with the vicinity of Aβ immunoreactivity is significantly greater for both 6-and 16-month-old APP/PS1 Grn −/− mice, compared with APP/PS1 mice (Fig. 3f, h ). We also examined whether PGRN deficiency affects microgliosis and microglial morphology in 6-monthold mice using anti-Iba1 antibody, a general marker for microglia. Although PGRN absence slightly increases Iba1-immunoreactive area and Iba1-positive microglia in both hippocampus and cortex, regardless of APP/PS1 transgene, the increases fail to reach statistical significance (Supplementary Figure 2a, 2b, and 2c) . High-resolution confocal microscopy shows no significant morphological change by PGRN deficiency in Iba1-positive microglia despite a significant increase in CD68-immunoreactive area (Supplementary Figure 3) . These results using anti-Iba1 antibody are consistent with previous studies using different Grn −/− strains [1, 75] . In addition, triple staining with ThioS, anti-Aβ antibody, and anti-Iba1 antibody shows that microgliosis rarely occurs near small ThioS-negative anti-Aβ-antibody-immunoreactive diffuse Aβ plaques while microglia accumulate robustly around ThioS-positive Aβ plaques in 6-month-old APP/PS1 mice, regardless of the presence of PGRN ( Supplementary Figure 4a and 4b) . Together, these results indicate that PGRN deficiency significantly increases CD68-positive microglia in the brain globally, and does so near Aβ plaques in particular."}, {"section_title": "PGRN deficiency induces expression of TYROBP network genes", "text": "To further characterize microglial phenotypes induced by PGRN deficiency, we analyzed expression of typical pro-inflammatory and anti-inflammatory genes in frontal cortex of 6-month-old mice of the 6 genotypes by qRT-PCR. Despite an increase in CD68-positive microglia in Grn −/− background, there is no significant difference in typical pro-inflammatory (iNOS, IL1β, TNFα, and IL6) and anti-inflammatory genes (Arg-1, TGFβ, Fizz1, and Ym1) between WT and Grn −/− mice or APP/PS1 and APP/PS1 Grn −/− mice (Fig. 4a, b) . To explore changes of any other microglial genes by PGRN deficiency, we performed genome-wide RNA sequencing (RNA-seq) using 2-month-old WT and Grn −/− brains (Z. Klein et al., unpublished observations) and analyzed upregulated genes in Grn −/− brains (FDR < 0.05, logFC > 0.2) using the database STRING website [76] . In a functional protein-protein interaction module of differentially expressed genes detected by the STRING, there is a cluster with TYROBP forming a major hub that consists of many microgliarelated genes including an AD risk factor Trem2 [14] , as well as Ms4a7, one member of the AD risk MS4A gene cluster [41] . Details of the 36 genes in the cluster are summarized in Supplementary Table 2 . We also sought to validate our data using the microarray dataset in a previous study with 6-or 9-month-old different Grn −/− strain [65] . Interestingly, 18 of 36 genes in the cluster from our study were also upregulated in the microarray dataset. We further analyzed them by the STRING and named the genes in the cluster TYROBP network gene (TNG) (Fig. 4c;  Supplementary Figure 5) . Consistent with the immunohistochemical data, Cd68 is also found in the TNG. Several lysosomal cysteine proteases including cathepsin S (CatS) and cathepsin Z (CatZ), which are highly expressed in immune/inflammatory cells, complement system proteins (C1qA, C1qB, and C4B), and Lyz2 [also known as Lysozyme M (LysM)] are also in the TNG. Using qRT-PCR of 6 genotypes, upregulation of at least 10 of 18 genes in the TNG was confirmed in frontal cortex of 6-month-old Grn −/− mice, regardless of APP/PS1 transgenes (Fig. 4d) . Since previous studies have reported that TREM2 and TYROBP are involved in microglial phagocytosis, which in turn is implicated in Aβ accumulation in AD [14] , we next sought to test the effect of increased TNG expression by PGRN deficiency on microglial phagocytic function. Grn −/− microglia engulf a significantly greater amount of fluorescent beads compared to WT cells at two different concentrations (Fig. 4e, f) . Together, these results show that PGRN deficiency causes TNG expression and facilitates microglial phagocytosis. Thus, increased phagocytosis by TNG-positive microglia surrounding ThioS-positive Aβ "}, {"section_title": "PGRN deficiency reduces dystrophic neurites and partially restores behavior deficits of APP/PS1 mice", "text": "Given the detectable reduction of diffuse Aβ plaques in 16-month-old APP/PS1 Grn −/− mice, we examined whether PGRN deficiency affects axonal dystrophy and a memory deficit in APP/PS1 mice. LAMP-1-positive dystrophic neurites are associated with all sizes and ages of Aβ plaques and are present from the earliest detectable stages of Aβ deposition in AD mouse models [28] . We performed triple staining using ThioS, anti-Aβ (2454) antibody, and anti-LAMP-1 antibody and detected the dystrophic neurites even in ThioS-negative and anti-Aβ-antibody-immunoreactive diffuse Aβ plaques in both 6-and 16-month-old APP/PS1 mice (Supplementary Figure 6a and 6b) . This demonstrates an association of the LAMP-1-positive dystrophic neurites with diffuse Aβ plaques, regardless of the presence of ThioSpositive amyloid filaments. Consistent with diffuse Aβ plaque results, the dystrophic neurites are significantly reduced in both hippocampus and cortex in APP/PS1 Grn −/− mice (Fig. 5a-c) . To examine spatial memory, we tested 16-month-old APP/PS1 Grn −/− mice in the Morris water maze. The APP/PS1 mice require a longer latency time to locate a hidden platform across forward learning trials and spend less time in the target quadrant during the probe trial 24 h after learning trials compared to WT mice, as previously reported [26] (Fig. 5d, e) . PGRN deficiency reduces the spatial learning acquisition deficit in APP/PS1 mice at certain time points, although APP/PS1 Grn −/− mice are indistinguishable from APP/PS1 mice in the probe trial (Fig. 5d, e) . For APP/PS1 mice, the PGRN null state reduces axonal dystrophy and improves memory impairment moderately, in contradistinction to enhanced AD risk in humans with PGRN reduction."}, {"section_title": "PGRN deficiency increases accumulation of C1q on neuronal synapses", "text": "To explain the contradiction described above as well as moderate effects of PGRN deficiency on behavior deficits despite a significant reduction in diffuse Aβ plaques in APP/PS1 mice, we considered whether other phenotypes and molecular pathways might be modulated differentially. Our human data with the GRN AD risk variant have shown an increase in CSF tau levels, which reflect neuronal damage accompanied by neurofibrillary tangles. Recent studies indicate that complement activation, especially an increase in C1q, mediates neuronal synaptic damage in AD and PGRN null mice [36, 53] . As the TNG also includes C1qA and C1qB, we examined whether PGRN deficiency affects synaptic accumulation of C1q in 6-month-old APP/PS1 mice. Consistent with the RNA analyses, C1q immunoreactivity is increased in dentate gyrus and frontal cortex in Grn −/− mice (Fig. 6a,  b) . Although there is no significant increase in the C1q immunoreactivity in APP/PS1 mice, the immunoreactivity is further increased in frontal cortex of APP/PS1 Grn −/− mice, compared to Grn −/− mice (Fig. 6a, b) . Importantly, the staining pattern of the anti-C1q antibody is consistent with several previous studies [12, 53, 72] . We also tested another anti-C1q antibody that is validated by C1q null mice [36, 72] , and confirmed a similar distribution pattern of C1q in both dentate gyrus and frontal cortex and an increase in the immunoreactivity in APP/PS1 Grn −/− mice (Supplementary Figure 7) . High-resolution imaging analyses of PSD-95 and C1q colocalization show an increase in the colocalization in Grn −/− and APP/PS1 Grn −/− mice (Fig. 6c, d) . The colocalization pattern of PSD-95 and C1q is also similar to that in a previous study [36] . These results suggest that PGRN deficiency enhances synaptic accumulation of C1q that has been reported to cause neuronal damage [36, 53] in APP/PS1 mice. Thus, while PGRN deficiency-induced microglial TNG expression protects against diffuse Aβ plaques, it simultaneously has a detrimental effect on neurons, a downstream target of Aβ accumulation, which can also, at least in part, explain the moderate effects on behavior deficits in PGRN-deficient APP/PS1 mice. , and APP/PS1 Grn −/− mice. Mean ± SEM, n = 4/ genotype. *p < 0.05, **p < 0.01, ***p < 0.001; one-way ANOVA, with Tukey post hoc correction. e Representative images of fluorescent beads (1:400 dilution) phagocytosis assay using WT and Grn −/− primary microglia. Bar 100 μm. f Quantification of beads-positive Iba1 area (%) in fluorescent beads phagocytosis assay using two different dilutions 1:400 and 1:800. Mean ± SEM, n = 3. *p < 0.05; t test , n = 7. Performance differed across the last four trials by genotypes. There was an interaction between APP/PS1 transgenes and Grn genotype. **p < 0.01; two-way RM ANOVA. By Bonferroni post hoc comparisons, the APP/PS1 group differed from the WT group (***p < 0.001). In the trial number 3 and 4, the APP/PS1 group differed from the WT group, whereas none of the other groups differed from each other, as shown in figure. **p < 0.01; one-way ANOVA, with Tukey post hoc correction. e MWM probe trial after reverse trial of aged WT, Grn , n = 7. **p < 0.01, ***p < 0.001; t test 1 3 The CSF tau data and the results of enhanced synaptic C1q accumulation in Grn −/− mice prompted us to further examine the effects of PGRN deficiency on neuronal tau dysfunction. We first tested whether tau phosphorylation is increased in APP/PS Grn −/− mice by immunoblot analysis using phospho-specific antibodies. Although no difference in tau phosphorylation between 16-month-old WT and APP/PS1 mice is observed, there is a significant increase in phosphorylation of tau at S404 in 16-month-old APP/ PS1 Grn −/− mice, compared with WT mice (Fig. 7a, b) . A trend toward an increased tau phosphorylation at T181 is also observed but does not reach statistical significance. It should be noted that APP/PS1 mice do not exhibit tau pathologies including neurofibrillary tangles. Therefore, to further investigate human tau pathology in the absence of Aβ accumulation, we took advantage of adeno-associated virus (AAV) vector that expresses human P301L tau 1-441 under the control of the neuron-specific synapsin-1 promoter. This AAV vector has been used to accelerate tau pathologies in mice and prominent AT8 pathology has been detected at least at 28 days post-injection [2] . We injected the AAV expressing human P301L tau (and GFP) into the entorhinal cortex of WT and Grn −/− mice (Supplementary Figure 8a) and analyzed tau pathologies at 28 days postinjection. To detect tau pathology, we used AT8 (PHF phospho-S202 and phospho-T205) and AT180 (PHF phospho-T231) antibodies because they have been most commonly used for this purpose and are commercially available. Immunohistochemical analysis shows that both AT8 and AT180 signals are significantly increased in Grn −/− mice compared to WT (Fig. 7c, d, f, g ). High-resolution confocal microscopy confirms an increase in neuronal AT8 and AT180 pathologies in Grn −/− mice (Fig. 7e) . In contrast, HT7 staining for human tau shows no difference in total viral-mediated expression of human mutant tau in entorhinal cortex between WT and Grn −/− mice ( Fig. 7h ; Supplementary Figure 8b ). It should be noted that the human CSF (Fig. 1) and mouse brain tissue (Fig. 7) showed differential effects of GRN on phospho-tau and total tau. Nonetheless, the human data from GRN AD risk variants together with mouse data from human P301L tau-expression in knockouts show that PGRN reduction exacerbates tau pathology in AD irrespective of Aβ pathology."}, {"section_title": "Discussion", "text": "The major conclusions of the present study are that GRN AD risk variant increases CSF tau levels without affecting Aβ pathology in humans and that PGRN deficiency exacerbates tau pathology while it protects against diffuse Aβ plaques in mice. The opposing effects of PGRN deficiency observed in mice are, at least in part, associated with induction of microglial TNG expression, including TYROBP, an AD risk factor TREM2, and a complement protein C1q. Importantly, PGRN deficiency can modify microglial phenotype and enhance tau pathology independent of Aβ pathology.\nThe purpose of this study was to investigate how PGRN reduction by GRN rs5848 variant or GRN mutation could modify AD pathophysiology and increase AD risk and we unexpectedly found that GRN rs5848 T allele and PGRN deficiency have no exacerbating effects on Aβ pathology in humans and rodents, respectively. Moreover, complete absence of PGRN prevents diffuse Aβ plaque growth leading to less severe axonal dystrophy and a partial rescue of behavior phenotypes in an APP/PS1 amyloidosis mouse model. This protective effect could be explained by an induction of the TNG expression by PGRN deficiency. Interestingly, the enhanced TNG expression is not due to an increase in microgliosis because PGRN absence has no significant effects on the number of Iba1-positive microglia or typical pro-inflammatory and anti-inflammatory genes at 6 months of age. There is also a further increase in expression of several TNG components in APP/PS1 Grn −/− mice, although we detect no significant changes in the TNG or pro-inflammatory or anti-inflammatory genes in APP/PS1 mice, in distinction to previous studies investigating neuroinflammation in AD mouse models [68] . This discrepancy is likely explained by a difference in mouse age [33] . Many previous studies have used aged AD mouse models while we performed qRT-PCR analysis using 6-month-old animals. In fact, we observed a dramatic increase in CD68-immunoreactive area in 16-month-old APP/PS1 mice while there is no such change at 6 months of age. We also showed that PGRN deficiency facilitates microglial phagocytosis in vitro, consistent with a previous study using PGRN-deficient peripheral macrophages [40] . It is thus possible that increased TNG expression cooperatively facilitates microglial phagocytosis to reduce diffuse Aβ plaque pathology. Importantly, a recent study has shown upregulation of very similar microglial gene network including TREM2, TYROBP, MS4A7, CD68, C1qA, C1qB, and Lyz2 by PGRN deficiency [53] , supporting this conclusion. The mechanisms by which PGRN deficiency induces microglial TNG expression will require further investigation.\nCD68 has been commonly used as a marker for \"activated\" microglia. However, we detected no significant changes in microglial morphology or in expression of typical pro-and anti-inflammatory genes by 6-monthold Grn −/− mice despite the dramatic increase in CD68-immunoreactivity and TNG mRNA levels. It appears likely that CD68 is upregulated as a part of the TNG involved in protein degradation following phagocytosis together with cathepsins CatS and CatZ in Grn −/− mice, rather than as a marker of typical microglial \"activation\", although the precise role of CD68 in lysosome remains unclear. Our data thus caution against simple interpretation of CD68 immunohistochemistry as microglial activation. In future studies, careful characterization of microglia by gene expression analyses, in addition to CD68 immunostaining, will be necessary to determine specific microglial phenotypes.\nA reduction in diffuse Aβ plaques is detected only in 16-month-old APP/PS1 Grn −/− mice despite increased TNG expression by PGRN deficiency at 6 months of age in our study. We found that microglia are rarely present around small ThioS-negative and anti-Aβ (2454) antibodypositive diffuse Aβ plaques whereas pronounced microglial accumulation is observed around ThioS-positive amyloid plaques even in 6-month-old APP/PS1 mice, regardless of PGRN. Consistent with this result, we also found that PGRN deficiency has no significant effect on Iba-1-immunoreactive microgliosis on APP/PS1 background. Importantly, recent studies have shown that microglia and TREM2/TYROBP play a critical role in reducing the diffuse Aβ deposition associated with already formed Aβ plaques and in reducing axonal dystrophy [15, 77, 83] . Our results thus suggest that Grn −/− microglia may prevent diffuse Aβ plaque growth from ThioS-positive dense-core amyloid plaques most efficiently, rather than delaying the initial formation (onset) of diffuse Aβ plaques. Furthermore, this is mediated, at least in part, by enhanced phagocytosis. In human florbetapir-PET analysis with the ADNI dataset, we have not seen a reduction of Aβ pathology by GRN AD risk variant. This result might be due to the PET tracer possessing a higher affinity for dense-core amyloid plaques, although the full in vivo specificity of the tracer remains to be determined [44] .\nOur Aβ plaque results are, however, inconsistent with a previous study using a different AD mouse model with conditional PGRN deletion [56] . One potential explanation for this contradiction is that the previous study utilized the LysM-cre mice lacking endogenous Lyz2, a gene significantly upregulated in Grn −/− and APP/PS1 Grn −/− mice in previous [53, 65] and our studies. Humans have one lysozyme gene, while mice have two encoding LyzM and LyzP [23] , and the gene product lysozyme is reportedly increased in CSF of AD patients and has a protective role in Aβ aggregation in vitro and in fly [34] . Lyz2 deficiency alone might affect Aβ pathology directly or indirectly by compromising TNG-related microglial phenotypes by PGRN deficiency. Alternatively, artificial PGRN reduction in a subset of neurons and microglia by LysM-cre mice [5] and/or AD mouse models used may yield complicated outcomes reflecting the varied and multifactorial and indirect actions of PGRN on Aβ pathology. However, regardless of difference in mouse models, our analyses of human florbetapir-PET and CSF Aβ 42 dataset clearly suggest that GRN rs5848 T allele increases AD risk not by altering Aβ accumulation.\nIn contrast to Aβ pathology, our analysis of ADNI database shows that GRN rs5848 T allele increases CSF tau levels in a T allele dose-dependent manner. The difference between GRN rs5848 genotype CC and TT is greater than the one between NL and EMCI in the ADNI cohort, suggesting an importance of this change for increasing AD risk. We also found that PGRN deficiency increases tau AT8 and AT180 pathologies in human P301L tau-expressing mice. PGRN haploinsufficiency causes FTLD with taunegative and TDP-43-positive inclusions [3, 19, 60] . However, in several GRN mutations, tau pathology is observed in addition to TDP-43 inclusion, showing an association of GRN mutation with tau pathology [52, 59, 62] . Although we utilized the AAV vector to examine tau pathologies in mice, AAV injection can be associated with impairment of the blood-brain barrier and inflammation during the period in which abnormal tau aggregates are formed. In addition, as expression from AAV may be transient, germline-modified tauopathy models may be closer to chronic human diseases. Of note, the recent report that PGRN haploinsufficiency increases tau phosphorylation in P301L tau transgenic mice [37] strongly supports our conclusion from AAV studies. The mechanism by which PGRN reduction increases CSF tau levels and tau pathology will be a fruitful site for further investigation. Both cell-autonomous and non-cell-autonomous mechanisms are possible, since neuroinflammation has been implicated in tau pathology as described previously [54] . The TNG-related microglial phenotype by PGRN deficiency might exacerbate tau phosphorylation despite a reduction in diffuse Aβ plaque pathology in a non-cell-autonomous manner, similar to previous studies using IL-1β-overexpressing mice and CX3CL1-deficient mice [25, 51] . Our results of C1q immunostaining suggest that greater neuronal injury by enhanced C1q accumulation may exacerbate tau phosphorylation and release into the CSF in GRN AD risk variants. It will be interesting to analyze C1q levels in CSF or brain sections of humans with GRN AD risk variant.\nIt also remains unclear how the GRN AD risk variant affects CSF tau but not CSF p-tau181 in our human study and how it is related to our mouse studies showing an increase in AT8 and AT180 pathologies by PGRN deficiency. CSF phospho-tau is thought to reflect phosphorylation states of tau in the brain [6, 30, 67] . While CSF p-tau181 has been widely used in CSF biomarker studies, other p-tau epitopes such as p-tau199, p-tau231, p-tau404 are also increased in AD patients [6, 30, 67] . A study comparing p-tau181, p-tau199, and p-tau231 using the same samples shows similar discrimination between AD and control [6, 31] . Previous CSF biomarker studies as well as the ADNI dataset in this study suggest that p-tau181-negative p-tau species are also present in the brain and released into the CSF of AD patients. Interestingly, although CSF p-tau181 shows a discrimination between AD and control, the relationship between CSF p-tau181 and AT8 (p-tau202 + 205) and AT180 (p-tau231) pathologies is still controversial and CSF p-tau231 showed a better correlation in AD in previous studies [9, 10] . In the present study of APP/PS1 mice lacking PGRN, we detected no significant difference in phospho-T181 tau while there was an increase in phospho-S404. Therefore, one potential hypothesis to connect between our human and rodent results is that the GRN AD risk variant or PGRN reduction might affect p-tau181-negative p-tau species to cause AT8 and AT180 tau pathologies. Again, further investigations using the postmortem brain with GRN AD risk variant as well as genetically modified tauopathy mouse models will be needed to confirm this hypothesis.\nDespite evidence that PGRN haploinsufficiency causes FTLD in human, most of previous studies have failed to see significant effects with mechanistic insight in Grn +/− mice [1, 27, 42, 53, 61, 80] . In the present study, we also observed no obvious phenotypic changes in Grn +/− mice with or without APP/PS1 transgene, compared to WT. The mechanism by which PGRN reduction differentially affects human and mouse brain functions is currently unclear and further investigation will be required.\nIn summary, studies with an amyloidosis mouse model lacking PGRN and genetic associations in the ADNI database argue against global PGRN reduction having an exacerbating effect on Aβ accumulation. Critically, as an alternative hypothesis for an increased AD risk by PGRN reduction, our studies of human CSF tau levels and human P301L tau-expressing mice show a role of PGRN in tau pathology. Furthermore, identification and characterization of TNG and a TNG-related microglial phenotype in this study provide novel insights into understanding of neurodegenerative disorders including AD and FTLD."}]