[{"section_title": "Abstract", "text": "Introduction: The aim was to create readily available algorithms that estimate the individual risk of b-amyloid (Ab) positivity.\nMethods: The algorithms were tested in BioFINDER (n 5 391, subjective cognitive decline or mild cognitive impairment) and validated in Alzheimer's Disease Neuroimaging Initiative (n 5 661, subjective cognitive decline or mild cognitive impairment). The examined predictors of Ab status were demographics; cognitive tests; white matter lesions; apolipoprotein E (APOE Q4 ); and plasma Ab 42 /Ab 40 , tau, and neurofilament light. Results: Ab status was accurately estimated in BioFINDER using age, 10-word delayed recall or Mini-Mental State Examination, and APOE (area under the receiver operating characteristics curve 5 0.81 [0.77-0.85] to 0.83 [0.79-0.87]). When validated, the models performed almost identical in Alzheimer's Disease Neuroimaging Initiative (area under the receiver operating characteristics curve 5 0.80-0.82) and within different age, subjective cognitive decline, and mild cognitive impairment populations. Plasma Ab 42 /Ab 40 improved the models slightly. Discussion: The algorithms are implemented on http://amyloidrisk.com where the individual probability of being Ab positive can be calculated. This is useful in the workup of prodromal Alzheimer's disease and can reduce the number needed to screen in Alzheimer's disease trials. Ó 2018 Published by Elsevier Inc. on behalf of the Alzheimer's Association. This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/)."}, {"section_title": "Introduction", "text": "b-Amyloid (Ab) accumulation is believed to be the initial pathology of the most common type of neurological disease leading to dementia, Alzheimer's disease (AD) [1] . Abnormal levels of Ab are associated with longitudinal cognitive decline in healthy elderly [2] and progression to AD dementia in subjects with mild cognitive impairment (MCI) [3] . A verified Ab status can be used to improve the accuracy of AD diagnostics and for including participants in trials of novel AD drugs, as currently used in several clinical trials [4] . Given the devastating symptoms of AD, the high number of affected people, and the tremendous costs for society (US$ 259 billion per year for dementia in the US alone), there will be a great pressure on the health care system to identify persons with abnormal Ab deposition when disease-modifying AD treatments become available [5] .\nBrain Ab can be detected in vivo either by performing a lumbar puncture (LP) and analyzing the levels of the peptide Ab 42 in cerebrospinal fluid (CSF) or by performing a positron emission tomography (PET) scan using a ligand that binds to Ab fibrils (Ab PET). There are no significant differences between the two methods in terms of accuracy for identifying AD [6, 7] , and they are used mostly not only in research but also in clinical practice at some specialized memory clinics. However, because these methods are invasive, costly, and not available in all health care settings, a screening process to select individuals for LP or PET testing, both in clinical practice and clinical treatment trials, would be very useful. Several studies on amyloid prediction tools or blood-based Ab biomarkers exist, but due to lack of or failed validations, low accuracies, or the usage of advanced technology or extensive neuropsychological testing, none of them are being used in clinical or research settings, to the best of our knowledge [8] [9] [10] [11] [12] .\nIn the present study, we aimed to develop algorithms that estimate the risk of being Ab positive using readily available and noninvasive measures and tests. Nondemented subjects with either subjective or objective cognitive symptoms were examined to provide a clinically relevant target population. The models were developed in a training cohort and validated in an independent population. In a second step, we analyzed the added value of including the plasma biomarkers tau, neurofilament light (NfL), and the Ab 42 /Ab 40 ratio. We also examined the accuracy of our models to longitudinally predict conversion to AD dementia."}, {"section_title": "Materials and methods", "text": ""}, {"section_title": "Participants of the training cohort (BioFINDER)", "text": "The Swedish BioFINDER study (Biomarkers For Identifying NeuroDegenerative Disorders Early and Reliably) is a prospective study that focuses on identifying key mechanisms and improving clinical diagnostics of AD and other neurodegenerative disorders. Details about the Swedish Bio-FINDER study design have been published previously [12, 13] and are available at http://biofinder.se. In the present study, we used the BioFINDER cohort of prospectively and consecutively included nondemented participants with cognitive complaints. They were enrolled between 2010 and 2015, mostly from primary care centers in the Southern part of Sweden. The inclusion/exclusion criteria are provided in the Supplementary. Based on the result of a comprehensive neuropsychological battery and the clinical assessment of a senior neuropsychologist and two physicians specialized in neurocognitive disorders, 54% of the 391 participants were classified as having MCI and 46% as having subjective cognitive decline [14] ."}, {"section_title": "Amyloid outcome measures in BioFINDER", "text": "Ab was measured using 18 F-flutemetamol PET if available (n 5 241), otherwise CSF Ab 42 was used (n 5 150). The scanning [15] and processing [13] procedures have been described previously. The weighted mean standardized uptake value ratio (SUVR) from a global neocortical region of interest [16] relative to a composite reference region (white matter, cerebellum and brainstem [13] ) was used to determine the Ab status. The SUVR cutoff for Ab positivity was determined using unbiased mixture modeling statistics, which is a well-validated method for determining such a cutoff [13, 17, 18] . The resulting cutoff for Ab positivity was .0.738 SUVR. LP and CSF handling followed a structured protocol [15] . CSF levels of Ab 42 were analyzed using INNOTEST ELI-SAs (Fujirebio Europe, Ghent, Belgium). The CSF Ab 42 cutoff for Ab abnormality was determined using the optimized Youden's Index against Ab PET in BioFINDER (CSF Ab 42 , 552 ng/L; sensitivity 93%, specificity 84%)."}, {"section_title": "Predictor variables of Ab positivity", "text": "Different types of predictors were examined in the primary analysis, including demographics (age, education, and sex), apolipoprotein E (APOE) genotype, cognitive test scores, and white matter lesions. The cognitive tests were administered by experienced research nurses who were blinded to the Ab status of the participants.\nAPOE genotypes were analyzed from blood samples, and the participants were stratified according to Ab risk into the following groups (see reference [19] for rationale): (1) ε2/ε2 or ε2/ε3, (2) ε3/ε3, (3) ε2/ε4 or ε3/ε4, and (4) ε4/ε4. APOE ε3/ε3 was the reference category. Episodic Q6 memory function was measured with the delayed recall part of the 10-word list from the ADAS-cog [20] . Cognitive function was also assessed with the Mini-Mental State Examination (MMSE) [21] . Both the total score and the score from the orientation and memory parts of the test were used. The scores from the orientation and memory parts of the MMSE were used based on previous findings showing that the orientation to time and place and 171  172  173  174  175  176  177  178  179  180  181  182  183  184  185  186  187  188  189  190  191  192  193  194  195  196  197  198  199  200  201  202  203  204  205  206  207  208  209  210  211  212  213  214  215  216  217  218  219  220  221  222  223  224  225  226  227  228  229  230  231 the three-word delayed recall parts can differentiate MCI and dementia due to AD from other causes of cognitive impairment [22, 23] . It consists of orientation to place (country, county/state, city, building/place, and floor), orientation to time (year, season, month, day of the week, and date), and three words that are being recalled after a short distraction task.\nWe also examined A Quick Test of Cognitive Speed (AQT)-color and form score, which is a sensitive test for attention and executive function to account for non-ADspecific cognitive impairment [24, 25] . AQT was used alone and as a ratio with the delayed word recall test and MMSE orientation and memory.\nMagnetic resonance imaging was performed on a 3-Tesla Siemens Tim Trio scanner (Siemens Medical Solutions, Erlangen, Germany). T2 FLAIR images were used for rating white matter lesions according to the ARWMC scale [26] to account for the impact of cerebrovascular pathology on cognitive impairment.\nIn a secondary analysis, we added the plasma biomarkers tau, the ratio of Ab 42 /Ab 40 , and NfL, which previously have been tested as AD biomarkers [27] [28] [29] . Plasma Ab 42 and Ab 40 levels were determined using the EUROIMMUN ELISAs (EUROIMMUN, Lubeck, Germany). The total levels of Ab 42 and Ab 40 were used to calculate the Ab 42 / Ab 40 ratio. Plasma tau and NfL concentrations were measured on a Simoa HD-1 analyzer using the Human Total Tau kit (Quanterix, Lexington, MA) for tau and an in-house assay based on the same antibodies and standard protein as in the commercially available NF-light kit (UmanDiagnostics, Ume a, Sweden) for NfL [30] . All predictor variables were available in all patients, except for plasma NfL and tau (n 5 346 of 391 participants)."}, {"section_title": "Validation cohort-Alzheimer's Disease Neuroimaging Initiative", "text": "A detailed study and data description of the Alzheimer's Disease Neuroimaging Initiative (ADNI) as well as inclusion/exclusion criteria and MCI definitions can be found on www.adni-info.org and in the Supplementary. Only nondemented subjects with cognitive symptoms were selected, which included participants with early and late MCI and participants from the healthy control cohort who had significant memory concerns.\nWe included only participants with a complete data set of cognitive test, APOE, and Ab data (Ab PET or CSF Ab 42 ). This selection resulted in a population of 661 participants, of which 170 had plasma biomarker data.\nAb status was based on (in order of preference) (1) Ab PET using the ligand 18 F-florbetapir, (2) Ab PET using the ligand 11 C-Pittsburgh Compound B (PiB), and (3) CSF Ab 42 measured using the multiplex xMAP Luminex platform (Luminex Corp, Austin, TX, USA) with the INNO-BIA AlzBio3 kit (Innogenetics, Ghent, Belgium) [31, 32] . Predefined cutoffs for Ab positivity were used for florbetapir (.1.11 SUVR) [33] , 11 C-Pittsburgh Compound B (.1.5 SUVR) [34] , and Ab 42 (,192 ng/L) [32] . The methods for these three measures have previously been described [32] [33] [34] .\nPlasma Ab 42 and Ab 40 were measured using the INNO-BIA plasma Ab immunoassay kit (Fujirebio, Ghent, Belgium) on the Luminex 100 immunoassay platform (Luminex Corp) [35] . The total levels of Ab 42 and Ab 40 were used to calculate the Ab 42 /Ab 40 ratio."}, {"section_title": "Statistical analysis", "text": "Group comparisons were done using the Mann-Whitney U test. In Table 1 , we applied Bonferroni correction to adjust for multiple comparisons. P values were thus multiplied by 6 and a value of ,0.05 was considered statistically significant. To predict Ab positivity, the following variables from the training cohort (BioFINDER) were entered in a general linear model: age, gender, presence of APOE ε2/ε2 or ε2/ ε3, presence of APOE ε2/ε4 or ε3/ε4, presence of APOE ε4/ε4 (APOE ε3/ε3 was not included because it was the reference variable), total MMSE score, the score from the orientation and delayed recall (memory) parts of the MMSE, the 10-word list delayed recall from ADAS-cog (number of errors), years of education, AQT score, 10word list delayed recall/AQT, MMSE orientation and memory/AQT, and degree of white matter lesions (ARWMC score). Using Ab status as the dependent variable, the general linear model was fitted to the data using the least absolute shrinkage and selection operator (LASSO) [36] . The LASSO analysis uses a type of forward selection logistic regression that provides more robust predictors because it penalizes the absolute value of the coefficients and shrinks irrelevant coefficients to zero. The LASSO was only used for selecting predictor variables in BioFINDER (the training cohort), it could not be directly applied to the ADNI data (validation cohort) because not all BioFINDER variables were present in ADNI (ARWMC and AQT data). To increase the applicability of an Ab risk model, we also used a reduced set of variables (but the same population) where we excluded the 10-word list delayed recall, AQT, and white matter lesions assessments because these measures are not always available in all settings. In a final step of Ab risk analyses, we added plasma tau, plasma NfL, and the plasma Ab 42 / Ab 40 ratio to the two LASSO models. The selected variables from the LASSO regression (variables with nonzero estimates) were entered in a logistic regression model to calculate the intercept, the coefficients, and the resulting area under the receiver operating characteristics curve (AUC). The Akaike Information Criterion (AIC) was used to assess the model fit in relation to its complexity (number of variables), where a drop of 2 indicated a statistically better model [37] . The best model was considered to be the one with the highest AUC and the lowest AIC. The logistic regression models from BioFINDER were then replicated in different subgroups in BioFINDER and in the 232  233  234  235  236  237  238  239  240  241  242  243  244  245  246  247  248  249  250  251  252  253  254  255  256  257  258  259  260  261  262  263  264  265  266  267  268  269  270  271  272  273  274  275  276  277  278  279  280  281  282  283  284  285  286  287  288  289  290  291  292   293  294  295  296  297  298  299  300  301  302  303  304  305  306  307  308  309  310  311  312  313  314  315  316  317  318  319  320  321  322  323  324  325  326  327  328  329  330  331  332  333  334  335  336  337  338  339  340  341  342  343  344  345  346  347  348  349  350  351 352 SMC, significant memory concern, WML, white matter lesions. NOTE. Data are given in mean values (standard deviation) if not otherwise specified. All P values are Bonferroni corrected (multiplied by 6) to adjust for multiple comparisons. Within population comparisons (Ab1 compared with Ab2): a P , .05; b P , .01; c P , .001. Comparison between ADNI and BioFINDER: d P , .05; e P , .01; f P , .001. Comparison between total and plasma populations in ADNI: g P , .05; h P , .01; i P , .001. *11 cognitively normal participants had progressed to MCI at the present study baseline, and these were approximated as EMCI. 355  356  357  358  359  360  361  362  363  364  365  366  367  368  369  370  371  372  373  374  375  376  377  378  379  380  381  382  383  384  385  386  387  388  389  390  391  392  393  394  395  396  397  398  399  400  401  402  403  404  405  406  407  408  409  410  411  412  413  414   415  416  417  418  419  420  421  422  423  424  425  426  427  428  429  430  431  432  433  434  435  436  437  438  439  440  441  442  443  444  445  446  447  448  449  450  451  452  453  454  455  456  457  458  459  460  461  462  463  464  465  466  467  468  469  470  471  472  473  474  475 independent ADNI cohort for a robust cross-validation. Equations for calculating the individual risk of being Ab positive were derived from the estimates and intercepts in the different models. The statistics were performed using R, version 3.3 (R Foundation for Statistical Computing, Vienna, Austria, 2013), and SPSS for Mac, version 22 (SPSS Inc., Chicago, IL). The amyloid risk models were implemented online using a R Shiny (version 1.0.0) program."}, {"section_title": "Results", "text": "The characteristics of training (BioFINDER) and validation (ADNI) cohorts are described in the Supplementary and shown in Table 1 ."}, {"section_title": "Establishing the amyloid prediction models in BioFINDER", "text": "The different Ab prediction models are illustrated in Fig. 1A and Supplementary Table 1 . The selected variables from the LASSO regression were age, APOE ε2ε2/ε2ε3, APOE ε2ε4/ε3ε4, APOE ε4ε4, and the 10-word list delayed recall (see Fig. 1 legend for a complete list of examined variables). Hereafter, this is referred to as the \"delayed recall\" model. In a multivariable logistic regression, coefficients and intercept were established ( Supplementary Fig. 1 ). The resulting area under the ROC curve (AUC) based on the probabilities from the model was 0.83 (95% CI 0.79-0.87) ( Fig. 1A , Supplementary Table 1 ). Because a 10word list, grading of white matter lesions, and AQT are not always available in all settings, we also ran another LASSO regression using the same population but removed these three measures. The variables selected by the LASSO regression were then age, APOE ε2ε2/ε2ε3, APOE ε2ε4/ ε3ε4, APOE ε4ε4, and MMSE orientation and memory. This is referred to as the \"MMSE model.\" In a logistic regression, this model had slightly less AUC than the delayed recall model (AUC 0.81, 95% CI 0.77-0.85), and a comparison of the AICs also favored the delayed recall model (DAIC 17).\nNext, we reran the aforementioned LASSO analyses but also included the plasma biomarkers Ab 42 /Ab 40 , NfL, and tau. The selected variables from the analysis were age, APOE ε2ε2/ε2ε3, APOE ε2ε4/ε3ε4, APOE ε4ε4, the 10word list delayed recall, and plasma Ab 42 /Ab 40 . This produced the best model with DAICs of 28 to 234 compared with the other models and the highest AUC of all models (0.85, 95% CI 0.81-0.89) ( Fig. 1A ; Supplementary  Table 1 ). When excluding grading of white matter lesions, AQT, and 10-word list delayed recall from the LASSO model, plasma Ab 42 /Ab 40 was again selected, in addition to age, APOE ε2ε2/ε2ε3, APOE ε2ε4/ε3ε4, APOE ε4ε4, and MMSE orientation and memory. The AUC from the logistic regression was 0.83 (95% CI 0.79-0.87), which was A vertical dashed line has arbitrarily been added at AUC 0.80 for easier comparison between the models. The delayed recall, MMSE, and plasma models were derived from the different sets of variables (but from the same population) using the LASSO analysis as the selection method. The AIC shows the model fit in relation to its complexity (number of variables) where lower AIC equals a better model fit (a decrease of 2 indicates a significantly better model). Detailed data of each cumulative step are shown in Supplementary Table 1. (B) shows univariate analyses of the selected variables. Note that the different APOE variables show the performance of each specified APOE group in contrast to all other groups. The complete performance of APOE (divided into 2, 3, and 4 groups, respectively) is shown in Supplementary Fig. 2 . Delayed recall model: Age, 10-word list delayed recall, APOE ε2ε2/ε2ε3, ε2ε4/ε3ε4, and ε4ε4. MMSE model: As above but with MMSE orientation and memory instead of delayed word recall. List of predictor variables in the LASSO analysis: 10-word list delayed recall (from ADAS-cog), MMSE total score (0-30 p), MMSE orientation and memory (0-13 p), AQT (including ratios with the other cognitive measures), white matter lesions (ARWMC scale), presence of APOE ε2ε2/ε2ε3, presence of APOE ε2ε4/ε3ε4, and presence of APOE ε4ε4. In the reduced set of variables (for the MMSE model), white matter lesions, delayed recall, and AQT were excluded (but the same population was used). In the secondary analyses, plasma NfL, plasma Ab 42 /Ab 40 ratio, and plasma tau were added to the two sets of variables (also using the same population). Abbre 476  477  478  479  480  481  482  483  484  485  486  487  488  489  490  491  492  493  494  495  496  497  498  499  500  501  502  503  504  505  506  507  508  509  510  511  512  513  514  515  516  517  518  519  520  521  522  523  524  525  526  527  528  529  530  531  532  533  534  535  536   537  538  539  540  541  542  543  544  545  546  547  548  549  550  551  552  553  554  555  556  557  558  559  560  561  562  563  564  565  566  567  568  569  570  571  572  573  574  575  576  577  578  579  580  581  582  583  584  585  586  587  588  589  590  591  592  593  594  595  596 favorable compared with the MMSE model without plasma Ab 42 /Ab 40 (DAUC 0.02 and DAIC 216). In univariate analyses of the selected variables from the LASSO regression, plasma Ab 42 /Ab 40 had the highest accuracy (AUC 0.74, 95% CI 0.69-0.79) ( Fig. 1B and Supplementary Table 1 )."}, {"section_title": "Replicating the models in ADNI", "text": "The BioFINDER models were replicated in both the ADNI subset where plasma Ab 42 /Ab 40 values were available (n 5 170) and in the total eligible ADNI population (n 5 661), that is, the equations in Supplementary Fig. 1 were tested in the ADNI samples (a new model was not fitted in ADNI). The different replications are shown in Fig. 2 and described with exact data in Supplementary Table 2 . When replicating the delayed recall model in ADNI, the AUC was 0.82 (95% CI 0.75-0.88) compared with 0.83 in Bio-FINDER. The AUC was 0.83 (95% CI 0.77-0.89) when replicating the delayed recall model plus plasma Ab 42 / Ab 40 (AUC 0.85 in BioFINDER). The MMSE model had an AUC of 0.81 (95% CI 0.75-0.88), equal to its original performance in BioFINDER (AUC 0.81, 95% CI 0.77-0.85). Similar performance was seen when adding plasma Ab 42 / Ab 40 (AUC 0.83, 95% CI 0.76-0.89, in ADNI compared with 0.83, 95% CI 0.77-0.85, in BioFINDER). In the total ADNI population (n 5 661), both the delayed recall and MMSE models had AUC of 0.80 (95% CI 0.77-0.84 and 0.77-0.83, respectively). The performance of the models in the eight different subpopulations in BioFINDER and ADNI ( Fig. 2 and Supplementary Table 2 ) was robust when tested within different age strata or within different groups of cognitive impairment (subjective cognitive decline, early MCI, and late MCI)."}, {"section_title": "Calculating the individual risk of being amyloid positive", "text": "The models were implemented and published on http:// amyloidrisk.com where the individual probability of being Ab positive can be calculated, including a 95% CI of the predicted probability. The plasma models were not implemented on the website because we believe further research is needed in terms of assay standardization and preanalytical protocols. ROC curves with sensitivity and specificity for each amyloid risk probability is shown in Fig. 3A-D specificity 83%), 59% probability for the MMSE model (sensitivity 66%, specificity 83%), 43% for the delayed recall model plus plasma Ab 42 /Ab 40 (sensitivity 85%, specificity 71%), and 50% for the MMSE model plus plasma Ab 42 /Ab 40 (sensitivity 75%, specificity 77%)."}, {"section_title": "Discussion", "text": "In this study, we have developed four different amyloid risk models based on consecutively recruited nondemented patients in BioFINDER (n 5 391). The models, which included the predictors age, APOE genotype, and parts of the MMSE or a delayed recall test, could accurately predict Ab positivity (AUCs 0.81-0.83) and were validated in an independent population (ADNI, n 5 170-661) with similar accuracies. The addition of plasma Ab 42 /Ab 40 to APOE, age, and brief cognitive testing increased the accuracy slightly.\nThere are several previous suggestions on how to estimate Ab positivity based on MRI measures, neuropsychological tests, APOE genotypes, and blood-based biomarkers [8, 9, 12, [38] [39] [40] [41] . For example, we previously found that a combination of demographics, APOE, and longitudinal cognitive testing could be used to identify Ab positivity in cognitively healthy controls [12] . Recently, age and APOE were examined as predictors of Ab positivity in MCI and subjects without objective cognitive decline [42] . The AUCs in that study were lower (0.74-0.75), and no increase in AUC was seen when MMSE was added. This might be explained by how APOE was coded (only as ε41/2) and that they used the total MMSE score, in contrast to the present study where we used four APOE groups based on their different contributing risks to Ab accumulation [19] and the use of only AD-specific parts of the MMSE score (orientation and memory) [22, 23] .\nA common limitation in many of the previous studies is that the Ab prediction models have not been validated in an independent population. In the present models, we only used biomarkers or measures that previously have 720  721  722  723  724  725  726  727  728  729  730  731  732  733  734  735  736  737  738  739  740  741  742  743  744  745  746  747  748  749  750  751  752  753  754  755  756  757  758  759  760  761  762  763  764  765  766  767  768  769  770  771  772  773  774  775  776  777  778  779  780   781  782  783  784  785  786  787  788  789  790  791  792  793  794  795  796  797  798  799  800  801  802  803  804  805  806  807  808  809  810  811  812  813  814  815  816  817  818  819  820  821  822  823  824  825  826  827  828  829  830  831  832  833  834  835  836  837  838  839  840  841 been shown to either be associated with Ab deposition or to predict future development of AD dementia [19, 23, 27, 41] , to reduce the risk of random inaccurate findings. The robustness of the models was confirmed by validating them in the independent ADNI population and in eight different subgroups ( Fig. 2A-D) . Note that the models performed well also in selected populations of individuals with only subjective cognitive symptoms (BioFINDER) and significant memory concerns or early MCI (ADNI), which may be of high interest in clinical trials of novel treatments. This also shows that the high accuracy of the models was not driven by the difference in cognitive status between subjective cognitive decline and MCI (BioFINDER) or early MCI and late MCI (ADNI). The training (BioFINDER) and validation (ADNI) cohorts are different in many ways, which makes it more likely that the established models are indeed generalizable. The differences include, for example, geographic locations (Sweden and North America), education levels (lower in BioFINDER, high in ADNI), cognitive tests in different languages, and the patient selection process (consecutively recruited subjects referred to memory clinics in BioFINDER; selected enrollment in ADNI). Nonetheless, we want to mention potential limitations in these cohorts. The amyloidosis is to a large extent associated with lateonset AD, and the applicability in early-onset AD remains to be tested. The models need further validation in unselected primary care populations with individuals who seek medical care due to cognitive complaints (i.e., tested in populations with lower prevalence of Ab positivity). Finally, the models should be validated in populations where the prevalence of different APOE genotypes differs from the North European/North American populations used in the present study [43] .\nOne popular aim has been to try to identify blood-based AD biomarkers. Plasma biomarker signatures of brain Ab has, however, been difficult to replicate. Voyle et al. [8] recently performed a large attempt to validated 35 different plasma proteins that had predicted Ab positivity in previous studies [38] [39] [40] 44] . Unfortunately, none of the proteins were significantly associated with neocortical Ab burden in the independent cohort. In the present study, we examined the additive effect of plasma Ab 42 /Ab 40 , NfL, and tau in our models because these biomarkers have been associated with AD [27] [28] [29] . Although levels of NfL were significantly higher in Ab-positive individuals ( Table 1) , only plasma Ab 42 /Ab 40 was an independent predictor of brain Ab in addition to age, APOE genotype, and cognitive testing. Plasma Ab 42 /Ab 40 was also the predictor with the highest accuracy in the univariate analysis ( Fig. 1B) . It increased the AUC in both the delayed recall and MMSE models ( Fig. 1A and Supplementary Table 1 ) and increased the AUC when replicated in ADNI (Fig. 2C-D and Supplementary Table 2 ). However, the clinical relevance of such a small increase in AUC is limited.\nAlso, assay-dependent differences, or possibly preanalytical factors, may have contributed to different levels in the cohorts (Table 1) . This highlights the need for an optimal unified analysis method for plasma Ab 42 /Ab 40 . Promising results with very high accuracies have been seen using mass spectrometry [45, 46] , but unfortunately this is an advanced and time-consuming technique that cannot be implemented in primary care or large screening settings in the near future.\nWe propose that the presented models could be useful in mainly two settings, clinical AD trials and primary care. In clinical trials aimed at Ab-positive subjects, amyloid risk models could reduce the number of unnecessary Ab PET scans or LPs. In Fig. 4 , we illustrate such a scenario using the delayed recall model. Here, we assume that 1000 Ab-positive subjects are to be included in a clinical trial where Ab PET is used to verify and assess the Ab burden. An amyloid risk screening process in a population similar to the BioFINDER cohort could reduce the number of unnecessary (negative) Ab PET scans by w90% and reduce the costs by .3.5 million USD [12, 47] , when using a probability cutoff of .80% for undergoing an Ab PET scan. In the trial scenario, the objective is thus to increase Ab prevalence of the eligible population (high specificity). On the other hand, in a primary care workup of cognitive impairment or in a scenario where anti-Ab drugs have become available, a high sensitivity may be preferred. Here, a probability threshold of around 30% would perhaps be more suitable to ensure a sensitivity of .90% (Fig. 4) . To facilitate such a use of the risk models, we have implemented them on http://amyloidrisk.com where age, APOE genotype, and cognitive test score can be entered to calculate the individual probability of being Ab positive. The website is only intended for research and education until further validation has been conducted, but we believe it can be a useful tool for deciding who should undergo further evaluation with LP or Ab PET to verify the presence of Ab pathology .  842  843  844  845  846  847  848  849  850  851  852  853  854  855  856  857  858  859  860  861  862  863  864  865  866  867  868  869  870  871  872  873  874  875  876  877  878  879  880  881  882  883  884  885  886  887  888  889  890  891  892  893  894  895  896  897  898  899  900  901  902   903  904  905  906  907  908  909  910  911  912  913 is providing funds to support ADNI clinical sites in Canada. Private sector contributions are facilitated by the Founda-tion for the National Institutes of Health (www.fnih.org). The grantee organization is the Northern California Institute for Research and Education, and the study is coordinated by the Alzheimer's Disease Cooperative Study at the University of California, San Diego. ADNI data are disseminated by the Laboratory for Neuro Imaging at the University of Southern California. S.P., P.S.I., N.M., and E.S. report no conflicts of interest. B.B. is a full-time employee of Euroimmun. K.B. has served as a consultant or at advisory boards for Alzheon, BioArctic, Biogen, Eli Lilly, Fujirebio Europe, IBL International, Merck, Novartis, Pfizer, and Roche Diagnostics. K.B. and H.Z. are co-founders of Brain Biomarker Solutions in Gothenburg AB, a GU Venture-based platform company at the University of Gothenburg. H.Z. has served at advisory boards of Eli Lilly and Roche Diagnostics and has received travel support from TEVA. O.H. has acquired research support (for the institution) from Roche, GE Healthcare, Biogen, AVID Radiopharmaceuticals, Fujirebio, and Euroimmun. In the past 2 years, he has received consultancy/speaker fees (paid to the institution) from Lilly, Roche, and Fujirebio. In this scenario, we assumed the same prevalence of Ab positivity as in the BioFINDER study and a trial design that required 1000 Ab1 subjects to be enrolled and Ab status verified using Ab PET (with an approximate cost of 4000 USD per PET scan [12, 47] ). The y-axis shows the total Ab PET cost, and the x-axis shows the probability of being Ab positive according to the delayed recall model (this probability output is available on http://amyloidrisk.com). The line in the graph shows the study cost as a function of the Ab probability, with the number needed to screen with the amyloid risk model on the left side (the prescreening process) and the number needed to undergo an Ab PET scan to verify the Ab status on the right side (normal trial screening process). The small costs for APOE genotyping (approximately 40 USD) and for administering the cognitive test were disregarded. The costs for verifying the Ab status using LP and CSF Ab42 analysis are approximately 10% of the costs for an Ab PET scan (in Europe) [47, 48] , so the costs on the y- "}]