[{"section_title": "INTRODUCTION", "text": "Participation in science, technology, engineering, and mathematics (STEM) has historically been a White male endeavor in the United States, with women and people of color much less likely to enter occupations in related fields (Campbell, Denes, & Morrison, 2000;Seymour & Hewitt, 1997). Recent reports by the National Academy of Science (NAS) sounded an alarm concerning the national need for more workers trained in STEM fields to maintain the economic supremacy of the United States and articulated the need for individuals from all backgrounds to participate to meet this increasing demand (NAS, 2007(NAS, , 2010. An increase in the supply of individuals working in STEM fields in the coming years necessarily requires that current generations of youth, regardless of gender or racial/ethnic background, aspire to eventually work in such domains. Prior research on equity and the paths that individuals take to ultimately reach a STEM occupation often focuses on students' choices to enter a STEM major during college as a critical point in the pathway and likely indicator of the desire to procure a future job in a STEM field (Chen, 2009;Correll, 2001;Xie & Shauman, 2003). But what do we know about equity at earlier points in time? There is a growing recognition that beginning with the early years of adolescence, individuals think concretely about future careers, and such thoughts hold strong sway over subsequent actions in preparing for their chosen career (Auger & Blackhurst, 2005;Bandura, Barbaranelli, Caprara, & Pastorelli, 2001). Building on this premise, our study contributes to the literature on STEM inequality by utilizing data on a recent national cohort of eighth-grade students to examine issues of equity in the formation of career aspirations in science and math during the critical juncture of adolescence. Specifically, we consider how the factors typically implicated in explaining disparities in STEM choices among young adults, namely attitudes and academic achievement, might help to account for differences in who aspires to a related career at earlier ages. Drawing on the expectancy-value model developed by Eccles and her colleagues (Eccles, 1994;Eccles, Wigfield, & Schiefele, 1998), we investigate how differences in self-concept and the intrinsic value students have for science and math are related to disparities in aspirations, as well as the potentially independent contribution of student achievement. Based on prior literature, there is reason to believe that such aspects of the expectancy-value model are likely to help explain gender disparities in aspirations among adolescent youth, whereas racial/ethnic disparities might be more related to achievement gaps. Yet rather than consider either gender or racial/ethnic disparities in career aspirations in the aggregate, our study departs from much of the previous literature on STEM equity by considering the intersection of gender and race/ethnicity, and therefore examining the potentially unique experiences of different subgroups, such as Black females or Hispanic males (Andersen, 2005;Browne & Misra, 2003). Because STEM fields have traditionally been the domain of White males and continue to be stereotyped as such (Buck, Clark, Leslie-Pelecky, Lu, & Cerda-Lizarraga, 2008;Scherz & Oren, 2006), we consider how different gender and racial/ethnic subgroups compare to White males in their likelihood to aspire toward a science or math occupation and the extent to which differences in attitudes and achievement might not necessarily play similar roles for each subgroup. In sum, our study highlights the importance of disparities that appear early in young people's lives yet have likely consequences that reach far into their educational and occupational trajectories. By examining inequality during adolescence, we gain a more in-depth understanding of the factors that set the stage for future inequality and perhaps gain insights into how to better promote equality among subsequent generations of youth."}, {"section_title": "THE TIMING OF INEQUALITY", "text": "Studies examining the intended or declared college majors of young adults clearly indicate patterns of inequality. For example, examining a national sample of high school seniors, Xie and Shauman (2003) found strong gender disparities in the intent to declare a STEM major in college, such that the probability of reporting an intended STEM major was 60% less for females than for males. Similarly, there is a wealth of evidence of documenting the underrepresentation of women in postsecondary majors in the fields of the physical sciences and engineering (Correll, 2001;National Science Board, 2004;Simon & Farkas, 2008). These gender gaps are subsequently echoed in the lower relative percentages of women found in STEM occupations in the labor force (Blickenstaff, 2005;Xie & Shauman, 2003). Patterns of inequality by race/ethnicity are not as clear, as some recent research finds that despite the many educational disadvantages minority students often face, Black and Hispanic students high school students have similar or even greater interest in pursuing STEM majors in college compared to White students (Anderson & Kim, 2006;Hanson, 2006). Yet Black and Hispanic individuals are clearly still underrepresented among recent cohorts of college graduates in STEM fields as well as in the labor force, indicating that much inequality remains (Lewis, Menzies, Najera, & Page, 2009). Compared to this body of research on young adults, there is much less research on a national scale on the development of career ambitions in STEM fields during earlier points in the life course, such as the critical juncture of adolescence. This is likely due, at least in part, to issues of limited data availability, as national data sets collected by organizations such as the Department of Education and the National Science Foundation rarely include survey participants younger than high school age. This research emphasis on older teens and young adults also likely reflects a belief in the importance of the time period more proximate to entry into the labor market. Yet there is very good reason to expect that the processes and experiences that function to produce inequality in later years begin much earlier. Social psychological research indicates that the decisions and preferences individuals develop during adolescence are formative for their future occupational trajectories as adults (Bandura et al., 2001). During the years of early childhood, ideas about future occupations are driven highly by fantasy (Seligman & Weinstock, 1991). As they get older, youth begin to replace such imaginative notions with more concrete ideas about their likely future occupations. While there is some debate about the particular age range when this occurs (Auger & Blackhurst, 2005), there is general agreement that by the years of adolescence, most individuals have developed career aspirations that center on real occupations about which they have at least some information and exposure (Gottfredson & Lapan, 1997;Seligman & Weinstock, 1991). Furthermore, such aspirations are indeed highly predictive of subsequent educational and occupational attainment, as adolescents begin to consciously choose courses and make other decisions about spending time in extracurricular activities that are consistent with a trajectory toward certain fields and inconsistent with others (Bandura et al., 2001;Eccles, 1994). Therefore, in this study, we seek to contribute to the literature on inequality in STEM fields by considering the extent to which disparities in career aspirations exist among adolescent youth. We consider the potentially divergent patterns by gender and race/ethnicity at this time point with the goal of providing valuable information about the early emergence of inequality and subsequently highlighting the factors that may function to decrease it."}, {"section_title": "SHAPING FUTURE CAREERS: THE ROLE OF ATTITUDES AND ACHIEVEMENT", "text": "Previous research indicates that the strongest determinants of entering a STEM major in college are students' prior academic preparation as well as their attitudes toward science and math in high school (Correll, 2001;Tai, Liu, Maltese, & Fan, 2006). Correspondingly, research that attempts to explain patterns of inequality in degree attainment and occupations in STEM fields tends to focus on these factors as likely determinants of disparities. This is the case particularly for the wealth of prior literature exploring the gender gap in STEM college majors and the labor force, which generally outweighs the amount of similar research focusing on aggregate racial/ethnic disparities (NAS, 2010). In the next section, we consider whether attitudes and academic achievement are similarly likely to be key factors in explaining disparities in the science and math career aspirations of youth of adolescent age. Later, we discuss the limitations of much prior STEM research due its general focus on only one dimension of inequality-either aggregate gender or racial/ethnic differences-and explain the contribution of this study toward a richer and more detailed picture of inequality at the intersection of gender and race/ethnicity."}, {"section_title": "Attitudes", "text": "With regard to attitudes, the expectancy-value model developed by Eccles and her colleagues posits that expectancies of success and subjective task values are key predictors of academic decision making that are related but distinct. Expectancies of success are defined as individuals' beliefs about how well they perform on a future task. However, based on empirical studies of the very high correlation between self-concept and expectancy of success and their similar association with academic choices, many studies of the expectancy-value model utilize measures of students' self-concept (Wigfield & Eccles, 2000). Subjective task value is multidimensional in nature, with intrinsic value, or the enjoyment that a person gets from performing an activity, defined as a key component (Eccles, 1994;Eccles et al., 1998;Wigfield & Eccles, 2000). 1 The Eccles et al. model has been used in many studies in the United States as well as other countries to explore gender differences in science and math during the high school and college years (American Association of University Women Educational Foundation [AAUWEL], 2008;Blickenstaff, 2005;Correll, 2001;Eccles, 1994;Eccles et al., 1998;Nagy, Trautwein, Baumert, Koller, & Garrett, 2006). There is generally strong evidence that females are less confident in their math and science abilities than their male peers, and that they similarly find these subjects less enjoyable (Eccles & Wigfield, 2002). While the origin of such attitudinal differences is typically attributed to gender socialization processes, the consequences play out in women's lower aspirations and subsequent rates of entry into college degrees and related jobs in STEM fields. For example, research on a national sample of high school seniors found that female students' relatively lower self-perceptions of math abilities are a key factor behind the gender gap in declaration of a STEM major (Correll, 2001). Yet the process by which females may view science and math occupations less favorably because of their lower confidence and affect toward these areas is likely to begin long before high school (Bandura et al., 2001). Although most research exploring expectancyvalue explanations for gender differences in academic choices and aspirations targets high school and college students, Eccles' research also shows evidence of gender differences in attitudes in science and math among adolescents, particularly with regard to measures of self-concept. Such attitudinal differences are therefore likely to translate into lower career aspirations in these fields among young females during this critical period of adolescence, one where gender identity becomes particularly salient. It is important to point out that the Eccles et al. model was designed with the issue of gender differences in academic choices in mind and, therefore, does not necessarily speak to issues of racial/ethnic inequality. In contrast to the pronounced attitudinal differences between individuals of different genders and across age groups, prior research has found that attitudes toward science and math are generally as favorable among Black and Hispanic youth as they are among White students, for both children and young adults (Muller, Stage, & Kinzie, 2001). Thus, it may be that explanations based on the expectancy-value model do not apply as well when considering racial/ethnic disparities in aspirations."}, {"section_title": "Achievement", "text": "Prior research has also explored the extent to which differences in achievement during the high school and early college years help to explain differences in field of study and career plans. Course prerequisites or standards for acceptable test scores and grades act as a structural filter in allowing students to continue in a STEM trajectory at this level. In addition, beyond how an individual perceives their own ability, grades, and test scores serve as objective feedback about realistic prospects for success in a field, prompting students to sometimes make necessary adjustments to their future plans (Schneider & Stevenson, 1999). In terms of explaining disparities in STEM fields, the notion that women's lower presence in postsecondary majors and related occupations is a consequence of their lower achievement and/or ability continues to persist. This is despite the fact that it has been largely rejected by recent research. Aggregate gender gaps in test scores have largely disappeared (Hyde, Lindberg, Linn, Ellis, & Williams, 2008) and remaining differences are too small to explain the large disparities in intended major and ultimate degree attainment and employment (Simon & Farkas, 2008;Xie & Shauman, 2003). Similarly, with regard to the particular focus of this study, it seems unlikely that achievement disparities could help to explain gender differences in career aspirations among adolescent youth, especially as achievement differences between genders are well noted to be smaller during earlier years of schooling (AAUWEL, 2008;Hyde et al., 2008). In contrast, although there is less national-level research on the obstacles to equity in STEM fields focusing on race/ethnicity than on gender, the existing evidence nevertheless suggests that achievement is a key obstacle to equity later in STEM pathways (Anderson & Kim, 2006;Campbell et al., 2000). While average test scores in science and math for Black and Hispanic high school youth continue to trail those of their White counterparts by differences of a standard deviation or more, large differences are also apparent as early as elementary school (Berends, Lucas, & Penaloza, 2008;Philips, Crouse, & Ralph, 1998). Therefore, to the extent that minority adolescent youth are less likely to aspire toward a career in science or math, it seems likely that achievement differences may be a key component of the story. Arguably now more than at any other time in our educational history, students in the age of No Child Left Behind (NCLB) are well aware of how their skills do-or do not-match up to external expectations of their academic proficiency in math and science. Independent of their own interest or feelings of competence, external feedback to the contrary may serve to dampen career aspirations. Indeed, lower levels of achievement could prompt teachers or others to discourage minority students away from future prospects considered unlikely."}, {"section_title": "CONSIDERING THE INTERSECTION OF GENDER AND RACE/ETHNICITY", "text": "Thus stepping back, it appears that there might be different explanations relevant when considering the gender gap in career aspirations among adolescents than when considering the racial/ethnic gap. Yet to better explore issues of equity, we argue that we should go further than exploring whether different factors may lie behind gender disparities on the one hand and racial/ethnic disparities on the other. Theories of intersectionality suggest that a focus on aggregate gender differences across individuals from different backgrounds essentially assumes that one set of experiences and outcomes applies generally to all females whereas another applies to all males, an assumption that can produce misleading or inaccurate overgeneralizations (Andersen & Collins, 1995;Browne & Misra, 2003;Hanson, 2006). Correspondingly, a focus on racial/ethnic differences assumes common patterns and processes for different genders. Instead, an intersectional perspective argues that there are \"interlocking, overlapping, and mutually reinforcing connections\" between race/ethnicity and gender (Andersen, 2005). According to such theories, the intersection of the two socially constructed categories of gender and race/ethnicity generates unique histories and experiences for each group at each point of intersection (Collins, 1998). Rather than considering gender and racial/ethnic subgroups, such as Black females, most prior research considers one axis of stratification (i.e., gender) as the focal point, while holding another (i.e., race) constant (Browne & Misra, 2003). Yet in doing so, a richer, more nuanced, and accurate conceptualization of inequality is lost (Johnson, 2007). For example, when considering previous gender research that finds that less positive attitudes toward science and math lead females to choose non-STEM majors (Correll, 2001), along with other research on race/ethnicity which finds that Black and Hispanic youth have as favorable or even more favorable attitudes toward science and math as White students (Muller et al., 2001), what do such patterns then tell us about minority females? With regard to achievement, how do findings about the slightly higher science test scores of male versus female high school students apply to minority male students, who are arguably the most academically at-risk or disadvantaged group (Hyde et al., 2008)? Thus, a focus on either aggregate gender or racial/ethnic differences can obscure the unique patterns and positions of particular subgroups and lead to conclusions about equity that are too simplistic, broad, or perhaps just erroneous. Therefore, in this paper we build upon and extend previous research that examines only type of inequality-either gender or race/ethnicity-by considering how the intersection of the two may be related to adolescent youth's career aspirations. Because White males have historically dominated STEM occupational fields, both in sheer number and in people's perceptions of the normative picture of a scientist, we consider them the relevant reference group (Buck et al., 2008;Clewell, Anderson, & Thorpe, 1992;Seymour & Hewitt, 1997). Therefore, we investigate how different racial/ethnic and gender subgroups compare to White males in terms of adolescent career aspirations in science and math, further considering the role that achievement and attitudes may play in shaping disparities at this early point in occupational trajectories."}, {"section_title": "DATA", "text": "We use the U.S. data from the 2003 Trends in International Mathematics and Science Study (TIMSS). This is a cross-sectional study carried out by the International Association for the Evaluation of Education Achievement that looks at mathematics and science achievement and attitudes of fourth-and eighth-grade students in 53 countries. For our purposes, we utilize the nationally representative sample of eighth-grade students from the United States as it is the only recent national data set that provides the opportunity to examine the STEM-related career aspirations of adolescent youth. 2 The 2003 TIMSS uses a two-stage sampling design, where schools are sampled and then classrooms within those schools. The eighth-grade sample includes 232 schools, with selection based on the probability proportional to each school's estimated enrollment, and two classrooms sampled within each school (Martin, 2005). We limit our sample to White, Black, and Hispanic students. 3 Furthermore, we include only those students with valid responses to our dependent measures. All other missing values are imputed using single imputation in Stata. Dependent Variables. Students were asked separate questions about their career aspirations in the field of science and math. Specifically, they were asked, \"How much do you agree with these statements about science? I would like a job that involves using science.\" A parallel version was asked for math. Because we were interested in parsing out those students who already had a strong aspiration toward a career in the subject, we dichotomize the original coding of both variables so that \"agree a lot\" has a value of 1, and \"disagree a lot,\" \"disagree a little,\" and \"agree a little\" make up the reference category (0). Although many studies of intended and declared college major choose to collapse across fields, we chose to model the decision to aspire toward a science career as distinct from that for math. Our decision is further validated by a cross-tabulation of the two indicators, as substantially less than half of students who report wanting a career in one field also report wanting a career in the other. Independent Variables. To capture students' attitudes toward science and math as outlined in the Eccles et al. expectancy-value model, we chose two variables (for each subject). First, a key element of subjective task value is represented by students' intrinsic interest. This is measured by students' response to how much they agree with the statement, \"I enjoy learning science (or math).\" For each subject, we dichotomized this variable to be 1 if students \"agree a lot\" and 0 if students \"disagree a lot,\" \"disagree a little,\" or \"agree a little.\" To capture students' self-concept, we use students' agreement with the statement, \"I usually do well in science (or math).\" This variable is also coded so that a value of 1 indicates that the students reported that they \"agree a lot\" and is coded 0 otherwise. To measure students' achievement in science and math, we utilize the tests administered by TIMSS in each subject. As typical in most large-scale educational surveys, TIMSS employed item response theory to estimate plausible values for students' scores in each subject, as students did not answer every item on each test. Test scores are on a scale with a mean of 500 and a standard deviation of 100. As recommended in the TIMSS User's Guide, we average the five plausible values generated by TIMSS for each subject assessment to approximate each student's math and science score (Martin, 2005). While students' attitudes and achievement in science and math are our key independent variables of interest, we control on other characteristics that may be associated with career aspirations. To account for differences in family socioeconomic background, we include two variables. Parental education level is student reported and coded as less than high school, finished high school, obtained a vocational or technical associates degree or certificate, graduated from a 2-or 4-year college, or obtained an advanced degree. The highest education achieved is used unless one parent is missing this information, in which case the nonmissing parent education is used. We also include a measure of how many books are in the students' homes. This is coded on an ordinal scale with five categories, ranging from \"none or few\" to \"three or more bookcases full of books.\" questions about students' career aspirations in math and science as they did in 2003. Thus, the data utilized here are the most recent national data available that can be used to address our questions of interest. To better ascertain the particular association between students' career aspirations and their science or math attitudes in particular, rather than positive attitudes toward school and education in general, we included two additional variables. The first measures educational expectations on an ordinal scale according to students' responses about how far they expect to go in school, with answers coded as finishing high school, completing vocational/technical training or community/junior college, obtaining a bachelor degree from a college or university, or going beyond a bachelor degree. We also control for students' general (rather than subject-specific) attitudes toward school by including a dichotomous variable indicating whether the student strongly agrees (vs. agrees a little, disagrees a little, or disagrees a lot) with the statement, \"I like being in school.\" Finally, students' race/ethnicity and gender are self-reported. 4 Table 1 presents descriptive statistics, and then Tables 2 and 3 present the results of logistic regression analyses indicating who wants a career in science and in math, respectively. All analyses utilize sampling weights provided by TIMSS to account for unequal probability of selection. In addition, we use the \"survey\" commands in Stata to calculate robust standard errors that adjust for the clustering of students within schools. Finally, it is important to remind the reader of the cross-sectional nature of the TIMSS data, such that our measures of career aspirations, attitudes, and achievement are all measured at the same time. Therefore, we have no ability to make causal inferences but instead can only speak to the associations we observe among a nationally representative sample of eighth-grade youth."}, {"section_title": "ANALYSES AND RESULTS", "text": "The first rows in Table 1 show the proportion of each racial/ethnic and gender group that strongly agree that they want a job in science or in math. Approximately 26% of White males report wanting a job in science. This is not statistically different from the percentages of Black males also wanting a job in science. In contrast, White females, Black females, and Hispanic students of both genders report that they want a science job at statistically significantly lower rates than White males (although the difference for White females is only marginally significant, p value = .06). For math, approximately 19% of White eighthgrade males report wanting a future job in this field, which is not significantly different from the percentage of Black males, Black females, or Hispanic males reporting such an aspiration. White females and Hispanic females, however, are significantly less likely than White males to report wanting a math job (about 11% for both female groups). With regard to students' attitudes toward science and math in the following rows in Table 1, we see that approximately 40% of White males report that they strongly enjoy science, which is not significantly different from the percentage of Black or Hispanic males that strongly enjoy science. Females of all racial/ethnic groups report lower science enjoyment than White males (and therefore also lower than their male peers in the same racial/ethnic group). Subsequent chi-square tests confirm that, generally speaking, all students report significantly lower enjoyment of math than of science in the eighth grade. Approximately 20% of White males report a strong enjoyment of math, which is comparable to the percentage of Hispanic females who feel that way, but in fact significantly lower than the corresponding percentage of Black males, Black females, and Hispanic males. Indeed, White females are the only group who report significantly less enjoyment of math than White males. Slightly less than 50% of White males report high levels of self-concept, such that they report doing very well in science. This is significantly higher than for all other groups with the exception of Black males. Approximately, 43% of White males report high self-concept in math, which does not differ from reports by Black males, but is significantly higher than the remaining groups (which includes females of all groups as well as Hispanic males). Turning to the means for math and science test scores, we see that White males have the highest test scores in both subjects compared to all other groups. It is also clear that while White males do have a test score advantage over their White female peers, this disparity is modest when considered next to the disparities observed between White males and Black and Hispanic youth of both genders. For example, the difference between the average science test score for Black females and White males is approximately one and a half standard deviations. In general, White males have an advantage of a standard deviation or more compared to Black and Hispanic students for test scores in both subjects. In sum, minority adolescent boys tend to have rather similar attitudes toward science and math compared to White adolescent boys. Yet the achievement of Black and Hispanic male youth trails behind that of White males by a very large margin. Females from all backgrounds tend to have less enjoyment and self-concept in math and science than White males, with the exception found for math such that only White females report significantly less math enjoyment than their male peers. In addition, in some sense, Black and Hispanic females could be considered doubly disadvantaged, as both their achievement test scores as well as their attitudes are far below those of White males. Finally, we include means and standard deviations by subgroup for all of our control variables in the analyses. We note that White students of both genders have generally higher levels of parental education and report more books in the home than their Black and Hispanic peers. 5 In addition, White males were significantly lower than all other subgroups in terms of liking school. White and Black females reported significantly higher educational expectations than White males, whereas Hispanic students of both genders reported significantly lower expectations. Table 2 displays results from logistic regression analyses predicting whether or not students report having strong aspirations for a career in science. We present odds ratios, which indicate the change in the odds of aspiring to a science career that is associated with a unit change in a given independent variable. In general, odds ratios greater than 1 indicate an increase in the likelihood of having science career aspirations, whereas ratios less than 1 would indicate a decrease. With regard to our interest in gender and racial/ethnic disparities, we choose White males as the reference category and enter separate indicators for each remaining subgroup (Black females, Hispanic males, etc.). By looking at the odds ratios, we can therefore see whether each subgroup is more likely (ratio greater than 1) or less likely (ratio less than 1) than White males to report having science career aspirations. With the addition of measures of attitudes and achievement in subsequent models, we can then examine whether gender and racial/ethnic patterns change once these other indicators are taken into account. 6 Consistent with the patterns observed in Table 1, in Model 1 of Table 2 we see that with the exception of Black male students, youth from all other racial/ethnic and gender subgroups are statistically significantly less likely than White males to desire a science career (although the odds ratio for White females is only marginally significant at p = .06). Model 2 adds measures of family social class background as well as general educational attitudes. The odds ratio for Hispanic males increases toward 1 and is no longer statistically significant. Supplemental analyses confirm that it is the inclusion of the social background measures of parent education level and number of books in the home in Model 2 that lead to this change. 7 While there are significant main effects for the measure of number of books in the home, liking school, and educational expectations on wanting a career in science, the inclusion of these measures does not change the fact that White, Black, and Hispanic females remain less likely than White males to desire a science career (indeed the odds ratio for White females decreases and is now significant at p < .001 due to including liking school and school expectations, two measures on which they have an advantage)."}, {"section_title": "Results of Logistic Regression Analyses: Predicting Science Career Aspirations", "text": "In Model 3, we add the measure for enjoying science to the model, which has a positive and significant association with science career aspirations. For both White and Hispanic females, the odds ratios increase toward 1 and are no longer statistically significant. This indicates that White and Hispanic females with the same level of science enjoyment as White males have comparable aspirations toward a science career. In Model 4, we remove the enjoyment measures and add the measure for science self-concept, so that we can observe the independent associations of each of these attitude measures with career aspirations. Science self-concept also has a positive and significant association with science career aspirations. In this model, White females are once again less likely to want a science career than their male peers, but for Hispanic females, adding self-concept has the same result as adding science enjoyment observed in Model 3, namely that it increases the odds ratio toward 1 and it is no longer statistically different from White males. So for Hispanic females, self-concept and enjoyment have the same association in terms of explaining their lower relative aspirations toward science careers. This stands in contrast to the result observed for White females, where accounting for differences in self-concept does not change their lower observed aspirations relative to White males. In Model 5, we add students' science test scores, which also have a positive and significant association with science career aspirations. With the inclusion of this measure, White girls remain less likely than their White male peers to report wanting a job in science. However, Black and Hispanic girls now have equal odds of declaring science career aspirations as White males. We note that the addition of test scores to the model is the only instance where we see the female Black odds ratio increase toward 1 and become nonsignificant, suggesting that achievement differences may be particularly important in understanding their relatively lower science career aspirations relative to White males. Model 6 is the full model, which includes test scores as well as enjoyment and self-concept in science. When all of these factors are taken into account, no gender or racial/ethnic disparities exist in aspirations toward a science degree. Also, we note that enjoyment and self-concept continue to be positively and significantly associated with science career aspirations net of test scores, although the magnitude of the associations is attenuated when all three measures are in the model together. 8"}, {"section_title": "Results of Logistic Regression Analyses: Predicting Math Career Aspirations", "text": "We now turn to the results predicting the math career aspirations of adolescent youth. Consistent again with Table 1, the results of the baseline model in Table 3 indicate that White and Hispanic girls have significantly lower odds of aspiring toward a math career. Specifically, they are approximately 50% less likely than White males to report such an aspiration. Black youth of both genders and Hispanic males are as likely as White males to report a strong aspiration toward a math career. Model 2 adds indicators of social class and general school attitudes. We observe no change to the odds ratios for White and Hispanic girls. Also, Black girls are now significantly less likely to aspire to a math occupation than White males. Additional tests confirm that it is adding the school attitude variables that results in this change, suggesting that once we account for the fact that Black adolescent girls have generally higher proschool attitudes than White males, a difference in math career aspirations emerges. In Model 3, we add enjoying math to the model, which has a positive and significant association with math career aspirations. However, we observe no real changes to gender and racial/ethnic patterns as White, Hispanic, and Black girls all remain less likely than White males to want a math career. Given that we observed in Table 1 that White females were the only group with significantly lower math enjoyment relative to White males, this result (or lack thereof) is not surprising. In Model 4, we include the indicator for math selfconcept, which also has a significant association with math career aspirations. While White and Hispanic girls remain less likely relative to White males to aspire toward a math career, with the inclusion of this measure in Model 4 we see that the odds ratio for Black females increases toward 1 and is no longer statistically significant. In Model 5, we add students' math test scores, which are significantly associated with math career aspirations. With the inclusion of achievement, Black girls' aspirations are again not significantly different from those of White males, and Black and Hispanic males are actually significantly more likely to want a math career compared to White males. However, White and Hispanic girls remain approximately half as likely to want a math career. Model 6 is the cumulative model including all measures of math attitudes as well as achievement. Interestingly, test score is no longer significantly associated with math career aspirations. As we have seen quite consistently across the models predicting math career aspirations, minority males are not statistically different from White males in this final model. However, girls of all racial/ethnic groups are significantly less likely than White males to want a career in math. Compared to the baseline model, we have basically explained none of the disparities between White and Hispanic females on the one hand, and White males on the other. For Black girls, we have uncovered protective mechanisms that once taken into account, reveal a disparity in aspirations compared to White males (although subsequent tests reveal that they have higher math career aspirations than their White and Hispanic female peers)."}, {"section_title": "DISCUSSION AND CONCLUSION", "text": "The results of our study indicate that even at this early stage in young people's life trajectories, before they enter high school and long before they enter college, disparities in science and math career aspirations are apparent. Interestingly, Black male youth are the only subgroup that shows comparable aspirations to White males in both subjects before accounting for other factors. For other subgroups, however, we observe distinct patterns by subject, so that patterns of equity are different for science career aspirations than they are for math. For example, Hispanic males' aspirations toward a future math career do not differ significantly from those of White males, whereas their lower relative science aspirations can be explained by social background differences. Comparing White male aspirations to different female subgroups, we are able to explain disparities in science career aspirations by taking into account attitudes and achievement, factors known to influence choice of college major and occupation much later in life. Yet for math career aspirations, some gender disparities among adolescent youth prove stubbornly persistent, regardless of all indicators we consider. We return to a discussion of math disparities a little later in this section. It is important to note that with regard to career aspirations in science, our results are consistent with theories of intersectionality; namely there is not a singular story that appears to explain the lower relative aspirations of females across different racial/ethnic groups. Specifically, for Black females, the elements of the Eccles et al. expectancy-value model included here, self-concept and enjoyment of science, did not help to explain their lower likelihood of aspiring toward a science career. Instead, it seems that achievement may be an instrumental part of the story, as once differences are held constant, Black females are as likely as White males to aspire toward a science career. Adjusting for achievement similarly results in comparable science aspirations for Hispanic females. Yet in contrast to the patterns observed for Black females, accounting for enjoyment and self-concept also results in predicted levels of science aspirations for Hispanic females that are comparable to White males. Thus the expectancy-value model appears to work well to explain the lower relative science career aspirations of Hispanic females, but not their Black female peers. For White females, however, only one aspect of the Eccles et al. model appears to contribute to their relatively lower aspirations toward a job in science. Specifically, adjusting for differences in science enjoyment led to comparable aspirations between White females and their male peers. Thus while women's lower self-concept is a key reason behind gender differences in choice of college among older youth (Correll, 2001), it appears that enjoyment of science is perhaps an important driver behind gender difference in career aspirations at younger ages, at least in the case of White and Hispanic girls. The general importance of students' enjoyment of science during adolescence warrants further discussion. The association of enjoyment with aspirations in science (as well as math) is stronger than we observe for respective levels of self-concept, suggesting that enjoyment is a crucial factor in the development of future interests. For example, a student who is average on all other indicators in the model and reports the highest level of science enjoyment has a predicted probability of .43 for aspiring toward a science career. In contrast, an average student reporting the highest level of self-concept has a predicted probability of .26 for related career aspirations. As mentioned before, the TIMSS data are limited by their cross-sectional nature. However, because they survey students from both fourth-and eighth-grade cohorts, we can compare differences across age groups. As seen in Figure 1, well more than half of the students from all groups report strongly enjoying science in the fourth grade. Among eighth-grade students, this proportion decreases across the board-yet more so for female adolescents than for male adolescents. While there are no differences between groups in science enjoyment in the fourth grade, there are significant differences in the eighth grade, such that significantly lower proportions of females from all racial/ethnic backgrounds report strongly enjoying science in comparison to White males (as well as their male peers of the same background). Albeit descriptive, these patterns suggest that our educational system does a poor job of maintaining students' love of science as they develop into adolescence, particularly for girls. This pattern is also consistent with some prior research on a decline in science attitudes as girls get older and points to the time period between the fourth and eighth grades as a critical point of intervention for gender equity in career aspirations (Greenfield, 1997;Sorge, 2007). Stepping back, in contrast to some research that has argued that the importance of student enjoyment is overrated (Loveless, 2006), we suggest otherwise. While it may be the case that enjoyment and positive affect toward science are not necessarily the strongest predictors of how well students score on standardized examinations, nevertheless such attitudes may be crucial to keep students (particularly at younger ages) interested in the possibility of pursuing a related career in the future. An educational system that focuses on increasing achievement without some degree of attention to whether students are engaged and having positive experiences is unlikely to produce greater numbers of future scientists, especially female ones. Given the current high-stakes testing environment that characterizes our nation's schools, teachers may well be challenged to promote a love of science among Figure 1. Proportion of students who report that they strongly enjoy science by grade level, race/ethnicity, and gender. An asterisk denotes a statistically significant difference from White males at p < .05. their students (Taylor, Jones, Broadwell, & Oppewal, 2008). This speaks to the importance of pedagogical techniques that promote both increases in student learning and enjoyment, such as active and cooperative learning (Hsu, 2008;Hug, Krajcik, & Marx, 2005). We mentioned earlier that aspirations toward a science career are largely independent of aspirations toward a math career. It appears that adolescents view these subjects quite distinctly, and for reasons we cannot adequately explain with the measures considered here, females of all racial/ethnic backgrounds remain less likely than White males (and actually males in general) to find a future career in math very appealing. More research is clearly needed to understand why an aversion to math careers appears so firmly entrenched at this early stage of girls' lives, particularly among White and Hispanic females. For instance, while the aspects of the Eccles et al. model considered here, self-concept and math enjoyment, do not appear to help explain disparities in career aspirations, it is possible that other aspects of the expectancy-value model may be more pertinent. Specifically, due to data limitations, we were not able to consider the other dimensions of subjective task value, namely utility and attainment value. With the availability of such measures, perhaps we could better account for disparities among one or more subgroups. Furthermore, qualitative studies might be able to shed light on what kinds of occupations students at this age think of when asked about a math or science career (Archer et al., 2010). Prior research has shown that children and youth of both genders are prone to stereotypical images of older White males with glasses and a labcoat when asked to draw a scientist (Scherz & Oren, 2006). Perhaps images of math occupations and/or mathematicians are even more skewed, or the tasks and work involved in math careers is viewed by some girls as even less appealing, perhaps more abstract and less relevant outside of school. Our comments are necessarily speculative but point to directions that perhaps future research can address. Turning to differences among male students, our results indicate that adolescent boys from different racial/ethnic backgrounds have generally similar aspirations toward future careers in math and science. The exception to this pattern worth noting is that White and Hispanic male youth have comparable science aspirations only when social background differences are taken into account. Such findings again speak to the importance of moving beyond a one-size-fits-all model for explaining disparities between different racial/ethnic and gender subgroups. Nevertheless, from the perspective of equity, the relatively high science and math career aspirations of Hispanic and Black males is an encouraging result, albeit one that warrants cautious optimism. The achievement gap between White males on the one hand, and Black and Hispanic males on the other, is very large in scope and cannot be overlooked. While minority male adolescents may aspire toward careers in science and math in spite of their relatively low levels of achievement, they may be thwarted by future struggles to meet academic requirements and prerequisites (as well as other known obstacles such as less access to economic and social resources and the possibility of a discriminatory environment). This is consistent with evidence of high levels of interest in STEM majors among minority college-aged youth, but relatively low rates of persistence (Anderson & Kim, 2006;Cole & Espinoza, 2008). In contrast, for Black and Hispanic females in our analyses, we noted earlier that once their lower science achievement was taken into account, their science aspirations reached those of White males, suggesting that minority females limit their aspirations at this early time point in relation to external feedback. Thus low levels of academic preparation may function early to deter minority females, but perhaps function much later to impede the STEM trajectories of minority males. In sum, our findings point to important disparities in who wants a career in science and math among adolescent youth, an age group that is typically less examined with regard to career interests. Our study contributes to previous literature by moving beyond a focus on aggregate differences between groups, and instead highlights the complex patterns behind gender and racial/ethnic disparities in aspirations, thereby indicating that there are no singular solutions that will promote equity for all groups. The disparities in career observations observed here are very likely to foreshadow future inequities, as individuals rarely reconsider a future occupational role that they have previously decided is not for them (Gottfredson & Lapan, 1997). To ensure that subsequent generations of STEM degree recipients and workers better reflect the diversity of the nation, we need more research that focuses on understanding how to prevent adolescents from prematurely closing the door on a future career in these fields."}]