[{"section_title": "1", "text": "Gaps in educational achievement between high-and low-income children are growing.\nThe poverty gap in standardized test scores is 40 percent larger today than it was 25 years ago and is twice as large as the black-white gap (Reardon 2011) . Test scores are an early predictor of educational attainment and income in adulthood: a one-standard deviation difference in test scores in grade school corresponds to a five percentage-point difference in college attendance and a nine percent difference in earnings at age 28 (Chetty, Friedman, and Rockoff, 2011) .\nA long literature studies the link between family resources in childhood and educational outcomes.\n1 Studies that exploit longitudinal data show that deficits are particularly large for children who are persistently disadvantaged.\n2 But the household surveys that these studies rely upon are infrequent and suffer from non-response and attrition. 3 The administrative datasets increasingly analyzed by education researchers (Dynarski and Berends, 2015) do not have these weaknesses, but typically contain a single, crude proxy for income: an indicator of a students' eligibility for federally-subsidized school meals.\nChildren in households with income below 185 percent of the federal poverty line are eligible for subsidized meals in school. Subsidized-meal eligibility is widely used by researchers as a proxy for poverty. But nearly half of students nationwide are eligible for subsidized meals, while only a quarter of US children live in poverty. These two statistics make clear that eligibility for subsidized meals is a blunt measure of economic disadvantage. It is, for now, the only measure available to the many researchers and practitioners who work with administrative 2 data to evaluate the effects of educational programs, measure gaps in student achievement, and steer resources toward the most needy children.\nWe use administrative data from Michigan to develop a more detailed measure of economic disadvantage. Our data contain information on the entire population of students in the Michigan public schools. We leverage the longitudinal nature of these data to document systematic variation in outcomes and disadvantage within the population of children who are eligible for subsidized meals. Children who spend all of their school years eligible for subsidized meals have the lowest scores, while those who are never eligible have the highest. In 8 th grade, the score gap between these two groups is nearly a standard deviation. The scores of children who spend a few of their school years eligible for subsidized meals fall between these two extremes.\nThere is a negative, nearly linear relationship between the number of grades spent in economic disadvantage and 8 th grade test scores. This relationship holds after controlling for student demographics and school fixed effects. The lower scores do not appear to be caused by more years in disadvantage: this linear relationship is similar in 3 rd grade, before children have been differentially exposed to five more years of economic disadvantage. Rather, we show that family income in a given year is negatively correlated with the number of years that a child will spend eligible for subsidized meals. 4 Our results imply that the number of years that a child spends eligible for subsidized meals is a reasonable proxy for household income. While still crude, this proposed measure captures greater variation in economic resources and educational outcomes than does the variable currently used by researchers, which captures only a child's current eligibility for subsidized meals. In Michigan, roughly half of 8 th graders are eligible for a subsidized meal; they score about 0.69 standard deviations below those who are not eligible. But just 14 percent of 8 th graders had been eligible for subsidized meals in every year since kindergarten, and these children score 0.94 standard deviations below those who were never eligible (and 0.23 standard deviations below those who were occasionally eligible). In future work, we will examine how well our new measure predicts educational attainment, including college attendance and graduation. We will also examine its performance in states other than Michigan.\nOur proposed measure of economic disadvantage will improve estimates of the value added by teachers and schools. Two classrooms may have identical numbers of currently disadvantaged children but different numbers of persistently disadvantaged children. A valueadded measure that does not account for these differences will be biased against teachers of persistently disadvantaged children. Our measure of persistence can also be used in evaluations, in order to estimate heterogeneity in causal effects or as a control to reduce omitted-variables bias.\nFinally, our proposed measure can be used to better target resources toward the most disadvantaged children. Many federal, state and local programs distribute money based on the share of a school's or district's students eligible for subsidized meals. In Michigan, schools that have identical shares of students who are currently eligible for subsidized meals vary considerably in the share of students who are persistently eligible (see Figure 5 ). By taking these differences into account, practitioners and policy-makers can better target resources intended to support the most disadvantaged children and their schools."}, {"section_title": "4", "text": ""}, {"section_title": "II. Prior Literature: Family Resources and Child Outcomes", "text": "Most research examining the correlation between income and child outcomes relies on contemporaneous, rather than longitudinal, measures of income. Reardon (2011) decline in the quality of household survey data compared to administrative data (Meyer, Mok, and Sullivan 2015; Meyer and Nittag 2015) .\n5 See Ashworth, Hill, Walker 1994; Bane and Ellwood 1986; and Cellini, McKernan, Ratcliffe 2008. Duncan and Rodgers (1988) find that while incidence of chronic poverty in childhood was relatively uncommon among children in the PSID in the late 1960s and 1970s, approximately half of all children experienced economic hardship at some point during childhood. 6 See Duncan and Magnuson 2011; Fryer and Levitt 2004; Magnuson and Duncan 2006; and Heckman et al., 2010. 7 See Duncan, Brooks-Gunn, Klebanov 1994; Duncan et al. 2012; Haveman et al 1991; Ku and Plotnick 2003; Peters and Mullis 1997; Petterson and Albers 2001; Rothstein and Wozny 2013; Smith, Brooks-Gunn, Klebanov 1997; Wolfe et al. 1996. 8 Duncan and coauthors (1994) conclude that the IQ deficit associated with persistent poverty is 80 percent higher than the deficit associated with transitory poverty."}, {"section_title": "5", "text": "A large and rapidly expanding literature makes use of administrative data held by states and school districts to conduct educational research (Dynarski and Berends, 2015) . These datasets lack the detailed data on income and demographics of the PSID and NLSY. But they are large, covering the universe of public school students, and contain comprehensive information on students' test scores and educational attainment. These datasets track students longitudinally, with each child assigned a unique identifier that in many states (including Michigan) stays with a student through college.\nIn these administrative data, eligibility for subsidized school meals is the only measure of economic status. Local education agencies use this variable to allocate Title I funds, which subsidize the schooling of low-income children (U.S. Department of Education 2012). This variable, discussed in detail below, is used widely by education researchers as a proxy for poverty (see, for example, papers in the volume edited by Dynarski and Berends 2015 such as Papay, Murnane, and Willett 2015) . To our knowledge, no study has leveraged the longitudinal nature of these data systems to construct measures of the persistence of economic disadvantage to examine the relationship between the duration of disadvantage and educational outcomes."}, {"section_title": "III. The National School Lunch Program", "text": "The National School Lunch Program (NSLP) is an $11 billion federal program, established by the 1946 National School Lunch Act. The NLSP provides subsidies that allow 31 million students to receive free or reduced-price lunch (Food and Nutrition Services 2012).\nSchools receive federal reimbursement for each student eligible for subsidized lunches (Food and Nutrition Services 2015)."}, {"section_title": "6", "text": "In recent years, nearly half of all school children received subsidized meals (see Figure   1 ). The growth in the population of children receiving subsidized meals has outpaced the growth in children living below the poverty line (again, Figure 1 ). This is in part due to the faster growth in the share of children living in households with income between the poverty line and 185 percent of the federal poverty line.\nA student can qualify for free or reduced-price meals in two ways: by providing paperwork to their school or through \"direct certification,\" which is triggered by a child's receipt of other federal, means-tested benefits. Once a student has gained eligibility for NSLP through either methods, she is eligible for the entire school year and up to 30 days of the next school year (USDA 2015) .\nUnder the first method, families showing monthly, household income below 185 percent of the federal poverty guideline gain eligibility for a reduced-price meal, and families below 130 percent get a free meal. (Currie 2004) . Research shows that some students receiving subsidized meals have income above the program cutoff (Newman and Ralston 2006; Harwell and LeBeau 2010; Hauser 1994; Kurki, Boyle, and Aladjem 2004; Randolph and Prejean-Harris 2014) . This finding is in part due to the eligibility rules: eligibility is determined by a single month's income. Once a student is certified, she maintains her eligibility for the entire calendar year, even if her household income rises over the course of the year. meals tend to have lower incomes than those who become eligible by filling out an application, as the income cutoffs for many of these programs are below 185 percent of the poverty threshold."}, {"section_title": "11", "text": "Entire schools can now be deemed eligible for subsidized meals through the \"community eligibility\" provision. As of 2010, schools are allowed to provide free lunches to all students if at least 40 percent are directly certified. States and districts vary in the speed with which they have taken up this option. Some states have stopped collecting student-level income data in schools that are community-eligible. Michigan has not, since the student-level information is used to distribute other state-controlled funds.\nFor backward-looking evaluations using administrative data, the subsidized-meals indicator is still the only available proxy for income. Our proposed measure, based on the persistence of eligibility for school meals, is therefore relevant for researchers using the many years of historical data that have been compiled by states and districts. Any researcher working with administrative, education data from 2010 forward should ask the relevant agency when and how it made the shift toward community eligibility, and whether individual student eligibility is still recorded. We discuss this point further in the conclusion."}, {"section_title": "IV. Data and Method", "text": "Our data are drawn from from the Michigan Center for Educational Performance and Table 2 . 13 See Data Appendix for detailed explanation of restrictions. 14 Students who were missing in at least one year typically scored about 0.06 standard deviation below students present for all nine years. Results are quite similar if we restrict the sample to children present for all nine years between kindergarten and 8 th grade (see Appendix Table 3 ). 15 Patterns are quite similar for other subject areas. 16 In order to be considered \"persistently disadvantaged,\" students must be present in the dataset for all nine years. Students who were not present for all nine years and had at least one year of subsidized meal eligibility are automatically considered \"transitorily disadvantaged.\" Our results are not sensitive to this decision, changing little when we restrict the sample to students observed for the full nine years (see Appendix Table 3 )."}, {"section_title": "9", "text": "are defined as never disadvantaged. The remaining children spent some years eligible for subsidized meals; we define them as transitorily disadvantaged."}, {"section_title": "17", "text": "We use the term currently disadvantaged to refer to a child's eligibility for subsidized meals in her tested grade (in our case, 8 th grade). This is the variable that typically would be used by researchers calculating income-based gaps in achievement."}, {"section_title": "18", "text": ""}, {"section_title": "V. Sample Characteristics", "text": "Nearly 60 percent of Michigan 8 th graders in the 2011-2013 school years were eligible for subsidized meals at least once between kindergarten and 8 th grade (see Table 1 ). These children spend, on average, six years eligible for subsidizes. Of this group, about a quarter (14 percent of the full sample) were persistently disadvantaged, in that they were eligible in every grade since kindergarten. Another forty percent of children were never disadvantaged.\nDemographics differ starkly by these measures of economic disadvantage. Ninety percent of the never disadvantaged are white, compared to 60 percent of those who are ever disadvantaged. Students ever disadvantaged by 8 th grade were six times more likely to be black and four times more likely to be Hispanic, compared to those who were never disadvantaged.\nThe persistently disadvantaged are more concentrated in urban areas, while the transitorily disadvantaged are more concentrated in suburban areas. The persistently disadvantaged attend schools with a higher concentration of students eligible for subsidized meals than those who are transitorily disadvantaged.\n17 We also create measures based on kindergarten through 5 th grade eligibility, 3 rd through 8 th grade eligibility, and 5 th through 8 th grade eligibility. See Appendix Figure 1 and Appendix Table 2 . 18 Some administrative datasets include a variable that distinguishes between eligibility for free vs. reduced-price meals. Since not all researchers have this variable, we don't focus on it in our analysis. In Michigan, almost all children (85 percent) eligible for a subsidized meal are eligible for a free meal; our results therefore change little if we focus on the free-meal children (see Appendix Table 4 ).\nOur administrative data lack information on income, parental education, and family structure. We show median income from the American Community Survey (ACS) in the zip code in which students live. Students who are never disadvantaged live in a zip code where the median household income is $63,000 (2014$), while those who were ever disadvantaged live in neighborhoods with a median household income of about $46,000. For the persistently disadvantaged, neighborhood income is $41,000.\nWe turn to nationally-representative survey data to shed more light on demographic differences between children who are persistently disadvantaged, transitorily disadvantaged and never disadvantaged. The Early Childhood Longitudinal Study, Kindergarten Class of 1998-1999 (ECLS-K) includes information on household income and subsidized-meal eligibility. About half of 8th graders in 2006-2007 were ever eligible for subsidized meals (similar to Michigan) and about 10 percent were eligible in each survey wave of the ECLS-K (again, similar to Michigan; see Appendix Table 5 )."}, {"section_title": "19", "text": "As in Michigan, persistently disadvantaged students in the ECLS-K are much more likely to be a racial or ethnic minority (73 percent compared to 46 percent among transitorily disadvantaged and 11 percent among the never disadvantaged). They were also much less likely to live with both parents at the start of the survey (51 percent compared to 65 percent among the transitorily disadvantaged and 91 percent among the never disadvantaged) and much less likely to have a parent with a college degree (two percent compared to 244 percent among the transitorily disadvantaged and 57 percent among the never disadvantaged). Family income also varies substantially by the persistence of disadvantage; we discuss this in detail later in the paper.\nAs these statistics make clear, the persistently disadvantaged are a distinct minority within the larger population of students who are eligible for subsidized meals. They are poorer, more likely to live in single-parent families, and have parents with lower educational attainment.\nAs we now show, these students have far lower test scores than their peers who are only temporarily (or never) eligible for subsidized school meals."}, {"section_title": "VI. Achievement Gaps by Economic Disadvantage", "text": "We first estimate a conventional measure of the income gap in academic achievement, by comparing the math scores of children who are, at the time of testing, eligible and ineligible for subsidized meals. Measured this way, the gap in 8 th grade math score gap is 0.69 standard deviations (see Table 2 ).\nIf our goal is to capture the effect of persistent disadvantage, this measure is biased downward by classification error. This error goes both ways: some of those currently eligible for subsidized meals were not eligible in previous years, while some of those currently ineligible were eligible at some point. Among Michigan students ineligible for subsidized meals in 8 th grade, 22 percent were eligible in a previous grade ( When we compare children who are persistently disadvantaged to those who are never disadvantaged, the achievement gap widens considerably. The score difference between the never disadvantaged and the persistently disadvantaged is nearly a standard deviation (0.94), 35 percent wider than the conventional measure (Table 2) . Persistently disadvantaged students score a quarter of a standard deviation below transitorily disadvantaged students."}, {"section_title": "12", "text": "The standard indicator for economic disadvantage is often included as a control in a regression that includes other variables, such as race, ethnicity, sex, and school characteristics.\nFor quantitative researchers, a key question is therefore whether these other observables \"explain\" the larger achievement deficit among persistently disadvantaged students. If observables explain the differences, then the analyst need only include these observables in the regression in order to eliminate biases that may otherwise be induced by unobserved heterogeneity within the population of currently disadvantaged students.\nWe explore this by estimating test-score gaps that control for student characteristics, school fixed effects, and neighborhood characteristics. Each column/panel combination in Table 3 represents a separate regression. Column 1 includes only the measures of disadvantage, Column 2 adds demographic characteristics, column 3 adds school fixed effects, Column 4 adds controls for median household income in a household's zip code, Column 5 includes controls for prior-year test scores,.\nWith no controls in the model, we replicate the gaps shown in Controlling for school fixed effects further reduces gaps (column 3). Still, the withinschool gap between the never disadvantaged and the persistently disadvantaged (0.55) is 41 percent larger than the gap based on standard measure of contemporaneous eligibility (0.39)."}, {"section_title": "20", "text": "The difference between these estimates is statistically significant.\nThese last results indicate that persistent disadvantage is not solely a geographic phenomenon. Even within schools, there is substantial variation in the performance of children who are persistently vs. transitorily disadvantaged. This could be because schools draw on neighborhoods with widely varying household incomes and levels of persistent poverty.\nHowever, controlling for household income in the child's home zip code (column 4) does very little to change these within-school results."}, {"section_title": "21", "text": "Researchers estimating causal effects of programs on achievement often include lagged test scores (e.g., Angrist et al., 2016) . Does our proposed measure of persistent disadvantage 20 Table 3 shows a substantial gap within schools between disadvantaged and non-disadvantaged children. This contrasts with the black-white gap which, as shown by Fryer and Levitt (2004) , is largely eliminated by school fixed effects. 21 Median household income data come from a five-year sample of the American Community Survey from 2010-2014. In an alternative specification, we included zip code fixed effects, which produced very similar results to those presented here. Results not shown but available upon request.\nexplain additional variation in scores, once lagged scores are included? In column 5 of "}, {"section_title": "VII. Do Achievement Gaps Widen with Each Year of Disadvantage?", "text": "We have shown that children who are persistently disadvantaged perform worse than those who are disadvantaged in only some grades. We next examine how the size of this gap varies with the number of grades spent in disadvantage. Figure 2 plots the score gap in 8 th grade against the number of grades spent in economic disadvantage since kindergarten. 22 The top line plots unconditional gaps. Note that no functional form is imposed upon this line; it connects unconditional score differences. We obtain these differences by regressing 8 th grade scores against a set of nine dummies that indicate the number of grades that a child has spent in economic disadvantage since kindergarten. The reference group is children who spent no grades in economic disadvantage. . We add to the graph unconditional differences in scores in 3 rd grade. While the intercept is lower, the slope is almost identical. Figure 4 shows the same plots for scores for grades three through eight. The lines shift up monotonically with each grade, tracing out the growth during 22 We also examined how the timing of disadvantage is related to the achievement gap by estimating coefficients on time-lagged indicators of disadvantage (see Appendix Figure 2 and Appendix Table 8 ). Eligibility for subsidized meals in kindergarten and in the current grade have the largest coefficients. 23 As in all previous regressions, we include a dummy that indicates whether a children was not observed in Michigan public schools during one or more grades. Results are similar when the sample is limited to a balanced panel of children enrolled in every grade from kindergarten through 8 th grade. In kindergarten, children who will spend nine grades in economic disadvantage by 8 th grade are already poorer than children who will spend just a few grades in economic disadvantage. We see this in the ECLS-K, where mean income falls with each additional year spent eligible for subsidized meals (see Figure 5) . 24 Among children who will never be eligible for subsidized meals, family income is an average of $85,000 in 3 rd grade. Among children who will be eligible for one grade, income is an average of about $47,000 (this is close to median household income in the US). Among children who will be eligible for five grades, income is an average of about $20,000. The relationship is similar in 8 th grade."}, {"section_title": "25", "text": "24 Since the ECLS-K does not collect data every year, we are only able to observe whether a student is eligible for each of the five waves collected between kindergarten and 8 th grade, rather than the full nine years.\nFamily income is measured in 13 income categories, ranging from less than $5,000 to more than $200,000. We assigned the midpoint of each category for this analysis.\nThese results indicate that the number of grades spent in economic disadvantage is a proxy for the level of income. This is consistent with family income moving in a random walk, drifting upward with each year. The poorest families have little chance of randomly moving above the cutoff for subsidized meals, so will typically spend every grade eligible for subsidized meals. Families with slightly higher incomes might randomly move above the cutoff for one year. The closer a family's permanent income is to the eligibility cutoff, the more likely it is to drift over in a given year."}, {"section_title": "VIII. Changes in the Determination of Eligibility for Subsidized Meals", "text": "Eligibility standards for subsidized, school meals are in motion. Federal \"community eligibility\" rules established in 2010 allow a school to provide free meals to all of its students if at least 40 percent are found to be individually eligible. 26 States and districts vary in the speed with which they have taken up this option. Some have stopped collecting information on studentlevel eligibility in schools that are community-eligible (Michigan has not).\nHow does this affect the relevance of our analysis? For backward-looking evaluations using administrative data, the subsidized-meals indicator is still the only proxy for income. Our proposed measure is therefore relevant for researchers using such historical data. In any research that relies on data gathered since 2010, analysts should learn how eligibility for subsidized meals is determined in their sample schools and how the student-level variable for eligibility in their data is coded.\nGoing forward, states will increasingly use eligibility for federal, means-tested programs (TANF, WIC and food stamps) to automatically qualify students for subsidized meals. Adding indicators for eligibility for these programs to administrative datasets will keep these datasets relevant. Without student-level proxies for family income, researchers cannot calculate gaps in student outcomes, understand how program impacts differ by income, or reliably calculate valueadded measures of teacher and school quality.\nOnce states and districts shift toward this new indicator of economic disadvantage, the insights of this paper will still be relevant. Educational outcomes will certainly be correlated with persistence in receipt of TANF, WIC and food stamps, just as they are correlated with persistence in eligibility for subsidized meals. In future work, we will examine these correlations."}, {"section_title": "IX. Discussion and Conclusion", "text": "Our findings have implications for researchers, policymakers and practitioners. We have uncovered considerable heterogeneity within the population of children eligible for subsidized meals. Sixty percent of Michigan's 8 th graders were eligible for subsidized lunch at least once during their time in the public schools. But just a quarter of these children (14 percent of all 8 th graders) were economically disadvantaged in every year between kindergarten and 8 th grade.\nThese persistently disadvantaged children score nearly one standard deviation below students who were never disadvantaged. The conventional method of estimating this gap, which relies only on current eligibility for subsidized meals, yields a gap of 0.69 standard deviations.\nThe gap as defined by persistent disadvantage is comparable to that between children in the 90 th and 10 th percentiles of the family income distribution (Reardon 2011) . The gap as defined conventionally is comparable to that between children at the midpoint and top (or bottom) of the family income distribution (Reardon 2011 Researchers can use our proposed measure to better estimate value-added and to estimate causal effects. A value-added measure that does not account for differences between current disadvantage and persistent disadvantage will be systematically biased against the teachers and schools of persistently disadvantaged children. In calculating measures of teacher and school effectiveness, controlling for persistent disadvantage will better capture variation in students' baseline characteristics.\nPolicymakers and practitioners can use our proposed measure to better target resources intended to support the most disadvantaged children. Schools with identical shares of currently disadvantaged children may have widely differing shares of persistently disadvantaged children.\nIn Michigan, as in many states, there are many schools in which all children are eligible for subsidized meals. In Michigan schools where 100 percent of 8 th graders are currently disadvantaged, the concentration of persistent disadvantage varies from 18 to 86 percent (see Figure 6 ). The conventional measure of economic disadvantage (current eligibility for subsidized meals) provides no traction in differentiating between these schools, or between classrooms within these schools. Our proposed measure of persistent disadvantage allows for finer distinctions between schools and classrooms, allowing for better targeting of scarce resources."}, {"section_title": "Data Appendix", "text": "This research uses data structured and maintained by the Michigan Consortium for Educational Research (MCER). MCER data are modified for analysis using rules governed by We limit the sample to students who were in 8 th grade between the 2010-2011 and 2012-2013 school years and had valid 8 th grade math test scores (341,133 observations). We do not restrict the sample to first-time 8 th graders, so some students may have repeated a grade in a prior year. We exclude students who did not have a 7 th grade math test score (12,974 observations), which we use to control for prior achievement in some analyses. We also exclude students without a valid school identifier in 8 th grade (9,537 observations). To maximize our sample size, we make no further restrictions on whether the student was present in the Michigan public school system for the nine years between kindergarten and 8 th grade (Appendix Table 7 shows a frequency table for the share of 8 th graders present in the data for the full nine years, separately by subsidized meal status in 8 th grade). Among all 8 th graders in our analysis, 76% were present in all nine years, and 86% were present for at least eight years. Students eligible for subsidized meals in 8 th grade were slightly less likely to be in the Michigan public school system for nine years (74% compared to 78% of non-eligible 8 th graders).\nIn regressions, we include an indicator for whether a student was not in the Michigan public school system for all nine years. These students typically had lower math test scores, on the order of 0.01 to 0.06 of a standard deviation. Results are nearly identical if we instead limit the sample to students present in Michigan public schools in all graded from kindergarten through 8 th grade. Notes: From OLS regressions of standardized 8th grade math test scores on indicators for subsidized meal eligibility. Demographic controls include race and gender indicators, interactions of race and gender indicators, whether the student was an immigrant, whether the student was a Michigan native, whether the student was missing at least one year between kindergarten and 8th grade. "}]