[{"section_title": "Abstract", "text": "Since the late twentieth century, \"citizen science\" has become an increasingly fashionable label for a growing number of participatory research activities. This paper situates the origins and rise of the term \"citizen science\" and offers a new framework to better understand the diversity of epistemic practices involved in these participatory projects. It contextualizes \"citizen science\" within the broader history of public participation in science and analyzes critically the current promises-democratization, education, discoveries-emerging within the \"citizen science\" discourse. Finally, it maps a number of historical, political, and social questions for future research in the critical studies of \"citizen science. \""}, {"section_title": "Introduction", "text": "There is probably no such thing as \"citizen science,\" yet there might be a few questions to ask about it (after Shapin, 1996) . The expression has become increasingly popular in the general media and in science policy discourses since the beginning of the twenty-first century, first and foremost in the United States and Europe, but now also in Asia and the Global South (Chandler et al., 2012; Kera, 2015; Pham et al., 2015) . The term \"citizen science\" is currently used in the media to designate a wide range of practices, from citizens donating the processing power of their personal computers to perform scientific calculations (SETI@home), to amateur naturalists collecting observational data outdoors about birds (eBird), city residents mapping air pollution (City Sense), people classifying online images of galaxies from home (Galaxy Zoo), patients sharing quantified observations, symptoms, and experiences about their health (PatientsLikeMe), and biohackers attempting to produce insulin in a community laboratory (Counter Culture Labs). A growing number of organizations and institutions carry it in their name (there is even a journal devoted to it). It is still unclear whether the diverse practices subsumed under that heading form a coherent whole, let alone a cohesive social movement, or even if they grew out of a single historical tradition. In this essay, we will outline some of the intellectual challenges raised by the rise of \"citizen science,\" especially with regard to their place in the longer history of public participation in science (Lengwiler, 2007) . 1 Even if we sound somewhat distrustful about the reality of a thing called \"citizen science,\" the rise to prominence of the term in contemporary discourse is beyond doubt and hugely interesting historically, politically, culturally, and epistemologically. It points to a potential transformation in the modes of public participation in science. 2 Contemporary discourses on public participation in science, including \"citizen science,\" are challenging a number of founding elements of the modern regime of knowledge production based on the separation between expertise provided by professional scientists working in dedicated research institutions and the lay public understood as a consumer of scientific knowledge and technologies. In many cases, participatory research projects question who can produce legitimate scientific knowledge, how it is produced, where it is produced, and sometimes why it is produced. Thus, participatory research is not necessarily just \"science by other means,\" but could refocus what parts of the natural and social worlds are subject to scientific inquiry, thereby transforming what we know about the world. The rise of participatory modes of scientific research constitutes a challenge not only to present science but also to the current social order, providing yet another example of the coproduction of science and society (Shapin and Schaffer, 1985; Jasanoff, 2004) . In this perspective, examining the rise of participatory research is as much a window into the transformation of modern science as it is into the transformations of contemporary societies (Chilvers and Kearnes, 2015) .\nIn this discussion essay, we attempt to make sense of the current discourse on \"citizen science, \" successively questioning the definitions, genealogies, and promises that have been put forward by its practitioners, promoters, and analysts. In the course of this examination, we spell out a number of research questions that the history of science and STS should, and are well equipped to, tackle. Such a research program will need to challenge the singular of \"citizen science\" in order to offer a fine-grained analysis of the variety of epistemic practices subsumed under that common expression. Only such an analysis will provide the basis for meaningful genealogies of \"citizen science,\" genealogies that go beyond the allusions, hat in hand, to the amateur naturalists of the nineteenth century or to the radical science movements of the sixties. Finally, understanding what kind of science, but also what kind of society, this particular mode of public participation in science is producing will require joining the epistemological with the political.\nfor the people\" and \"science by the people.\" The book's recommendations are mainly focused on the first notion, aiming at making science policy more responsive to people's \"understanding\" and \"concerns\" thus making science policy more \"democratic\" (Irwin, 1995: 69-80) . The book was published in the midst of the British debates about the value of \"public understanding of science,\" just three years after the launch of the eponymous journal. When addressing the second notion, Irwin's emphasis was on \"local\" and \"contextual\" knowledge produced by citizens, which differs qualitatively from knowledge produced in scientific institutions. His concern echoed the debates then taking place in science and technology studies and feminist epistemology about \"indigenous knowledge\" (Watson-Verran and Turnbull, 1995) and \"situated knowledge\" (Haraway, 1988 ). Irwin wanted these voices and forms of knowledge-and not only those of scientific experts-to be taken into account in deliberations about technological risks and science policy. Although Irwin's work is often cited in reference to current practices labeled as \"citizen science,\" it is more of a reflection on the participatory ideals-and their limitations-of the 1970s than on the practices currently subsumed under the label \"citizen science,\" which focus on the production of scientific knowledge outside of scientific institutions, but mostly following the norms and values of institutional science. Richard Bonney's (1996) notion of \"citizen science\" pointed in a different direction. Since 1992, he has been supported by a National Science Foundation (NSF) grant to study the educational role of \"Public Participation in Ornithology,\" following up the long tradition of amateur ornithology (Barrow, 1998) . Four years later, he defined \"citizen science\" as scientific projects in which \"amateurs\" provide observational data (such as bird spotting) for scientists and acquire new scientific skills in return, \"a two-way street\" (Bonney, 1996) . By 2001, the NSF was developing policies to complement \"public understanding of science\" with \"public understanding of research\" (Field and Powell, 2001) . The subsequent year, through its new Informal Science Education program, it began supporting initiatives that \"involve the public in scientific research\" (National Science Foundation, 2002: 7), a goal it reformulated in 2004 as allowing \"participants to contribute to ongoing scientific research as in citizen science\" (National Science Foundation, 2004) and supported numerous such initiatives in the following years. As Bonney would put it in 2016, regarding science education \"Citizen science was the magic bullet the NSF was looking for\" (Bonney, 2016) .\nBonney (and the NSF) viewed \"citizen science\" as both public participation in scientific research and a tool to promote the public understanding of science (killing two birds with one stone). To a large extent, this view reflects current practices that fall under the heading of \"citizen science,\" even if the attention to education varies from case to case. In 2013, the SOCIENTIZE Expert group for the European Commission's Digital Science Unit defined \"citizen science\" in a similar way: \"Citizen science refers to the general public engagement in scientific research activities when citizens actively contribute to science either with their intellectual effort or surrounding knowledge or with their tools and resources\" (Socientize, 2013: 6) . The main goal, however, was to educate the public, as the coordinator of the European Expert group put it: \"One of the best ways to help people understand science is by letting them participate in scientific research and experiments. This is what citizen science tries to achieve\" (Serrano, 2013) . In 2014, the Oxford English Dictionary added an entry for citizen science (without mentioning, however, its educational feature): \"citizen science: n. scientific work undertaken by members of the general public, often in collaboration with or under the direction of professional scientists and scientific institutions\" (OED, 2014) .\nThe specificity of the current understanding of \"citizen science, \" as a mode of public participation in science, is the claim that amateurs (\"general public\") can contribute to the production of scientific knowledge, with education as an associated goal or a by-product. A variety of other terms have been used to designate practices that fit, at least partially, the current definition of \"citizen science, \" including \"participatory research,\" \"communitybased research,\" \"science 2.0,\" \"open science,\" \"amateur science,\" and many others. Though the meaning and history of these terms do not perfectly overlap, they all encompass participa-tory practices aiming at including non-professionals in the making of scientific knowledge (the notions of \"amateur, \" \"lay person, \" \"general public\" or \"non-professional\" are of course problematic and will be discussed below). \"Citizen science\" is best understood as a recent and increasingly fashionable label applied to a subset of initiatives promoting \"public participation in scientific research\" (Shirk et al., 2012) ."}, {"section_title": "Typologies of \"Citizen Science\"", "text": "Practitioners, promoters, and analysts of \"citizen science\" have proposed a number of different typologies to make sense of the variety of practices that the expression encompasses. These typologies have mainly emerged in the context of evaluation practices carried out by the organizers of \"citizen science\" projects themselves and science funding agencies. More rarely, these typologies have been the result of academic research in science studies, which have contributed to evaluating these projects and defining what \"citizen science\" should be. Like all typologies, they reflect normative commitments about the values and hierarchies among various kinds of activities.\nThe most common kind of typology of participatory projects has focused on the locus of power. The typology devised by an NSF-sponsored inquiry group led by Richard Bonney distinguishes \"contributory projects,\" which are \"designed by scientists\" and where the public \"primarily contributes data, \" from \"collaborative projects, \" where the public can also \"refine project design, analyze data, or disseminate findings,\" and from \"co-created\" projects which are \"designed by scientists and members of the public\" and \"at least some of the public participants are actively involved in most or all steps of the scientific process\" (Bonney et al., 2009: 11) . This typology creates an implicit hierarchy that places \"co-created\" projects as a superior mode of \"citizen science,\" since it goes further in involving the public's participation, echoing public policy analyst Sherry R. Arnstein's (1969) influential \"ladder of participation\" developed in the context of participatory urban planning. This typology was later expanded into five modes (contractual, contributory, collaborative, co-created, and collegial) according to the \"degree of participation\" (Shirk et al., 2012) , but this time the authors were careful to avoid any hierarchical interpretation, insisting that they represented a \"spectrum. \" This approach to classifying participatory activities according to \"degrees of participation\" has also been adopted by geographer and participatory research advocate Muki Haklay into a model of different \"levels of participation,\" a \"ladder\" (and even an \"escalator\") from \"crowdsourcing\" (distributed computing and data gathering) to \"extreme citizen science\" where citizens have the most agency and \"are involved in deciding on which scientific problems to work on\" (Haklay, 2013a: 117) . These kinds of typologies have a clear political agenda: to encourage projects fulfilling citizen empowerment, rather than exploitation while ensuring that they contribute to science, as defined by scientists.\nAlternative typologies have focused for example on the goals of the participatory projects as well as the environments in which they are carried out. Information scientists Andrea Wiggins and Kevin Crowston (2011) distinguish five types of \"citizen science\": \"action\" (reaching local civic agendas through science), \"conservation\" (natural resource management), \"investigation\" (data collection in a natural environment), \"virtual\" (online scientific research projects), and \"education\" (science education in formal and informal settings). This typology places a greater emphasis, and value, on place and locality in participatory projects, highlighting participatory projects carried out in the physical world and distinguishing them from the \"virtual\" projects carried out online which have, due to their technological novelty, received the most attention in the media.\nWe propose a rather different typology of the practices that have been labeled \"citizen science, \" distinguishing between five epistemic practices, which we identified expanding on an initial classification developed by physicist and participatory research organizer François Grey (\"volunteer thinking,\" \"volunteer sensing,\" \"volunteer computing,\" Grey, 2012) . Our five epistemic practices involved in participatory researchsensing, computing, analyzing, self-reporting, making-help us see beyond the recent initiatives carrying the label \"citizen science\" and capture the greater diversity of participatory practices, past and present (for an illustration of each of these different epistemic practices, see the five vignettes). This typology does not imply any hierarchy between the different kinds, they are simply qualitatively different, and often hybrid, modes of knowledge production. These practices are ideal types, not natural kinds that could uniquely define the \"nature\" of participatory projects. Their purpose is to help us analyze (not classify) participatory projects in terms of their different knowledge practices. \"Sensing,\" for example, might be a dominant practice in a nature observation project, which also involves \"analyzing\" data and \"making\" instruments as a more minor component. This typology, like all typologies, has an agenda: by staying close to the actual knowledge practices of the actors, it avoids presupposing that they are all related and forms a thing called \"citizen science. \""}, {"section_title": "Strasser et al.", "text": "Sensing. In 2002, the Cornell Lab of Ornithology and the National Audubon Society launched eBird, an NSF-supported online platform dedicated to recording the migration of birds: \"Keep track of the birds you see anywhere in North America\" ordained their website at that time (eBird, 2002) . The data collected by the participants contributed to a \"cumulative eBird database\" to be used \"by birdwatchers, scientists, and conservationists who want to know more about the distributions and movement patterns of birds across the continent.\"\nBy September 2017, participants had reported more than 400 million bird observations on all continents of the globe. Today, hundreds of similar projects are available worldwide. They draw on people's familiarity with their local environment and the fact that large numbers of participants can greatly expand the spatial reach of observational projects. These projects range from eye observations of floods in the UK (Floodcrowd, 2016 -\" citizen science study into flooding in the UK\") or road signs in Luxembourg (Lingscape, 2016 -\"Citizen science meets linguistic landscaping\") to air quality monitoring through smartphone embedded sensors in the US (Common Sense, 2009 -\"use sensing technologies to conduct citizen science and participate in the political process\"). Most are available through smartphone apps and therefore follow people in their everyday lives.\nComputing. In 1996 at the Fifth International Conference on Bioastronomy, a group of scientists announced that they were designing \"an innovative SETI [Search for Extra-Terrestrial Intelligence] project (..) involving massively parallel computation on desktop computers scattered around the world\" (Sullivan et al., 1997) . Two years later, SETI@home was launched, under the direction of the University of Berkeley computer scientist David Anderson, and soon attracted millions of participants who \"donated\" the idle cycles of their desktop computers' CPUs in order to analyze radio signals that might indicate the existence of extraterrestrial intelligence. In 2005, the original SETI@home gave way to BOINC (Berkeley Open Infrastructure for Network Computing), a platform which allowed participants to choose between many different science-related projects, such as Rosetta@home (protein structure prediction) or MalariaControl.net (simulation models of the transmission dynamics and health effects of malaria), among many others. Although these projects are more commonly referred to as \"volunteer computing\" projects-a term coined in 1996 by the computer scientist Luis F. G. Sarmenta at MIT (Sarmenta, 2001)-they are now retrospectively cast as the forefathers of contemporary \"citizen science\" projects (Wright, 2010; Hand, 2010) , or simply as \"citizen science\" projects in their own right (Holohan, 2013) , even though the expression is rarely used by the members of the BOINC community.\nAnalyzing. In 2006, a NASA spacecraft landed back on earth, quite dusty after spending almost seven years in space. Scientists from the UC Berkeley Space Sciences Laboratory hoped that among millions of specks of dust a few might be of interstellar origin. To accomplish this massive quest, they launched the web platform Stardust@home, \"a distributed search by volunteers for interstellar dust,\" where participants could operate a \"virtual microscope\" to identify these rare particles from online images (Stardust, 2006) . The following year, the Education and Public Outreach Specialist of Stardust@home named it \"a citizen science project\" (Méndez, 2008) . Since then, a number of similar projects have emerged, such as Galaxy Zoo (2006)-determine the shape of galaxies-or Penguin Watch (2014)-count penguins in large colonies-many of which are present on the Zooniverse web platform, founded by astrophysicists Chris Lintott and Kevin Schawinski at the University of Oxford, \"home to the internet's largest, most popular and most successful citizen science projects\" (Zooniverse, 2009) . Since 2005, these projects have also been designated as \"crowdsourcing\" (Howe, 2005; Brabam, 2013) and cover a wide range of tasks, such as classifying images like in Galaxy Zoo, or analyzing existing scientific data by playing games like in the Foldit project (2008), where people fold proteins in three-dimensions.\nhelps us see beyond the label and provides a useful entry point into the longue durée history of participatory research. If, as we have argued, \"citizen science\" signals the new challenges faced by the experimental sciences rather than the continuity of the tradition of the amateur naturalist, if \"citizen science\" has more to do with the countercultural movements of the 1960s and 1970s than with the radical science movements of that time, then it may have the potential to reconfigure science in ways that go deeper than the arithmetic of participation-in ways that are inextricably epistemological and political. Such a way is opened, for example, by the emphasis put on experiential or embodied knowledge (Strasser and Mahr, 2017) , with tremendous consequences on not only the dominant scientific epistemology of the time, but also on the ways in which this epistemology is traditionally used to stabilize the social order and pacify social conflict.\nWe hope that our discussion can provide food for thought for more history of science-and STSinspired studies of \"citizen science.\" The current popularity of the term, in media and science policy discourses alike, should lead us to question what kind of society and what kind of science this particular mode of public participation in science is producing. Conceptualizing \"citizen science\" as a particular kind of relationship between science and the public (Nieto-Galan, 2016), specifically as a subset of public participation in research, opens up many possibilities for constructing meaningful historical narratives. Historical examples, when appropriately contextualized, can provide illuminating perspectives on how precise arrangements build and professional actors transform the relationships between knowledge and power. Long before the term \"citizen science\" was invented, proponents of \"community-based (action) research\" (or \"participatory action research\") inspired by the work of the Brazilian popular educator Paulo Freire and his successful Pedagogy of the Oppressed ([1968] 2000) , sought to connect scholars and lay people to produce knowledge that could solve local problems (Gutberlet et al., 2014) . Although they have often been mentioned, a more sustained attention to the history of \"community-based research\" and \"participatory action research,\" a growing practice today, especially in public health, environmental, and social science research, could provide a welcome contextualization for studies of \"citizen science\" (Kindon et al., 2010) .\nCritical studies of \"citizen science\" could also benefit from the voluminous scholarship about these modes of participatory research (and their effects on the production of knowledge and the transformation of communities) to gain a better understanding of the politics of public participation in science, especially with regard to its function as counter-expertise (Ottinger, 2016) . For example, philosopher Christopher Kullenberg, discussing air quality monitoring projects in Britain, has argued that \"citizen science\" could be a privileged tool of \"resistance\" by producing scientific facts that could then \"travel without encountering the usual forms of opposition, thus creating a displacement of what can be contested\" (Kullenberg, 2015: 61) . Others, such as historian Sezin Topçu, exploring popular oppositions to nuclear technology in France, argued that citizens' efforts to produce \"independent\" counter-expertise largely failed to displace the debate's demarcation lines because the production of counter-expertise required the adoption of too many of science's epistemic norms, values, and framings, precisely those that had produced nuclear power as a \"rational,\" \"safe,\" and \"cheap\" technology (Topçu, 2013) . The involvement of grassroots counterexpertise groups with governmental regulatory agencies can involve questionable trade-offs. As political scientist Gwen Ottinger aptly put it, \"scientific legitimacy, however, may come at a cost: where social movement-based citizen scientists align themselves with expert practices for the sake of scientific legitimacy, their critiques of standard scientific practices are apt to get lost\" (Ottinger, 2016: 99) . The political effects of today's \"citizen science\" projects, such as those of the Public Laboratory, best known for its attempt to \"tell a different story\" of the 2010 Deepwater Horizon oil spill through participatory mapping (Public Lab, 2016) , are largely unknown. Using a wider lens to empirically explore the consequences of various arrangements of experts and lay people in producing scientific knowledge-or redefining what counts as scientific knowledgewould go a long way in answering this question.\nA related question concerns the extent to which the support for \"citizen science\" projects, mainly originating from science funding agencies and academic institutions, really aims at empowering lay people in relation to science. Aside from the legitimate question of how volunteer work should be rewarded, financially or otherwise, or whether they contribute to the social dumping of paid professionals and the \"Uberizing\" of research, one might ask if the enrolment of lay people in participatory research does not represent yet another effort at governing the critique of science, rather than producing citizens with a critical understanding of science and its role in society. The very notion of \"citizen scientist, \" rather than \"amateur scientist\" for example, requires unpacking as it is unclear what it means to say that scientific literacy and scientific practice should become part of a fully developed citizenship. Is it about the production of a citizenry that embraces science and technology, a condition for liberal democracies to pursue the post-war alliance between science, technology, and the state? Is it about empowering a public to critically use the tools of science for solving some of its problems, while also resisting the hegemony of the scientific framing of others? Or is it about fostering scientific modes of reasoning among citizens, a condition for a robust deliberative democracy? Answering these questions will require sustained attention to the diversity of participatory practices, past and present, as well as how they transform knowledge, communities, and social order."}, {"section_title": "Self-reporting.", "text": "Riding on the success of medical information websites and social networks, several medical research platforms were created at the beginning of the twenty-first century. Among the most popular are the social media health platform PatientsLikeMe (2004) , the direct-to-consumer genomic service 23andMe (2006), and the microbiome research company uBiome (2012). These platforms invite their participants/consumers to share and compare both qualitative (self-reported symptoms and illness-narratives) and quantitative data (patient records, genomic and other laboratory test results, and self-tracking health data). The information is then pooled for research purposes. The projects are advertised through \"participatory\" slogans such as \"Let's make health care better for everyone through sharing, support, and research\" (PatientsLikeMe, 2016) or \"Join the thousands of citizen scientists who have had their microbiome sequenced\" (uBiome, 2016).\nMaking. In 2010, a group of biologists and entrepreneurs from the San Francisco Bay Area created BioCurious, a space which they defined as a \"Hackerspace for Biotech\" and a \"Community Lab for Citizen Science\" (Kickstarter, 2010) . In order to pay the rent of their 3,000 square-feet space located in an industrial building in Silicon Valley, and \"dedicated to Non-Institutional Biology,\" they launched a financing campaign on the crowdfunding platform Kickstarter asking people to \"forgo that skinny soy pumpkin soy latte for A DAY, and pledge toward the advancement of Citizen Science!\" (Kickstarter, 2010) . In the following years, BioCurious hosted a number of scientific projects, ranging from making plants that would glow in the dark to producing vegan cheese by genetically engineering yeast to produce milk proteins. The latter project was carried out in collaboration with another laboratory, Counter Culture Labs, a \"Community Lab for biohacking and citizen science\" that had been set up in Oakland, California in 2013, by a \"community of citizen scientists\" (Counter Culture Labs, 2013) . Since 2010, a number of similar spaces, often under the heading of \"do-it-yourself biology\" (DIYbio), or \"biohacking,\" have been established in large cities in the United States and Europe, such as Genspace in Brooklyn, NY, \"a nonprofit organization dedicated to promoting citizen science and access to biotechnology in the greater New York Area,\" and La Paillasse in Paris. Often inspired by computer hacker spaces and foregrounding the \"hacker spirit\" (Himanen, 1999; Delfanti, 2013) , these spaces illustrate epistemic practices based on \"making\" things and producing knowledge in laboratories.\nThis typology also draws attention to practices not carried out under the banner of \"citizen science,\" such as \"participatory action research\" and \"community-based research,\" but that might nevertheless be essential to understanding public participation in the production of scientific knowledge. Unlike other typologies, such as the \"ladders of participation, \" the one presented here, based on epistemologies, makes no assumptions about the kinds of politics enacted by different kinds of \"citizen science\" projects, leaving the question of the links between epistemologies and politics as an empirical question. The goal of this typology is not taxonomic, but fundamentally analytic: by analyzing the variety of public participation projects in terms of their individual epistemic components, the individual genealogies of these \"ways of knowing, \" as John Pickstone (2000) has put it, can be disentangled."}, {"section_title": "Situating \"citizen science\" historically", "text": "Although most exponents of the different kinds of \"citizen science\" frame them as an unprecedented or revolutionary movement emerging at the end of the twentieth century, they sometimes acknowledge the existence of two historical precedents: the tradition of amateur naturalists in the eighteenth and nineteenth century and the critique of science of the late 1960s and early 1970s (Dickinson et al., 2010; Silvertown, 2009; McQuillan, 2014) . These two historical filiations deserve critical scrutiny (for another attempt at historicizing the transformation of public participation in sciences, see Lengwiler, 2007) ."}, {"section_title": "Amateur Naturalists", "text": "Drawing a simple connection between amateur naturalists and current \"citizen science\" can be misleading and obscure two crucial aspects that make present forms of public participation in research, including \"citizen science,\" historically significant. First, the concept of \"citizen science,\" as a relationship between professionals and amateurs focused on the production of scientific knowledge, only makes sense after professionalization has produced these mutually exclusive categories, a process which took place during the nineteenth century and only solidified by the end of that century (Mody, 2016; Allen, 2009 ). Before that, most \"natural philosophers\" and \"naturalists\" (then \"men of science,\" \"savants,\" and \"Naturforscher\") were many other things at the same time (White, 2016) , and were mostly unpaid for their scientific occupation, which was often practiced only a few hours a day, aside from their main professional occupation. Science was mostly what one might call a \"hobby\" today, and those spending time producing natural knowledge were all \"amateurs,\" even though not all amateurs were equally involved in their craft. Thus, before the mid-nineteenth century, almost all science was \"citizen science\" (Haklay, 2013a) . Applying this notion to historical periods predating the professionalization of science is thus not particularly helpful analytically. However, the fact that this mistaken historical filiation is put forward today is interesting as an attempt at \"inventing a tradition\" (Hobsbawm and Ranger, 1983 ) that could legitimize today's participatory research: if Darwin was a citizen scientist (Silvertown 2009 ), then today's amateurs participating in science might also be up to something valuable.\nFor example, instead of thinking of public participation solely as a matter of expertise, with \"amateurs\" taking part in activities reserved to \"experts,\" it might be more useful to conceptualize public participation in terms of space. From people sharing processing power from their personal computer for the SETI@home project to hackers making biological experiments in their garage or kitchen, these forms of public participation delineate a domestic space for science and a distinctive genealogy of public participation. Indeed, the home was, since the scientific revolution, a key place for the production of scientific knowledge, especially among natural philosophers developing experimental ways of knowing in the laboratory's ancestor: the domestic kitchen (Shapin, 1988) . However, the importance of domestic spaces for science was not restricted to the house of experiment in seventeenth century England, and \"domestic science\" continued far into the nineteenth century (Opitz et al., 2016) . Darwin carried out physiological experiments, anatomical dissections, and systematic observations from his country house, a place that blurred the bounda-ries between the public and the private, family and colleagues, work and leisure. So, Darwin certainly had something in common with current \"citizen scientists, \" not as some kind of \"amateur, \" but rather as someone performing research from home.\nYet, the bigger picture remains: after Darwin, the exclusion of science from the home was a key aspect of the professionalization of science and part of the deep historical transformation that separated living and working spaces (Prost, 1999) . In the twentieth century, when scientific and technical practices took place in the home, they were the mark of the \"hobbyist,\" not the \"professional.\" Scientific and technical hobbies blossomed after World War II, from ham radio to home rocketry, and delineated a special space, essentially for men, in the family home (Haring, 2008) . Understanding the history of public participation might thus require a greater attention to the locus of scientific practices and their cultural, political, and epistemic consequences. Thinking about participatory research in terms of \"domestic science\" might be at least be as illuminating as describing it as \"citizen science. \"\nThe second element that makes current public participation historically significant pertains to the fact that even after the professionalization of science (and thus the creation of a meaningful category of \"amateur\"), professional \"science\" remained a heterogeneous category (Pickstone, 2000) . By the late nineteenth century, an increasing number of men (and some women) were practicing science as a full-time occupation, were paid for it, and were being called \"scientists, \" a term coined by William Whewell half-a-century earlier, by analogy with \"artist\" to designate collectively all \"students of the knowledge of the material world\" (Yeo, 1993; White, 2016) . Nevertheless behind these attempts at unification, a number of dissimilar epistemic and social practices continued to coexist. In this regard, the (experimental) physicist, the naturalist, and the mathematician (to borrow Whewell's examples) did not have that much in common. Regarding their relationship with the public, the differences could not be more striking. In plant and animal taxonomy, geology, anthropology, and astronomy, a dense network of professionals and amateurs collaborated, especially with regard to the collection of specimens and observations (Strasser, 2012) . The great botanical collections of William Jackson and Joseph Dalton Hooker at Kew Gardens (Endersby, 2008) and of Augustin Pyramus and Alphonse de Candolle at the Conservatory and Botanical Gardens in Geneva, were largely constituted from specimens contributed (and sometimes identified) by amateur naturalists. In Britain, a rich culture of working-class amateur botanists, meeting in pubs, contributed to the production of systematic knowledge (Secord, 1994) .\nIn the experimental sciences, a very different situation prevailed. The epistemic and moral authority of the experimental sciences derived in part from the exclusion of the public from the place where knowledge was produced: the laboratory (Shapin and Schaffer, 1985) . In addition, the more and more sophisticated and expensive instruments required to practice experimental research were increasingly beyond the financial reach of the general public. Although these two scientific cultures live on to the present day, from the late nineteenth century, the experimental sciences have come to dominate most areas of inquiry about nature, marginalizing the kind of sciences in which amateurs played the most important role (Coleman, 1971; Cunningham and Williams, 1992) . Thus, the twentieth century saw a widening gap between professional (experimental) scientists and the public. As Popular Science Monthly put it in 1902, referring to the experimental sciences: \"The era of the amateur scientist is passing; science must now be advanced by the professional expert\" (Anonymous, 1902: 477) . Science popularization was not just a neutral observer of this divide. It declared its intention to bridge it, yet contributed to sustaining it (Bensaude-Vincent, 2003) . From the late nineteenth century, the decrease in public participation in science should thus be seen not only as a result of the professionalization of science, but also as a shift in the center of gravity of the sciences from one kind of epistemic practice, where amateurs were highly present, to another where they were mostly excluded (even though, in some cases, collaborations persisted; Alberti, 2001) .\nNoting the importance of this second factor (the decline in natural history and the rise of exper-imentalism) makes visible one of the most distinctive features of some of the current practices falling under the label \"citizen science.\" There are indeed strong historical continuities between amateur ornithologists in the nineteenth century, contributors to the Audubon Christmas Bird Count in the twentieth, and participants in Cornell University's online bird mapping project, eBird, in the twenty-first century. However, one should not overlook the fact that current \"citizen science\" projects include not only time-tried participation of amateurs in the collection of observations, like the presence of birds, but also their participation in experimental research, a field from which they had been mostly excluded for more than a century. Participatory projects involving the public in research about protein folding or particle physics, fields in which there was no tradition of public participation to build on, could mark a significant historical transition. One of the most striking features of some of the current participatory projects, we suggest, is that in some cases, they begin to bridge the gap between science and the public in the experimental sciences, precisely where this gap has been the widest. Making sense of this historical transition will require embracing a historical perspective that deviates from the usual reference to nineteenth-century amateur naturalists."}, {"section_title": "Radical Science Movements", "text": "After the amateur naturalist, the other most common historical filiation drawn for \"citizen science\" goes back to the radical science movements of the 1960s and 1970s. This genealogy apparently makes sense since some of the current advocates of public participation in knowledge production, especially in do-it-yourself biology and environmental monitoring, are highly critical of academic and corporate science for not serving the public interest (Delgado, 2013; Wylie et al., 2014) . In the immediate postwar period, such challenges to the authority of science and technology had been more limited in scope (Pessis et al., 2013; Jarrige, 2016) , focusing on specific issues, such as nuclear fallout or nuclear war (Wittner, 2009) , air pollution (Fleming and Johnson, 2014) , and toxic molecules that were harmful for human health or the environment (Boudia and Jas, 2016). Rachel Carson's indictment of the pesticide DDT in her immensely popular book Silent Spring (1962) soon became a rallying cry for those questioning more broadly the role of science in society (Lear 1997) and fueled the growth of the environmental movement (Egan, 2007) . In the 1960s, and especially in the context of the protest against the Vietnam War, the critiques from the anti-nuclear, the environmental, and the health movements began to coalesce into a broad critique of science and technology (Moore, 2008; Egan, 2007; Leslie, 1993; Beckwith, 2002) .\nIn 1969, the American group Scientists (and Engineers) for Social and Political Action, better known through the title of the journal it started publishing the following year, Science for the People, began disrupting the annual meeting of the American Association for the Advancement of Science (AAAS), calling for a redirection of the research enterprise towards the needs of the people, rather than those of the \"military-industrial complex\" (Moore, 2008) . In many ways, their call echoed those of the radical scientists of the 1930s, such as John Desmond Bernal in the UK and Walter B. Cannon in the US, but without explicit Marxist overtones (Ravetz and Westfall, 1981; Kuznick, 1987 ). Yet, the message of Science for the People activists was not always well received, at least not by \"the angered wife of a respected biologist [who] thrust her knitting needle into the arm of a noisy young protestor\" (Wilford, 1970) . Science for the People also attempted, like other similar movements in France, to \"educate the scientists\" (\"raise awareness\" one might say today) about issues such as the researcher's working conditions, social inequalities, race, poverty and gender disparities (Debailly, 2015; Quet, 2013) . The goal was to encourage the development of a community of \"citizen scientists. \"\nAlthough it might be tempting to see a deep connection between the \"citizen scientists\" envisioned by these radical science movements and the current discourse about the lay individuals becoming \"citizen scientists,\" these two notions of \"citizen scientist\" actually point in opposite directions. In the 1970s, groups like Science for the People, mainly composed of professional scientists, hoped to make their colleagues better citizens, or \"citizen scientists\" (instead of \"military scientists\" or \"industrial scientists\"). These (citizen) scientists were called to take on their civic responsibilities and better serve the public interest-as determined by scientists. Today, the \"citizen scientist\" is no longer a professional scientist behaving like a responsible citizen, but a lay citizen who acts like a scientist, specifically in producing scientific knowledge (although the idea of the responsible scientists may still apply to the organizers of participatory projects). The legacy of the radical science movements of the 1960s and 1970s, such as Science for the People, the Union of Concerned Scientists, the British Society for Social Responsibility in Science, and many others (Sonnert and Holton, 2002) , is only marginally connected to current modes of public participation where lay people contribute to the production of scientific knowledge, and far more with the configuration that emerged earlier (and continues to the present day), based on the involvement of the public in deliberations about science and technology that dominated the ideals of public participation in the 1980s and 1990s.\nIndeed, in the 1980s, a number of \"institutional experimentations\" (Chilvers and Kearnes, 2015: 8), such as consensus conferences, participatory technology assessment, and science shops, aimed in Europe and the United States at making the voices of citizens heard in the formulation of national science policy or in making local technological choices (Petersen, 1984) , and thus are best understood as a \"deliberative regime\" of public participation (Bucchi and Neresini, 2007) . These initiatives-often grouped under the heading of \"public engagement\" as opposed to \"public understanding\"-are part of the broad \"participatory turn\" (Jasanoff, 2003) , promoted by national and supranational governments (Saurugger, 2010) and international organizations such as the World Bank (World Bank, 1996) . Following up on the ideals of earlier radical science movements, these forums aimed at identifying the public interest and setting the course of scientific researchconducted by scientists-towards serving them, a key element of what Helga Nowotny, Peter Scott, and Michael Gibbons (2002) have labeled the \"Mode 2\" of knowledge production. But this time, \"the people\" had an actual say in what it considered the public interest; however, it turned out, this occurred mostly at the very end of the research and development process. Abundant literature in science studies has describedand played a key role in crafting and promoting (Stilgoe et al., 2014) -the rise of these models of public engagement, especially upstream engagement, but has also exposed its numerous limitations (Jasanoff, 2013; Irwin, 2006; Felt et al., 2007) .\nIt seems unclear if these institutional arrangements have restored public trust in science as their promoter had hoped, perhaps because they still implicitly envision the public through the \"deficit model\": the public lacks knowledge and expertise and is waiting to be enlightened (Wynne, 2006) . One more troubling concern perhaps, is that these institutions could be considered less as a tool for helping the public participate in the governance of science than as a tool for governing the public's anxieties about science, while leaving the general course of scientific research unaltered (Pestre, 2011) .\nIn the 1990s, the rise of public participation in scientific research and discourse about \"citizen science\" should be understood against the backdrop of this deliberative regime of public participation, focused on deliberation about science and technology. Specifically, participatory research, such as \"citizen science, \" can be seen as a response to perceived shortcomings of the deliberative regimes and as yet another attempt at restoring a trustful relationship between science and the public. If this claim has any value, then it is crucial to critically examine shifts in science policy, in the European Commission for example, from \"Science for Society\" (FP7) to \"Science with and for Society\" (European Commission, 2016), which resulted in generous support for initiatives falling under the heading of \"citizen science. \"\nObviously, this does not mean that the 1960s and 1970s, and especially the countercultural movements, were irrelevant for understanding the current rise of participatory research (McQuillan, 2014) , only that the social movements conducted by scientists were perhaps not the most significant. Of far greater relevance, we argue, were the women's health movements, such as the Boston Women's Health Collective, which produced the newsprint Our Bodies Our Selves (Boston Women's Health Book Collective, 1971) , and \"popular epide-miology\" which addressed the health issues of people living in toxic waste sites. In their attempts to \"liberate\" women from the patriarchal domination of medical professionals, self-help groups and feminist women's health centers were established in the 1970s to teach lay women how to produce biomedical knowledge about their own bodies through self-examination using cheap plastic speculums (today produced at home with 3D printers) (Morgen, 2002; Kline, 2010; Nelson, 2015; Mahr and Prüll, 2017) . Most of this knowledge was mainly for individual use, but sometimes also served to challenge established biomedical knowledge, especially about fertility and pregnancy. Similarly, since the 1970s, communities living in environments perceived to be toxic, began to conduct epidemiological research to link the emergence of diseases, such as leukemia, with pollutants released in the environment (Brown et al., 1997; Brown, 2007) . They too were producing new scientific knowledge, often challenging widespread consensus that the presence of pollutants (when acknowledged) was unrelated to the occurrence of diseases. These community efforts to challenge biomedical orthodoxy gained far more power in the unique circumstances of the AIDS crisis in the 1980s, when patient organizations, such as Act Up, succeeded in becoming legitimate-and unavoidable-partners in the production of biomedical knowledge (Epstein, 1996; Rabeharisoa and Callon, 2002) . The heritage of the countercultural movements of the 1960s and 1970s for participatory research, and for science more generally (Kaiser and McCray, 2016) , thus requires a serious reassessment."}, {"section_title": "Contextualizing the promises of \"citizen science\"", "text": "Among the various kinds of participatory research projects, those promoted under the banner of \"citizen science\" have produced a particularly dense promissory discourse. Three kinds of promises are made: a greater democratization of science, better scientific literacy, and new scientific breakthroughs. All three claims deserve critical scrutiny."}, {"section_title": "Democratizing Science?", "text": "The democratization thesis is certainly the brightest and at the same time the most opaque. It has been embraced almost unanimously by science policy bodies, promoters of \"citizen science\" projects, and the media. The European Commission put it unambiguously: \"[Citizen science] allows for the democratization of science\" (European Commission, 2015) . The crowdsourcing platform Zooniverse put it more elegantly: \"People Powered Research\" , and a guest blog of Scientific American, to make sure no one would miss the constitutional dimension of \"citizen science,\" was astutely entitled: \"Science of the People, by the People and for the People\" (Cooper, 2015) .\n\"Democracy\" can refer to many things, but if one has to find a common element to most theories of democracy, it is the fact that some measure of power should be distributed among all citizens (Christiano, 2015) . Thus, something becomes more democratic when more people, ideally everyone concerned, can take part. Countering the traditional view of science as an arcane activity and of scientists as a closed, elitist circle cut off from the community, the rhetoric of openness pervades public participation in science, and especially \"citizen science. \" Organizers of \"citizen science\" projects stress repeatedly that \"anyone can become a citizen scientist\" (Gonforth, 2016) .\nBut who does in fact participate? Are today's participants really \"anyone\"? Does their age, gender, ethnicity, class, and especially educational background, statistically represent that of \"the people,\" a condition for public participation to fulfill its promises at democratizing science? The answer is that nobody really knows. Limited surveys of certain participatory projects seem to indicate that the participants are predominantly white, younger than average, middle class, and men (Curtis, 2015; Reed et al., 2013; Raddick et al., 2010) , but little research has been done about the most important variable: their educational and professional background. If the goal of public participation is to expand the range of people involved in science, then it should reach out to people with little or no previous experience in science-although it cannot assume, as it usually does, that \"anyone\" desires to participate in scientific research (Haklay, 2013b) . Taking the democratization argument seriously will thus require a more fine-grained analysis of the demographics of participation across the different kinds of participatory projects (distributed computing and do-it-yourself biology might not yield the same answers). A prosopography of today's contributors to participatory research will go a long way in assessing its contribution to the democratization of science.\nA related issue concerns the actual size of the \"crowd\" participating in scientific research. Hyperbolic comments about massive crowds of \"millions of participants\" abound , but such bold claims, and what is meant by \"participant,\" have as yet received little scrutiny. In Bowling Alone: The Collapse and Revival of American Community, Robert D. Putnam notes that the millions of \"members\" joining environmental associations do not undermine his general claim about the decline in traditional communities because the meaning of \"membership\" has changed over time, becoming little more than the signing of a check rather than a personal and active involvement in an association (Putnam, 2001) . Similarly, the participant who signs up for an online participatory project, but never contributes, should be distinguished from the one who spends most of her evenings and weekends in a DIY community laboratory. As in all other online communities, such as Wikipedia, there are great levels of inequality in the number of contributions by participants.\nA way to contextualize the size of the participatory research \"crowd\" is to compare it to past examples where citizens were involved in the production of scientific knowledge (Vetter, 2011) . In 1897, in Germany alone, around five thousand amateur ornithologists (individuals, their families, and local collectives) were mapping birds as members of a long-term biogeographic survey (Mahr, 2014) . In the US, several thousand birders were contributing to the annual Christmas Bird Count since the first decade of the twentieth century (Barrow, 1998) and, starting in 1958, more than 750,000 volunteers were tracking artificial satellites in Operation Moonwatch to better understand their trajectories in the upper atmosphere (McCray, 2008) . To carry any meaning, the numbers of individuals currently enrolled in participatory research should be brought into comparative perspective."}, {"section_title": "Educating Citizens in Science?", "text": "The second promise of participatory research, and especially in \"citizen science\" projects, revolves around science education and the need to raise scientific literacy, a major topic (together with participant motivation and data quality) in the literature about \"citizen science\" Herodotou et al., 2017) . Empirical research on the learning outcomes of \"citizen science\" has documented improvements in content knowledge, but it remains inconclusive with regard to improving participants' understanding of the scientific process (Cronje et al., 2011; Masters et al., 2017) , although future projects might well develop new methodologies to attain these goals. However, a more contextual understanding of these educational promises should highlight why increasing \"scientific literacy\" has become a task for \"citizen science\" to fulfill. Part of the answer stems from the changing meaning of \"science literacy\" since it was coined in the late 1950s, and the growing influence of international science learning assessments (DeBoer, 2011) .\nImmediately after the Second World War, science education became considered by governments as a critical tool, not just for moral and civic improvement, but for the training of the scientific workforce perceived to be essential for economic growth and national security in the Cold War (Rudolph, 2000) . Discourses about the \"knowledge economy\" and \"informational capitalism\" in the 1980s renewed the desirability of training increasing amounts of \"STEM workers\" and made scientific literacy an essential part of modern citizenship (Kosmin et al., 2008) . Although the shortage of \"STEM workers\" might no longer be true in the United States and other Western countries (Benderly, 2016) , numerous educational policies remain in place to encourage careers in these fields, perhaps because of the belief that in a \"knowledge economy, \" technological innovation will fuel economic growth. Moreover, many of today's global threats, from climate change to food (in)security, are perceived as having techno-logical solutions, requiring the production of more entrepreneurial scientists; carbon capture and GMOs, for example. International science assessments, such the International Association for the Evaluation of Educational Achievement's Trends in International Mathematics and Science Study (TIMSS) (since 1995) or the OECD's Programme for International Student Assessment (PISA) (since 2000), have reinforced these trends and fueled a competition among nations towards attaining the highest score on these particular tests of \"scientific literacy. \"\nIn these international assessments, as well as in numerous national educational policies, the meaning of \"scientific literacy\" has shifted from content knowledge to a broader understanding of the scientific process, the nature of science, and the nature of scientific inquiry (DeBoer, 2000) . The failure of school laboratory instruction to increase students' understanding of the scientific process, a critique made as early as 1902, has made alternative pedagogical models, from out of school learning to informal learning, more attractive (DeBoer, 1991) . By involving students, as well as adults, in authentic research projects, rather than \"school science,\" organizers of \"citizen science\" projects could claim that participation would increase understanding of the research process, thereby aligning themselves with educational policies. Thus, understanding the rise of participatory research will require sustained attention to its framing as a solution to (international) educational challenges."}, {"section_title": "Producing New Science?", "text": "Finally, promoters of \"citizen science\" projects also promise new scientific breakthroughs made possible only by (massive) volunteer participation. The amount of work to be performed or the geographic reach of the observation to be collected is found to justify the enrollment of a large number of volunteers. The volunteers' individual lack of scientific expertise is compensated by the collective cognitive abilities that emerge from \"wise crowds\" (Surowiecki, 2005) . Although participating in an online \"citizen science\" game like Foldit might seem like a solitary activity, in the words of one user, \"chat windows, a wiki, duels and group play make Foldit into a social environment in Strasser et al. which users learn from each other\" (Perkel, 2008) . A number of online participatory research projects, such as Foldit, EyeWire, or Galaxy Zoo, where volunteers analyze scientific data, have forcefully advertised how \"citizen science\" results in scientific publications in high profile journals, in which volunteers have occasionally been included as individual or collective (\"Foldit Players\" and \"Eyewirers\") co-authors (Horowitz et al., 2016; Kim et al., 2014) . Economists have attempted to quantify the monetary benefits of using volunteers rather than professional researchers in producing these scientific contributions (Sauermann and Franzoni, 2015) .\nNonetheless, understanding the contribution of volunteers to participatory research through the number of papers published or the economic value of volunteer labor might be somewhat of a narrow view. First, it is far from clear that all \"citizen science\" projects, even those directed by professional scientists, are aimed at solving problems deemed scientifically important by the scientific community. A number of the \"scientific\" problems given to volunteers by professional researchers would probably never have been carried out, regardless of the required resources, because they would have been considered of limited scientific and societal interest. In other words, this is not a zero-sum game, since the range of questions addressed by participatory research does not always overlap with that currently investigated by academic science. This does not undermine the value of participatory research, but it instead draws attention to the fact that public participation in research can also produce knowledge on parts of the natural and social world that have been largely unexamined scientifically. \"Citizen science\" has mainly been viewed as a way of assisting scientists in reaching their research goals, ignoring the possibility that participatory research could also expand what counts as the scientific worldview.\nSecond, public participation in research may not only change the territory of science but also the perspective on this territory. This is obviously true, according to any kind of standpoint theorist, because the inclusion of people from different social backgrounds, such as underprivileged minorities, with different personal experiences, such as patients with rare diseases, will result in the production of different knowledge, at least if they are given the power to frame research questions (Wylie and Sismondo, 2015) . However, this might also be true for public participation in research where the \"volunteers\" have the least agency: crowdsourcing. Indeed, the most common argument for enrolling a wide spectrum of the public in crowdsourcing is the sheer number of simple tasks that need to be accomplished, such as classifying hundreds of thousands of images of galaxies. The rationale for involving the public, rather than automated methods, is that these tasks often involve, \"intuition, \" \"insight, \" and \"pattern recognition,\" and thus cannot be easily performed by computers. As an article in Scientific American praising \"citizen science\" put it: \"Humans retain an edge over computers when complex problems require intuition and leaps of insight rather than brute calculation\" (Coren, 2011) . Stories about amateurs who make exceptional contributions to research, for example, at solving highly complex 3D protein structures, highlight their unique set of cognitive, but also perceptive and affective qualities. In a piece published in Nature, Foldit player Scott \"Boots\" Zaccanelli, who works as \"a buyer for a valve factory\" but spends much of his spare time folding proteins on Foldit, is described as having reached sixth position in the game's rankings in part because of his personal abilities: \"I can look at something and see that it's not right\" (Hand, 2010: 687) . Another player described her special \"feel\" for proteins (Boyle et al., 2011) . Later, Nature simply called this \"Science by intuition\" (Marshall, 2012) .\nFrom the history of epistemology, it is rather striking that the mobilization of these abilities would become heralded as legitimate strategies for solving scientific problems, knowing that their exclusion was a key element in the formation of modern science, based on the ideal of objective, rational, and disinterested knowledge (Shapin, 1996; Dear, 2001; Daston and Galison, 2007) . In this sense, citizen science sometimes seems to embrace a premodern (and postmodern) notion of knowledge, with the inclusion of \"experiential knowledge\" (Smith, 2006; Harkness, 2007) \"embodied\" knowledge (Lawrence and Shapin, 1998) , and \"situated knowledge\" (Haraway, 1988;  Science & Technology Studies XX(X) Longino, 1990; Fausto-Sterling, 1992) . These epistemological commitments, if they turn out to provide viable alternatives to traditional scientific epistemologies, could have far-reaching consequences on the nature of the scientific knowledge produced and its relations to gender and power (for other epistemological critics of participatory science, Sieber and Haklay, 2015; Watson and Floridi, 2016) Analyzing the epistemological values at play in current modes of public participation in research also illuminates their historical connections to earlier challenges to scientific authority. It is no historical accident that many of the successful challenges from lay people to scientific orthodoxy emerged from knowledge grounded in their own body or its immediate environment. The credibility of the knowledge claims made by women health activists in the 1970s, by AIDS patients in the 1980s, or by residents of toxic neighborhoods in the 1990s was based on their intimate experience of their own bodies and physical environments. Patients spoke on behalf of their bodies and residents on behalf of their environments (Epstein, 1996; Kohler, 2002; Brown, 1997) . Because of this, their claims carried much epistemic weight, sometimes enough to overcome their professional marginality and challenge scientific consensus. Seen in this light, the contribution of participatory research could be far more significant than simply adding an army of unpaid volunteers to help in solving current scientific problems at a lower price. It could result in a different kind of science and a different kind of knowledge. If participatory research can transform how knowledge is being produced, at a deep epistemological level, then it could hold important potential for transforming who can produce legitimate knowledge and what we know about the natural world."}, {"section_title": "Conclusion", "text": "Taking stock of the rise of \"citizen science\" requires that we hold together an analysis of the discourse surrounding \"citizen science\" and a finegrained examination of the practices that may only partially, and only provisionally, fall under its name. In other words, we should not let the label obscure, or entirely determine, the meaning of practices which, seen from the vantage point of the historian and sociologist of science, are significant in and of themselves. Of course, we need to understand where the label \"citizen science\" comes from, what strategic role it plays for the institutions and individuals who promote it, and how its performative power shapes and re-shapes actual practices of participation. However, we also need to move from \"citizen science\" to participatory research or even inquiry (Heron and Reason, 1997) -beyond the label, to the many ways in which members of the public have engaged and continue to engage in the production of scientific knowledge, and how they make sense of this engagement.\nWe have suggested that \"citizen science\" as a label emerged in the context of a shift, inside the participatory turn in science policy, from deliberation to production. \"Citizen science\" can indeed be seen as the next step of the participatory turn, one that has the potential to overcome the shortcomings of the deliberative regime by involving the public in the very production of science. \"Citizen science\" offers to turn anyone into a scientist, promising to produce new knowledge, educating the public and above all reconfiguring science from a closed to an open activity-in short, \"democratizing\" science. This context and these promises explain why so many typologies of \"citizen science,\" both emic (by practitioners and promoters of \"citizen science\") and etic (by STS scholars), have focused on the degree or level of participation, implicitly measuring the extent to which the elitist barrier between scientists and the public has been undermined.\nIn paying close attention to the various practices and genealogies obscured by the uniformity of the label \"citizen science,\" we have not attempted to shy away from its politics. Evaluating the promises of \"citizen science\" is, of course, necessary, for example by questioning and putting in perspective the nature and the size of the crowd of citizen scientists. But we believe that it is only through a better understanding of the epistemologies of participatory research projects that we can arrive at a better assessment of the politics of \"citizen science.\" Our typology of five different epistemic practices-sensing, computing, analyzing, self-reporting, making-"}]