[{"section_title": "Abstract", "text": "In this study had been investigated from cognitive ability to economic development in Turkey. Turkey has young population, and developing country. It has candidate member of European Union. It has member of OECD. This means that I compared with OECD countries Pisa examination. I used to EUROSTAT's data EU countries. The main objectives of this study are to compare developing and developed countries population and education system for economic and social development. Literature review, there are several papers and research human capital and economic development. We should be investigating multidisciplinary approach. Because it is differ from social, cultural, economic and political level. Bologna progress is obliged to regulate for member to EU. Research Methodology, in this study welfare level and GDP is dependent variable. Enrollment, student, education programs, population, employment, IQ tests and Pisa scores are independent variables. There is positive correlation individual and cognitive skill to human and social capital. But there is cultural and social effect for measurement. I find that high average scores are strongly associated with increases in school enrollments and large reductions in the unemployment."}, {"section_title": "Introduction", "text": "There is a general consensus that Human Capital is a major determinant of economic development. However, the range of available Human Capital variable is very wide in technical and theoretical senses that different Human capital measurement is sometimes only comment. Economy is a social science. Therefore in this study dependent variable is social development, independent variables are, forms of capital and subfield social sciences. This paper focuses on essence and relationship as a human capital instrument and pillars social and economic development. Main objective is to denominate to literature and Purpose: To assess a government's policy emphasis on education relative to the perceived value of other public investments. It reflects also the commitment of a government to invest in human capital development. Calculation method: Divide total public expenditure on education incurred by all government agencies/departments in a given financial year by the total government expenditure for the same financial year and multiply by 100. Formula: PXEt %PXE:----------x100 TPXt t Where : %PXEt: Public expenditure on education as a percentage of total government expenditure in financial year t PXEt: Total public expenditure on education in financial year t TPXt: Total government expenditure in financial year t Data required: Total public expenditure on education; and total government expenditure. Data sources: Annual financial reports prepared by the ministry of finance; national accounts reports by the central statistical office and financial reports from the various government departments engaged in education activities especially the ministry of education. Data disaggregation: By level of administration, geographical location (region, urban/rural), and by purpose of expenditure (emoluments, teaching material, etc.).Interpretation: A higher percentage of government expenditure on education shows a high government policy priority for education relative to the perceived value of other public investments, including defense and security, health care, social security for unemployment and elderly, and other social or economic sectors. Quality standards: Total public expenditure on education should include those incurred by all concerned ministries and levels of administration. This indicator can never be 100% since the latter includes expenditure on many economic and social sectors, besides education. The fact that the fiscal year and educational year budget periods maybe different should also be taken into consideration. Limitations: In some instances data on total public expenditure on education refers only to the ministry of education, excluding other ministries that spend a part of their budget on educational activities. (Unesco,2009:p.21) Economic and social theories are set of knowledge. Science is connected with reason and results. In several economic theories argues that the value of education is evaluated by way of two different theoretical approaches; the human the capital approach and human capabilities, which are including cognitive and non cognitive approach. Schooling period are both relevant and espouse for children. Cognitive ability develops fort his period, non cognitive ability established this period. This means that, Turkish education enrollment must be regulate knowledge based economy and form of capitals. Human capital measures different ways, but effects of capital measures TIMSS (Trends in International mathematics and Science Study) and PISA.(Program of International Student Assessments),this program especially using by OECD countries' Turkey increases for PISA score, GNP effect will be increase absolutely. This hypothesis supports some evidence fellow. "}, {"section_title": "Comparative analysis:", "text": "Mean years of schooling (MYS) have been used by the Human Development Report Office(HDRO) of the United Nations Development Programme (UNDP) since 2010 as one of two education indicators in the calculation of the Human Development Index (HDI) (UNDP, 2010) .MYS replaced the adult literacy rate that was used in the calculation of the HDI until 2009(UNDP, 2009). The second education indicator used in the calculation of the HDI is the school life expectancy, called \"expected years of schooling\" by HDRO, which replaced the combined gross enrolment ratios in primary, secondary and tertiary education.(UNECSO,2013 p.1) The method for the calculation of MYS used at the UIS is similar to the approach by Barro and Lee (1993, 2010) . The following information, available in the education statistics database of the UIS, is needed for each country to estimate MYS: Distribution of the population by age group and highest level of education attained in a given year; and Time series with the official duration of each level of education. For each age group, the proportion that attained a given level of education is multiplied by the official duration of that level. The sum of the resulting values yields the MYS for the population under investigation. For example, assume that 50% of a population completed primary education with a duration of 4 years, and 50% completed lower secondary education with a duration of 4 years, which means they spent 8 years in primary and lower secondary education combined. In this case, MYS is 0.5 × 4 + 0.5 × 8 = 6 years. (Unesco,2013,p.4) The Commission proposes increasing the amount allocated to R&D and innovation from S55 billion in the last financial framework to S80 billion in 2014-20.This is welcome but still inadequate for a continent whose future prosperity will depend on staying at the technological frontier.. (John Peet and Stephen Tindale, 2012; p.6) .South Korea leads 2013 R&D expenditure GDP ratio among advances nations. Postsecondary VET in Korea In Korea most young people enter high school (88.5% of15-19-year-olds in 2008 (88.5% of15-19-year-olds in (OECD, 2011a , either general (75.5%), vocational (23.5%) or other types (1%). Both types of high school allow students to pursue post secondary studies. In 2009 85% of general high school graduates sand 74% of vocational high school graduates enrolled in a post secondary programme (MEST, 2010) . Access to post secondary education is selective and students are admitted to an institution and programme based on their performance on the Korean Scholastic Aptitude Test (KSAT).Posts secondary VET accounts for 30.8% of tertiary enrolment (Kim,Woo, Ryu and Oh, 2011) . It is provided by two types of institution: junior colleges and polytechnics. The junior college sector is much larger, enrolling over 50 times more students than polytechnics. Access to junior colleges is selective in principle, but not genuinely so in some institutions that struggle to fill their places. About two thirds of entrants are recent high school graduates, while most of the rest are students who retook the KSAT test. ( Kis, V. and E. Park (2012,p.15) The well qualified labor forces are an indispensable component for a productive economy. This means that has been the well qualified labor force is possible with well planned high school vocational and technical education. In this view, vocational and technical education is critically important for the developing economies. Turkey needs to well qualify labor force to employ in its own industry. Define the set of key skills that are referenced by the labels \"deeper learning,\" \"21st century skills,\" \"college and career readiness,\" \"student centered learning,\" \"next generation learning,\" \"new basic skills,\" and \"higher order thinking.\" These labels are typically used to include both cognitive and no cognitive skills-such as critical thinking, problem solving, collaboration, effective communication, motivation, persistence, and learning to learn that can be demonstrated within core academic content areas and that are important to success in education, work, and other areas of adult responsibility. The labels are also sometimes used to include other important capacities-such as creativity, innovation, and ethics-that are important to later success and may also be developed in formal or informal learning environments.  (James W. Pellegrino and Margaret L. Hilton, p.14) Technical education: theoretical vocational preparation of students for jobs involving applied science and modern technology; compared to vocation education (which focuses on the actual attainment of proficiency in manual skills), technical education emphasizes the understanding of basic principles of science and mathematics and their practical applications; usually delivered at upper-secondary and lower-tertiary levels to prepare students for occupations that are classified above the skilled crafts but below the scientific or engineering professions (although diploma-and degree-level courses also exist). Vocational education: organized activities designed to bring about learning as preparation for jobs in designated (manual or practical) trades or occupations; traditionally nontheoretical and focused on the actual attainment of proficiency in manual skills; usually considered part of the formal education system and thereby falling under the responsibility of the Ministry/Department of Education. Vocational training: prepares learners for jobs that are related to a specific trade or occupation; but, compared to vocational education, is better linked to the labor market and employment development system, and therefore usually falls under the responsibility of the Ministry/ Department of Labor. On-the-job training: workplace-based training that uses real jobs as a basis for instruction and for practical purposes. Apprenticeship training: combines on-the-job training for a highly skilled craft or trade (from someone who is already a skilled leader in the field) with academic/ theoretical instruction; also called dual-training programmes.( Janice Tripney, p.3) Education system from primary school to PhD level is foundation human capital a country. Which is process is contribute economic development. Vocational training especially developing countries are very important education level. Germany, Japan, and USA are good examples this system. Vocational and Technical high schools those schools are provided specialized instruction with the aim of training qualified personnel. These personnel will be employ public and private sectors. Market economy and social and economic change requires qualified skilled persons. Knowledge based economy established technology transfer and adopted from donor countries to receive country, to protect intellectual property right, and lastly skilled staff contributed to workforce. Private sectors have been expenditure R&D but this matter differs from company to company. Human capital indicator is changing for measurement. Mainly human developments index are (HDI, Human Development Index, CER, Combined Enrollment Ratio, EII, Education Index, LEI, Life Expectancy, WBE,Well being Index, NRI, Networked Readiness Index, KEI ,Knowledge economy Index, SII ,Summary Innovation Index. ) Education is provided from the beginning to the end of compulsory schooling, with no transition between primary and lower secondary education, and with general education provided in common for all pupils. After successful completion of primary education, students are required to follow distinct educational pathways or specific types of schooling, either at the beginning or during lower secondary education. (European commission, 2014 (European commission, -2015 Beyond technical skills, there is evidence that cognitive and non-cognitive skills affect labor market outcomes (Heckman, Stixrud, and Urzua (2006) ) Cognitive skills: \"ability to understand complex ideas, to adapt effectively to the environment, to learn from experience, to engage in various forms of reasoning, to overcome obstacles by taking thought\" American Psychological Association (APA) Literacy Numeracy Ability to solve abstract problems Non-cognitive skills: characteristics across multiple domains (social, emotional, personality, behaviors, attitudes, etc.) not included under cognitive skills Work habits (effort, discipline, determination)Behavioral traits (self-confidence, sociability, emotional stability )Physical characteristics (strength, dexterity, endurance)Technical skills: Combinations of cognitive and non-cognitive skills used to accomplish specific tasks. (OECD, 2010, p.23) Resource: Zelanzy; 2015, p.17) Economies are extremely as forms of employment. Employment's essence is workforce.Workforse2s pillar is skilled persons. In USA R&D expenditure is rising from 3.4 billion USA dollars to 515 billion USA dollars. China R&D expenditure is rising increases from 6.3 billion US dollars to 396 billion dollars. : r 0.8 e = educational attainment levels (1 to 5): 1 = zero to eight years of school, 2 = some or completed high school, 3 = some post-secondary education below bachelor's degree, 4 = bachelor's degree, 5 = master's degree or above; a = ages: 15 to 74; ℎ , = average human capital or average lifetime labour income per capita for individuals with age (a) and education level (e);"}, {"section_title": "Human Capital measurement:", "text": "1, = probability of engaging in paid employment for individuals with age (a) and education level (e), defined as the number of paid workers over the population for that cohort; 1, = annual labour compensation of paid workers with age (a) and education level (e); 2, = probability of engaging in self-employment for individuals with age (a) and education level (e), defined as the number of self-employed workers over the population for that cohort; 2, = annual labour compensation of self-employed workers with age (a) and education level (e);\n, +1 = the probability of surviving one more year from age (a); and g = real income growth rate; r = discount rate. I applied five human capital measurement methods. Results are above. In sum up that method correct analytical method, but if data's differ forms result can be changed. Human capital measurement can be from country to country, from period to period, from social structure to social structure. Therefore social and economic developments pillars are knowledge based economy, human capital and share of GDP. Both developed and developing in addition to under developing countries are faced with the demands economic growth and social development in globally competitive world. Main independent variables are,1.information techonology,2.innovation,3.information,4.kno-wledge based economy,5.trade liberelisation,6.social and political change,7.skilled workforce, 8.young population,9.enrollment stdent,10.number of R&D staff,(full-time)11.Number of R&D staff private sectors,12.percantege for R&D in GDP,13.Percantege expenditure education on GDP.14.trade liberalization and taxes system.15.regional trade policy. Economic and Social development are complex phenomenon and they are challenge for researchers to create one index, so there are several indicators, we should not be ignored those indicators. According to EU criteria and Lisbon strategy is since the adoption of the Lisbon Strategy, transition towards a knowledge economy has become a pivotal policy area for the EU. Turkey has candidate member of EU. Therefore Lisbon criteria are prior to education policy for Turkey. R&D is a process. R&D expenditure of % GDP costs varies from several fields. This expenditure varies from industry and sectors to industry and sectors. This cost is differing from country to country. This cost changes from year to year. In Turkey this costs resources are founds, universities, TUBİTAK, TUBA, business sector, Ministry of Education, Higher Education Council Among OECD countries, the United States is the main performer with 42% of the total OECD GERD in 2009, followed by Japan (15%) and Germany (9%). Since 1999, real R&D expenditure has been growing the fastest in Estonia, Korea, Portugal and Turkey, with average annual growth rates around 10%. Outside the OECD area, China's average annual real growth in R&D spending has been close to 20%, making it the world's second largest R&D performer and ahead of Japan since 2009. The importance of human capital (general and specific) as pillars of progress and economic growth and social development has long been recognized in the several economic literatures last four decade. \"In principle it is easy to accept the idea that universal education is one of the key \"Information Technologies upon which western industrial growth has been built. Sweden spends about 6 percent of total labor input one education and research, as measured in the national accounts and the U .S. more than 8 percent. The figure is lower for (Eliasson et.el:1990,p.26 )\" Same scholar argued that human capital and education level and economic development those are.:Kyriacou (1991) Lau, Jamison and Louat (1991) ,and Lau, Bhalla andLouat (1991 ), Barro and Lee (B&L 1993), Nehru, Swanson and Dubey (NSD, 1995) , If a nation has human capital endowment including the skills ,cognitive and non cognitive ability that reside in people and that are put to productive use can be a more important determinant of its should have be long term economic success than virtually any other revenues. Human capital measurement can be measures different methods, but this methods should be include some pillars and independent variables those are education system, primary-secondary-vocational training-higher education .health and well being, which are mental and physical wellbeing. Workforce, skilled workforces especially median age and lastly protect to environment. Knowledge based economy and technology are the heart and mind of the comparative economy. The countries struggle that encourage their student and education staff to develop the skills, talent and competencies they need to become better, public staff, business staff, workers, business managers, public administers, young entrepreneurs, and innovators The French scholar Piketty's book Capital analyzes last two decade economic and social development analyzed in chapter. According to Piketty the state should be protect taxes. \"Some economists, including the authors of a recent series of World Bank reports on \"the wealth of nations,\" choose to calculate the total value of \"human capital\" by capitalizing the value of the income flow from labor on the basis of a more or less arbitrary annual rate of return (typically 4-5 percent). These reports conclude with amazement that human capital is the leading form of capital in the enchanted world of the twenty-first century.\" (Piketty,2014; p.168) As seen in table R&D expenditure % of GDP correlation has between economic and social development absolutely .In addition to there is multiple effect. This means that county x has % x1, another country x2 has %x1,if country x2 has GDP rather than country x1,therefore country x will be gain multiple effect. Because country x has GDP bigger GDP than others. Knowledge based economy and Human capitals are pillars of economic and social development, R&D expenditure and education programs are instrument for this aims. Because R& D covers three sub system. Those are A. Basic research B. applied research. C. Experimental research. Types of research can b e change from country to country. "}, {"section_title": "Conclusion:", "text": "Social and economic change is reality. Education and workforce system are indisputable general social system. Turkey has young population and forms of capital. Primary, secondary, vocational training and universities should be adopted knowledge based economy and prior to human capital. For example universities can be begun three"}]