[{"section_title": "Introduction", "text": "Since the passage of the Bayh-Dole Act of 1980 in the United States, the general role of universities as sources for commercial innovations and technologies has gained considerable attention.2 The more specific role of universities as research partners gained visibility with the passage of the National Cooperative Research Act (NCRA) of 1984 and the related policy and academic emphasis on research collaboration per se. According to a recent Council on Competitiveness (1996, pp. 3-4) report: R&D partnerships hold the key to meeting the challenge of transition that our nation now faces. … Over the next several years, participants in the U.S. R&D enterprise will have to continue experimenting with different types of partnerships to respond to the economic constraints, competitive pressures and technological demands that are forcing adjustments across the board … [and in response] industry is increasingly relying on partnerships with universities … And, according to Morgan (1998), universities are seeking such partnerships at an increasing rate. A university has a financial incentive to partner with industry in its applied research, especially if commercial technologies are expected to result. Industry has a research efficiency incentive to partner with a university. Efficiencies are gained through access to complementary activities and research results, and access to key university personnel (faculty and graduating students).3 As Rosenberg and Nelson (1994, p. 340) "}, {"section_title": "note:", "text": "What university research most often does … is to stimulate and enhance the power of R&D done in industry, as contrasted with providing a substitute for it. Relatedly, Hall et al. (2003, p. 490) argue: Universities are included (invited by industry) in those research projects that involve what we have called \"new\" science. Industrial research participants perceive that the university could provide research insight that is anticipatory of future research problems and could be an ombudsman anticipating and translating to all the complex nature of the research being undertaken. Thus, one finds universities purposively involved in projects that are characterized as problematic with regard to the use of basic knowledge. This paper investigates one aspect of universities as research partners, namely the conditions when a research collaboration, a research joint venture (RJV) in particular, will involve a university as a research partner. In Section 2, the National Cooperative Research Act of 1984 and related policies are discussed since that Act generates the data on which the analysis in this paper is based. In Section 3, we provide a theoretical explanation of university participation in a research joint venture. The explanation implies the hypothesis that the larger the joint venture the greater the likelihood that industry members will invite university participation in the venture, ceteris paribus. The hypothesis follows because larger ventures are less likely to expect substantial additional appropriability problems to result because of the addition of a university partner and because the larger ventures have both a lower marginal cost and a higher marginal value from university R&D contributions to the ventures' innovative output. We test this conclusion using information on research joint ventures and their membership from the U.S. National Science Foundation's (NSF) COoperative REsearch (CORE) database, and we report and discuss our findings in Section 4. Section 5 concludes the paper with brief summary remarks."}, {"section_title": "Historical background on the National Cooperative Research Act of 19844", "text": "The National Cooperative Research Act of 1984, Public Law 98-462, was legislated, as stated in the Preamble to the Act: to promote research and development, encourage innovation, stimulate trade, and make necessary and appropriate modifications in the operation of the antitrust laws. While the Act sets forth these objectives, it does not place them in an historical perspective. In the early 1980s, there was growing concern that the U.S. industrial sector was loosing its competitive advantage in global markets. This was explicitly noted in the Research and Development Joint Venture Act of 1983, HR 4043. In the Joint Research and Development Act of 1984, HR 5041, the supposed benefits of joint research and development were first articulated from a policy perspective: Joint research and development, as our foreign competitors have learned, can be procompetitive. It can reduce duplication, promote the efficient use of scarce technical personnel, and help to achieve desirable economies of scale [in R&D]. After revisions, the NCRA of 1984 was passed. The NCRA of 1984 created a registration process, later expanded by the National Cooperative Research and Production Act (NCRPA) of 1993 and the Standards Development Organization Advancement Act of 2004 (SDOAA), under which research joint ventures can voluntarily disclose their research intentions to the U.S. Department of Justice; all disclosures are made public in the Federal Register.5 RJVs gain two significant benefits from filing with the Department of Justice. One, if the venture were subjected to criminal or civil antitrust action, the courts would evaluate the alleged anticompetitive behavior under a rule of reason rather than presumptively ruling that the behavior constituted a per se violation of the antitrust law. For RJVs that have filed, the Act states: In any action under the antitrust laws … the conduct of any person in making or performing a contract to carry out a joint research and development venture shall not be deemed illegal per se; such conduct shall be judged on the basis of its reasonableness, taking into account all relevant factors affecting competition, including, but not limited to, effects on competition in properly defined, relevant research and development markets. And two, if the venture were found to fail a rule-of-reason analysis, it would be subject to actual damages rather than treble damages."}, {"section_title": "Theoretical model of university participation in a research joint venture", "text": "The ideas in Leyden and Link (1999) are important for understanding the economics of university participation in industrial RJVs.6 Leyden and Link emphasize that the non-industrial partners in an industrial RJV can provide synergies that increase expected revenues per industrial RJV partner, and they can also affect the costs per RJV member. University participation can contribute valuable research resources-equipment, facilities and personnel that increase the expected flow of innovations from the RJV's investments, both increasing expected per member revenues from the RJV and reducing per member costs because of the unique research expertise and laboratory resources of the university partner. On the other hand, the openness of the academic research culture-analogous to the openness of the federal laboratory research culture emphasized by Leyden and Link-may create difficulties for the industrial partners when they attempt to appropriate the returns from their research investments (Hall et al., 2001 andHall et al., 2003). This is completely analogous to the Leyden and Link argument about federal labs creating appropriability difficulties for the RJVs they join, and such difficulties will be an especially important deterrent to inviting a university (or a federal laboratory in the Leyden and Link study) to participate in an RJV when without the university there would not be a significant appropriability problem. For that reason, we hypothesize that larger RJVs, where size is measured by the number of members, will be more likely than smaller RJVs to invite a university to participate as a research partner. Larger RJVs will have appropriability problems anyway because with more members it is more likely that proprietary information will leak to outsiders or be used opportunistically by some members at the expense of other members. Adding a university may not cost much in terms of additional appropriability problems for a large RJV. Whatever synergy or cost gains are to be had can be enjoyed without the appropriability concern that a smaller RJV would have about significant effects of university participation on the RJV's ability to appropriate returns on its investments. In addition to an advantage for large ventures because of less concern about appropriability problems, ceteris paribus, that university participation causes, Leyden and Link (1999) discuss synergy and cost effects from the participation of a non-industrial partner in a venture. The ideas in Kohn and Scott (1982) are also useful for understanding why university participation in an industrial RJV is more likely when the RJV is large.7Kohn and Scott (1982) explain how organizational size is linked with R&D activity. Their ideas imply that larger RJVs are more likely than smaller ones to find university participation worthwhile and to invite a university to join the RJV, when the marginal cost of university R&D-output contributions decreases steeply with venture size and when the marginal value of university R&D-output contributions increases sharply with venture size. Both of these conditions are likely to hold. Marginal venture-related university R&D-output costs decrease with venture size given the high overhead costs associated with university research and the greater volume of research output anticipated for the larger ventures. The marginal value of the university R&D-output contributions is expected to increase with venture size because ventures with more participants are more likely to find useful applications for the venture's research output and because they are more likely to have the marketing and distribution channels necessary to exploit quickly the innovative outputs of the venture. Thus, not only the appropriability argument supports the expectation that larger RJVs are more likely to invite university participation, but the expectations about synergies and costs support that hypothesis as well. Eq. (1) summarizes our model for estimating the impact of RJV size-measured as the number of members in the RJV-on the probability that a university will be invited to participate in the venture."}, {"section_title": "Equation 1", "text": "Probability (university participation in an RJV) = f(size of RJV, X) where vector X controls for the public good nature of the RJV's research activities, unique characteristics of the RJV's membership, the technology characteristics of the research, time controls and industry controls. We hypothesize, ceteris paribus, that the size of the RJV is positively related to the probability of university participation."}, {"section_title": "The empirical analysis", "text": ""}, {"section_title": "The CORE database", "text": "The data used to test the model in Eq. 1come from the CORE database. The database was constructed under the sponsorship of the National Science Foundation and is maintained under its auspices and with its support by Link. The resource base for the CORE database is information in the RJV filings registered with the Department of Justice and disclosed in the Federal Register. The unit of observation in the CORE database is the RJV. All public information contained in each new and updated filing is coded in the database, and that information is supplemented with other sources of information to describe the industry represented by the RJV's membership and technology areas and dimensions to which the venture's research relates. Through calendar year 2003, 913 RJVs have been registered with the Department of Justice and disclosed in the Federal Register.8 These RJVs are shown, by year of disclosure in the Federal Register, in Fig. 1. Certainly, the trend in RJV disclosures was upward until the mid-1990s, and since then it has generally declined.9 Relevant to this paper, 14.46% of the 913 RJVs filed with the Department of Justice and publicly disclosed have a U.S. university as a member of the research venture. This percentage has varied over time, as shown in Fig. 2. Also, in the aggregate, this percentage varies by the technology area of the venture's research, as shown in Fig. 3.10"}, {"section_title": "Fig. 2. Percent of RJVs filed with U.S. Department of Justice and disclosed in the Federal", "text": "Register with university members, by year of disclosure. Fig. 3. Percent of RJVs filed with U.S. Department of Justice and disclosed in the Federal Register with university members, by technology area. Note: The primary technology area toward which the overall research of the venture is directed: aut, factory automation; bio, biotechnology; che, chemicals; com, computer hardware; def, defense; enr, energy; env, environmental; it, information technology; man, manufacturing equipment; mat, advanced materials; med, medicals; pha, pharmaceuticals; pho, photonics; sof, computer software; sub, subassemblies and components; tam, test and measurement; tel, telecommunications; trn, transportation."}, {"section_title": "The regression results", "text": "The variables used to estimate Eq. 1are defined in Table 1, and descriptive statistics are presented therein. Vector X in Eq. 1controls for the public good nature of the RJV's research activities. The relevant variable is infra, which captures whether the research of the RJV is oriented toward infrastructure technology or not. 11 Research leading to protocols or standards has a public good nature, and thus the output from the research lacks appropriability. On one hand, this variable should enter positively since the marginal cost of including a university as a research partner is less given the public good nature of the research. On the other hand, it could enter negatively since university research is basic in nature and would not be especially relevant to the formation of applied protocols or standards. a For some of the RJVs a unique two-digit SIC classification could not be determined. Designating the \"sic\" for those cases as a no-unique sic code category, the no-unique category case is left in the intercept of the estimated models. Also, the means (and hence the proportions in the sample) for each of the dummy variables used to control for the industry effects, as well as for the time and technology effects, are not reported to save space, but they are available on request. A unique membership characteristic of the RJV's membership is captured by the variable for. On the one hand, the presence of a foreign firm or university could increase the probability that a U.S. university is invited to join the RJV if the presence of a foreign member increases the likelihood of productive U.S.-university aided and mediated informational spillovers. On the other hand, it could decrease the probability if the foreign member was invited into the RJV because of its unique research expertise and that expertise substitutes for that of a U.S. university. The technology characteristics of the venture's research are controlled for in two ways. First, we control for whether the primary objective of the venture is product technology (prod), process technology (proc), or mixed technology (mixed). We also control for the technology area of the overall research (technology effects) as defined in Fig. 3. And, as noted in Table 2, time controls and industry controls (based on the two-digit SIC code of the dominant industry represented in the venture) are considered. Note: Robust standard errors (and with standard errors adjusted for correlation of errors within each year) in parentheses. Significance levels denoted by * (10%), ** (5%), *** (1%). Included in the intercept is proc and, when appropriate, year = 1985, one technology class and one industry class. Also, the reduction in sample size reported in columns (3) and (4) is because of dropping dummy variables, and the observations set to 1 for those variables, when the variables predict inclusion or exclusion perfectly. Four sets of probit results are presented in Table 2. Those presented include a parsimonious specification of Eq. 1, followed by three additional specifications adding in time effects, technology effects, and industry effects. Our findings, based on the results in Table 2 and on other analyses, regarding the positive impact of RJV size on the probability of the venture inviting a university to join as a research partner, are robust.12 Consider the results in column (4) of Table 2. Size does matter in a non-linear manner. The calculated partial derivative of the probit index with respect to number of members implies a maximum for an RJV of size 321 members.13 There are only two of the 913 RJVs with more than 320 members, one with 369 members and one with 529 members. The downturn in the probit index is not of interest, but rather the fact that it increases at a decreasing rate. Also, the presence of a foreign member of the RJV reduces the probability that the RJV will invite a U.S. university to join. Although our theoretical argument did not predict the direction of impact of this variable, we interpret our finding to mean that RJVs view U.S. universities and foreign members as substitutes for providing, at the margin, relevant knowledge for the success of the research endeavor, ceteris paribus. RJVs with a primary objective of product technology are less likely to include a university than are those with a primary objective of process technology. To the extent that product technologies are less dependent on the basic research expertise of university scientists than are process technologies, ceteris paribus, this finding is intuitive."}, {"section_title": "Concluding remarks", "text": "This paper addresses only one of many interesting issues related to collaborative research. In large part, the cause of the paucity of empirical research is the absence of readily available databases (Hagedoorn et al., 2000). In 2000, the National Science Foundation sponsored a workshop on strategic research partnerships in an effort to identify and discuss the innovationrelated implications of collaborative research and set a direction for a more systematic collection of information-more systematic relative to studying Federal Register filings (Jankowski et al., 2001). NSF added a question on their 2002 survey of industrial research and development (RD-1) specifically designed to collect information on company-funded R&D done in collaboration with other research partners (e.g., for-profit companies, federal laboratories, universities and colleges, and other non-profit organizations). As these data become available, we expect that researchers will go beyond exploratory empirical investigations, as in this paper, and begin to test many of the theoretical conclusions that scholars have formulated with regard to research collaboration. and Rees (1990). See also Hagedoorn et al. (2000) and Scott (2003a). Scott (2003b, pp. 99-112) compares and contrasts findings about the efficiency of RJVs filed under the National Cooperative Research Act with findings about the efficiency of a particular type of cooperative effort -namely, cooperative efforts aimed at improving emissions performance in U.S. industry. 4 Much of the material in this section draws directly from Link and Bauer (1989), Scott, 1988and Scott, 1989, Link (1996, and Brod and Link (2001). 5 We define an RJV as a collaborative research arrangement through which firms jointly acquire technical knowledge. 6 Although the work of Leyden and Link (1999) examines the economics of inviting federal laboratories to participate in industrial RJVs, the discussions there of the issues about appropriability, synergies and economies of scope, and cost are the key to understanding the circumstances where industrial RJV partners will invite any type of non-industrial organization to participate in the industrial research ventures. 7 Although Kohn and Scott (1982) focus on the advantages of firm size for R&D activity, the economics of why R&D activity would increase more than proportionately with firm size is useful for understanding the advantages of venture size for university R&D-output contributions to an RJV -that is, the conditions in which university participation in an industrial RJV would be more likely as RJV size increases. Greater advantages of venture size for university R&Doutput contributions make it more likely that a university would be invited as a partner in the RJV rather than having the RJV use arms-length mechanisms to acquire university knowledge. Relatedly, Laursen and Salter (2004) show that the capability of manufacturing firms to draw from university research increases with firm size. Their arguments hold here since the RJV is a research organization and it should have similar objectives as the R&D areas of a firm. 8 There has been, on average, a 2-month lag between registering the RJV with the Department of Justice and that registration being disclosed in the Federal Register (Brod and Link, 2001). 9 Brod and Link (2001) have identified selected correlates with the trend in RJVs over time. In particular, the annual number of filings of RJVs changes, on average, in a countercyclical manner and in relationship to industrial development (as opposed to research) activity. 10 We thank Nick Vonortas for suggestions in formulating these technology areas. 11 According to Tassey (1997), p. 152, infrastructure technology, or infratechnologies \"are a varied set of 'technical tools' that include measurement and test methods [and] artifacts such as standard reference materials that allow these methods to be used efficiently …\" Link and Tassey (1993) provide empirical support, albeit limited, for the positive relationship between investments in infrastructure technology and productivity growth at the industry level."}]