[{"section_title": "Abstract", "text": "This paper evaluates fairness in educational achievements through the ordered pair (W EEOp , I EOp ) whose components provide: (i) A measure of social welfare which accounts for the achievement of less-advantaged pupils and (ii) a synthetic index of inequality in educational opportunities. Students' test scores from the Programme for International Students Assessment PISA, 2003PISA, , 2006PISA, , 2009PISA, , and 2012 are exploited to perform a cross-country and intertemporal comparison of fairness in education. The cross-country comparison shows that none of the countries outperform in both components of fairness, whereas the intertemporal comparison shows that few countries have moved towards a greater degree of equality of opportunity all the while improving the performance of the less-advantaged students."}, {"section_title": "Introduction", "text": "The principle of equality of opportunity (EOp hereafter) 1 has been central in recent economic and public debates. According to it only inequalities caused by individuals' choices should be considered acceptable from an ethical perspective.\nTheoretical and empirical approaches to analyse EOp have been based on two different perspectives: one related to the measurement of the degree of EOp and one focused on policies designed to equalize opportunities. 2 The literature on educational inequality, on the other hand, can be classified into three strands.\nThe first includes studies that measure inequality in students' achievements by using national or international surveys on test scores obtained by pupils (Brown et al. 2007; Micklewright and Schnepf 2007) . The second focuses on inequalities in attainments as level of education or completed years of schooling (Morrison and Murtin 2007; Thomas et al. 2001) . The third deals with intergenerational persistence in educational achievements (Ermisch et al. 2012; Macdonald et al. 2010; Marks 2005) .\nThe concern for EOp in education comes from different sources: as pointed out by Ferreira and Gignoux (2014) , inequality in educational opportunities (IEOp hereafter) is relevant from a normative point of view for all those who, like Sen (1985) among others, see educational achievements as relevant in their own right. The analysis of IEOp matters also from a positive perspective, as the distribution of educational achievements plays a role in the distribution of earnings (Blau and Khan 2005) , as predicted by the human capital theory, and from the perspective of promoting economic growth Woessmann 2008, 2010) .\nA number of studies in recent years have dealt with the measurement of IEOp, focusing attention on access to education (Paes de Barros et al. 2009 ) or educational achievements (Ferreira and Gignoux 2014; Gamboa and Waltenberg 2011; among others) . This paper focuses on the latter and provides a measure of fairness in educational achievements along the line of Roemer (2013) . The measure is based on two components: the first is a measure of social welfare that accounts for achievements of pupils coming from the most disadvantaged backgrounds; the second is a synthetic index of IEOp that gives the share of inequality in achievements due to students ' responsibility. 3 In this study, the measure of advantage is a pupil's test score and IEOp is given by the proportion of inequality in advantages explained by a chosen set of circumstances. This paper differentiates from previous ones measuring IEOp in Programme for International Students Assessment (PISA) test scores in two ways. First, as far as known, only Gamboa and Waltenberg (2011) and de Carvalho et al. (2012) provide an intertemporal comparison of IEOp. However, both studies focus only on Latin American countries whose performances are tracked over two time periods. Here, we look at the whole sample of countries that took part in the four PISA surveys and use a different measure of IEOp. Second, we complement the analysis with a more 1 Throughout the paper we will use EOp and IOp for equality of opportunity and inequality of opportunity, and EEOp and IEOp for equality and inequality in educational opportunity, respectively. I EOp and W EEOp refer to the two components of the measure presented in Section 3. 2 For complete and recent surveys on this literature, see Pignataro (2012) and Ramos and van de Gaer (2012) . 3 Section 2 deals with the discussion on whether and to what extent pupils should be held responsible for their outcome.\ngeneral description of social welfare consistent with the EOp ethic that evaluates a countryspecific level of welfare by looking at the educational achievement of less-advantaged pupils. Social welfare is usually proxied by the level of income or national gross domestic product (GDP), whereas we use an 'education-based' measure of social welfare. As far as one agrees that education is a key determinant of economic outcomes, this measure can be seen as a 'predictor' of social welfare measured in a more 'standard' way. Moreover, the focus on the worst-off is supported by the ideas that the level of social welfare crucially depends on the welfare of the less-advantaged individuals (Rawls 1971) and that a country should be judged according to the way it treats its weakest citizens. As far as known, no other studies have evaluated fairness in education considering both the level and the degree of inequality of opportunity (IOp hereafter).\nThis study can contribute to the current debate on education policies in two ways. The crosscountry analysis can be a helpful tool to assess whether national schooling systems actually help children overcome possible disadvantages arising from their socio-economic background. The tracking of country performances over time can be used by policy makers to design better policies, to set national goals and benchmarks on the basis of their previous performances, and, finally, as a first piece of evaluation of major policies that have already been implemented.\nBefore presenting this study's model and results, let us recall that caution is necessary in interpreting the findings. Owing to the impossibility of taking into account the whole set of pupils' circumstances, the measure of welfare should be interpreted as an upper bound estimate and the index as a lower bound estimate of IEOp. 4 Also, IEOp should not be considered as a lower bound of IOp for the whole cohort of 15-year-old individuals for two additional reasons. First, the coverage rate varies across countries and this variation is not uniform across them; 5 second, PISA evaluates only those who are above 15 years, who do not drop out, and have not repeated too many grades. 6 The rest of the paper unfolds as follows: after a brief introduction of the EOp literature, Section 2 presents the main findings of the study focusing on IEOp. Section 3 is devoted to the model and the theoretical approach relied on. Section 4 briefly describes the data used. The main results and conclusions are presented in Sections 5 and 6."}, {"section_title": "2", "text": ""}, {"section_title": "Literature review", "text": "Studies on IOp are usually distinguished depending on whether they use ex ante or ex post approaches, direct or indirect measures of IOp, and parametric or non-parametric estimation procedures.\nThe distinction between ex ante and ex post approaches is based on different interpretations of the two principles embodied in the EOp ethic: the compensation and the reward principles. Besides being different from a normative point of view and giving rise to incompatible definitions of EOp (Fleurbaey 2008; Fleurbaey and Peragine 2012; Ramos and van de Gaer 2012) , relying on one or the other approach also has practical implications in terms of data 4 A formal proof of this result is provided by and Luongo (2011) . 5 The Programme for International Students Assessment (PISA) coverage problem is discussed in Gamboa and Waltenberg (2011) and treated in Ferreira and Gignoux (2013) by relying on ancillary surveys, and in de Carvalho et al. (2012) by using a composite measure that takes into account the access and achievement dimensions. 6 Even if the second problem does not affect all countries in the same way, it could be particularly relevant for those with lower enrolment rates, such as developing countries or those with a very resilient education system. requirements and measurement issues. Broadly speaking, the first approach is less datademanding and does not require identification and measurement of effort because IOp is usually evaluated by examining the opportunity sets available to individuals belonging to different types (where each type is formed by individuals who share the same set of circumstances). The second approach focuses more on inequalities between individuals who differ in circumstances but have exerted a comparable degree of effort, requiring a measure for the latter that can be proxied through parametric (Björklund et al. 2012; Bourguignon et al. 2007) or non-parametric (Checchi and Peragine 2010) procedures.\nThe EOp framework takes advantage of different measurement techniques. Lefranc et al. (2008) and Cogneau and Mesplé-Somps (2008) , among others, focused on IOp in income distribution relying on the ex ante approach and using a direct measure of IOp. 7 Other authors focus on earning distribution, measuring IOp by relying on a direct or indirect (Checchi and Peragine 2010) ex ante approach, and on a direct (Pistolesi 2009 ) or indirect (Bourguignon et al. 2007; Checchi and Peragine 2010; Pistolesi 2009 ) ex post approach. These studies also differ in the specific index and estimation procedures used in terms of countries, time periods, and circumstances considered.\nWhen it comes to IEOp, a frequent concern in the literature is whether and to what extent pupils can be held responsible for their outcomes. Here, a distinction should be made between studies focusing on access to education (Paes de Barros et al. 2009 ) and those focusing on educational achievements (de Carvalho et al. 2012; de la Vega and Lekuona 2013; Gamboa and Waltenberg 2011; Salehi-Isfahani et al. 2013; Schütz et al. 2008) as the caveat applies more to the access dimension than to the achievement one. More precisely, as long as one focuses on the access dimension, equality of outcome should be the correct metric to evaluate how fair a society is as pupils cannot be held responsible for not having access to such a fundamental right; there is no portion of inequality in this dimension that can be considered ethically acceptable (on the same line of reasoning, see Brunori et al. 2013; Peragine 2011) . On the other hand, a certain degree of inequality can be accepted when one considers the achievement dimension for 15-year-old pupils who are assumed to be at least partially accountable for the results they obtain. 8\nThis also seems to be the underlying idea in studies that analyse IEOp. They focus on inequalities in test scores caused by pupils' circumstances by using standardized measures of test scores provided in international surveys, such as TIMSS (Trends in International Mathematics and Science Study), PIRLS (Progress in International Reading Literacy Study), and PISA, regularly conducted across different groups of countries. The advantage of using these data sources is that they allow for cross-country and/or intertemporal comparisons as they provide standardized measures of achievements and the same set of information at individual and school levels. -Isfahani et al. (2013 -Isfahani et al. ( ), for example, use the 1999 -Isfahani et al. ( , 2003 -Isfahani et al. ( , and 2007 waves of the TIMSS to measure the level and evolution of IEOp in a selected number of countries in the Middle East and North Africa. They measure IEOp in mathematics and science. This is done by applying to the distribution of test scores the parametric version of the standardized and smoothed 7 One can distinguish between 'direct measures that measure how much inequality remains when only inequality due to circumstances is left from indirect measures that measure how much inequality remains after opportunities are equalized'. (Ramos and van de Gaer 2012: 4) . 8 Even if one considers ethically acceptable inequality arising from differences in innate abilities or talent, these should affect achievements but not hamper access to education, at least at lower levels."}, {"section_title": "Salehi", "text": "distributions proposed by Checchi and Peragine (2012) . 9 The direct and indirect measures of IEOp are then decomposed to evaluate the share of inequalities arising from the circumstances used to partition the population into types (gender, ethnicity, family background, and community characteristics). The cross-country comparison shows great variability-I EOp ranges from 4 per cent in Algeria to 34 per cent in Turkey in 2007-while the country rankings are almost constant with respect to the subject considered. The intertemporal comparison shows that IEOp increases between 2003 and 2007 in almost every country in the sample except Bahrain and Egypt. The authors also suggest and test for possible explanations of the observed heterogeneity, such as inequality in the unconditional distribution of test scores, income inequality, and per capita expenditure in education. Only weak positive correlation is found between the first two and IEOp which appears to be more strongly and negatively correlated with expenditure in education. Only weak positive correlation is found between the first two and IEOp which appears to be more strongly and negatively correlated with expenditure in education. Finally, their decomposition results show that family background is the most important determinant of IEOp in all countries but Lebanon where community characteristics play this role.\nA different approach is used by de la Vega and Lekuona (2013) to measure IEOp in PISA test scores. They exploit the 2009 pupils' results in reading and rely on the measures of unfair inequality proposed by Fleurbaey and Schokkaert (2009) : The direct unfairness and fairness gap. The first fixes a reference value of effort and measures IOp as inequality in the distribution obtained once differences due to effort are removed. The second fixes a reference value of circumstances to obtain an ideal distribution where all inequalities are due to effort; IOp is computed as the difference between inequalities in the original and in the ideal distribution.\nAssuming that test scores are generated by a function additively separable in circumstances and effort 10 and using the variance as the inequality index the authors compute IEOp in PISA 2009 test scores in reading. IEOp is measured as the ratio between unfair inequality (inequality in fitted values of test scores when a reference value of circumstances or effort is chosen) and overall inequality (inequality in fitted values of test scores when both circumstances and effort take their actual values). They find that IEOp is higher in South America, Eastern Europe, and Asia and lower in North America, Western Europe, and Oceania. Moreover, they report a negative correlation between IEOp and average scores of countries. Waltenberg (2011), de Carvalho et al. (2012) , and Ferreira and Gignoux (2014) also exploit the PISA data to measure IEOp. Waltenberg use 2006 and PISA waves to measure IEOp in six Latin American countries. Unfair inequality is measured by applying the mean log deviation to a counterfactual ex post distribution of test scores obtained with a non-parametric procedure. Their circumstances include three groups (gender, parental education, and school type) whose impact on test scores is evaluated singularly and then in different combinations. Their results vary depending on circumstances, subjects, and year considered but, overall, the authors report that I EOp ranges from 1 to 25 per cent. Moreover, the country rankings change depending on the classification type used: Argentina and Brazil show the highest level of IEOp and Colombia and Mexico the lowest, when school type is used; when the selected circumstance is parental education, Chile and Colombia, respectively, show the 9 The parametric equivalents of the standardized and smoothed distributions were proposed and applied to earnings by . The first corresponds to the distribution of the predicted value of outcome obtained after running a reduced-form equation model that jointly considers the direct and indirect effects of circumstances on outcome. The second is obtained by substituting the original distribution with the predicted scores obtained as a function of predicted residuals and fixed values of circumstances. 10 This assumption, together with the use of an absolute index of inequalities, is a necessary condition for the two measures to coincide (Fleurbaey and Schokkaert 2009). highest and lowest IEOp. Parental education and school type emerge as the main drivers of unfair inequality in test scores and their impacts appear stable over time and across countries.\nThe same countries and datasets are used by de Carvalho et al. (2012) to provide a measure of IEOp that takes into account both the access and achievement dimensions. They do this to take into account differences in coverage rate among countries participating in PISA. Their measure of unfair educational inequality is obtained by separately computing IOp in access to education and in educational achievement; then, alternative aggregation procedures of the two components are proposed. 11 IEOp is measured through a couple of these aggregations and results are compared with those obtained when only the achievement dimension is taken into account. This comparison shows partial changes in the country rankings, more evident in 2006 than in 2009.\nFinally, Ferreira and Gignoux (2014) propose measures of educational achievement and IEOp and apply them to PISA 2006. 12 First, they show that very few measures of dispersion are ordinally equivalent to the standardization of test scores carried on in PISA surveys and none is cardinally equivalent. The latter is an issue of less concern but the former implies that many of the most commonly used indexes of inequality do not provide the same ranking of countries when applied to the pre-or post-standardized distribution of test scores. The proposed solution consists of using the variance as a measure of inequality in educational achievement and the portion of variance explained by selected circumstances as the IEOp index. Their results show that I EOp ranges from 10 to 35 per cent in mathematics, from 11 to 38 per cent in science, and from 12 to 38 per cent in reading. They do not find a clear regional pattern but note that Nordic and Asiatic countries, together with Australia, Italy, and Russia, are fairest; Eastern and Western European countries as well as the Latin American countries display higher IEOp; and the United States, United Kingdom, and Spain occupy an intermediate position. Moreover, they find almost no correlation between IEOp and per capita GDP or the average score in PISA and interpret these results as further evidence of the absence of regional patterns.\nIn the analysis here, these results will be compared with those of this study, providing some insights on practical implications that derive from using alternative definitions of circumstances and measures of IEOp. Before doing this, the next sections introduce the model applied and the data used."}, {"section_title": "Model", "text": "In this study, the idea of measuring the level and degree of IOp within a country through an ordered pair (W EEOp , I EOp ) is borrowed from Roemer (2013) and adapted to suit the study's framework. Each individual has a set of circumstances C, which are characteristics outside their control. The population is partitioned into types, t=1, …, T, which are combinations of circumstances, and it is assumed that a pupil's outcome (i.e. the score) s only depends on his/her type t and effort e. 11 The authors measure IOp in access to education through the PISA coverage rate or the Human Opportunity Index (Paes de Barros et al. 2009 ) whereas IEOp with regard to achievement is measured as in Ferreira and Gignoux (2014) . 12 They also take into account differences in coverage rates between participating countries. To do that they use ancillary national surveys for the four countries with the lowest coverage rate (Indonesia, Turkey, Mexico, and Brazil) and derive two procedures to assess the robustness of the measurement of inequality to sample selection bias.\nEffort is considered unobservable. Together with types and policy (here, country) it is the determinant of outcomes. It follows that\nFor the sake of simplicity, the country suffix is omitted from the notation. As in Roemer's (2013) approach, it is assumed that unobservable effort corresponds to the rank [0,1] occupied by each pupil in his/her own type distribution of test scores. Let v t () be the level of s for individuals of type t at quantile  of their respective effort distribution. Then, a measure of the educational opportunities of a country can be defined as\nThat is, the level of educational opportunities can be found by computing the minimum value of the indirect outcome function v across responsibility groups (i.e. groups formed by pupils who occupy the same rank  in their own type distribution of test scores). The social welfare function is obtained by applying the utilitarian criterion to these minimum values. An alternative way of looking at the measure (Roemer 2005) is by defining the cumulative distribution function (CDF) of outcomes in type t,G(|t). If the outcome is monotonic in effort, then the individuals at the th quantile of the effort distribution are exactly those at the  quantile of the outcome distribution. Moreover, if the distribution function is strictly increasing, it has an inverse G 1 (|t)=v t (). Hence Equation (2) can be restated as\nIn the plane of the outcome distributions, W EEOp is geometrically represented by the area at the left of the left-hand envelope of the distribution functions of the types, bounded by the line at ordinate value one and the horizontal axis, and it equals the mean of the left-hand envelope. In class-ranked situations, that is, when the type-specific outcome distributions do not cross, the level of educational opportunity in a given country corresponds simply to the average value of the worst-off type. 13\nAs detailed in Section 2, the list of circumstances is quite restrictive because increasing the number of types is problematic for calculating the measure of educational opportunities and may result in severely downward biased estimates in small samples. This can be seen by outlining the estimation procedure in more detail. For each type, defined according to circumstances, we estimate the conditional CDF, G|t. Increasing the number of types may result in each type containing few observations. In turn, this may imply that the left-hand envelope of the CDFs across types (whose average is W EEOp ) reaches its maximum as a consequence of (possibly) anomalous data. To clarify, consider the following extreme case: suppose that a type is defined over a single unit, showing a very low score (e.g. 100). This type's CDF will equal zero for each score lower than 100, jumping to one once 100 is reached. In the worst case, if this CDF is dominated by CDFs of all other types, the left-hand envelope of the CDFs will equal one at 100 13 In the literature that test for EOp through stochastic dominance (see Lefranc et al. 2008, among others) , this is usually referred to as a 'weaker criterion' for empirically testing for EOp, as it focuses on the average outcome across types. The stronger version, on the other side, considers first-order stochastic dominance comparisons across the whole type-specific distribution of outcome. and will be likely to give an enormous weight on a single, eventually anomalous, observation. Summarizing, we need a sufficient number of observation to identify G|t and obtain a reliable measure of W EEOp . 14 Conversely, the omission of relevant circumstances is likely to generate an upward bias in the estimates of social welfare. To see why, intuitively, suppose that, given a set of circumstances, the left-hand envelope of the type distribution is defined by the function G|t. For simplicity, assume a class-ranked situation, but exactly the same argument can be applied to a more general case. Now, suppose that a new circumstance j is introduced and that it takes two possible values, without loss of generality. This will result in the expansion (by a factor two) of the cardinality of types, each type now being identified by a generic couple (t,j). What is relevant is that, given that G|t is a convex combination of the conditional to j distributions G|t,j, at least one of the two conditional CDFs will lie above and the other below G|t for any outcome in the support. Given that in any interval of the support there exists at least one distribution that is dominated by G|t, the new left-hand envelope (obtained when the additional circumstance is taken into account) must be first-order stochastically dominated by the original one. Hence, the average of the new left-hand envelope will be smaller than the original one: in other words, when an additional circumstance is considered, the value of social welfare (W EEOp ) goes down. Or, putting it differently, the omission of relevant circumstances from the estimates gives rise to an upwardbiased measure of the social welfare.\nThe second component of the measure is based on the inequality in the distribution of test scores and provides a synthetic index of IEOp. The index used in this study is based on the ex ante approach that takes into account differences in the distribution of outcome between individuals who belong to different types. With this approach IOp is usually measured as between-types inequality in mean outcomes, with the mean outcome of each type interpreted as the opportunity set faced by individuals who share the same set of circumstances. Consider an empirical linear approximation of Equation (1)\nIn this setting, effort is interpreted as a residual term (Dunnzlaff et al. 2010 ) including all individual characteristics that have not been included in the set of circumstances (innate ability, luck, measurement error, etc.). IEOp is then measured by using the procedure outlined by Ferreira and Gignoux (2014) :\nwhere ̂ is the vector of the ordinary least-square (OLS) estimated coefficients and var(s) represents the overall inequality in the outcome. Roughly speaking, IEOp is measured as the proportion of variance in PISA test scores explained by the vector of circumstances and corresponds to the R 2 of the OLS regression of s on C. In this model, the vector of estimated coefficients captures both direct and indirect effects of circumstances on s, but is likely to be downward biased as a consequence of the omission of relevant circumstances. In the outlined parametric setting, this can be seen immediately by noticing that the inclusion of relevant circumstances in the regression in Equation (4) increases the share of the variance in the outcome explained by the model."}, {"section_title": "Data", "text": "The data used in this study are taken from the Programme for International Students Assessment (PISA) by OECD (n.d.).\nThe first round of PISA took place in 2000 and after that it has been conducted every three years: 43 countries took part in PISA 2000 , 41 in PISA 2003 , 58 in PISA 2006 , 74 in PISA 2009 , and 65 in PISA 2012 (see OECD 2003 , 2006 . For each country, a representative sample is selected by means of a two-step sampling scheme. Schools are first sampled and then students are sampled in the participating schools. The survey assesses students aged between 15 years and 3 months and 16 years and 3 months, who are enrolled in grade 7 or higher.\nEach survey provides assessments in three domains: mathematics, reading, and science. The main focus of the survey shifts from domain to domain in rotation, so that for each domain more detailed data are periodically available. Moreover, the survey collects background information on students and the school they attend.\nThe test scores collected by PISA are scaled by using an item response theory (IRT). After the IRT adjustment a second procedure standardizes the test scores. The latter justifies the use of the variance as a measure of inequality.\nThe use of PISA data in this study is mainly justified by the possibility of contrasting results obtained from 15-year-old pupils on a comparable basis and by the inclusion in the survey of information on pupils' background. This characteristic of the survey surely improves the data management process as we do not need to rely on ancillary national surveys that would give rise to comparability issues.\nThe two components of the measure of educational opportunities here depend on the identification of those pupil characteristics that affect their test scores but are outside their sphere of responsibility (circumstances).\nPupils' educational achievements are based on the combination of several inputs (ability, genetic endowment, preferences, motivation, schools' endowment, socioeconomic status, parents' investment in socio-emotional and financial dimensions, etc.), but here the focus is only on a particular channel that affects students' test scores, their parental background. These first results suggest that, as one might expect, individual circumstances impact differently according to the subject taught and more intensively on cognitive abilities related to the use of language. This is shown in Figure 1 , where the country ranking according to I EOp in reading is reported. There is often accordance in rankings in different subjects, 16 so only a single subject is shown here; the whole set of results are in the Appendix. To the best of my knowledge, there are no other studies that measure I EOp by relying on the last wave of PISA, so there is little room for comparison. However, the OECD recently published a report on equity in education (OECD 2013) that focused on mathematics results of pupils who 15 The regressions were performed with the STATA module PISAREG (Jakubowski 2013) . They were run five times, one for each plausible value reported in datasets, and the final result was calculated as a mean of these regressions; standardized errors were bootstrapped. 16 The robustness of the comparison of results on country rankings depending on the subject considered is broadly analysed by Brown et al. (2007) who also consider comparisons that rely on different surveys. took part in PISA 2012. Despite differences in the subject considered and (partially) in the definition of equity, similarities can be found with the results of this study. As in the OECD (2013) report, Macao (China), Hong Kong (China), and Canada are among the best performers in terms of I EOp ; Belgium is one of the countries where the strength of the association between parental background and student performance is higher than the OECD averages ( Figure 1 and Appendix Tables A1-A8).\nThe results of this study are also partially in line with those of the OECD (2013) when looking at the relationship between average test scores and the degree of fairness. Hong Kong (China) and Canada belong to the group of countries that perform better than the OECD average in terms of average scores and I EOp . Others, such as Finland or Belgium, combine high performances in terms of test scores with higher association between parental background and students' test scores (see Appendix Figure A1 ).\nThe regional pattern shows that North American and Eastern European countries, respectively, are the best and the worst performers in terms of fairness in education; Western European, South American, and Asiatic countries occupy an intermediate position. The Asiatic region also shows the highest variability between countries in the association between parental background and learning outcomes ( Figure 2 ). Let us now look at the first component. The reason for using this measure is that a country's performance should be evaluated also according to the way it treats its less-advantaged citizens; results on this issue could provide opposite or in some ways different evaluations on a country's level of fairness. In part, this is what can be observed, in fact, by looking at Figure 3 .\nThe average score of the less-advantaged students, which here measures the level of fairness, ranges from 213 in the Slovak Republic to 516 in Shanghai (China), and the latter occupies an intermediate position in terms of I EOp (Figure 1) . Results on the level of fairness are in accordance with those on I EOp for the best and the worst performing countries: W EEOp is 295 in Bulgaria and 470 in Macao (China) (Figure 3 ). As regards the subject, in this case too reading is the one most affected by circumstances; it shows a low level of W EEOp that ranges from 257 (Slovak Republic) to 554 (Shanghai, China) in mathematics and from 279 (Perm, Russian Federation) to 532 (Shanghai, China) in science. A clear regional pattern cannot be identified, although Figure 4 shows more homogeneity within North and South America and Western Europe and higher heterogeneity in Eastern European and Asiatic countries. The level of W EEOp is overall higher in North American and Western European countries and lower in those belonging to the remaining three areas, with few exceptions in some Asiatic countries. Looking singularly at the result obtained for the two components of measure in this study bring us to wonder whether there is a country that performs better in both respects. Figure 5 shows that this happens in a few cases: only Macao (China) and Hong Kong (China) outperform both in the way they treat less-advantaged pupils and in the way they help children to overcome possible disadvantages arising from their socio-economic background, whereas Bulgaria and the Slovak Republic perform poorly in both respects, irrespective of the subject considered. For the remaining countries this is not the case, even though Figure 5 shows a slightly negative correlation between the two components. The last panel of Figure 5 shows that in Asiatic and some Western European countries, such as Spain and Ireland, although students with the poorest parental background reach learning outcomes higher than the OECD average, the relationship between students' circumstances and test scores is lower than the OECD average. By looking at simple pairwise correlations, possible alternative explanations may be put forward for the observed heterogeneity considering the relationships between the ordered pair (W EEOp , I EOp ) and the inequality in the marginal distribution of test scores, a measure of tracking, 17 and per capita GDP. W EEOp is positively correlated with all of them while I EOp is positively correlated with tracking and inequality in the marginal distribution of test scores but negatively correlated with per capita GDP. In accordance with the results of the OECD (2013) report, the latter relationship seems to be stronger for countries with per capita GDP below the OECD average (see Appendix Figures A1-A3 ). Looking at countries' performances at a point in time is interesting and provides helpful crosscountry comparisons, but a number of questions arise such as whether these figures represent an improvement or a worsening for a single country with respect to previous results or whether country rankings are stable across time and/or subjects. These are the kind of questions addressed through the comparison of PISA waves.\nIf we do not consider the two outliers (Macao (China) and Azerbaijan) that show pretty low values of I EOp , 18 the portion of unfair inequality in 2009 ranges from 2 to 18 per cent in science, from 3 to 20 per cent in mathematics, and from 6 to 24 per cent in reading, with the United Kingdom and Hungary being high and low performers, respectively, in terms of fairness in each subject (see Appendix Figures A1-A3 and Appendix Tables A1-A8 ). The level of fairness ranges from 255 (Russia) to 458 (Korea) in reading, from 293 (Peru) to 500 (Hong Kong, China) in mathematics, and from 247 (Himachal Pradesh, India) to 473 (Chinese Taipei) in science.\nSome differences can be noted between the results of this study and those obtained for the same subject and year in the study by de la Vega and Lekuona (2013) . Interestingly, if the effort and circumstance variables used by the authors were correlated their measure of overall inequality would correspond to the I EOp index in this study. If this were the case, the latter should show values lower than the former as the set of circumstances is smaller and based on a coarser division of the population into types. Conversely, if their assumption on additive separability in the score production function holds, I EOp is only partially comparable with their measure of IOp, not only because of differences in the set of circumstances but also because the two measures rely on different distributions.\nThe comparison of I EOp with their measure of overall inequality and IOp confirms these assumptions. Evidently, the measure of overall inequality computed by de la Vega and Lekuona (2013) is higher than I EOp , but the comparison of the two measures of unfair inequality is interesting: both the country ranking and the degree of fairness are quite different. For example, I EOp in reading in Hong Kong (China) accounts for 6 per cent of overall inequality in this study and for 21 per cent of overall inequality according to de la Vega and Lekuona (2013); they find I EOp to be 11 per cent of overall inequality in Portugal against the 17 per cent reported here (see Figure 1 and Appendix Tables A1-A8). The results of this study are more in accordance with theirs in terms of the regional pattern of I EOp that is lower in North America, Western Europe and Asiatic countries than in Eastern Europe and South America, with North America also showing lower variability between countries (Appendix Tables A1-A8 ).\nThese findings confirm that the evaluation of countries' performances change according to the dimension considered and the measure used. The choice of different metrics depends on the assumption made regarding what constitutes effort and what constitutes circumstances and this, in turn, depends on the underlying definition of EOp. The choice is driven by data availability and personal judgements on fairness, but has to be made clear and to be explicitly taken into account when drawing conclusions and policy implications.\nIn 2006, I EOp ranges from 6 (Azerbaijan) to 22 (Thailand) per cent in reading, from 4 (Norway) to 16 (Hungary) per cent in mathematics, and from 3 (Azerbaijan) to 17 (Luxemburg) per cent in science. 19 In 2003, the subjects taught show, in the same order, the following ranges: from 5 (Japan) to 18 ( These figures show that, irrespective of the time period considered, I EOp is always higher in reading than in the remaining two subjects. Because of this, and to allow for comparison with the earlier discussion, let us continue to focus on reading.\nBetween 2003 and 2012, on average, the improvement in the performance of the less-advantaged students is accompanied by an increase in the strength of the association between parental backgrounds and learning outcomes. But the pattern is not uniform across and within areas. 21 The number of countries in which the performance of the worst-off increases is much higher than the number of countries where I EOp is reduced. Mexico, Great Britain, and Ireland, among others, move towards a greater level of fairness, but the first two also increase the degree of fairness, which remains almost unchanged in Ireland.\nBoth components of the measure of I EOp remain almost constant over time in Austria, Iceland, Netherlands, and Norway, whereas the improvement in average test scores of the worst-off students in the United States and Brazil, among others, is accompanied by an increase in I EOp . A small number of countries outperform in both respects, moving towards a greater degree of EOp all the while improving the performances of the less-advantaged students, and they are almost all Western European countries, with the exception of Indonesia and Mexico. Almost an equal number of countries show a reduction in both the level and the degree of fairness, but in this case there is no clear regional pattern. Only in Norway and Korea weakening of the strength of the association between parental background and student performances has been accompanied by a reduction in the level of fairness. Most of the Asiatic and the Western European countries move towards a higher level but a lower degree of fairness ( Figure 6 )."}, {"section_title": "Conclusions", "text": "Exploiting PISA 2003 PISA , 2006 PISA , 2009 PISA , and 2012 , this paper provides cross-country and intertemporal evaluations of fairness in educational achievements.\nFollowing Roemer (2013) , the evaluation was carried out through an ordered pair (W EEOp , I EOp ) whose components provide a measure of social welfare focused on less-advantaged pupils and an index of IEOp.\nTo the best of my knowledge, no other papers evaluate IEOp taking into consideration both the level and the degree of fairness in educational achievements. Also, this paper differs from previous contributions on this topic by providing cross-country and intertemporal comparisons for the whole set of countries that took part in PISA surveys, considering also the 2012 wave.\nIt is emphasized that, because of the omission of relevant circumstances, the two components studied are likely to be, respectively, upward and downward biased, and thus caution is necessary in interpreting the results.\nWith these caveats in mind, the ordered pair (W EEOp , I EOp ) was computed for each subject, year, and country and high heterogeneity was noted across countries in terms of both the level and the degree of fairness in education. Despite the lack of a clear regional pattern, the cross-country comparison showed that W EEOp is higher in the North American and Western European countries than in the Eastern European, South American and Asiatic ones, with some exceptions. On average, North American and Eastern European countries are, respectively, the best and worst performers in terms of I EOp . Western European, South American, and Asiatic countries occupy an intermediate position, with the latter showing great variability between countries in the association between parental backgrounds and learning outcomes.\nThe intertemporal comparison showed that, on average, between 2003 and 2012, the improvement in the performances of the less-advantaged students was accompanied by an increase in the strength of the association between parental background and learning outcomes. A small number of countries outperformed in both respects, moving towards a greater degree of EOp all the while improving the performances of the worst-off pupils. All of them but Indonesia and Mexico were Western European countries.\nI EOp was also noted to be always higher in reading than in the remaining two subjects, confirming that individual circumstances impact differently according to the subject taught and more intensively on cognitive abilities related to the use of language.\nFinally, comparing the results of this study with previous findings on the same topic, it was noted that they were in line with those obtained by Ferreira and Gignoux (2011) for 2006 but differed from those reported by de la Vega and Lekuona (2013) for 2009. This confirms that the evaluation of fairness crucially depends on the choice between which characteristics constitute effort and which constitute circumstances, on the assumptions made on their relationship and the way they affect individuals' outcome, and on the specific measure used to evaluate fairness. "}, {"section_title": "Appendix", "text": ""}]