[{"section_title": "Abstract", "text": "Abstract Sexual selection is expected to promote speciation by fostering the evolution of sexual traits that minimize reproductive interactions among existing or incipient species. In species that compete for access to, or attention of, females, sexual selection fosters more elaborate traits in males compared to females. If these traits also minimize reproductive interactions with heterospecifics, then species with enhanced risk of interactions between species might display greater numbers of these sexual dimorphic characters. We tested this prediction in eight families of North American birds. In particular, we evaluated whether the number of sexually dimorphic traits was positively associated with species richness at a given site or with degree of sympatry with congeners. We found no strong evidence of enhanced sexual dimorphism with increasing confamilial species richness at a given site. We also found no overall relationship between the number of sexually dimorphic traits and overlap with congeners across these eight families. However, we found patterns consistent with our prediction within Anatidae (ducks, geese and swans) and, to a lesser degree, Parulidae (New World warblers). Our results suggest that sexually selected plumage traits in these groups potentially play a role in reproductive isolation [Current Zoology 58 (3): 450−459, 2012].\nKeywords Speciation, Reproductive character displacement, Sexual selection, species recognition, Reinforcement Sexual selection is thought to be a key driver of diversification, both within and between species (Andersson 1994; Ritchie 2007). Indeed, the observation that the form, type, and numbers of traits used for sexual signaling generally differ among species within a given genus or family has often been used to suggest that sexual selection may play a role in speciation or in maintaining (or enhancing) reproductive isolation between species (Price 1998; Ritchie 2007; Seddon et al., 2008; Martin et al., 2010) .\nOne explanation for why traits diversify among species is that species diverge in sexual traits so as to minimize costly reproductive interactions between them. In particular, if species risk hybridization, or if they interfere with each other during reproduction (e.g., owing to competition for signal space), then selection will favor the evaluation of traits that minimize such interactions (Butlin, 1987; Howard, 1993; Butlin and Ritchie, 1994; Grether et al., 2009; Pfennig and Pfennig, 2009 ). This process, known as reproductive character displacement, might not only result in divergence in expression of a single trait, but also in the proliferation of multiple traits used in mate acquisition (Pfennig, 1998; Hebets and Papaj, 2005) . As divergence in traits accumulate, reproductive isolation can increase, and, for species that risk hybridization, divergence in sexually selected traits can complete the speciation process by decreasing the likelihood of mating between them (a process known as reinforcement; Howard, 1993; Servedio and Noor, 2003; Coyne and Orr, 2004; Pfennig and Pfennig, 2009) .\nAcross communities or taxa, character displacement should generate divergence among interacting species that could account for variation within and among taxonomic groups in sexual signal diversity (e.g., Chek et al., 2003; Martin et al., 2010 ). Yet, whether species interactions foster divergent values in the same trait or, alternatively, diversification in the kinds and numbers of traits used is generally unclear. Indeed, most studies of character displacement focus on evaluating whether species differ along axes of variation for the same trait (or the same small subset of traits; Howard, 1993; Gerhardt and Huber, 2002) . However, many species often use multiple behavioral and morphological traits during competition for and attraction of mates (Candolin2003; Hebets and Papaj2005). If multiple traits are required to reliably identify conspecifics, then character displacement could contribute to the evolution of diversification in the number of traits as well as the form of those traits between species. Yet, the degree to PFENNIG KS, HURLBERT AH: Species interactions and sexually dimorphic traits 451 which such use of multiple traits in sexual signaling per se contributes to reproductive isolation between species remains largely unknown. Nevertheless, addressing this issue is important for understanding whether species interactions foster enhanced diversity in both the nature and complexity of sexual signaling.\nTo specifically address this issue, we examined whether the number of sexually dimorphic traits increases with increasing heterospecific interactions in North American birds. We focused on sexually dimorphic traits, because the degree to which traits are sexually dimorphic potentially indicates the strength of sexual selection (Andersson, 1994) . Our goal was to address this issue by evaluating whether species that experience enhanced interactions with heterospecifics are more likely to possess higher numbers of sexually dimorphic traits. Previous work has evaluated whether taxonomic groups that are sexually dimorphic are more speciose (e.g., Barraclough et al., 1995) or are more ecologically diverse (e.g., Price, 1998). Such studies evaluate the possible role of sexual selection in speciation and adaptive diversification. Here, we take a slightly different perspective by evaluating whether species interactions might actually contribute to enhancing the number of sexually dimorphic traits, as might be expected if species interactions promotes the use of multiple sexual traits in mate choice (Møller and Pomiankowski, 1993; Pfennig, 1998; Candolin, 2003; Hebets and Papaj, 2005) .\nTo do so, we used sexual dimorphism data for families of North American birds in two ways. First, we evaluated whether species richness of confamilials across different sites predicts the mean number of sexually dimorphic traits at that site. Second, because interactions with congeners may be more likely to generate selection on sexual characters (e.g., owing to increased risks of hybridization), we evaluated whether the number of sexually dimorphic traits was positively correlated with geographic range overlap with congeners. Although we did not find a strong pattern across all families, we did identify two families in which species interactions and the proliferation of sexual dimorphic traits may be linked.\nMaterials and Methods\nSexual dimorphism data for birds were taken from a previously published data set in Reeve and Pfennig (2003) , in which the number of sexually dimorphic traits was tabulated from field guides. We restricted our analyses to morphology and plumage coloration data. Although doing so excluded the potentially important effects of behavior, many behaviors such as calls and courtship displays can consist of multiple components, which could not have been parsed in a comparable way across species in the available data. We therefore focused strictly on morphological and coloration differences between males and females, where each trait exhibiting sex differences in expression was scored as 1. If, for example, only males possessed a crown stripe and a cheek patch, then that species would receive a score of 2.\nWe conducted our analyses on those North American bird families with at least 10 species overall and with at least one species that exhibited two or more sexually dimorphic traits. The families meeting these criteria include Anatidae (ducks, geese and swans), Cardinalidae (cardinals, grosbeaks and tanagers), Emberizidae (New World sparrows), Fringillidae (finches), Icteridae (blackbirds, orioles and allies), Parulidae (New World warblers), Picidae (woodpeckers), and Scolopacidae (sandpipers). We use the genus and family classifications given by the 51st supplement to the American Ornithologists' Union Checklist of American Birds (Chesser et al., 2010) .\nWe then evaluated the influence of interspecific interactions on the number of sexually dimorphic traits at two levels. First, we examined site level sexual dimorphism as a function of species richness of confamilials. Second, we evaluated whether range overlap among congeners predicted the number of sexually dimorphic traits in a family. The methods for each of these levels of analysis are described below.\nSite level data on species co-occurrence were taken from the North American Breeding Bird Survey (BBS; Sauer et al., 2010) . Each BBS route (site) consists of 50 three-minute point counts spaced at 800 m intervals, and is conducted by a single observer during the breeding season, typically in June. We examined 1,497 sites across North America that were surveyed continuously from 2006-2010, and calculated species richness within each bird family based on this 5-year window. The use of a 5-year window minimizes the potential underestimation of species richness due to sampling effects (McGill, 2003; White and Hurlbert, 2010) . At each site, we also calculated the average number of sexually dimorphic traits among the species present within each 452\nVol. 58 No. 3 family. The mean number of sexually dimorphic traits at sites with high species richness must necessarily converge on the family mean. We conducted a simple null model of random sampling weighted by a species' prevalence in the dataset (i.e., widespread species had a proportionately greater chance of being sampled) to generate a distribution of 10,000 values of mean trait dimorphism for each level of species richness. We used this random sampling to generate confidence bands around the grand family mean as a function of species richness. We were thus able to ask whether sites with more confamilial species tended to consist of species with a greater number of sexually dimorphic traits than would be expected by chance.\nBecause the above null model does not take into account the contiguous nature of species ranges, we generated an alternative null model that uses the empirically observed species lists at each site (thus maintaining range contiguity and the degree of commonness of species). We then randomly shuffled the number of sexually dimorphic traits across members of a family in each iteration of the model. This model yielded qualitatively similar results to our original null model (Supplemental Fig. 1) , and is not discussed further.\nWe also examined whether the amount of geographic range overlap among congeneric species predicted the number of sexually dimorphic traits. These analyses were based on species distribution maps taken from Ridgely et al. (2007) . Specifically, for each species, its breeding season range map was overlaid with range maps for all other congenerics, and the following metrics were calculated: 1) the total number of congeneric species with at least some overlap in breeding range; 2) the maximum amount of overlap with any congeneric species, measured as a fraction of the range size of the focal species; and 3) and the total amount of range overlap with all congenerics measured in range size units of the focal species (e.g., if the ranges of four congeneric species completely overlapped the breeding range of the focal species, the total would be 4).\nFor each family we calculated the Spearman rank correlation between the number of sexually dimorphic traits and each of the three metrics of range overlap within a given family. These correlation coefficients were compiled across all eight families for each metric, and we used a Wilcoxon Rank Sum test to determine if the mean correlation coefficient for all families was different from the null hypothesis of zero.\nWe first examined the relationship between the number of sexually dimorphic traits and familial species richness at a given site. We found that, for the most part, the mean number of sexually dimorphic traits present among confamilial species at a given site fell within the range of values expected from random sampling (Fig. 1) . The most notable exception was in the Parulidae (warblers), which had 82 sites (5.9%) with less sexual dimorphism than expected (typically at sites with 6-14 warbler species), but 64 sites (4.5%) with more sexual dimorphism than expected (typically at sites with 10-20 species). Although not as pronounced as the Parulidae, other families also showed site-specific deviation from random expectation. Namely, Cardinalidae and Picidae showed 12 and 13 sites (<1%), respectively, with higher sexual dimorphism than expected by chance. By contrast, 29 sites (2%) for the Fringillidae and 16 sites (1%) for the Anatidae actually showed lower numbers of sexually dimorphic traits than expected by chance.\nWe next examined whether the number of sexually dimorphic traits across North American bird families was positively correlated with our different measure of interactions among congeners. We found no strong evidence for a positive correlation across families for any of our measures (Fig. 2) : number of overlapping congeners (mean r = 0.03; Wilcoxon Signed Rank = 3.0; P = 0.74); total overlap with congeners (mean r = 0.11; Wilcoxon Signed Rank = 9.0; P = 0.24); or maximum overlap with any congener (mean r = 0.11; Wilcoxon Signed Rank = 9.0; P = 0.24).\nAlthough we found no striking pattern across most families, we did find positive relationships in two of the four families with the widest ranges of sexually dimorphic traits (Fig. 3) : Anatidae (ducks, geese and swans) and Parulidae (New World warblers). In particular, we found a positive relationship with all three range-based measures of congeneric heterospecific interactions for the Anatidae (0.001< P < 0.012), and a weaker positive relationship with the number of overlapping species for Parulidae (P = 0.065; Fig. 3 ).\nOur goal was to determine if species interactions, as measured by site-specific species richness and geographic range overlap, engender the proliferation of sexually dimorphic traits. Such a pattern is predicted if interactions between species selectively favor the diver- Solid black horizontal line represents family-wide mean number of sexually dimorphic traits; other lines are confidence interval fits generated from a random null model for the data, weighted by the prevalence of the species in the data set. Data outside those lines represent increased (or decreased) sexual dimorphism relative to that expected by chance. Size of circles is proportional to number of data points that fall at those values.\n454\nVol. 58 No. 3 Contrary to expectation, we found only weak and inconsistent support for the predicted pattern that heterospecific interactions promote the proliferation of sexually dimorphic traits across eight families of North American birds. Indeed, the site-specific analysis revealed that most sites across all families did not differ from random expectation for the mean number of sexually dimorphic traits. When sites deviated from random, there was no consistent pattern: two families (Cardinalidae and Picidae) showed higher than expected sexual dimorphism, whereas two families (Fringillidae and Anatidae) showed lower dimorphism than expected by chance. Indeed, Parulidae showed both kinds of sites: lower sexual dimorphism than expected by chance at moderate species richness, but higher sexual dimorphism than random expectation at high species richness.\nWe found similarly inconsistent results across families in the geographic range overlap analyses. Across all families, we found that the distributions of correlation coefficients for number of sexually dimorphic traits and each of our three metrics of range overlap (i.e., number of overlapping congeners; total overlap with congeners; or maximum overlap with any congener) exhibited distributions centered on zero (Fig. 2) . Concomitantly, in all but two families, we found no correlation between number of sexually dimorphic traits and each of our three metrics of range overlap (Fig. 3) ."}, {"section_title": "", "text": "Sexual selection is thought to be a key driver of diversification, both within and between species (Andersson 1994; Ritchie 2007) . Indeed, the observation that the form, type, and numbers of traits used for sexual signaling generally differ among species within a given genus or family has often been used to suggest that sexual selection may play a role in speciation or in maintaining (or enhancing) reproductive isolation between species (Price 1998; Ritchie 2007; Seddon et al., 2008; Martin et al., 2010) .\nOne explanation for why traits diversify among species is that species diverge in sexual traits so as to minimize costly reproductive interactions between them. In particular, if species risk hybridization, or if they interfere with each other during reproduction (e.g., owing to competition for signal space), then selection will favor the evaluation of traits that minimize such interactions (Butlin, 1987; Howard, 1993; Butlin and Ritchie, 1994; Grether et al., 2009; Pfennig and Pfennig, 2009 ). This process, known as reproductive character displacement, might not only result in divergence in expression of a single trait, but also in the proliferation of multiple traits used in mate acquisition (Pfennig, 1998; Hebets and Papaj, 2005) . As divergence in traits accumulate, reproductive isolation can increase, and, for species that risk hybridization, divergence in sexually selected traits can complete the speciation process by decreasing the likelihood of mating between them (a process known as reinforcement; Howard, 1993; Servedio and Noor, 2003; Coyne and Orr, 2004; Pfennig and Pfennig, 2009) .\nAcross communities or taxa, character displacement should generate divergence among interacting species that could account for variation within and among taxonomic groups in sexual signal diversity (e.g., Chek et al., 2003; Martin et al., 2010 ). Yet, whether species interactions foster divergent values in the same trait or, alternatively, diversification in the kinds and numbers of traits used is generally unclear. Indeed, most studies of character displacement focus on evaluating whether species differ along axes of variation for the same trait (or the same small subset of traits; Howard, 1993; Gerhardt and Huber, 2002) . However, many species often use multiple behavioral and morphological traits during competition for and attraction of mates (Candolin2003; Hebets and Papaj2005). If multiple traits are required to reliably identify conspecifics, then character displacement could contribute to the evolution of diversification in the number of traits as well as the form of those traits between species. Yet, the degree to which such use of multiple traits in sexual signaling per se contributes to reproductive isolation between species remains largely unknown. Nevertheless, addressing this issue is important for understanding whether species interactions foster enhanced diversity in both the nature and complexity of sexual signaling.\nTo specifically address this issue, we examined whether the number of sexually dimorphic traits increases with increasing heterospecific interactions in North American birds. We focused on sexually dimorphic traits, because the degree to which traits are sexually dimorphic potentially indicates the strength of sexual selection (Andersson, 1994) . Our goal was to address this issue by evaluating whether species that experience enhanced interactions with heterospecifics are more likely to possess higher numbers of sexually dimorphic traits. Previous work has evaluated whether taxonomic groups that are sexually dimorphic are more speciose (e.g., Barraclough et al., 1995) or are more ecologically diverse (e.g., Price, 1998) . Such studies evaluate the possible role of sexual selection in speciation and adaptive diversification. Here, we take a slightly different perspective by evaluating whether species interactions might actually contribute to enhancing the number of sexually dimorphic traits, as might be expected if species interactions promotes the use of multiple sexual traits in mate choice (Møller and Pomiankowski, 1993; Pfennig, 1998; Candolin, 2003; Hebets and Papaj, 2005) .\nTo do so, we used sexual dimorphism data for families of North American birds in two ways. First, we evaluated whether species richness of confamilials across different sites predicts the mean number of sexually dimorphic traits at that site. Second, because interactions with congeners may be more likely to generate selection on sexual characters (e.g., owing to increased risks of hybridization), we evaluated whether the number of sexually dimorphic traits was positively correlated with geographic range overlap with congeners. Although we did not find a strong pattern across all families, we did identify two families in which species interactions and the proliferation of sexual dimorphic traits may be linked."}, {"section_title": "Materials and Methods", "text": ""}, {"section_title": "Characterizing the number of sexually dimorphic traits", "text": "Sexual dimorphism data for birds were taken from a previously published data set in Reeve and Pfennig (2003) , in which the number of sexually dimorphic traits was tabulated from field guides. We restricted our analyses to morphology and plumage coloration data. Although doing so excluded the potentially important effects of behavior, many behaviors such as calls and courtship displays can consist of multiple components, which could not have been parsed in a comparable way across species in the available data. We therefore focused strictly on morphological and coloration differences between males and females, where each trait exhibiting sex differences in expression was scored as 1. If, for example, only males possessed a crown stripe and a cheek patch, then that species would receive a score of 2.\nWe conducted our analyses on those North American bird families with at least 10 species overall and with at least one species that exhibited two or more sexually dimorphic traits. The families meeting these criteria include Anatidae (ducks, geese and swans), Cardinalidae (cardinals, grosbeaks and tanagers), Emberizidae (New World sparrows), Fringillidae (finches), Icteridae (blackbirds, orioles and allies), Parulidae (New World warblers), Picidae (woodpeckers), and Scolopacidae (sandpipers). We use the genus and family classifications given by the 51st supplement to the American Ornithologists' Union Checklist of American Birds (Chesser et al., 2010) .\nWe then evaluated the influence of interspecific interactions on the number of sexually dimorphic traits at two levels. First, we examined site level sexual dimorphism as a function of species richness of confamilials. Second, we evaluated whether range overlap among congeners predicted the number of sexually dimorphic traits in a family. The methods for each of these levels of analysis are described below."}, {"section_title": "Site level species richness and number of sexually dimorphic traits", "text": "Site level data on species co-occurrence were taken from the North American Breeding Bird Survey (BBS; Sauer et al., 2010) . Each BBS route (site) consists of 50 three-minute point counts spaced at 800 m intervals, and is conducted by a single observer during the breeding season, typically in June. We examined 1,497 sites across North America that were surveyed continuously from 2006-2010, and calculated species richness within each bird family based on this 5-year window. The use of a 5-year window minimizes the potential underestimation of species richness due to sampling effects (McGill, 2003; White and Hurlbert, 2010) . At each site, we also calculated the average number of sexually dimorphic traits among the species present within each family.\nThe mean number of sexually dimorphic traits at sites with high species richness must necessarily converge on the family mean. We conducted a simple null model of random sampling weighted by a species' prevalence in the dataset (i.e., widespread species had a proportionately greater chance of being sampled) to generate a distribution of 10,000 values of mean trait dimorphism for each level of species richness. We used this random sampling to generate confidence bands around the grand family mean as a function of species richness. We were thus able to ask whether sites with more confamilial species tended to consist of species with a greater number of sexually dimorphic traits than would be expected by chance.\nBecause the above null model does not take into account the contiguous nature of species ranges, we generated an alternative null model that uses the empirically observed species lists at each site (thus maintaining range contiguity and the degree of commonness of species). We then randomly shuffled the number of sexually dimorphic traits across members of a family in each iteration of the model. This model yielded qualitatively similar results to our original null model (Supplemental Fig. 1) , and is not discussed further."}, {"section_title": "Range overlap and number of sexually dimorphic traits", "text": "We also examined whether the amount of geographic range overlap among congeneric species predicted the number of sexually dimorphic traits. These analyses were based on species distribution maps taken from Ridgely et al. (2007) . Specifically, for each species, its breeding season range map was overlaid with range maps for all other congenerics, and the following metrics were calculated: 1) the total number of congeneric species with at least some overlap in breeding range; 2) the maximum amount of overlap with any congeneric species, measured as a fraction of the range size of the focal species; and 3) and the total amount of range overlap with all congenerics measured in range size units of the focal species (e.g., if the ranges of four congeneric species completely overlapped the breeding range of the focal species, the total would be 4).\nFor each family we calculated the Spearman rank correlation between the number of sexually dimorphic traits and each of the three metrics of range overlap within a given family. These correlation coefficients were compiled across all eight families for each metric, and we used a Wilcoxon Rank Sum test to determine if the mean correlation coefficient for all families was different from the null hypothesis of zero."}, {"section_title": "Results", "text": "We first examined the relationship between the number of sexually dimorphic traits and familial species richness at a given site. We found that, for the most part, the mean number of sexually dimorphic traits present among confamilial species at a given site fell within the range of values expected from random sampling (Fig. 1) . The most notable exception was in the Parulidae (warblers), which had 82 sites (5.9%) with less sexual dimorphism than expected (typically at sites with 6-14 warbler species), but 64 sites (4.5%) with more sexual dimorphism than expected (typically at sites with 10-20 species). Although not as pronounced as the Parulidae, other families also showed site-specific deviation from random expectation. Namely, Cardinalidae and Picidae showed 12 and 13 sites (<1%), respectively, with higher sexual dimorphism than expected by chance. By contrast, 29 sites (2%) for the Fringillidae and 16 sites (1%) for the Anatidae actually showed lower numbers of sexually dimorphic traits than expected by chance.\nWe next examined whether the number of sexually dimorphic traits across North American bird families was positively correlated with our different measure of interactions among congeners. We found no strong evidence for a positive correlation across families for any of our measures (Fig. 2) : number of overlapping congeners (mean r = 0.03; Wilcoxon Signed Rank = 3.0; P = 0.74); total overlap with congeners (mean r = 0.11; Wilcoxon Signed Rank = 9.0; P = 0.24); or maximum overlap with any congener (mean r = 0.11; Wilcoxon Signed Rank = 9.0; P = 0.24).\nAlthough we found no striking pattern across most families, we did find positive relationships in two of the four families with the widest ranges of sexually dimorphic traits (Fig. 3) : Anatidae (ducks, geese and swans) and Parulidae (New World warblers). In particular, we found a positive relationship with all three range-based measures of congeneric heterospecific interactions for the Anatidae (0.001< P < 0.012), and a weaker positive relationship with the number of overlapping species for Parulidae (P = 0.065; Fig. 3 )."}, {"section_title": "Discussion", "text": "Our goal was to determine if species interactions, as measured by site-specific species richness and geographic range overlap, engender the proliferation of sexually dimorphic traits. Such a pattern is predicted if interactions between species selectively favor the diver- Solid black horizontal line represents family-wide mean number of sexually dimorphic traits; other lines are confidence interval fits generated from a random null model for the data, weighted by the prevalence of the species in the data set. Data outside those lines represent increased (or decreased) sexual dimorphism relative to that expected by chance. Size of circles is proportional to number of data points that fall at those values. sification of the kinds of traits used in competition for or attraction of mates.\nContrary to expectation, we found only weak and inconsistent support for the predicted pattern that heterospecific interactions promote the proliferation of sexually dimorphic traits across eight families of North American birds. Indeed, the site-specific analysis revealed that most sites across all families did not differ from random expectation for the mean number of sexually dimorphic traits. When sites deviated from random, there was no consistent pattern: two families (Cardinalidae and Picidae) showed higher than expected sexual dimorphism, whereas two families (Fringillidae and Anatidae) showed lower dimorphism than expected by chance. Indeed, Parulidae showed both kinds of sites: lower sexual dimorphism than expected by chance at moderate species richness, but higher sexual dimorphism than random expectation at high species richness.\nWe found similarly inconsistent results across families in the geographic range overlap analyses. Across all families, we found that the distributions of correlation coefficients for number of sexually dimorphic traits and each of our three metrics of range overlap (i.e., number of overlapping congeners; total overlap with congeners; or maximum overlap with any congener) exhibited distributions centered on zero (Fig. 2) . Concomitantly, in all but two families, we found no correlation between number of sexually dimorphic traits and each of our three metrics of range overlap (Fig. 3) .\nThe absence of increased numbers of sexually dimorphic traits with increasing species richness or overlap with congeners could be attributed to limitations of our analyses (see below). However, our results could also reflect a genuine pattern. In particular, interactions with heterospecifics may actually lead to the evolution of signal convergence if, for example, different species evolve the use of similar traits for signaling territoriality and mediating agonistic interactions between them (Price 2008; Grether et al., 2009) . Moreover, sexually selected traits in males might actually be lost (and sexual dimorphism thereby reduced) if such sexually selected traits enhance the risk of heterospecific interactions (Pfennig, 1998; e.g., Rosenthal et al., 2002) . In either case, interactions between species would likely not contribute to the proliferation of sexual traits (and, concomitantly the number of sexually dimorphic traits) used in mate choice or competition for mates.\nAdditionally, when species compete for resources, divergence in resource use by males and females (and the resulting dimorphism in morphology) can mitigate competitive interactions between species (Bolnick and Doebeli, 2003; Cooper et al., 2011) . Conversely, divergence in resource use between species might reduce selection for divergence in the sexes for resource use (and therefore the expression of sexual dimorphism). If so, then overlapping species that partition resources may be less likely to show sexual dimorphism. Although such may be the case with the bird families we included here, this possibility does not seem likely. Most of the features included in our data set were sexual characters (e.g., plumage coloration) rather than traits associated with resource acquisition (e.g., jaw morphology or body size) and are therefore less likely to be subject to selection stemming from resource competition. More generally, in an analysis of sexual dichromatism in 15 pairs of bird tribes, Price (1998) found no difference between sexually dichromatic and sexually monochromatic groups in ecological diversity or species richness within regions of occurrence.\nNevertheless, the possibility remains that the absence of enhanced numbers of sexually dimorphic traits may be tied to the extent to which interacting species partition resources and habitat. Such may be the case if divergence between species in resource use generates selection on males and females within species to converge in resource use (see further comments below) or if plumage dimorphism is driven by adaptive responses by the sexes to different selective pressures (e.g., predation; Badyaev and Hill, 2003) rather than mate choice.\nDespite the general pattern of no relationship between number of sexually dimorphic traits and our measures of species interactions, two families -Anatidae and Parulidae -provide exceptions that would be worth investigating in more detail with future studies. In Anatidae, the number of sexually dimorphic traits was positively correlated with all three metrics of range overlap, whereas in Parulidae, the number of sexually dimorphic traits was positively associated with the number of overlapping congeners, albeit only weakly (Fig. 3) .\nWhy Anatidae might show the most consistent support of the predicted pattern is not clear. Plumage dimorphism has been accounted for in waterfowl by other factors such as parental care and pairing frequency (Scott and Clutton-Brock, 1989) . Our results suggest that interactions between species may also promote enhanced numbers of sexually dimorphic traits in this group. One possible explanation is that, of the families examined, anatids may be the most reliant on visual displays for male competition or female choice, and the traits captured in our dataset were able to reflect those differences. In contrast, acoustic signaling is known to be at least as or more important for many of the other families examined here, and our lack of information on acoustic traits may have hindered our ability to detect the predicted patterns (see further discussion of this issue below). Such a possibility requires further investigation to determine how sexual selection and selection to avoid reproductive interactions with heterospecifics might be manifest in different signaling contexts across different families.\nFour issues arise with our analyses, which must be considered in accounting for our results. First, our analyses failed to account for a number of historical and geographical complexities regarding our measures of species co-occurrence and intensity of species interactions. For example, accounting for phylogenetic history or age of the taxonomic groups and their overlap could potentially reveal patterns of divergence between species that were not captured here (e.g., Price et al., 2000; Martin et al., 2010) . Moreover, although our analysis considered species richness at a given site, and therefore captures those potential interactions, our measure cannot take into account fine scale habitat segregation or activity patterns that may affect the actual patterns of selection on species differentiation in sexually dimorphic traits (Luther, 2009) . Additionally, species co-occurrence may be dictated by influences other than reproductive interactions (e.g., resource competition; age of a group; Price et al., 2000; Price, 2008) , and sexual dimorphism is likewise affected by other factors. Indeed, migration patterns, seasonality, or even habitat characteristics potentially affect sexual dimorphism in birds (e.g., Hamilton, 1961; Bailey, 1978; McNaught and Owens, 2002; Friedman et al., 2009) . A consideration of both the features that structure communities and the alternative factors that affect dimorphism might better explain variation in the number of sexually dimorphic traits than the measures we considered here.\nSecond, and related to above, we did not consider the causal route by which species become dimorphic. Although sexual dimorphism is often presumed to arise when males diverge from females by adopting sexual traits to attract females (or to compete with other males), the converse could occur. In particular, females may become less showy; that is females may diverge from males in terms of morphology or sexual traits through the evolutionary loss or reduction of such characters (Badyaev and Hill, 2003; e.g., Hofmann et al., 2008) . Explicitly considering those groups in which traits are gained (as opposed to lost) would enhance the ability to detect the predicted pattern of proliferation of sexual dimorphic traits, if any such pattern exists.\nThird, we excluded behavior and focused strictly on morphological traits and plumage coloration. Because behavior can consist of multiple, complex components (Candolin, 2003; Hebets and Papaj, 2005) , our measures of sexually dimorphic traits are potentially conservative measures of the number of traits that might become involved in distinguishing species or contributing to reproductive isolation. In Passerines, for example, song is critical in male-male competition and mate attraction, and it plays a key role in reproductive isolation (Price, 2008) . Thus, the combined effects of sexual selection and selection to minimize reproductive interactions between species may be acting more strongly on song than plumage, an effect not detectable in our study. Moreover, song can even become negatively related to plumage dimorphism if trade-offs arise in the production or evolution of these alternative trait types (Shutler and Weatherhead, 1990; Badyaev et al., 2002) . Generally, different components of behavioral signaling might more readily diversify or increase in number relative to what might occur in plumage or morphology, because these latter traits might experience stronger countervailing selective pressures from other ecological factors such as predation (Shutler and Weatherhead, 1990; Badyaev and Hill, 2003) . Our results should therefore not be taken as evidence that heterospecific interactions do not generally contribute to enhanced numbers of sexual traits. Rather, our results suggest that heterospecific interactions do not seem to account for increased numbers of the particular sexually dimorphic traits that we measured.\nA fourth issue that arises with our data is that trait diversity driven by the combined effects of sexual selection and species interactions may be manifest in coloration and morphology, but not in the way assayed here. Specifically, species may diverge along axes of variation for the same trait, rather than accumulate multiple traits in response to species interactions. In our analyses, two species might be divergent in coloration (e.g., black in one species, yellow in the other), but not differ in the number of sexually dimorphic traits, if the same body part (e.g., the crown) was differently colored between males and females. In other words, species may evolve differences along a single axis of variation for a given trait, rather than adopt the use of completely different traits during competition for, or attraction of, mates. Moreover, species recognition may be manifest by en-hanced discrimination of conspecifics from heterospecifics without accompanying changes in the traits used for recognizing conspecifics. For example, in the presence of heterospecifics, females may become better able to identify conspecifics even though male characters do not change (see Price 2008, ch. 14, for full discussion). Indeed, reproductive character displacement (and, more narrowly, reinforcement) is generally thought to derive from divergence in focal traits along a single axis of variation or in discrimination ability rather than via the accumulation of multiple traits (Howard, 1993; Noor, 1999; Price, 2008) .\nThat diversification could occur primarily in this way could explain why our results differ from previous studies. Indeed, in a recent study, Martin et al. (2010) found that, among some of the same families used here, color divergence is positively associated with degree of sympatry. However, their ratings of color pattern differences did not distinguish between the effects of number of traits per se and divergence along single trait axes. In light of this previous work, our results suggest that divergence within sexual traits, rather than the proliferation of sexual traits in plumage and morphology per se, may be the means by which sexual selection and selection to minimize reproductive interactions combine to contribute to sexual signal diversity within these families. Møller and Pomiankowski (1993) posed the question: \"Why have birds got multiple sexual ornaments?\" Our results suggest that the answer to this question could stem from species interactions for some species and genera. However, reproductive interactions between confamilials and congeners are not necessarily the primary driver of this level of sexual signal diversity."}]