[{"section_title": "Introduction", "text": "Attitude can be defined as the tendency of giving a positive or negative response to an object, person, institution, or incident. Although the figural definitions of attitude vary, most of the contemporary social psychologists accept that the evaluative aspect of attitude is its typical characteristic (Ajzen, 2005) . According to another definition, attitude is the readiness of an individual for giving cognitive, emotional, and behavioral reactions towards his own self, an object, or an incident that developed around him based on his knowledge and experience gained throughout his lifetime (Inceoglu, 1993, p. 15) . Attitudes are composed of three elements as follows: cognitive, emotional, and behavioral (McGuire, 1985) . Cognitive elements of attitude comprise the knowledge, belief, and thoughts of the person, which he/she owns towards the attitude object, based on his/her personal experiences. The effective element of attitude is the positive or negative feelings of an individual about the attitude object (Koklu, 1995, p. 81) . The behavioral element of attitude shows the tendency of an individual to display an act about an attitude fact (Tavsancil, 2014, p. 77) .\nThurstone, Likert, Guttman, and emotive meaning scales are the most popular scales among the attitude scales (Fishbein & Ajzen, 1974) , which indicated that four scales have different aspects (Anderson, 1988 , as cited in Cikrikci, 1991 , whereas Thurstone, Likert, and Guttman scales are composed of sentences, emotive meaning scales consist of adjective lists (Wright & Feinsten, 1992) . Although all aspects making up attitude and representing the aspects are included in Thurstone and Guttman scales, Likert-type scales focus on two end-points of attitude; positive and negative (Tavsancil, 2014, p. 79) . The respective scoring is carried out based on each answer (such as agree, disagree) on Likert-type scales. Likert type scales are the most frequently used attitude scales. Likert type scales have strengths in comparison to other scales, including easy preparation and applicability, allowing a single-dimension structure, allowing scoring and scoring reliability, and testing the inter-item relations statistically (Babbie, 2014; Bayat, 2014; Seker & Gencdogan, 2014) .\nDeveloping a positive attitude has a crucial importance in science education. The cognitive learning objectives in the Turkish science curriculum were prepared in integration with affective and psychomotor skills by the Ministry. In these curricula, the learning domain of effect expects students to develop positive attitudes towards science and enjoy science (Turkish Ministry of National Education, 2005; 2013; 2018) . Attitude towards science is an individual's organization of beliefs and cognitive schemas, leading to the affective reactions of that individual toward science (Reid, 2006) . The emergence of these reactions shows the tendency of individuals to reach some decisions, including inclining to careers and courses related to science and willingness to participate in investigating scientific developments and scientific activities (Jones, Howe & Rua, 2000; Osborne, Simon & Collins, 2003) .\nIdentifying the attitudes of people toward science provides prior knowledge of their future behaviors. Thus, there are studies that reported the attitudes toward science started by the end of the 20th century (Fraser, 1978; Ormerod & Duckworth, 1975; Reid, 2006; Rennie & Punch, 1991) . The main cause of conducting these studies was the concern that interest in science declined and a negative attitude towards science was adopted in developed countries, including the UK and the USA. These studies enable the determination of the reasons for developing a negative attitude towards science in society and making the necessary regulations (Osborne, Simon & Collins, 2010) . Attitude scales have been developed to identify attitudes toward science in many studies (Afacan, Aydogdu & Usak, 2006; Akpinar, Yildiz, Tatar & Ergin, 2011; Balim, Sucuoglu & Aydin, 2009; Kececi & Zengin, 2015; Kenar & Balci, 2012; Nuhoglu, 2008; Shrigley, 1974; Sener & Tas, 2016; Tekkaya, Cakiroglu & Ozkan, 2002; Thompson & Shrigley, 1986; Yasar & Anagun, 2009 ).\nIt can be seen that the attitude-scale studies towards science are shaped around the changing science topic names and contents, which are carried out with primary or middle school students (Balım, Sucuoglu & Aydin, 2009; Kenar & Balci, 2012; Nuhoglu, 2008; Yasar & Anagun, 2009) . Along with these scales, there are also some studies in the literature, which have been carried out to measure the attitudes of preservice teachers towards science courses and experiences (see Afacan, Aydogdu & Usak, 2006; Tekkaya, Cakiroglu & Ozkan, 2002; Shrigley, 1974; Thompson & Shrigley, 1986) . In a study conducted by Sener and Tas (2016) , a scale was developed to investigate students' attitudes towards science. However, the number of attitude-scale studies is not at a satisfactory level for measuring middle school students' attitudes towards science in general, which is more complicated compared to the lesson contents of science. Therefore, there is a need for more comprehensive scales to be used for identifying middle school students' attitudes toward science. The present study aims is to develop a questionnaire that can measure attitudes towards science with all dimensions. The main purpose of the science teaching program is scientific literacy for each student. In this respect, seven learning domains are determined. Attitudes domain is one of seven main domains and it has an important role for scientific literacy (Kavak, Tufan & Demirelli, 2006) . Scientific and technological developments of countries form a labour force in areas related to science. To form such a labour force, youngsters need to develop positive attitudes towards these areas. Second, it was aimed to investigate the 5th, 6th, 7th, and 8th graders' attitudes towards science and to investigate its relation with the grade level (cross-sectional). Thereby, how middlegrade students' attitudes towards science can change over time can be determined. In consideration of this process, we try to seek the answers for the following research questions:\n1. Does the attitude-scale towards science have validity and reliability? 2. What kinds of relations are there among students' grade levels and their attitudes towards science?"}, {"section_title": "Method", "text": ""}, {"section_title": "Research Design", "text": "The cross-sectional survey design was used in this study. This research design allows the characterization of an incident, object, group, or subject as in real life, which permits the representation of variables related to the research area in detail (Johnson, 2001; Karasar, 2005, p. 77; Mertens, 2014, p. 173 ).\nThis study is a cross-sectional study permitting the immediate identification of the states and behaviors of individuals about a subject or question (Gay, Mills & Airasian, 2009; Ucar, 2011; Woodcock & Reupert, 2012) . Cross-sectional studies help to gather data about a specific from a sample representative of the population (Fraenkel, Wallen & Hyun, 2012, p. 394) . The most fundamental benefit of cross-sectional studies may be regarded as determining whether there is a change in an individual with the improvement of cognitive development level and experiences about a specific subject or question. It is thought that in addition to the determination and comparison of 5th, 6th, 7th and 8th graders' attitudes towards science by including its cross-sectional."}, {"section_title": "Research Sample", "text": "The target population of this study consisted of students attending three different secondary schools located in a city center in the Central Anatolian Region during the spring semester of the academic year of 2017-2018. The cluster sampling method, which is a probability-based sampling method, was selected to set the study sample. In the cluster sampling method, the target population is divided into various groups and each group is accepted as a cluster. Random selections are made among the clusters and a sample is formed (Comlekci, 2001, p. 90; Mertens, 2014, p. 319) . When determining the sample, the students comprising the universe of the study were considered as clusters concerning grade levels. The sample comprises randomly selected classes from the four clusters that were formed based on grade levels (see Table 1 ). Out of 691 students making up the sample, 375 were male and 316 were female. "}, {"section_title": "Research Instruments and Procedures", "text": "The following steps were suggested by DeVellis (2003, pp. 60-96) in the development of the attitude scale towards science."}, {"section_title": "Determining the Theoretical Framework of Measured Characteristics", "text": "The objective within the first phase of the scale development process was to identify the characteristics, comprising the theoretical infrastructure of attitudes towards science, by analyzing the national and international literature. Within this context, an in-depth literature review was carried out. The studies which were about attitudes towards science and scale development studies were selected. After examining these studies, items that were representing attitudes towards science were specified and listed. In the list, items that indicated the same characteristics were grouped. Items in each group were evaluated together to create a new attitude towards science items. In addition to these characteristics, those within the items of scale studies about science and attitude-related gains in the curriculum of Turkish Ministry of National Education were taken into consideration, as well (Balim, Sucuoglu & Aydin, 2009; Ebenezer & Zoller, 1993; Fraser, 1978; Germann, 1988; Kennedy, Quinn & Taylor, 2016; Kind, Jones & Barmby, 2007; Mejias-Algarin, 1989; Misiti, Shrigley & Hanson, 1991; Nuhoglu, 2008; Pell & Jarvis, 2001; Schreiner & Sjoberg, 2004; Wang & Berlin, 2010; Yasar & Anagun, 2009 )."}, {"section_title": "Creating Item Pool", "text": "The data collected in the first stage were analyzed, and the characteristics which were thought to represent the attitude towards science were identified. Item expressions ensuring the testing of each character were written, and an extensive item pool was generated. The features considered for writing the attitude expressions, which were included in the scale, were as follows: The items must be the expressions of what is needed or unneeded and the factual statements were avoided (Tezbasaran, 2008, p. 12) , each item must consist of only a single expression for the character which is to be measured (Edwards, 1983) , the scale items must be expressed as short and simple, not causing misunderstandings (Tezbasaran, 2008, p. 12) , the items do not contain words that are not used in daily life frequently and do not contain foreign words (Edwards, 1983 ), a number of choices and choice expressions are not to include expressions that are hard to be distinguished by the responders, the number of choices to be included in Turkish scales had to be maximum five (Seker & Gencdogan, 2014, p. 8) , words implying the degree (quantity) of the character that is to be measured by the scale are not to be used in the item (Seker & Gencdogan, 2014, p. 8) , the number of positive items are to be equalized to the number of negative items in the scales as much as possible. Hence, the students would be prevented to give stereotypical reactions without reading the items (Tezbasaran, 2008, p. 12) ."}, {"section_title": "Determining the Scale Type", "text": "In the third stage of the scale development studies, the scale type to be used, and the answer choices were determined. It was decided that the Likert type scale was to be used in this scale development study owing to its implementation and preparation convenience. Likert scale was organized as a five-point Likert type, thought to be the best for the perceiving and distinguishing level of the group, with whom the scale will be applied. The developed scale did not consist of the choices, including \"I have no idea,\" \"I am undecided,\" \"I don't know,\" which are used in the implementation of Likert type attitude scales. These choice categories show that the responders have knowledge or experience deficiencies about the subject and therefore, they don't allow the responders to give positive and negative reactions (Basar, 2010; Ocal, 2012; Sturgis, Roberts & Smith, 2014) . In the developed scale, all choice categories were organized to provide scores between 1 and 5 among the choices \"I don't agree absolutely\" and \"I completely agree\" to eliminate the confusion of the responders because of the intermediate choice categories."}, {"section_title": "Consulting Expert Opinion", "text": "Expert opinion was resorted to after deciding the scale type in the fourth stage. The items included in the scale were reviewed by two academicians who were experts in science education, one person who was an expert in Turkish language and literature, and two science teachers, and their opinions were received. The necessary revisions were made on the items based on the feedback from the experts. Based on expert reviews, some words were changed to improve clarity and some items that were not considered appropriate as attitude expressions were removed from the scale. Revised attitude items were evaluated as positive, negative, and neutral by 60 students, representing the target population, to whom the scale was to be applied. Four items which were not evaluated as positive or negative and were difficult to be understood by the student group were removed from the scale as a result of the pilot implementation (Anderson, 1988 , as cited in Cikrikci, 1991 . It was decided that a total of 40 items remained in the scale, 20 of them were positive and 20 of them were negative, as a result of the removal of the items."}, {"section_title": "Applying the Scale", "text": "Adding one check item, the pilot form of the scale consisted of a total of 40 items. It was aimed to distinguish the responders who answered the items of the scale randomly using the check item (Adams, Perkins, Podolefsky, Dubson, Finkelstein & Wieman, 2006) . The check item was included in the scale: This item was included to check whether the study participants answered this scale after they had read it. The following instruction was provided: \"If you are reading this item, please mark the choice of 4\". The scale was prepared for the pilot implementation stage by making the necessary writing, orthographic and formal arrangements on the scale items.\nThe pilot study was conducted using a 90-person sample, including 20 fifth graders, 20 sixth graders, 30 seventh graders, and 20 eighth graders. The student sheets in which the relevant answer was not given fort the check item were not evaluated in the pilot study. The data collected as a result of the pilot study were analyzed using the SPSS 22.0 package program and analyzed. The item analysis aimed to determine and identify the items that did not successfully reflect the character, which was desired to be assessed and measured in terms of reliability and validity among the scale items. It was decided that four items were to be removed from the scale to improve the reliability and validity of the scale as a result of the item analysis."}, {"section_title": "Final Shape of the Scale", "text": "The scale consisted of 36 items finally as a result of the data collected during the pilot study. Again, a check item was added to the scale, to find out whether the scale was answered randomly. The necessary writing, orthographic, and formal arrangements were made and the final form of the scale was generated. In 50 sheets, the answer '4' was not given. Thus, these sheets were removed from the final data set. Finally, data that came from 691 student sheets were sent to SPSS 22.0 program."}, {"section_title": "Data Analysis", "text": "To support the construct validity of the scale, first, the scale was applied to a sample of 363 students, and Explanatory Factor Analysis was conducted. To verify the construct, Confirmatory Factory Analysis was carried out with a sample of 328 students.\nThe data collected by the attitude towards the science scale (ATSS) were analyzed by exploratory factor analysis (EFA) to determine the factor structure and establish construct validity. The data were analyzed by confirmatory factor analysis (CFA) using the LISREL 8.80 package program to provide evidence for the accuracy of the factor structure found out as a result of EFA. Moreover, Cronbach Alpha's internal consistency was estimated to provide evidence for the reliability of the entire scale and its subfactors. The data were analyzed using one-way analysis of variance to determine whether the scores received in the attitude towards the science scale varied based on grade level."}, {"section_title": "Results", "text": ""}, {"section_title": "Exploratory Factor Analysis", "text": "Descriptive statistics about the items making up ATSS are shown in Table 2 . It can be seen that the mean total scores received in ATSS is 147.8324, its standard deviation is 30,50407, the variance is 930,498, the minimum is 53, the maximum is 196, kurtosis value is -.153, and skewness value is -.677. The kurtosis and skewness values ranged between -1 and +1 and this shows that the distribution is normal (Tabachnick & Fidell, 2001) .\nKaiser-Meyer-Olkin (KMO) coefficient and Barlett test conducted to determine the suitability of the data collected in the attitude of towards science scale for factor analysis. The KMO coefficient of .876 of the scale items and Barlett test result showed significance at the level of .000 (x 2 = 2248.748, sd = 630, p<. 001). A KMO coefficient larger than 0.60 and a Barlett test result of smaller than 0.05 are the indicators showing that the scale is suitable for factor analysis. The collected results revealed that the scale items are suitable for factor analysis.\nPrincipal component analysis and Varimax rotation technique, a vertical rotation technique, were used to identify the factor structure and factor loads. As a result of the Varimax rotation technique, attention was paid so that the relation level of each item with a factor was 0.30 and higher (Ozcan, 2019; Secer, 2015; Tabachnick & Fidell, 2001) . Attention was paid so that there was a difference at the level of 0.10 between the levels of the relation of the items gathered under multiple factors with the factors. An item, which showed a relation with different factors and had a relation level of less than 0.10 (cyclic), was removed from the scale (Secer, 2015) . Factor analysis was repeated after the item was removed. As shown in Table 3 that the scale items are distributed in four factors with the repeated factor analysis. Naming these four factors, the common characteristics of the items, which comprise the factors, were considered, along with the contents of the factors used in similar studies within the literature. The enjoyment factor has 13 items (1, 2, 5, 8, 15, 17, 20, 24, 27, 29, 30, 33, 34) , the confidence factor has 12 items (4, 9, 10, 12, 14, 16, 21, 23, 26, 32, 35, 37) , the usefulness factor has seven items (3, 6, 7, 11, 13, 18, 25) and the interest factor has four items (22, 28, 36) . Table 3 . The eigenvalue of each factor must be minimum 1 for each factor to be acceptable (Buyukozturk, 2013) . The eigenvalue of the four factors obtained as a result of EFA were 15.719, 2.210, 1.987, 1.525 and 1.388, a, respectively. The variance values explained by each factor were 21.555%, 16.795%, 12.817% and 8.391%. The cumulative variance value explained by the entirety of the factors was estimated at 59.559%. Considering the item-total test correlations, it was seen that these values were at the range of .411 and .766 (p<.01). These values to be higher than .30 indicated that the scale items provided an adequate level of distinguishing (Field, 2009 )."}, {"section_title": "EFA Results about the ATSS", "text": "Considering the descriptive statistics included, it can be seen that the kurtosis and skewness values of the scores of the scale's sub-dimensions ranged between -1 and +1. This indicates that the total scores received in the entire scale were in conformity with the kurtosis and skewness values and that these scores had a normal distribution (Tabachnick & Fidell, 2001) .\nThe correlation values were estimated to establish the relations of the factors included in the scale with each other and it was found out that the correlation values between the factors ranged between .511 and .753 (Table 4 ). Considering the correlation values, it can be indicated that the sub-dimensions making up the scale had a positive and strong relationship with each other (Buyukozturk, 2013; Ozcan, 2019) . At the same time, multicollinearity among factors was tested by conducting multiple regression correlation. The results showed that, as shown in Table 5 , tolerance values were found to be between.077 and .749 and inflation values were found to be between -0.03 and 1.476. The tolerance values below 1 and and the inflation values below 10 shows that there is not multicollinearity among factors (Field, 2009 ). "}, {"section_title": "Confirmatory Factor Analysis", "text": "CFA ensures the assessment of the conformity of the factor structure formed as a result of EFA with the data (Floyd & Widaman, 1995; Tabachnick & Fidell, 2001) . CFA was performed using LISREL 8.80 package program to verify and validate the fourfactor structure obtained as a result of EFA. Considering the CFA results that are shown in Table 6 , when the chi-square accommodation conformity was divided to the degree of freedom, the value of 2 was found out and this indicated that the scale was in perfect conformity (Kline, 2005) . Similarly, agree with an RMSEA value of 0.051, an NFI value of 0.93, and the NNFI, CFI, and IFI values of 0.98 showed that the scale was in perfect conformity (Byrne, 1998; Hu & Bentler, 1999) . SRMR value of 0.05 expressed that the scale had perfect conformity (Brown, 2006) . Considering all the fitting indexes together with AGFI (0.87) and GFI (0.85) values, there is evidence for the construct validity of the scale (Joreskog & Sorbom, 1993) . (Joreskog & Sorbom, 1993) As can be seen in Figure 1 , error variances of the variables are between .42 -.88 following CFA, which means that the error variances are not on a high level. Additionally, the standardized path coefficients (Figure 1 ) of the factors are as follows: For enjoyment factor: .45 and .73; for confidence factor: .39 and .65; for usefulness state factor: .54 and .71; for the factor for interest: .45 and .76. "}, {"section_title": "Reliability Analysis", "text": "Cronbach Alpha coefficient was estimated to provide evidence about the reliability of the 36 items included in ATSS. Table 7 shows that the Cronbach Alpha coefficients of .70 and higher that were found for all factors established evidence for the reliability of the scale (Buyukozturk, 2013) . Table 8 shows that the 5th graders had the highest science attitude score average ( ̅ = 154.4074), and the 7th graders had the lowest science attitude score average ( ̅ = 142.9610). Table 9 shows that there was no significant difference between the score averages of the attitudes of the students at different grades towards science a result of the performed variance analysis (F= 2,380; p> .001). "}, {"section_title": "Data on the Difference between the Scores of Attitudes towards Science based on Grade Levels", "text": ""}, {"section_title": "Discussion, Conclusion, and Recommendations", "text": "In the current study, a scale for determining students' attitudes towards science, (science is a broader area than science lessons) was developed. The attitude towards the science scale developed as a result of this study consisted of 36 items (excluding the check item) and was organized as a five-point Likert scale (see Appendix). To establish construct validity of the scale, factor analysis was conducted. EFA showed that scale was constructed of four factors, the relevance values between items and factors were between .502 and .776, item-test correlation values were between .411 and .766, and the factors explained 59.559% of the total variance. To provide evidence to four-factor construct that was obtained from EFA, CFA was carried out on a different sample. CFA also confirmed that four-factor construct (enjoyment, confidence, usefulness, interest). It was seen that Cronbach Alpha coefficients found from each factor making up the scale and from the entire scale were higher than 0.70. This provided evidence for the reliability of the scale. This scale development study, with established validity and reliability, consists of attitude components completely reflecting the science field.\nStudies conducted on attitude towards science have received great attention from the past to the present. Attitude studies have been conducted at various grade levels, on various main themes and in various cultures in the national and international literature (Fraser, 1982; Schreiner & Sjoberg, 2004) . The number of studies conducted on science education has increased in Turkey in recent years because of the failures of students seen in the science field in various tests, including OSYM (Student Sel ection and Placement Centre), PISA (Programme for International Student Assessment), TIMSS (Trends in International Mathematics and Science Study), and the regression in the levels of interest on this field (Aydeniz, 2017). Establishing students' attitudes towards science and identifying the source of their negative attitudes before the educational process is a crucial issue for providing quality science education (Gomleksiz & Yuksel, 2003) .\nWhen relevant research studies were reviewed, it was found that there were both similarities and differences between the findings of the current study and that of prior research studies. Investigating students' attitudes towards the science field, Kenndy, Quinn, and Taylor (2016) purported that the attitudes towards science had six subdimensions, enjoyableness, self-efficacy, difficulty, usefulness for career, relevance for everyday life, and intention to enroll. Yasar and Anagun (2009) established that attitudes had three sub-dimensions, dependent on proofs, curiosity and persistence, and Wang and Berlin (2010) identified that attitudes towards science class had a single dimension. Sener and Tas (2016) found out that attitude towards sciences had five subdimensions as daily life and learning new knowledge, difficulty in application, problem-solving, motivation, and anxiety. As a result of this study, on the other hand, it was deduced that attitudes towards science had four sub-dimensions, namely enjoyment, confidence usefulness and interest. The enjoyableness and usefulness for the career sub-dimension of Kenndy, Quinn, and Taylor (2016) are similar to the enjoyment and usefulness sub-dimension of the current study and both subdimensions point to students' perceived competence in the areas of science. There are some studies that found different sub-dimensions when compared to the current study (Yasar and Anagun, 2009; Kenndy, Quinn, and Taylor, 2016; Sener and Tas, 2016) . It is thought that these factors making up the basis students' attitudes towards science are the students' belief in the facilitation of their daily life using their science knowledge, their levels of self-confidence to succeed in the science field, and the levels of their knowledge in these fields.\nConsidering the mean total scores received from the attitude towards science scale, it was seen that the 5th, 6th and 7th graders received higher scores in comparison to the 8th graders. However, it was seen that the difference between the mean scores was not significant. The findings showed that positive attitudes developed towards science diminished in time in contrast to what was anticipated with the improvement of cognitive development depending on the rise of grade level. Pell and Jarvis (2010) ascertained that students' scientific attitudes regressed during the process from the age of five years till the age of 11 years as their age increased and this regression was more conspicuous in female students in comparison to the male students. In a similar study, they saw that the attitudes of the students at the range of 11 years old and 14 years old towards science showed regression as students' education levels increased. It was also put forward that thi s regression was more distinct in female students (Kind, Jones, & Barmby, 2007) . The regression occurred in students' attitudes depending on the increase of their grade levels as a result of these studies was in conformity with the data collected as a result of the research. In a study investigating attitudes towards science class in Taiwan, it was concluded that there was no significant difference in science attitude based on grade level and gender in similar to the result of this study (Wang & Berlin, 2010) .\nIn a cross-sectional study conducted on the change of attitudes of students enrolled in the 3rd grade up to the 12th grade towards science, results were similar. In contrast to this study, former study showed a regression in the levels of student atti tudes as their grade level increased (Said, Summers, Abd-El-Khalick & Wang, 2016) . It was determined that the regression in these attitude changes occurred because the students thought that their skills in science education fields worsened and due to the l oss of their faith in the benefits and necessity of science education.\nThe efficiency in teaching and learning science can be improved using an attitude towards the science scale. Thus, teachers may use the attitude scale developed in this study to establish students' attitudes towards science both before and after education. Moreover, this scale may also be used to determine the degree of their attitude gains in the affective dimension of science curriculum the following education. Thus, organization and development of activities included in the curriculum concerned with attitude gain may be managed. Cross-sectional studies with various scales may be conducted for different grade levels with different disciplines in future studies. Moreover, various scale studies may be carried out to find out the relationships between different age groups and attitude scores towards science. benimsenmeye başlaması nedeniyle fene yönelik ilginin arttırılmasının amaçlanması ve gelecekte ülkelerin ihtiyaç duyacağı mesleklerin fen ile ilişkili olması gibi pek çok fakör fene yönelik tutumların ölçülmesini gerekli kılmaktadır.\nAraştırmanın Amacı: Bu çalışmada fene yönelik tutum ölçeği (FYTÖ) geliştirilmesi, 5, 6, 7 ve 8. sınıf düzeyinde öğrenim görmekte olan öğrencilerin fene yönelik tutumlarının ölçülmesi amaçlanmıştır. Ayrıca çalışma farklı düzeyde yapılarak ise sınıf düzeyi ile fene yönelik tutum arasındaki ilişkinin araştırılması amaçlanmaktadır. Çalışmanın sonuçları, fene yönelik tutumların belirlenmesi ve tutumların istenilen düzeylere ulaşabilmesi için araştırmacılara, program hazırlayıcılara ve öğretmenlere yol gösterici olacağı düşünülmektedir.\nAraştırmanın Yöntemi: Bu ölçek geliştirme çalışmasında nicel araştırma yönteminin temel alındığı tarama modeli kullanılmıştır. Çalışmanın evrenini 2017-2018 eğitimöğretim yılı bahar döneminde bir il merkezinde bulunan üç farklı ortaokulda öğrenim gören öğrenciler oluşturmaktadır. Bu çalışmanın örneklemi 316'sı kız 375'i erkek olmak üzere toplam n= 691 öğrenciden oluşmaktadır.\nÖlçek geliştirme sürecinin ilk aşamasında ilgili ulusal ve uluslararası alan yazın incelenerek fene yönelik tutumların teorik altyapısı oluşturulmuştur. Aynı zamanda fen alanında daha önce yapılmış ölçek geliştirme çalışmaları ile MEB tarafından Öğretim Programı'nda tutumla ilişkili olarak yer verilen kazanımlar gözden geçirilmiştir. Uygulanma ve hazırlanma kolaylığı nedeniyle bu ölçek geliştirme çalışmasında Likert tipi ölçek kullanılmasına karar verilmiştir. Likert ölçeği, ölçeğin uygulanacağı grubun algılama ve ayırt edebilme düzeyine en uygun olacağı düşünülen beş puanlı likert biçiminde düzenlenmiştir. Ölçekte yer alan maddeler, Fen Bilgisi Eğitimi alanında uzman iki kişi, Türk Dili ve Edebiyatı alanında uzman bir ki şi ve iki Fen Bilimleri öğretmeni tarafından incelerek görüşleri alınmıştır. Uzmanlardan alınan dönütler doğrultusunda, doğrudan tutumları ifade etmediği belirtilen 8 madde ölçekten çıkarılmış ve diğer maddeler üzerinde önerilen düzenlemeler yapılmıştır. Revize edilen tutum maddeleri, ölçeğin uygulanacağı evreni temsil eden 60 kişilik bir öğrenci grubu tarafından olumlu-olumsuz-nötr şeklinde değerlendirilmiştir. Öğrenci grubu ile yapılan ön deneme sonucu maddelerde herhangi bir anlaşılmayan ifade olmadığı görülmüştür. Bu çalışma sonucu ölçekte 20'si olumlu, 20'si olumsuz toplam 40 maddenin kullanılmasına karar verilmiştir.\nÖlçekte yer alan 40 maddeye bir adet kontrol maddesi ilave edilerek pilot ölçekte toplamda 41 madde olması sağlanmıştır. Kontrol maddesi kullanılarak ölçekte yer alan maddelere rastgele cevap verenlerin ayırt edilmesi amaçlanmıştır. Kontrol maddesi \"Bu madde ölçeği okuyarak cevaplayıp cevaplamadığınızı kontrol etmek için yazılmıştır. Eğer bu maddeyi okuyorsanız \"4 no.lu kutucuğu işaretleyiniz.\" şeklinde ölçeğin 20. madde olarak yer almıştır. Ölçek maddeleri üzerinde gerekli olan yazım, imla ve biçimsel düzenlemeler yapılarak ölçek pilot uygulama aşamasına hazır hale getirilmiştir.\nÖlçeğin pilot uygulaması 20'u 5. sınıf, 20'u 6. sınıf, 30'u 7. sınıf ve 20'si 8. sınıf olmak üzere toplam 95 kişilik bir örneklem ile gerçekleştirilmiştir. Pilot uygulama neticesinde kontrol maddesine beklenen seçeneğin işaretlenmediği ölçekler değerlendirmeye alınmamıştır. Pilot uygulama sonucunda elde edilen veril er SPSS 22.0 paket programına aktarılarak analiz edilmiştir. Ön deneme ve pilot uygulama aşamalarından elde edilen veriler sonucu nihai ölçekte 36 maddeye yer verilmiştir. Ölçeğe 20. madde olarak ölçeğin rastgele cevaplandırılıp cevaplandırılmadığını belirlemek adına kontrol maddesi ilave edilmiştir. Gerekli yazım, imla ve biçimsel düzenlemeler yapılarak ölçeğin nihai formu oluşturulmuştur. Oluşturulan nihai formun uygulanması neticesinde elde edilen veri setinde öncelikle kontrol maddesine \"katılıyorum\" cevabının verilmediği 50 ölçek örneklemden çıkarılmıştır. Elde edilen 691 ölçeğin verileri (363'ü AFA ve 328'i DFA çalışmalarında kullanılmak üzere ayrı ayrı aktarılmıştır) SPSS 22.0 ve LISREL 8.80 paket programlarına aktarılmıştır.\nVeriler, öncelikle faktör yapısının saptanması amacıyla Açımlayıcı Faktör Analizi'ne (AFA) tabi tutulmuştur. Ardından elde edilen yapının kabul edilebilir olup olmadığına ilişkin kanıt oluşturmak için Doğrulayıcı Faktör Analizi'ne (DFA) tabi tutulmuştur. Fene yönelik tutum ölçeğinden elde edilen puanların sınıf düzyine göre farklılaşıp farklılaşmadığını tespit etmek amacıyla ise veriler tek yönlü varyans analizine (Anova) tabi tutulmuştur.\nAraştırmanın Bulguları: Açımlayıcı Faktör Analizi sonucunda bir maddenin ölçekten çıkarılmasına karar verilmiştir. Temel bileşenler analizi ve Varimax döndürme tekniği sonucunda Fene yönelik tutum ölçeğinin dört faktörlü bir yapıya sahip olduğu görülmüştür. AFA sonucu elde edilen dört faktörlü yapının değerlendirilip doğrulanması amacıyla LISREL 8.80 paket programı kullanılarak DFA yapılmıştır. DFA sonucu ki-kare iyilik uyumunun serbestlik derecesine bölümü 2, RMSEA değeri 0.051, SRMR değeri 0.05, NFI değeri 0.93 ve NNFI, CFI ve IFI değerleri 0.97 olarak bulunmuş olup ölçeğin mükemmel uyuma sahip olduğunu göstermektedir. DFA sonucunda maddelerin sahip oldukları faktör ağırlıklarının .42 ile .88 arasında değişmekte olup anlamlı bulunmuştur.\nFYTÖ'de yer alan 36 maddenin güvenirliğine ilişkin kanıt oluşturabilmek amacıyla Cronbach Alpaha katsayısı hesaplanmıştır. Ölçeğin tamamından elde edilen Cronbach Alpha katsayısı .93 olarak bulunmuştur. Hoşlanma faktörü için hesaplanan iç tutarlık katsayısı .91, Güven faktörü için hesaplanan iç tutarlık katsayısı .74, Fayda faktörü için hesaplanan iç tutarlık katsayısı .76 ve İlgi faktörü için hesaplanan iç tutarlık katsayısı .72 olarak bulunmuştur.\nSonuç ve Öneriler: Bu çalışma sonucunda geliştirilen Fene Yönelik Tutum Ölçeği, 36 maddeye (kontrol maddesi hariç) sahip ve 5'li likert biçiminde düzenlenmiştir. Örneklemden elde edilen veriler ölçeğin dört faktörlü bir yapıya sahip olduğunu göstermiştir. Ölçeği oluşturan faktörlerin her birinin ve ölçeğin tamamının güvenilirliği yüksektir. Veriler üzerinde sırasıyla gerçekleştirilen AFA ve DFA sonuçları oluşturulan yapının kabul edilebilir olduğu kanıtlamaktadır. Geçerliği ve güvenirliği kanıtlanmış olan bu ölçek geliştirme çalışması fen alanını kapsayan tutum öğelerinin tamamını kapsamaktadır. Fene yönelik tutum ölçeğinden alınan toplam puanların tek yönlü varyans analizi sonucu 5, 6, 7 ve 8. sınıf öğrencilerinin puanları arasında anlamlı bir farklılığın bulunmadığı görülmüştür."}]