[{"section_title": "Abstract", "text": "Alzheimer's disease (AD) is the primary cause of dementia worldwide (1), with an increasing morbidity burden that may outstrip diagnosis and management capacity as the population ages.\nCurrent methods integrate patient history, neuropsychological testing and magnetic resonance imaging (MRI) to identify likely cases, yet effective practices remain variably-applied and lacking in sensitivity and specificity (2). Here we report an explainable deep learning strategy that delineates unique AD signatures from multimodal inputs of MRI, age, gender, and minimental state examination (MMSE) score. Our framework linked a fully convolutional network (FCN) to a multilayer perceptron (MLP) to construct high resolution maps of disease probability from local brain structure. This enabled precise, intuitive visualization of individual AD risk en route to accurate diagnosis. The model was trained using clinically-diagnosed AD and cognitively normal (NC) subjects from the Alzheimer's Disease Neuroimaging Initiative (ADNI) dataset (n=417) (3), and validated on three independent cohorts: the Australian Imaging, Biomarker & Lifestyle Flagship Study of Ageing (AIBL, n=382) (4), the Framingham Heart Study (FHS, n=102) (5), and the National Alzheimer's Coordinating Center (NACC, n=582) (6).\nModel performance was consistent across datasets, with mean accuracy values of 0.966, 0.948, 0.815, and 0.916 for ADNI, AIBL, FHS and NACC, respectively. Moreover, our approach exceeded the diagnostic performance of a multi-institutional team of practicing neurologists (n=11), and high-risk cerebral regions predicted by the model closely tracked postmortem histopathological findings. This framework provides a clinically-adaptable strategy for using routinely available imaging techniques such as MRI to generate nuanced neuroimaging signatures for AD diagnosis, as well as a generalizable approach for linking deep learning to pathophysiological processes in human disease."}, {"section_title": "Introduction", "text": "Millions worldwide continue to suffer from AD, while attempts to develop effective disease modifying treatments remain stalled. Though tremendous progress has been made towards detecting AD pathology using cerebrospinal fluid (CSF) biomarkers (7) (8) (9) , as well as positron emission tomography (PET) amyloid (10, 11) , and tau (τ) imaging (12, 13) , these modalities often remain limited to research contexts. Instead, current standards of diagnosis depend on highly skilled neurologists to conduct an examination that includes inquiry of patient history, an objective cognitive assessment such as bedside MMSE or neuropsychological testing (2) , and a structural MRI to rule in findings suggestive of AD (7) . Clinicopathological studies suggest the diagnostic sensitivity of clinicians range between 70.9-87.3% and specificity between 44.3%-70.8% (14) . While MRIs reveal characteristic cerebral changes noted in AD such as hippocampal and parietal lobe atrophy (15) , these characteristics are considered to lack specificity for imaging-based AD diagnosis (7, (16) (17) (18) . Given this relatively imprecise diagnostic landscape, as well as the invasive nature of CSF and PET diagnostics and a paucity of clinicians with sufficient AD diagnostic expertise, advanced machine learning paradigms such as deep learning (19) (20) (21) , offer ways to derive high accuracy predictions from MRI data collected within the bounds of neurology practice.\nRecent studies demonstrate the application of deep learning approaches such as convolutional neural networks (CNNs) for MRI and multimodal data-based classification of cognitive status (22) . Despite the promising results, these models have yet to achieve full integration into clinical practice for several reasons. First, there is a lack of external validation of deep learning algorithms since most models are trained and tested on a single cohort. Second, there is a growing notion in the biomedical community that deep learning models are \"blackbox\" algorithms (23) . In other words, although deep learning models demonstrate high-accuracy classification across a broad spectrum of disease, they neither elucidate the underlying diagnostic decisions nor indicate the input features associated with the output predictions. Lastly, given the uncertain onset and heterogeneity of symptoms seen in AD, a computerized individual-level characterization of AD remains unresolved. Considering these factors, we surmise that the clinical potential of deep learning is attenuated by a lack of external validation of single cohortdriven models, and an increasing use of opaque decision-making frameworks. Thus, overcoming these challenges is not only crucial to harness the potential of deep learning algorithms to improve patient care, but to also pave the way for explainable evidence-based machine learning in the medical imaging community. To address these limitations, we developed a novel deep learning framework that links a fully convolutional network (FCN) to a traditional multilayer perceptron (MLP) to generate high-resolution visualizations of AD risk that can then be used for accurate predictions of AD status (Fig. 1) . Four distinct datasets were chosen for model development and validation (Fig. 2 , Table 1 ). Association of model predictions with neuropathological findings along with a head-to-head comparison of the model performance with a team of neurologists underscored the validity of the deep learning framework."}, {"section_title": "Results", "text": "Our dual deep learning pipeline can link an FCN to an MLP to predict AD status directly from MRI data or from a combination of MRI data and readily available non-imaging data (Fig.   1 ). The FCN portion of the framework generated high-resolution visualizations of overall AD risk in individuals as a function of local cerebral morphology. We refer to these visualizations as disease probability maps (DPMs). The MLP then used DPMs directly (Model A in Fig. 1) , or a set of non-imaging features such as age, gender and MMSE score (Model B in Fig. 1 ), or a multimodal input data comprising DPMs, MMSE score, age and gender (Model C in Fig. 1 ), to accurately predict AD status across four independent cohorts (Table 1, Fig. 2 ). We chose these known AD risk factors because they can be easily obtained by non-AD specialists. The FCN was trained to predict disease probability from randomly-selected patches (sub-volumes) of pixels sampled from the full MRI volume ( Fig. 1 & Table S1 ). Given that this type of network accepts input of arbitrary size, application of the sub-volumetrically trained FCN could then be used to construct high resolution DPMs without the need to redundantly decompose full-sized test images."}, {"section_title": "Rapid processing of individual MRI volumes generated volumetric distributions of local AD", "text": "probabilities in the brains of affected and unaffected individuals, respectively (Figs. 3a, S1-S3).\nIn order to assess the anatomical consistency of AD suggestive morphology hot spots derived from these distributions, population-wide maps of Matthew's Correlation Coefficient (MCC) were constructed. MCC mapping enabled identification of areas from which correct predictions of disease status were most frequently derived ( Fig. 3b ), thus acting as a means to demonstrate structures most affected by neuropathological changes in AD.\nAs confirmation, average regional probabilities extracted from selected segmented brain regions ( Fig. 4 ), were highly associated with AD positive findings reported in postmortem neuropathology examinations. Specifically, these regions correlated with the locations and numerical frequency of Aβ and τ pathologies reported in available autopsy reports from the FHS dataset (n=11) ( Table S2 ). Postmortem data indicated that, in addition to predicting higher region-specific AD probabilities in individuals with disease compared to those without, proteinopathies were more frequent in cerebral regions implicated by the model in AD (Fig. 4 ).\nModel-predicted regions of high AD risk overlapped with the segmented regions that were indicated to have high localized deposition of Aβ and τ . Additionally, predicted AD risk within these zones increased with pathology scores. Given that these postmortem findings are definitive in terms of confirming AD, these physical findings grounded our computational predictions in biological evidence.\nFurthermore, DPMs provided an information-dense feature that yielded sensitive and specific binary predictions of AD status when passed independently to the MLP portion of the framework Table S3 ). Given the proportionality between age and global cerebral atrophy (17, 18) , addition of non-imaging variables at the MLP stage also allowed us to control for the natural progression of cerebral morphological changes over the lifespan.\nWe also compared performance of the deep learning models against an international group of clinical neurologists recruited to provide impressions of disease status from a randomly-sampled cohort of ADNI participants whose MRI, MMSE score, age and gender were provided. The performance of the neurologists (Figs. 5a-5b), indicated variability across different clinical practices, with a moderate inter-rater agreement as assessed by pairwise kappa (ߢ) scoring ( Fig.   5a ; average ߢ =0.493±0.16). Interestingly, we noted that the deep learning model that was based on MRI data alone (Model A; Accuracy: 0.858±0.016; Table S4 ), outperformed the average neurologist (Accuracy: 0.823±0.094; Table S5 ). When age, gender and MMSE information was added to the model, then the performance increased significantly (Model C; Accuracy: 0.963±0.013; Table S4 ). High classification performance of the deep learning model was confirmed using other metrics (Table S4) , and sub-group analyses ( Fig. S5 ). Also, we examined the model performance visually by respective clustering of AD cases and the ones who had normal cognition (NC) in a t-distributed stochastic neighbor embedding (t-SNE) (26) , which employed features from the final hidden layer of the MLP (Fig. 6 ). The t-SNE method takes high-dimensional data and creates a low-dimensional representation of that data, so that it can be easily visualized.\nIt is worth noting that our strategy represents a significant increase in computational efficiency over a traditional CNN approach to the same task (Step 1 in Fig. 1 vs Fig. S6 ). Given fixed dense layer dimensions, generation of DPMs from traditional CNNs requires not only subvolumetric training, but also sub-volumetric application to full-sized MRI volumes (Table S1 vs   Table S6 ), obligating repeated computations in order to calculate local probabilities of disease status. By circumventing this rigidity, our approach readily generates DPMs (Step 2 in Fig. 1 ), which can be integrated with multimodal clinical data for AD diagnosis (Step 3 in Fig. 1 ). As such, this work extends recently reported efforts to abstract visual representations of disease risk directly from medical images (24) , and also represents the first application of FCNs to disease classification tasks as opposed to semantic segmentation (25) . In a head-to-head comparison, the FCN model outperformed the traditional CNN model in predicting AD status, and this result was consistent across all the datasets ( Fig. S7 & Table S7 )."}, {"section_title": "Discussion", "text": "Our deep learning framework links an FCN to an MLP and generates high resolution DPMs for neurologist-level diagnostic accuracy of AD status. The intuitive local probabilities outputted by our model are readily interpretable, thus contributing to the growing movement towards explainable artificial intelligence in medicine, and deriving an individualized phenotype of insidious disease from conventional diagnostic tools. Indeed, the DPMs provide a means for tracking conspicuous brain regions implicated in AD during diagnosis. We then aggregated DPMs across the entire cohort to demonstrate population-level differences in neuroanatomical risk mapping of AD and NC cases. Critically, by the standards of several different metrics, our model displayed high predictive performance, yielding high and consistent values on all the test datasets. Such consistency between cohorts featuring broad variance in MRI protocol, geographic location, and recruitment criteria, suggests a strong degree of generalizability. Thus, these findings demonstrate innovation at the nexus of medicine and computing, simultaneously contributing new insights to the field of computer vision while also expanding the scope of biomedical applications of neural networks.\nDPMs were created by element-wise application of a softmax function to the final array of activations generated by the FCN. This step enabled the conversion of abstract tensor encodings of neuroanatomical information to probability arrays demonstrating the likelihood of AD at different locations in the brain given their local geometry. Alternatively put, the model develops a granular conceptualization of AD-suggestive morphologies throughout the brain, and then uses this learning information in test cases to assess the probability of AD-related pathophysiologic processes occurring at each region. The simple presentation of these probabilities as a coherent colormap displayed alongside traditional neuroimaging thus allows a point-by-point prediction of where disease-related changes are likely to be present. While DPMs are generated using the FCN framework, a conceptual understanding of neural networks is not warranted for their interpretation. Recent work has also demonstrated effective differentiation of AD and NC cases using a patch-based sampling algorithm (27) , but is limited by simultaneous reliance on MRI and FDG-PET as well as a model whose inputs are computed as scalar averages of intensities from multi-voxel cerebral loci. Furthermore, we believe that the broader notion of disease process mapping with deep learning has the potential to be applied in many fields of medicine. The simple presentation of disease risk as a coherent colormap overlaid on traditional imaging modalities aids interpretability. This is in contrast to saliency mapping strategies that highlight certain pixels based only on their utility to the internal functioning of a network (25) , as well as methods that highlight penultimate-layer activation values (27) . Consequently, informative anatomical information is abstracted and lost. Our work builds upon such advances by requiring just a single imaging modality en route to mapping an array of raw pixel values to a DPM that isomorphically preserves neuroanatomical information. While traditional neural networks require an input of fixed magnitude, FCNs are capable of acting on inputs of arbitrary size. Thus, the same patch-trained model was then applied to test inputs of full MRIs. This allowed the local representations of AD status learned by the model during training to be transferred to the task of predicting disease processes throughout the entire brain. Importantly, just as the input size was larger in testing, so too was the size of the output. Thus, during application of the FCN to unseen MRI stacks, the model produces two 3D matrices of activation values, which get converted to arrays of probability values by element-wise softmax application. Together, these two arrays represented spatial distributions of AD and NC probabilities, respectively.\nCertainly, limitations to the current study must be acknowledged. We considered a casecontrol population, where two sub-populations were chosen in advance that were either cognitively normal (NC) or have the diagnosis (AD). Therefore, the clinical relevance of our model is restricted to scenarios when patients are screened out for other forms of dementia or pseudodementia. While this may not be the clinical scenario faced by the majority of neurologists, who see individuals with any number of diagnoses and then must distinguish between them, certainly it is still an interesting and important clinical question. Furthermore, the circularity that MMSE tests and other demographic parameters used to determine clinical diagnosis may capture a biased diagnosis which in turn may differ across the different studies.\nConsequently, our results indicate the potential to augment standard methods of AD management via emerging computational strategies. It is also worthwhile to note that non-imaging data-based models performed better on AIBL and NACC data, while the MRI-based model performed better on the FHS data. As such, the MMSE value was a key element in the study criteria for ADNI, AIBL and NACC, and this may explain why the non-imaging data-based model performed better on these datasets. Since FHS is a community cohort, it more or less remained as a fairly unbiased dataset for analysis. Despite this study selection, our MRI-based model provides compelling evidence that use of an imaging biomarker alone can provide strong classification in a deep learning framework.\nOur approach has significant translational potential beyond AD diagnosis. Indeed, the tissuelevel changes predicted by our model suggest the prospect of directly highlighting areas of pathophysiology across a spectrum of human disease. This ability may be particularly useful in conditions where diffuse symptomologies are accompanied by insidious lesions, including non-AD dementias and cognitive conditions. Additionally, it may be of interest in future studies to determine whether the well-defined pattern of high-risk findings from the currently-presented framework may follow regions of interest from PET. In such cases, our model may aid in both noninvasive monitoring of AD development and expanding access to high quality care in resource-limited settings.\nIn conclusion, our deep learning framework was able to obtain high accuracy AD classification signatures from MRI data, and our model was validated against data from independent cohorts, neuropathological findings and expert-driven assessment. If confirmed in clinical settings, this approach has the potential to expand the scope of neuroimaging techniques for disease detection and management. Further validation could lead to improved care and outcomes compared with current neurologic assessment, as the search for disease modifying therapies continues."}, {"section_title": "Methods", "text": ""}, {"section_title": "Study participants and data collection", "text": "Data from ADNI, AIBL, FHS, and NACC cohorts were used in the study ( Fig. 2 & Table 1 ).\nADNI is a longitudinal multicenter study designed to develop clinical, imaging, genetic, and biochemical biomarkers for the early detection and tracking of AD (3). AIBL, launched in 2006, is the largest study of its kind in Australia and aims to discover biomarkers, cognitive characteristics, and lifestyle factors that influence the development of symptomatic AD (4). FHS is a longitudinal community cohort study and has collected a broad spectrum of clinical data from three generations (5) . Since 1976, FHS expanded to evaluate factors contributing to cognitive decline, dementia, and AD. Finally, NACC that was established in 1999, maintains a large relational database of standardized clinical and neuropathological research data collected from AD centers across the US (6).\nModel training, internal validation and testing were performed on the ADNI dataset.\nFollowing training and internal testing on the ADNI data, we validated the predictions on AIBL, FHS, and NACC. The criterion for selection included individuals over age 55 years, with 1.5\nTesla, T1-weighted MRI scans taken within ±6 months from the date of clinically confirmed diagnosis of AD or NC (Fig. 2 ). We excluded cases including AD with mixed dementia, non-AD dementias, history of severe traumatic brain injury, severe depression, stroke, and brain tumors, as well as incident major systemic illnesses. Note that this inclusion and exclusion criterion was adapted from the baseline recruitment protocol developed by the ADNI study (3), and to maintain consistency, the same criterion was applied to other cohorts as applicable. This led to the selection of 417 individuals from the ADNI cohort 382 individuals from AIBL, 102 FHS participants, and 565 individuals from the NACC cohort. If an individual had multiple MRI scans taken within the time window, then we selected the scan closest to the date of clinical diagnosis. For all these selected cases, age, gender and MMSE score were available."}, {"section_title": "Algorithm development", "text": "A fully convolutional network (FCN) was designed to input a registered volumetric MRI scan of size 181x217x181 voxels and output the AD class probability at every location. We employed a novel, computationally efficient patch-wise training strategy to train the FCN model ( Fig. 1 ). This process involved random sampling of 3000 volumetric patches of size 47x47x47 voxels from each training subject's MRI scan and used this information to predict the output of interest. The size of the patches was the same as the receptive field of the FCN.\nThe FCN consists of six convolutional blocks (Table S1 ). The first four convolutional blocks consist of a 3D convolutional layer followed by the operations: 3D max pooling, 3D batchnormalization, Leaky Relu and Dropout. The last two convolutional layers function as dense layers in terms of the classification task and these two layers play a key role in boosting model efficiency (25) . The network was trained de novo with random initialization of the weights. We used the Adam optimizer with a 0.0001 learning rate and a mini-batch size of 10. During the training process, the model was saved when it achieved the lowest error on the ADNI validation dataset. After FCN training, a single volumetric MRI scan was forwarded to get a complete disease probability map (DPM) was an instantaneous process taking about a second on an NVIDIA GTX Titan GPU.\nThe FCN was trained by repeated application to cuboidal patches of voxels randomlysampled from a full volume of sequential MRI slices. Since the convolutions decrease the size of the input across successive layers of the network, the size of each patch was selected such that the shape of the final output from each patch was equal to 2x1x1x1 (Table S1); i.e., the application of the FCN to each patch during training produced a list of two scalar values. These values can be converted to respective AD and NC probabilities by application of a softmax function, and the greater of the two probabilities was then used for classification of disease status. In this way, the model was trained to infer local patterns of cerebral structure that suggested an overall disease state.\nAfter generating DPMs for all subjects, an MLP model framework was developed to perform binary classification to predict AD status by selecting AD probability values from the DPMs. Fig. 1 ), and the other MLP took the 106 features along with age, gender and MMSE score as input to predict AD status (Model C in Step 3 in Fig. 1 ). All the MLP models comprised of a single hidden layer with width 64 and an output layer with size 2.\nThe MLP models also included nonlinear operators such as ReLu and Dropout."}, {"section_title": "Volumetric MRI segmentation and neuropathological validation", "text": "Cortical and sub-cortical structures from volumetric MRI scans of 11 individuals from the FHS cohort, with brain autopsies, were segmented using FreeSurfer (28) . In-built functions such as 'recon-all', 'mri_annotation2label', 'tkregister2', 'mri_label2vol', 'mri_convert' and 'mris_calc' were used to obtain the segmented structures.\nWe validated the FCN model's ability to identify regions of high AD risk by overlapping the predicted brain regions with postmortem findings. Eleven individuals from the FHS dataset had histopathological evaluations of autopsied brains, and 4 individuals out of the 11 had confirmed AD. A blinded assessment to all demographic and clinical information was conducted during the neuropathological evaluation. Detailed descriptions of the neuropathological evaluation have been previously reported (29) . For this study, we examined the density of neurofibrillary tangles field was assessed semi-quantitatively and scores ranging from 1-4 were assigned (1+: 1 NFT/field; 2+: 2-5 NFT/field; 3+: 6-9/field; and 4+: ≥ 10 NFT/field). Similarly, DP and NPL were examined in a 100× microscopic field and rated separately with scores ranging between 1-4 (1+: 1-9 plaques/field; 2+: 10-19/field, 3+: 20-32/field, and 4+: >32/field). The final determinations were made by averaging the count in 3 microscopic fields. The density of NFTs, NPLs and DPs in each brain region were qualitatively compared with the model's AD probability in that region."}, {"section_title": "Clinical validation", "text": "Nine US board-certified practicing neurologists and two non-US practicing neurologists (all referred to as neurologists) were asked to provide a diagnostic impression (AD versus NC) of 80 randomly selected cases from the ADNI dataset that were not used for model training. For each case, the neurologists were provided with full volumetric, T1-weighted MRI scan, subject's age, gender and their MMSE score for evaluation. The same parameters were used for training the model (Model C in Fig. 1) . To obtain estimates of how the deep learning model compared to an average neurologist, the characteristics of neurologist performance were averaged across the neurologists who individually evaluated each test case. More details on the neurologist approach to the ratings can be found in the Supplement. Table S6 ). Each convolution layer was followed by ReLu activations. Max-pooling layers between the convolution blocks were used to down-sample the feature maps. Nonlinear activation function, including ReLu, dropout, softmax and batch-normalization were applied on feature vectors of the dense layers. The CNN model was trained from scratch with the same optimizer and loss function as the FCN model. We used a learning rate of 0.0001 and mini-batch size of 6."}, {"section_title": "CNN model development", "text": ""}, {"section_title": "Performance metrics", "text": "We first generated sensitivity-specificity (SS) and precision-recall (PR) curves based on model predictions on the ADNI test data as well as on the other independent datasets (NACC, AIBL and FHS). For each SS and PR curve, we also computed the area under curve (AUC) values. Additionally, we computed sensitivity, specificity, F1-score and Matthews correlation coefficient on each set of model predictions. The F1-score considers both precision and recall of a test and is defined as: "}, {"section_title": "Statistical analysis", "text": "To assess the overall significant levels of differences between NC and AD groups, twosample t-test and the Chi square test were used for continuous and categorical variables, respectively. The FCN model's ability to identify regions of high AD risk was evaluated by overlapping the DPMs with postmortem histopathological findings. A subset of 11 individuals from the FHS study sample had undergone brain autopsy and were used for the analysis. In these participants, the locations and frequencies of Aβ and τ pathologies, semi-quantitatively reported by neuropathologists, were associated with high-AD risk regions. The Spearman's rank correlation coefficient test was used to determine the strength and direction (negative or positive) of the relationship between these regional AD probabilities and pathology scores. Lastly, given the widespread recognition of diffuse cerebral atrophy in the normal aging process, we performed an age-based subgroup analysis. We used the ANOVA test to determine whether age distributions differed across TP, TN, FP and FN cases obtained from the multimodal MLP model (Model C). Separate analysis was conducted across each study cohort. analysis. From there, ADNI data was split in a 2:1:1 ratio for training, validation, and testing sets, and fully trained models were applied to NACC, FHS, and AIBL to assess model generalizability. The ADNI dataset was randomly split in the ratio of 2:1:1, where 50% of it was used for model training, 25% of the data was used for internal validation and the rest was used for internal testing. The best performing model on the validation dataset was selected for making predictions on the ADNI test data as well as on the AIBL, FHS and NACC datasets, which served as external test datasets for model validation. All the MRI scans considered for this study were performed on individuals within ±6 months from the date of clinical diagnosis. "}, {"section_title": "Main figure and table legends", "text": ""}, {"section_title": "Supplementary table captions", "text": "Table S1: Summary of FCN architecture and hyperparameters for patch-wise training and full-volume application. The FCN model was trained on patches of size 47x47x47 in order to yield scalar (1x1x1) predictions of AD status from randomly-sampled sub-volumes. Each convolutional step within the network was followed by max-pooling and batch-normalization prior to passage to a leaky rectified linear unit (ReLu) activation. Channel depth, kernel size, padding, and stride hyperparameters are shown along with dropout probabilities at each step of the network. Application of the same model architecture to full-sized images yielded rank 3 tensors of size 46x55x46 that could be translated to DPMs via passage to a softmax function. Table S2 : Correlation between neuropathologic findings and regional AD probability predictions. The MRI scans were segmented to represent various brain lobes using a segmentation platform (FreeSurfer), and population-averaged regional AD probabilities were computed for each segmented region. Spearman correlation coefficients were then calculated to quantify the relationship between the regional probabilities and semiquantitative pathology scores derived from pathologist-scored densities of neurofibrillary tangles (NFT), neuritic plaques (NPL) and diffuse plaques (DP). Using this non-parametric test, the strength and direction (negative or positive) of a relationship between the regional AD probabilities and pathology scores were assessed for significance at the 0.05 level. A positive correlation was observed across the numerous pathologies across these regions, however only the NFTs in the left hippocampal CA1 region, NFTs in the right olfactory bulb, and diffuse plaques in the temporal region reached statistical significance. noted that the performance of Models A and B still displayed higher specificity and sensitivity than many of the human neurologists, all of whom used the full suite of available data sources to arrive at an impression (see Table S7 below). with clinical information from 80 randomly-selected individuals from the ADNI cohort whose disease status was masked. For each case, MMSE score, age, and gender were given. Volumetric MRIs were made available for examination using an open source platform (http://www.slicer.org). Each neurologist provided diagnostic impressions using the given materials and accuracy, sensitivity, specificity, F1-score, and MCC were calculated relative to the clinical diagnosis. Of note, participating neurologists were requested to explain their reasoning when tasked to predict AD status from collections of MRIs, age, gender, and MMSE score for a subset of individuals with masked disease diagnosis. While there was notable variation in the order in which imaging and non-imaging data were considered, the two forms of information were widely considered complementary. Focal atrophy of key cerebral regions (notably the hippocampus and temporal lobes) was considered in light of generalized ageappropriate atrophy, and imaging was broadly utilized to rule out competing etiologies of dementia such as frontotemporal degeneration and vascular disease. MMSE, often considered in the context of age, was widely employed as comparison to salient imaging features as well.\nCollectively, these perspectives speak to the importance of an integrated approach to AD diagnosis in which distinct forms of information are reconciled prior to an ultimate classification of disease status. "}]