[{"section_title": "", "text": "The first essay evaluates the effect of high-skilled immigrants in science and engineering on wages of similarly skilled U.S. natives. The extensive literature on all immigrants finds no significant impact of immigration on native wages. Empirical results cannot reject the hypothesis that immigrants and natives are perfect substitutes within the same skill group. The instrumental variable (IV) estimates show that a ten percent increase in employment due to an influx of highskilled immigrants reduces wages of natives in the same occupation by 2.8 to 4.4 percent. These results are consistent with theoretical predictions that increased labor supply puts downward pressure on wages. The second essay investigates the transferability of foreign human capital in the occupation of nursing. The immigration literature shows that the returns to foreign education are lower, though previous studies typically use indirect information on foreign education or ignore the heterogeneous nature of foreign human capital across occupations. The labor market for nurses is especially important because of the growing nursing shortage and its potentially negative impact on quality of health care. The estimates reveal that nurses who obtained basic nursing education outside the U.S. earn a premium relative to U.S.-educated nurses. In addition, immigrant nurses with only foreign education do not suffer a wage penalty. These estimates iv contrast with past research and highlight the heterogeneity in the value of foreign human capital. The results also suggest foreign education penalty in occupations with licensing requirements should be minimal. The third essay examines the immigrant-native disparity in health insurance coverage. The analysis illustrates that immigrants have lower rates of health insurance coverage, controlling for demographic characteristics, employment, income, risk attitude, and health status. Though less-educated immigrants are at a larger disadvantage than well-educated immigrants, a significant immigrant-native coverage gap still exists in the highly-educated population. Conditioning on working for an employer that provides insurance, immigrants, regardless of education level, are less likely to take up coverage. v ACKNOWLEDGEMENTS First and foremost, I would like to express my gratitude to my advisor, Donna Ginther, for her invaluable guidance and support. She has given me both the freedom to explore research independently and directions to maintain my focus. Her patience and encouragement helped me overcome the obstacles that are unavoidable in empirical research. Her faith in me was vital to the completion of this dissertation. I am forever grateful. I am indebted to Joshua Rosenbloom for insightful questions and constructive criticisms at different stages of my research. I am grateful to him for holding me to a high research standard. I am thankful to Ronald Caldwell for carefully reading and commenting on my numerous revisions. He has given me the much needed encouragement throughout the writing process. Nancy Dunton was generously patient with my endless questions regarding foreign-educated nurses. I thank her for posing challenging questions about the data and valuable input. I am grateful to ChangHwan Kim for his kind comments and time in reviewing the three essays. His expertise on high-skilled immigration has undoubtedly improved this dissertation. My gratitude is also extended to Lisa Barrow, Luojia Hu, and Madeline Zavodny, who have offered immense encouragement and helpful suggestions on my first essay. Michael Fox has been a superb mentor and continued to provide thoughtful comments on my third essay even after he left Kansas. I am grateful to Teri Chambers, Michelle Huslig Lowrance, and Leanea Wales for their support and assistance throughout my graduate study. I also want to thank Neal Becker, whose teaching and encouragement inspired me to pursue my degrees in economics. I am thankful to a number of friends and colleagues who were supportive and understanding. Vic Valcarcel, Hajar Aghababa, Aneeqa Aqeel, Sarah Frazelle, and Angela Rojas were always there to listen and gave me useful comments. Most importantly, none of this would have been possible without the love and patience of my family. Naty provided unending encouragement and support throughout this endeavor. I would like to express my gratitude to my parents, Frank Huang, Helen Lee, and Conni Rush, my aunt, Sophie Lee, my uncle, Roger Lee, and my cousin-in-law, Romsai Boonyasai."}, {"section_title": "Introduction", "text": "Immigration has long been a much debated subject in the United States. However, both academic research and policy discussions thus far have focused on the low-skilled and undocumented populations. The U.S. has received a large influx of skilled immigrants due to the shortages of information technology (IT) workers and hospital nurses. In fact, these shortages prompted changes in immigration policies in the late 1990s, including the increase in H-1B visas and the creation of H-1C visas for foreign nurses. Yet, skilled immigration has received limited attention in past studies. In a different debate, illegal immigration has stirred controversy in the discussion of expanding health insurance coverage. There is little mention of high-skilled immigrants, who are generally legal, in health policy research. This dissertation fills these gaps in the literature by examining skilled immigration in the context of labor and health economics. Using high quality data sets, this dissertation pursues three questions on immigration. First, what is the wage impact of high-skilled immigrants on U.S. workers? Second, does foreign human capital in nursing earn a lower return in the U.S.? Finally, does the immigrant-native health insurance disparity exist in the high-skilled population? These questions are answered in three separate essays in this dissertation. The first essay estimates the effect of skilled immigration on the wages of competing U.S.-born workers. The small number of studies on high-skilled immigration focus on immigrants' innovation and do not examine their wage impact. This essay makes three contributions to the immigration literature. First, the paper examines the wage consequences of immigration in the college-educated population. Second, two econometric methods, including a new instrumental variable, are applied to the research question. Third, the analysis is based on a rich dataset on the nation's scientists and engineers, which contains more detailed information on individuals and includes more recent immigrants than other commonly-used datasets. The study has implications for immigrations and educational policies. Understanding the wage effect of immigration in various high-skilled occupations may help draft better-informed policies on the admission of high-skilled immigrants and incentives for domestic students to pursue a career in certain occupations. The second essay examines another type of skilled immigrants-foreign-educated nurses (FENs). The increased recruitment of foreign-trained nurses in U.S. hospitals has raised some concerns. Opponents argue foreign education in nursing may be of inferior quality, and foreign nurses with inadequate training will provide lower quality of patient care. This study investigates whether foreign-and domestically-trained nurses are viewed as equivalents by U.S. employers by estimating the international transferability of human capital in nursing. The nursing occupation is unique because of its licensing requirement and high degree of unionization. Both labor market institutions increase and compress wages within an occupation, and may result in a smaller wage gap between U.S.-and foreign-educated nurses. This essay contributes to the literature on the returns to foreign human capital in three key ways. First, the study takes into account the heterogeneity in the labor market by focusing on a specific occupation. Second, the dataset contains precise information on the location where human capital was acquired. This information allows me to distinguish between individuals with only foreign education and those with both U.S. and foreign education to avoid bias in the estimated returns on foreign education. Finally, important institutions in the labor market, including unions and occupational licensing, are examined. If foreign human capital in nursing is highly transferable, recruiting licensed nurses from abroad could be one way of temporarily addressing the shortage of hospital nurses. Immigrants have increasingly become the focus of policy debates to expand insurance coverage. The third essay examines the immigrant-native disparities in health insurance coverage and aims to address two limitations in the literature. First, the study profiles a group of individuals that have been overlooked-highly-educated immigrants-by examining the immigrant-native insurance disparities for different education levels. Second, the analysis takes into account an individual's risk attitude and examines whether health risk behaviors play a different role in explaining the insurance rates in the college-educated and less-than-college populations. The study seeks to understand whether there is a gap between immigrants and natives, and how the gap differs between college-educated and less-educated populations. Furthermore, the essay examines how employer-sponsored insurance can help to explain the immigrant-native gap. Finally, the differential in insurance take-up rates is analyzed. Because it is commonly believed that immigrants' lower coverage rates have resulted from their lower levels of education, income, and English proficiency, examining college-educated immigrants provides a much needed analysis with policy implications. Specifically, serious public concern is warranted if highly-educated immigrants, who have more income and are fluent in English, remain uninsured. This dissertation is organized into five chapters, including the introduction. Chapter two analyzes the wage consequences of high-skilled immigration. The third chapter examines the international transferability of human capital in nursing. Chapter four investigates the health insurance coverage disparities between immigrants and natives. The final chapter provides a summary of findings and discusses policy implications. give hiring priority to U.S. workers over H-1B visa holders. This paper is the first to employ multiple approaches to examine the effect of recent high-skilled immigration on wages of similarly skilled native workers. I estimate the elasticity of substitution between high-skilled immigrants and natives and cannot reject the hypothesis of perfect substitution. In addition, I employ an instrumental variable (IV) approach and find that a ten percent increase in employment due to an influx of 5 high-skilled immigrants reduces wages of natives in the same occupation by 2.8 to 4.4 percent. However, increased supply of immigrants in engineering, computer and mathematical sciences has limited impact on wages of native workers in these occupations, implying the strong growth in labor demand offsets negative wage effects. This analysis indirectly examines the impact of the 1998 increase in H-1B visas by comparing estimates in occupations targeted by the policy change with those in occupations unaffected by the visa increase. Altogether, the estimates in this study are consistent with theoretical predictions that increased labor supply puts downward pressure on wages, though increased labor demand can mitigate adverse wage effects."}, {"section_title": "II. Literature", "text": "Most papers on the effect of immigration take one of the two approaches: the national approach and \"area studies\". The national approach typically relies on a Constant Elasticity of Substitution (CES) production function and estimates the elasticity of substitution between immigrants and natives. Researchers then simulate the model to calculate the wage effect of immigration on different groups of native workers based on this coefficient.  hereafter, BGH) find foreign-born and native workers are perfect substitutes and their simulations show immigrants lower wages of natives. However, others using simulation methods argue that immigrants and natives are not close substitutes; therefore immigration does not reduce wages of native workers. Ottaviano and Peri (2008;hereafter, OP) find evidence of imperfect substitution and conclude that the 1990-2006 immigration increase has only small negative effects on native U.S.-born workers in the short-run and positive effects in the long-run. Peri and Sparber (2009) develop a general equilibrium model of comparative advantage in task performance to evaluate the effects of immigration on less-educated natives. They show that 6 inflows of less-educated immigrants have negative but very small effects on similarly educated natives. Research based on the national approach thus far has found mixed results. Rather than looking at the effect of immigration nationwide, the \"area studies\" approach examines the effect of immigrants on the local economy. Instead of measuring the degree of substitution, these papers perform reduced-form estimates to study the correlation between the increased number of immigrants in an area and wages in the same area. Some papers use a similar methodology to examine the relationship between immigration and wages in different education and occupation groups. Most studies find no significant negative effect of increased immigration on natives (Altonji and Card 1991;Butcher and Card 1991;Card 1990Card , 2001Card , 2005Card and DiNardo 2000;Grossman 1982). This empirical finding contradicts economic theory, which predicts immigrant inflows will harm labor market outcomes of natives provided immigrants and natives are substitutes in the production function. As noted by Borjas (2003), the estimated effect of immigration on native wages \"cluster around zero\". However, a few studies find small effects of immigration. Jaeger (1996) concludes that immigration depresses the wages of native high school dropouts by three percent. Schoeni (1997) shows that the five percentage point increase between 1970 and 1990 in the share of foreign-born workers has led to a decline in the weekly wages of high school dropouts of at most ten percent, but the effect on the overall economy is found to be insignificant. Orrenius and Zavodny (2007) analyze the effects of immigration on natives separately for professionals, service workers, and manual laborers. Using occupation as a proxy for skill, they find negative effects of the increase in foreign-born workers on natives in blue collar occupations after controlling for endogeneity. These results do not hold for professionals or higher-skilled workers. Borjas (2003) shows the impact of immigrant share on native weekly and annual earnings is negative across education groups. More specifically, his results indicate immigration between 1980 and 2000 increased the labor supply of working men by eleven percent, and wages fell by 8.9 percent for high school dropouts, 2.6 percent for high school graduates, 0.3 percent for those with some college education, and 4.9 percent for college graduates. Literature on immigration generally finds very small, if any, negative wage effects among high-skilled workers. While the majority of the immigration literature either looks at immigrants as a homogeneous group or focus on low-skilled workers, a few exceptions in this extensive literature specifically examine the effect of high-skilled immigrants. Borjas (2005) shows that a ten percent immigration-induced increase in the supply of doctorates lowers the wage of similarlyskilled workers by about three percent. Peri and Sparber (2008) find that immigrants with graduate degrees specialize in occupations demanding more quantitative skills and that similarly educated natives respond to immigration by choosing new occupations with less analytical and more communicative content. Although advanced degree holders are an important part of the high-skilled labor market, they constitute less than half of this labor market. By looking at highskilled immigrants based on a more general definition, the findings in this study will have broader implications. High-skilled immigrants in science and engineering (S&E) have attracted some recent attention. A small number of papers document the contribution of foreign-born scientists and engineers. Lowell et al. (2007) show that foreign students make up roughly four percent of bachelor graduates, 28 percent of master graduates, and 32 percent of doctorate graduates in the fields of science, technology, engineering, and mathematics. Wadhwa et al. (2007)  Policy-makers have actively managed the supply of high-skilled immigrants in the past two decades. Like the economic literature, the policy debate typically focuses on low-skilled immigrants. One of the few policies that target high-skilled immigrants is the American Competitiveness and Workforce Improvement Act of 1998, which temporarily increased the cap on H-1B visas issued. H-1B visas can only be issued to immigrants with at least a college degree. The annual limit on these visas was 65,000 before fiscal year 1999, and it increased to 115,000 in fiscal year 1999 and to 195,000 in fiscal year 2001. Since the late 1990s, approximately 60 percent of the visas are devoted to S&E occupations (Kerr and Lincoln 2010). This research makes three significant contributions to the immigration literature. First, I focus on high-skilled immigrants, as defined by foreign-born individuals with at least a bachelor's degree. Second, I extend the \"area studies\" approach by analyzing the effect within occupations, given high-skilled workers face more of a national labor market. Third, I use a combination of econometric techniques to examine the research question. The first method is based on the national or general equilibrium approach. I estimate the elasticity of substitution between immigrants and natives following BGH and OP. I find robust estimates using sampling and weighting schemes in BGH and OP and cannot reject the hypothesis that high-skilled immigrant and native workers are perfect substitutes. The second method is a modified \"area studies\" approach. IV estimates from individual-level regressions reveal a significant and negative effect of immigration on native wages in the same occupation, which is consistent with theoretical predictions. A new instrument, which exploits the exogenous variation in the supply of foreign-born graduates educated in a field, is introduced to correct for endogeneity in the supply of immigrants' in the relevant occupation. The remainder of the paper is organized as follows: section III describes the data and provides descriptive statistics. Sections IV and V discuss the methodology and estimates for the substitution elasticity and the effect of immigration on wages, respectively. The final section concludes.\nA large body of literature illustrates that immigrants on average are more likely to be uninsured than natives, although differences in the magnitude and contributing factors exist between subpopulations. 2 Researchers and public officials have given considerable attention to obviously vulnerable populations, including ethnic minorities, children, elderly, recent arrivals, less-educated, and the undocumented (Alegría et al. 2006;Angel, Frias, and Hill 2005;Callahan, Hickson, and Cooper 2006;Choi 2006;Guendelman et al. 2005;Huang, Yu, and Ledsky 2006;Kincheloe, Frates, and Brown 2007;Lucas, Barr-Anderson, and Kington 2003;Prentice, Pebley, and Sastry 2005;Shah and Carrasquillo 2006;Yu et al. 2006;Yu et al. 2004). In contrast, college-educated immigrants have largely been overlooked in health policy research. It is not surprising that the well-educated receive so little attention, since higher education improves one's ability to seek full-time jobs with more comprehensive health benefits. Nevertheless, highly-educated immigrants face some of the same barriers as the less-educated ones, such as limited access to government-sponsored programs. By analyzing the insurance disparity for highly-educated as well as less-educated individuals, this research paints a more complete picture of the nation's uninsured population. A crucial determinant of the demand for health insurance is an individual's degree of risk-aversion. However, most empirical studies do not include such measure due to the lack of data. There is an extensive literature on the relationship between risk and health insurance coverage. The classic adverse selection model by Rothschild and Stiglitz (1976) predicts a positive correlation between risk and coverage, where high-risk individuals purchase full insurance and low-risk individuals purchase partial insurance. Yet, empirical research on adverse selection in health insurance markets is inconclusive (Cardon and Hendel 2001;Fang, Keane and Silverman 2008;Finkelstein and Poterba 2004;Hurd and McGarry 1997). Alternative models proposed by de Meza and Webb (2001) and Hemenway (1990) show an advantageous selection equilibrium can prevail if risk-averse individuals also engage in precautionary activities to lower their risk of suffering losses. Finkelstein and Poterba (2004) point out the importance of considering the various features of insurance contracts. They find no evidence of adverse selection on the amount of payment in the event that the insured risk occurs, but there is strong evidence of adverse selection along other dimensions of the insurance contract. While economic theory provides no clear prediction on immigrants' relative risk preferences, immigrants are often perceived to be risk takers due to the high risks associated with international migration. Empirical studies, however, have not reached a consensus on whether immigrants are less risk-averse. Orrenius and Zavodny (2009) find that immigrants are more concentrated in risky jobs, defined as occupations with high injury and fatality rates, than their native counterparts. On the other hand, Bonin et al. (2009) illustrate that immigrants in Germany are generally less willing to take risks than the native population. This analysis will examine how immigrants compare with natives in terms of risk attitude, measured by risk-taking behaviors in health, and whether risk plays a different role in health insurance coverage for individuals of different education levels. Another important predictor of the demand for health insurance is an individual's health status. Several studies find immigrants are positively selected in terms of health and have more favorable health outcomes than their native counterparts (Frisbie, Cho, and Hummer 2001;Lucas, Barr-Anderson, and Kington 2003;Singh and Yu 1996;Stephen et al. 1994;Wei et al. 1996). The phenomenon is also known as the \"healthy immigrant effect\". Because of their health status, immigrants may choose not to purchase insurance. This study will examine if the \"healthy immigrant effect\" exists and incorporate health status in the covariates when analyzing the immigrant-native insurance disparity."}, {"section_title": "III. Data and Descriptive Statistics", "text": "In order to examine the effect of S&E immigration on U.S.-born workers, I use the Scientists and Engineers Statistical Data System (SESTAT). These National Science Foundation (NSF)-sponsored data contain information on employment, educational, and demographic characteristics of scientists and engineers in the United States. Only high-skilled individuals 10 educated or employed in S&E are included in the data. SESTAT is a longitudinal dataset that consists of three biennial surveys: the National Survey of College Graduates (NSCG), the National Survey of Recent College Graduates (NSRCG), and the Survey of Doctorate Recipients (SDR). 3 These surveys have the advantage of detailed information on educational background, including the fields of major and minor for a respondent's three highest degrees. Furthermore, the surveys ask about an individual's work activity on the job, in addition to his or her occupation. Information of this quality and detail is not available in other data sets. The NSCG is available in 1993NSCG is available in , 1995NSCG is available in , 1997NSCG is available in , 1999NSCG is available in , 2003NSCG is available in , and 2006. The 1993 NSCG is a special baseline survey that includes all those who had earned a bachelor's degree or higher prior  1995, 1997, and 1999 Due to a major redesign, the 2001 NSCG was not conducted. The NSRCG covers those who received an S&E degree from a U.S. institution in the two academic years prior to the survey reference date. 5 Once individuals have entered the SESTAT system through the NSRCG, they are followed as part of the next NSCG. The 2003 NSCG serves as the baseline survey for future survey cycles in the current decade, much as the 1993 NSCG did. 6 The 2003 NSCG was constructed from the 2000 Census Long Form. Individuals in the 2003 NSCG and NSRCG are included in the 2006 NSCG. In addition to having detailed information on education and work activities, SESTAT has the advantage of a large sample size and repeated observations. Frequently used data sets such as the Census Public Use Micro Samples (PUMS) do not follow individuals over time. Moreover, SESTAT is a more-representative sample of recent immigrants since new graduates are added to the data every survey year. 7 The sample used in the study excludes part-time and self-employed workers and those above age 65 or who have worked more than forty years. 8 Individuals with missing earning information and those with real weekly salary less than half of the minimum wage are excluded from the sample. 9 Table 1 provides weighted descriptive statistics for the variables used in the study from the 1993-2006 SESTAT. The third column contains p-values for test of significant difference between immigrants and natives. Mean values for immigrants and natives are significantly different at ten percent in all except mathematics, aerospace, and industrial engineering occupations. Compared to native workers, foreign-born workers are older, more experienced, more likely to be male, Asian, Hispanic, married, and have a master's or a doctorate degree. Immigrants are less likely to live in the Midwest and the south. High-skilled immigrants earn a higher salary than natives on average. The descriptive statistics in Table 1 indicate high-skilled  12   immigrants are considerably different from immigrants as a whole, since immigrants on average are found to be less educated and earn less than native workers (Borjas 1995;Bucher and DiNardo 2002;Chiswick 1978). Table 2 displays distribution of workers across occupations and highest degree fields as well as the share of immigrants present in each group. The share of foreign-born workers varies quite significantly across occupations, ranging from 6.6 to 27.1 percent (Column 2). Immigrants are concentrated in more technical fields, such as computer, information, and biomedical sciences, physics, chemistry, and electrical engineering. The share of immigrants exceeds twenty percent in each of these occupations. Teaching, social services, psychology, and environmental sciences occupations contain less than seven percent of immigrants. In terms of education fields, the presence of immigrants is also higher in computer sciences and engineering (Column 4). are much more likely than natives to be a programmer and less likely to be a manager or supervisor. Table 2 and Figure 1 indicate immigrants and natives sort into different fields of employment and types of work, suggesting the possibility of imperfect substitution between the two groups. This hypothesis will be formally tested in the analysis.\n\nThis research utilizes data from the 1998-2006 waves of the NHIS. 3 The NHIS is a nationally representative annual survey of the non-institutionalized population residing in the  Table 1 presents descriptive statistics of insurance status, risky behavior, and selected socio-demographic variables by education level and nativity in the pooled 1998-2006 NHIS. Columns 1 and 2 display means for natives and immigrants with less than college education, whereas Columns 3 and 4 contain characteristics of natives and immigrants in the collegeeducated population. In the less-educated sample, immigrants are more than twice as likely to be uninsured than their native counterparts. In fact, 40 percent of less-educated immigrants reported to be currently uninsured. Immigrants are also much less likely to have private insurance. A few socio-demographic characteristics stand out from the table. Immigrants are younger, more likely to be married, have a larger size of family and lower family income, more likely to be Hispanic or Asian, and employed by private companies. There is some evidence of healthy immigrant effect in the less-than-college sample, since immigrants are more likely to report being in excellent health. Foreign-born persons represent 13.3 percent of the non-elderly college-educated sample. Consistent with findings in previous studies, immigrants are much more likely to be uninsured. More precisely, 13.2 percent of college-educated immigrants have no health insurance, compared to only 6.2 percent of natives. In addition, immigrants are less likely to have private insurance. Immigrants are more likely than natives to be unemployed, outside of the labor force, less likely to work for the government, and have lower family income. The aforementioned factors may contribute to college-educated immigrants' lower rate of insurance. Contrary to existing literature, the \"healthy immigrant effect\" is not evident in the this population. The descriptive statistics indicate immigrants are less likely to report having very good or excellent health status. Contrary to common perception, the table reveals some evidence that immigrants are less risk-loving, measured by health risk behaviors. In the less-educated sample, immigrants are more risk-averse than natives, since they are less likely to smoke and drink heavily. On the other hand, college-educated immigrants are less risk-loving in terms of heavy drinking, but are similar to their native counterparts in terms of smoking. Additionally, Table 1 demonstrates that collegeeducated and less-educated immigrants have distinct characteristics. For instance, collegeeducated immigrants are much more likely than less-educated immigrants to be white or Asian, work for the government, have higher family income, and report being in good health (Columns 2 and 4). Given these differences, it is more appropriate to examine the immigrant-native insurance gap separately in the college-educated and less-than-college populations. The next section describes the health insurance purchase decision and analyzes the immigrant-native disparity in health insurance using a series of probit regressions."}, {"section_title": "IV. Elasticity of Substitution between Immigrants and Natives", "text": "I begin the analysis by estimating the elasticity of substitution between immigrants and natives, which is a key determinant of the wage impact of immigrants. Holding capital constant, an increase in the supply of immigrants will depress wages of natives if the two groups are close substitutes. As mentioned earlier, empirical results on the immigrant-native elasticity of 13 substitution in the literature are mixed. In fact, BGH and OP use the same approach and data set yet have found opposite results using slightly different sampling and weighting methods. Adopting a multi-level nested CES production function, the model assumes immigrant-native relative average wages to be a function of relative labor supply and relative demand. 10 The model yields the following reduced form equation: ( , can be estimated by regressing log relative average wages on log relative hours worked and fixed effects, including education, experience, year fixed effects, and their interactions to proxy the last term in equation 1. The hypothesis that immigrants and natives are perfect substitutes is tested by examining whether the coefficient on log relative hours equals zero, which implies infinite elasticity of substitution. Since BGH and OP have found contradicting results using slightly different samples and weights, I test for robustness in the high-skilled population following the sampling and weighting methods described in both papers. In calculating the relative wages, BGH include the entire 14 sample, while OP restrict the sample to be the same as that for calculating the relative supplies. Though both papers restrict the sample to workers with positive work hours and salary, BGH further exclude self-employed workers. BGH limit the sample to persons who are between 18 and 64 years old and whose potential experience range from one to 40 years. However, OP do not impose an upper limit on age. The weighting methods differ as well. BGH use the inverse of the variance of the dependent variable, whereas OP use simple cell-size as the analytic weights. 11 To correct for potential endogeneity in relative foreign-native hours worked, an instrument variable regression approach is used. Following BGH and OP, I instrument relative hours worked with relative employment, or relative number of workers, in the relevant population. The instrument is expected to be positively correlated with relative hours, although its exogeneity is not discussed in BGH nor OP. As in their research, each specification is estimated for the pooled sample and by gender. Relative to BGH and OP, the definition of skill groups in this study is more precise, since I further disaggregate high-skilled workers into three education groups, which are bachelor's, master's, and professional or doctorate degree recipients. 12 In addition, the measurement error in years of experience in their studies is likely larger because the actual age at graduation is unknown. In this research, work experience is proxied by the difference between the survey year and the year when an individual's highest degree was obtained. I estimate the elasticity of substitution using the pooled 1995, 1997, 1999 11in BGH (2008) for their definition of weights. 12 Doctorates refer to degrees such as PhD, DSc, EdD. I group doctorates and professional degrees because professional degrees include JD, LLB, MD, DDS, etc. An MBA is considered a master's rather than professional degree. 13 Information on hours and weeks worked is not available in 1993; therefore the 1993 SESTAT is excluded from this analysis. 15 relative hours and a constant term (Column 1). Then various combinations of fixed effects are gradually added to this specification to capture labor demand shocks (Columns 2 to 6). In addition to the five specifications in OP, I include another specification with only year fixed effects. In the pooled sample, the WLS and IV coefficients are not significant across six specifications (Panel A). Contrary to results based on the entire labor market in BGH and OP, parameter estimates in this analysis are not sensitive to minor changes in sampling and weighting methods. These robust estimates imply the hypothesis of perfect substitution cannot be rejected in the pooled sample. In the male-only sample, however, the inverse elasticity of substitution is sensitive to the choice of sampling and weighting methods. The WLS coefficients are not significant under the OP method but are significant in two specifications following BGH (Panel B, Columns 4 and 6). The results imply the hypothesis that foreign-and U.S.-born men are perfect substitutes cannot be rejected using the OP methodology, though there may be very weak evidence of imperfect substitution between male immigrants and natives following the BGH method. In the sample of women, the inverse elasticity of substitution is negative and significant in simple specifications (Panel C, Columns 1 and 2). However, including a richer set of fixed effects leads to either negative and insignificant or positive estimates (Panel C, Columns 3 to 6). Studies using the national approach typically do not explain which set of fixed effects is the most appropriate in capturing relative demand shocks. The take-away point is that a saturated set of dummies will substantially reduce the source of variation, increase standard errors, and produce insignificant estimates. Nonetheless, results reported in this table still suggest there may be some evidence of imperfect substitution between female immigrants and natives. In sum, the estimates of substitution elasticity between high-skilled foreign-born and native workers in the pooled sample are robust to minor changes in weighting and sampling methods. The results cannot reject the hypothesis that skilled immigrants and natives are perfect substitutes. If immigrants and natives are viewed as equivalents by employers, increased labor supply induced by immigration should have negative impact on wages of average native workers. Certainly there are limitations of the CES framework that need to be acknowledged. For instance, the model assumes capital does not adjust in response to immigration, which is a strong assumption. The one-country model cannot incorporate positive effects such as knowledge flows nor account for outsourcing. In addition, the exogeneity of the instrument for relative work hours, relative number of workers, is debatable. Furthermore, the insignificant coefficients in the last four specifications may be due to the inclusion of a saturated set of fixed effects. However, it remains important to address the literature by applying this widely-used approach to a new sample of data. The next section relaxes assumptions in the structural model and instead uses a reduced-form approach to examine wage consequences of immigration."}, {"section_title": "V. Individual-Level Estimation of Effect of Immigration on Wages", "text": "Group-level regressions such as equation 1  Since I am pooling multiple years of data, equation 2 Since is potentially endogenous, can only be regarded as correlation between immigration and wages unless endogeneity is corrected. If immigrants are drawn to occupations with higher wages or increasing demand, least-squares coefficient on will be biased upward. Thus the impact of immigration on U.S. wages, if negative, will be under-estimated. On the other hand, if immigrants are more likely to be in low paid occupations, as often argued in the lowskilled immigration literature, the estimated will be biased downward."}, {"section_title": "A. Construction of the Instrumental Variable", "text": "To address the endogeneity of the ratio of immigrants to natives in an occupation, I estimate IV regressions. The most frequently used instrument in the \"area studies\" literature is the stock of immigrants in the previous period, which is likely to have high predictive power for the immigrants in the current period. 15 However, this instrument may be problematic if previous immigrants are located in some areas for wage reasons that also affect the locational choice of new immigrants. Finding a suitable instrument can prove challenging. A valid instrument must not only be strongly correlated with the endogenous regressor but also be uncorrelated with the error term. In the present study, the instrument would be valid if it was a strong predictor of immigrant inflows into certain occupations and was independent of relative wages across occupations. A source of exogenous variation in the entry of high-skilled immigrants into an occupation may come from the stock of immigrants educated in a field correlated with their current occupation. This study uses the fact that many immigrants were educated in their home country to construct the instrument. Because immigrants' educational choice reflect local labor market conditions, I use the number of foreign-born individuals with a bachelor's degree in a field, whether or not they are currently in the labor force, as an instrument for the number of foreign-born individuals working in the relevant occupation. The SESTAT data allow me to map 25 majors onto corresponding occupations. Because the endogenous variable is in the form of a ratio, the instrument should also be a ratio. I instrument the ratio of immigrants to natives in occupation o in year t, , with the ratio of foreign-to U.S.-born bachelor's degree holders in field o in the same year. For instance, the ratio of immigrant to native chemists in 1995 will be instrumented by the ratio of immigrant to native chemistry bachelor's degree holders that year. The correlation between the IV and is expected to be positive because graduates in field o are more likely to find employment in the corresponding occupation o. A health sciences graduate is much more likely to find a job in the healthcare industry than in mechanical engineering. However, the correlation will not be perfect, since not all individuals find full-time employment and those who do may work outside the field of their studies. In addition, individuals may obtain graduate education in a different field and work in a field of their graduate education rather than their major in undergraduate studies. For example, many economists have a bachelor's degree in mathematics or engineering. In constructing the instrument, I assume the field of immigrants' undergraduate studies is independent of wages in the domestic labor market. I argue that immigrants' choice of college major is a response to their home labor market, which has a different wage structure than the United States. Empirical results in the literature provide little support for the theoretical prediction from simple rational expectations models that undergraduate students choose majors with high starting or average salaries. In addition, even domestic college students often lack accurate knowledge of salaries. Dominitz and Manski (1996) find significant uncertainties in high school students and college undergraduates' belief of their future earnings after completing a bachelor's degree. Betts (1994) shows fourth-year undergraduate students know notably more about salary levels than first-year students, but more than half of the learning occurs in the final year. Berger (1988) demonstrates college students do not choose majors with higher beginning salaries at the time of the choice. Instead, they are likely to choose majors with higher present value of future earnings streams. It is also worth mentioning that occupational wages change over time. In other words, the salary level in a particular occupation will be different at the time of graduation than at the time the choice of major is made. Moreover, the distribution of immigrants across undergraduate majors may reflect their comparative advantage relative to natives, which is not necessarily related to wages. For instance, immigrants may be more likely to enter math-or science-intensive majors because those skills are internationally transferable. Table 5 provides descriptive statistics on immigrants by education level. Foreign-born individuals with a bachelor's degree are substantially more likely to work outside the field of their degree (71%) than those with graduate education (49%). While this is not a surprising finding, it shows a significant probability of mismatch between undergraduate major and occupation in the sample of foreign-born bachelor's recipients. Additionally, a higher portion of immigrants with an advanced degree have obtained their highest degree in the United States, which implies they are more likely to have chosen their field of degree based on U.S. wages than immigrants with only a bachelor's degree ( Table 5, Row 2). However, the correlation is not perfect. Figure 3 illustrates the relationship between the relative supply of immigrant workers and bachelor's based on broad occupations in 1993 and 2006. In most cases the ratio of immigrant to native workers is larger than the ratio of immigrant to native graduates, though the correlation varies significantly across occupations and years. In life sciences occupations, the ratio of workers is double the ratio of graduates in 1993 but the difference is almost four times in 2006. In engineering occupations, however, the relationship between these two variables is more stable over time. The statistical significance of this correlation will be examined with identification tests in the next section."}, {"section_title": "B. WLS and IV Estimates", "text": "I use the pooled 1993-2006 SESTAT to examine the impact of foreign-born scientists and engineers on their native counterparts. I estimate equation 2for the sample of native workers using two specifications. The first row of The second row in Table 6 displays coefficients on the instrument in the first-stage. Figure 2, the ratio of immigrant-native bachelor's degree holders is positively correlated with the ratio of immigrants to natives working in the corresponding occupations. The next two rows present results of identification tests. The instrument passes the Kleibergen-Paap under-identification test with p-value less than 1%, indicating the excluded instrument is correlated with the endogenous regressor. 16 The large F-statistic implies the null of weak instrument can be rejected in both specifications."}, {"section_title": "Consistent with", "text": "Controlling for endogeneity, the IV estimates of are negative and significant in both specifications (Table 6, Row 1, Columns 2 and 4). The sign reversal between WLS and IV estimates suggests the occupational distribution of high-skilled immigrants is endogenous. The WLS results are biased upward because immigrants are more likely to choose or be employed in occupations with higher wages. The IV estimate is -0.275 in the baseline specification, which includes covariates used in most existing immigration studies (Column 2). Because work activities such as research and teaching are important explanatory variables, the estimates in the first specification and those in previous studies likely suffer from omitted variable bias. Appendix 2 contains estimates on the other covariates and demonstrates that the additional controls on work activity are significant. The IV coefficient becomes more negative once work activities are taken into account (Column 4). The IV estimates in this table imply that a ten percent increase in the ratio of high-skilled immigrants to natives in S&E lowers wages of competing natives by 2.8 to 4.4 percent. The magnitude of the negative impact is similar to that in Borjas (2003) and Borjas (2005). Most researchers recognize the difficulty in finding a valid instrument, namely, a truly exogenous variable that is strongly correlated with the endogenous regressor. The first-stage results reported in Table 6 demonstrate the instrument is not weak; however, the exogeneity assumption on the instrument cannot be tested statistically. Since it is possible that some immigrants move to the U.S. or choose their majors based on the domestic market, it is worth stressing that the IV estimates would be inconsistent if the instrument was not completely exogenous. Nevertheless, to the extent that some immigrants have obtained college education in the U.S. and may have selected undergraduate majors for the same reasons as natives, it would bias the IV estimates toward finding a positive coefficient. Thus, the negative IV coefficients in this analysis are likely upper bound estimates and may understate the adverse effect of immigrants on native wages. The next section examines the robustness of the estimates by considering various sub-samples."}, {"section_title": "C. Sensitivity Analyses", "text": ""}, {"section_title": "Robustness to Demand Shocks", "text": "The first sensitivity analysis tests the hypothesis that occupations that experienced increased labor demand are less affected by immigrant supply shocks. I perform a robustness check by estimating equation 2 The WLS estimates are positive in both sub-samples, indicating immigrants are more concentrated in higher-paying jobs within and outside of ECM occupations (Table 7, Columns 1 and 3). Interestingly, IV estimates show increased immigration in ECM occupations has no significant effect on wages of their native counterparts (Table 7, Panel A). The results suggest that native workers in the IT sector did not experience a reduction in their wages following the immigrant supply shock induced by the 1998 increase in H-1B visas, consistent with findings in Kerr and Lincoln (2010), Lowell (2001), andZavodny (2003). Panel B of Table 7 displays estimated effects of immigration on occupations outside of ECM. The negative wage effect on native workers outside of ECM is more severe than that in all occupations reported in Table 6, although the coefficient is only significant in the second specification. These estimates imply a ten percent increase in the ratio of immigrant to native workers outside of ECM reduces wages of native workers in the same occupation by as much as nine percent. The first-stage estimates indicate the relative supply of immigrant bachelor's degree recipients in a field is positively correlated with the relative supply of foreign-born workers in the corresponding occupation. As before, the instrument passes both identification tests. The results in Table 7 provide support for theoretical predictions that increased immigration reduces wages of competing natives in occupations with no labor shortage, given perfect substitution. However, increased labor demand can lessen the negative wage effects on native workers and may explain why many existing studies find little overall effect of immigration on native wages."}, {"section_title": "Gender", "text": "Next I split the sample by gender. If perfect substitution exists only among male but not female workers, as suggested by Table 3, immigration should have a negative impact on wages of male native workers and a smaller or limited effect on wages of female natives. Table 8 contains results of WLS and IV estimates of equation 2by gender. WLS estimates indicate positive correlation between the presence of immigrants and wage levels in an occupation for both U.S.-born men and women, though the correlation is higher in the female sample (Columns 1 and 3). These findings are consistent with the estimates based on the 1990 census in Borjas et al. (1996). The IV estimates indicate adverse wage effects of increased immigration on U.S.-born men (Table 8, Panel A, Columns 2 and 4). A ten percent increase in the relative supply of immigrants lowers wages of male natives by 5.3 to 6.6 percent, which is more severe than effects in the pooled sample. On the other hand, immigration raises wages of U.S.-born women by five to 6.7 percent (Table 8, Panel B, Columns 2 and 4). The first-stage estimates are positive and significant. The instrument also passes both identification tests. These estimates are consistent with the findings in Panel C of Table 3, which suggest female immigrants and natives may be imperfect substitutes. Although the elasticity of substitution between female immigrants and natives is not robust across specifications based on the national approach, simple descriptive statistics may provide further information on the degree of substitution between immigrants and natives. Figure 4 presents occupational distribution of immigrants and natives by gender. The difference between immigrants and natives is significant at 1% in all occupations. However, the gap is larger for women in five out of eight occupations-life, physical, social, health sciences, and non-S&E. Figure 5 contains the work activity distribution by gender. Similarly, the immigrant-native difference is larger in the female sample in most activities-accounting or finance, applied research, basic research, computer applications or programming, employee relations, production and maintenance, quality or productivity management, teaching, and other activity. These figures provide additional evidence supporting the claim that immigrant and native men are closer substitutes than immigrant and native women."}, {"section_title": "Age", "text": "Previous research shows that younger workers experience more rapid wage growth than older workers on average. Since the difference in growth rate of wages may influence the magnitude of wage impact of immigration, it is worth examining the effect of immigration on young and older natives separately. While previous research such as Friedberg (2001) has used 35 as the cutoff, it may not be appropriate for high-skilled workers, given that many individuals are in their 30s when they finish their graduate degree. Appendix 3 displays the age-earning profile for high-skilled workers and indicates wage growth does not slow down until age 45, which is the upper bound for younger workers defined in this analysis. One would expect little difference in the size of effect unless immigrants compete more with natives in one particular age group. It is possible that older immigrants and natives are more alike than younger immigrants and natives in terms of unobservable characteristics. Existing studies find the degrees of immigrant assimilation, measured by cultural, economic, and civic indicators, increases with the number of years spent in the host country (Vidgor 2009). Since older immigrants have lived in the U.S. for about ten more years than young immigrants on average, they are likely to be more assimilated into the American society and therefore compete with older native workers more intensively (Table 9). Furthermore, the occupational mobility of older workers may be lower, which exacerbates the negative effect of immigration. Columns 2 and 4). The estimates are consistent with the descriptive statistics presented in Table  9, which suggest older immigrants and natives may be more similar than younger immigrants and natives given that older immigrants are on average more assimilated."}, {"section_title": "Region", "text": "Next I examine the effect of immigration in different geographic regions. This robustness check estimates the local rather than national effect of immigration and is similar to area studies approach. Because immigrants are more likely to live on the coasts (Table 1), the negative effect may be more severe in these regions. Contrary to expectations, the IV estimates presented in Table 11 reveal smaller negative effects in the coastal areas. A ten percent increase in the relative supply of immigrant workers reduces wages of natives located on the coasts by 3.2 to 4.9 percent, but the coefficient is not significant in the baseline model (Panel A, Row 1, Columns 2 and 4). The negative wage effect is slightly larger (3.4 to 5.2 percent) on natives in interior areas (Panel B, Row 1, Columns 2 and 4). A potential explanation is that there is growing demand for workers on the coasts, which can ease some of the downward pressure on wages and lead to a quicker absorption of immigrants. The WLS estimates are positive in both regions, implying immigrants are more concentrated in occupations with higher pay (Columns 1 and 3). As in the other samples, the first-stage estimates are positive and significant. The instrument passes both the weak instrument and under-identification tests."}, {"section_title": "Alternative Definition of", "text": "Since the stock of immigrants, including those who are outside the labor force, may affect wages of U.S. natives, I estimate the wage effect of immigrants using an alternative measure of immigration as a robustness check. More specifically, I redefine based on the full sample rather than only workers so is the ratio of all immigrants to natives in occupation o in year t. Because of the high quality data, I am able to proxy potential occupation of individuals outside the labor force using their field of study. The WLS estimates presented in Table 12 suggest immigrants, including those outside of the labor force, are drawn to higher-paying fields (Columns 1 and 3). The IV estimates imply a ten percent increase in the relative supply of immigrants potentially working in an occupation reduces wages of natives working in that occupation by 2.4 percent to 3.8 percent (Row 1, Columns 2 and 4). The IV passes the weak instrument and under-identification tests in both specifications. Note the estimates in Table 12 are quite similar to those in Table 6, which indicates the estimates are not sensitive to the inclusion of non-workers in the construction of immigrant concentration in an occupation."}, {"section_title": "Accounting for Occupation Outflows", "text": "A major criticism of area studies approach is that natives may migrate out of an area in response to increased immigration locally and thus the overall effect of immigration may be biased downward. I argue that high-skilled workers have greater geographic than occupational mobility in the short-run; however, the negative wage effects on natives may be mitigated by their outflows from lower paying and in-migration to higher paying occupations. I address the concern of native outflows by excluding observations with occupation changes. Specifically, observations with an occupation that is different from the last period are excluded. The restriction decreases the sample size from 246,553 to 213,735. Table 13 contains WLS and IV estimates of the effect of immigration on wages of natives who did not change occupation in the sample. The WLS estimates are positive and significant as in the other samples (Columns 1 and 3). The IV estimates are negative, ranging from -0.44 to -0.31, which suggest a ten percent increase in the ratio of immigrants to natives lowers native wages in the same occupation by 3.1 to 4.4 percent (Row 1, Columns 2 and 4). The point estimates here have a smaller range than those based on the full sample in Table 6, but the results are quantitatively similar. The first-stage estimates are positive, indicating a positive correlation between relative supply of immigrant graduates in the field and the relative supply of immigrants working in the corresponding occupation. In both specifications, the IV passes the weak instrument and under-identification tests. If native workers change their occupation to avoid wage cuts caused by immigration, the estimated wage effect based on the full sample of natives will be biased upward and the negative effects will be biased downward. Unlike in most area studies, I am able to observe mobility of individuals in the data set and test the robustness of the results by excluding occupation changers. The results in Table 13 demonstrate the estimated wage impact of immigration on native workers is not sensitive to the assumption of zero occupational mobility."}, {"section_title": "VI. Conclusion", "text": "Despite the large amount of research on immigration, there is no consensus regarding its wage consequences. This study sheds new light on the effect of immigration in the United States by focusing on the high-skilled labor market, using a rich data set on scientists and engineers, exploiting cross-occupation variation in immigration, and incorporating a new instrumental variable. I find a negative and significant impact of immigrants on the wages of high-skilled native workers between 1993 and 2006. This analysis begins with the widely-accepted general equilibrium model and estimates the elasticity of substitution between immigrants and natives. Assuming a multi-level nested CES production function, empirical results fail to reject the null hypothesis that high-skilled immigrants and natives are perfect substitutes within the same education-experience group. One would expect immigrants to lower wages of natives, given perfect substitution. The second method uses a reduced-form approach to gauge the effect of increased immigration on wages. Using a new instrument, the ratio of foreign-to U.S.-born bachelor's degree holders, individuallevel regressions find a negative and significant effect of immigration on native wages. IV estimates indicate that a ten percent increase in employment due to an influx of high-skilled immigrants reduces wages of natives in the same occupation by 2.8 to 4.4 percent. These results are consistent with theoretical predictions that increased labor supply puts downward pressure on wages. Because there is some evidence of imperfect substitution between female immigrants and natives, the effect of immigration may be less severe among women. Reduced-form estimates confirm this hypothesis and indicate increased immigration has larger negative wage effects on male native workers but does not reduce wages of female natives. This research illustrates that high-skilled immigrants should be analyzed as a separate labor market, since the high-skilled market is distinctively different from the low-skilled one. Studies that include workers of all skill levels typically find no net effect of immigration on native wages. Even papers that distinguish between high-and low-skilled usually treat all highskilled individuals as a homogeneous group. I disaggregate high-skilled workers by the type of their highest degree, because advanced degree holders in general command a higher wage than bachelor's degree recipients. This more precise definition of education groups, along with the ability to control for additional individual characteristics than were available to previous studies, allows me to estimate a more accurate impact of immigration.        Notes: The dependent variable is the log real annual salary. The regressions are weighted by SESTAT sampling weights and control for education, age group, experience, experience-squared, female, married, children, race, year, and region fixed effects. Robust standard errors are in brackets, clustered on individuals. * significant at 10%; ** significant at 5%; *** significant at 1%. The sample excludes part-time and self-employed workers and those above age 65. Workers with missing salary information and those with real weekly salary less than half of the minimum wage are excluded.   Notes: The dependent variable is the log real annual salary. The regressions are weighted by SESTAT sampling weights and control for education, age group, experience, experience-squared, female, married, children, race, year, and region fixed effects. Robust standard errors are in brackets, clustered on individuals. * significant at 10%; ** significant at 5%; *** significant at 1%. The sample excludes part-time and self-employed workers and those above age 65. Workers with missing salary information and those with real weekly salary less than half of the minimum wage are excluded. Notes: The dependent variable is the log real annual salary. The regressions are weighted by SESTAT sampling weights and control for education, age group, experience, experience-squared, female, married, children, race, year, and region fixed effects. Robust standard errors are in brackets, clustered on individuals. * significant at 10%; ** significant at 5%; *** significant at 1%. The sample excludes part-time and self-employed workers and those above age 65. Workers with missing salary information and those with real weekly salary less than half of the minimum wage are excluded. Notes: The dependent variable is the log real annual salary for individual natives. The endogenous regressor is constructed based on all individuals rather than only workers. The regressions are weighted by SESTAT sampling weights and control for education, age group, experience, experience-squared, female, married, children, race, year, and region fixed effects. Robust standard errors are in brackets, clustered on individuals. * significant at 10%; ** significant at 5%; *** significant at 1%. The sample excludes part-time and self-employed workers and those above age 65. Workers with missing salary information and those with real weekly salary less than half of the minimum wage are excluded. p-values in parentheses. Notes: The dependent variable is the log real annual salary for individual natives. The sample excludes observations with an occupation different from that in the previous period. The regressions are weighted by SESTAT sampling weights and control for education, age group, experience, experience-squared, female, married, children, race, year, and region fixed effects. Robust standard errors are in brackets, clustered on individuals. * significant at 10%; ** significant at 5%; *** significant at 1%. The sample excludes part-time and self-employed workers and those above age 65. Workers with missing salary information and those with real weekly salary less than half of the minimum wage are excluded. p-values in parentheses.    This study sheds new light on the portability of foreign education and experience by examining a specific labor market and using more precise information on foreign human capital. Using a nationally representative sample of registered nurses in the U.S., I find a small foreign education premium in nursing. The result contrasts with existing research and highlights the heterogeneity in the value of foreign human capital."}, {"section_title": "II. The Returns to Foreign Education", "text": "The finding of smaller returns on foreign human capital should arrive as no surprise. As outlined in Chiswick (1978) and Alboim et al. (2005), economic theory predicts foreign human capital will earn a lower return than domestic human capital due to a number of reasons. First, immigrants' unfamiliarity with the language and institutions of the U.S. will result in lower economic returns on their skills. Second, discrimination against immigrants in the labor market may contribute to lower value of foreign human capital. Third, the overall quality of foreign education may be lower on average. Finally, employers lack the information required to evaluate and fully remunerate foreign education and experience. A more recent study by Chiswick and Miller (2008) suggests the less-than-perfect transferability of foreign education may also be a result of mismatch between immigrants' skills and job requirements. Researchers often use the return on education for immigrants as a proxy for the return on foreign education. However, such measure is biased due to the fact that many immigrants have both foreign and domestic education. The value of foreign education will therefore be overestimated if foreign education commands a lower return than domestic education. In Chiswick's early study (1978), the return to an additional year of education is 5.7 percent for immigrants and 7.2 percent for natives. He also explores whether the lower return to education for immigrants is a result of lower return to education acquired before migration. The estimates show higher return to pre-migration education than post-migration education, which are contrary to expectations. However, his estimates may be biased because the definition of pre-and post-migration schooling, based on immigrants' age at arrival, may have substantial measurement errors. A few studies more accurately measure foreign education and typically find lower returns to foreign than domestic education. Schoeni (1997) reports that Mexican and Central American immigrants with only foreign education earn substantially less than their immigrant counterparts who obtained U.S. education. Bratsberg and Ragan (2002) use data from the U.S. censuses and the National Longitudinal Survey of Youth (NLSY) to study the effects of domestic education on earnings. They show that immigrants who acquire U.S. schooling earn higher wages than other immigrants. Furthermore, returns to education are higher for immigrants from highly developed countries and countries in which English is an official language. Using the 1993 National Survey of College Graduates and 1990 census, Zeng and Xie (2004) demonstrate that Asian immigrants who received foreign education earned about 16 percent less than those who were U.S.-educated. An important question unaddressed by these papers is whether immigrants with domestic education are comparable to natives. Kim and Sakamoto (2010)  native RNs. He finds little difference in wages of the two groups and that the increased supply of foreign RNs reduces wages of their native counterparts. It has to be stressed that the earnings differential documented in these studies is not equivalent to the returns on foreign nursing education because some foreign nurses obtained more education in the U.S. after migration. Failure to differentiate between nurses with only foreign education and foreign nurses with U.S. education will result in biased estimates of the returns to foreign education. A distinct feature of the nursing occupation is its licensing requirement. In economic theory, occupational licensing is viewed as a way to restrict entry, reduce competition, and drive up the cost of labor (Friedman 1962). Proponents of occupational licensing argue the requirement protects consumers by precluding incompetent practitioners from entering the occupation or by forcing less-competent practitioners to invest in human capital (Leland 1979;Shaked and Sutton 1981;Shapiro 1986 This essay contributes to the literature on the returns to foreign human capital in three key ways. First, the study takes into account the heterogeneity in the labor market by focusing on a specific occupation. Second, the dataset contains precise information on the location where human capital was acquired. This information allows me to distinguish between individuals with only foreign education and those with both U.S. and foreign education to avoid bias in the estimated returns on foreign education. Finally, important institutions in the labor market, including unions and occupational licensing, are examined. Altogether, this research addresses major limitations in existing studies and provides a more comprehensive analysis of the international transferability of human capital. The next section discusses the data and provides descriptive statistics. Section IV describes the empirical methodologies and reports estimates of the returns on foreign human capital. The final section concludes with a summary and policy implications."}, {"section_title": "A. National Sample Survey of Registered Nurses (NSSRN)", "text": "The sample is drawn from the NSSRN, which is conducted by Health Resources and  1988, 1992, 1996, 2000, and 2004 NSSRN to analyze the returns on foreign nursing education. For a more precise analysis, the sample is restricted to full-time workers with nonzero earnings."}, {"section_title": "B. Construction of Variables", "text": "I measure education by the type of nursing degree rather than the total years of schooling for two reasons. First, the estimated return to education measured by years of schooling is likely biased due to the presence of sheepskin effects, or wage premium for degree recipients relative to individuals with the same years of schooling but have not completed the degree (Hungerford and Solon 1987;Jaeger and Page 1996). Second, nursing degrees are not consecutive as other academic degrees. There are three typical educational paths available to any high-school graduates planning on becoming a RN-a nursing diploma, an associate degree in nursing (ADN), and a bachelor's of science in nursing (BSN). Nursing diploma programs, administered in hospitals and sometimes in conjunction with community colleges, take about three years. ADN programs, offered by community colleges and focus more on technical skills than theory, take two to three years to complete. BSN programs are four-year programs offered by universities and colleges. Though licensed graduates of any of the three programs qualify for entry-level nursing jobs, advancement opportunities may be more limited for ADN and diploma holders. A bachelor's or higher degree is often required for administrative, research, consulting, and teaching positions. 1 In order to account for the non-consecutive nature of nursing education and sheepskin effects, I allow wages of nurses to vary by the type of nursing degree rather than assuming wages increase with years of education. Based on the location of basic nursing education, years since graduation, and years since obtaining nursing license in the U.S., I define three types of nurses to examine the returns on foreign education: (1) Pure FEN: Basic nursing education from abroad; highest nursing degree completed before obtaining U.S. license. (2) Mixed FEN: Basic nursing education from abroad; highest nursing degree completed after obtaining U.S. license.   "}, {"section_title": "C. Summary of Statistics", "text": ""}, {"section_title": "IV. Empirical Analysis", "text": "\nA. Decision to Purchase Health Insurance Figure 1 presents a decision tree for individuals, starting with the decision of whether or not to work. Once an individual chooses to work, he or she can decide between working for a firm and self-employment. Next, the individual who is not self-employed may choose whether or not to work for a firm that provides insurance. Finally, a worker with coverage available through work may choose whether or not to take up coverage. Certain choices, such as not working and self-employment, will limit individuals' access to group coverage. These individuals may choose to purchase non-group plans, enroll in public coverage (if eligible), or be uninsured. The feasibility of the first two options depends on one's income level. Specifically, non-group plans may be too expensive for lower-income individuals. However, public coverage will not be available to individuals with higher income. Another option available to all individuals, including non-workers, is obtaining coverage through a family member who has access to group coverage. Preferences and constraints will influence individual decisions at each step, which will in turn determine an individual's access to the various types of insurance coverage. Taste  The decision tree illustrated in Figure 1 suggests that the probability of having insurance coverage should be a function of employment characteristics, demographic variables, risk attitude, and health status. The next section describes the empirical strategy in more detail."}, {"section_title": "A. Theoretical Framework", "text": "The human capital model provides the basis for empirical analysis in this study. The model assumes that wages are determined by an individual's education, experience, and other demographic characteristics. The standard Mincer earnings equation is the follows:  nursing. In the baseline model, which controls for education, experience, and employer setting, the return on having only foreign nursing education is 11.3 percent (column 1, row 1). The return on having U.S. in addition to foreign education is 9.4 percent (column 1, row 2). These large coefficients may reflect the wage differential between races. When demographic variables are added to the regression, the returns on pure foreign and mixed education reduce to only 3.7 percent and 6.1 percent, respectively (column 2, rows 1 and 2). Because the wages of nurses likely reflect the complexity of their jobs, the third specification further controls for 13 nursing positions, 11 unit types, and ten types of patients. 4 The returns on foreign and mixed education increase slightly in magnitude (column 3, rows 1 and 2). Finally, in order to allow wages to vary by location, the full model includes dummy variables for states, being in a MSA, and in-MSA dummy interacted with states. The returns to purely foreign and mixed education both reduce to around 4 percent (column 4, rows 1 and 2). Taken together, the positive returns to foreign education reported in Table 2 contradict with theoretical models. Economic theory predicts foreign education commands a lower return due to immigrants' unfamiliarity with the language and institutions, discrimination against immigrants in the labor market, the overall quality of foreign education being lower, employers' inability to evaluate foreign credentials, and a mismatch between immigrants' skills and job requirements. Consistent with existing studies and theoretical predictions, this analysis shows U.S. experience earns a higher return than foreign experience in the sample of nurses. Each year of U.S. experience increases nursing wages by 2 to 2.5 percent, whereas the return on foreign experience is less than one percent and not always statistically significant. The transferability of work experience from another country is often lower because many domestic employers have imperfect information on the job content and work tasks associated with a position title from abroad. Some employers may find it cumbersome to contact references who are located abroad. Furthermore, foreign applicants are disadvantaged if their recommendation letters are not written in proper English. Altogether, the estimates presented in Table 2 suggest foreign education is more transferable than foreign experience in nursing. The subsequent section aims to explain the counter-intuitive foreign education premium that is not found in the aggregate labor market."}, {"section_title": "C. Potential Explanations", "text": "There are several potential factors that might explain the absence of foreign education penalty in nursing. First, FENs may be more responsive to economic incentives and may choose to work for the employers who pay the highest wages, given the high cost of migration. Second, FENs are likely to obtain degrees with the greatest returns, following the same logic. Third,   While wages are not the highest in hospitals, the value of foreign education may be higher in hospitals than in other settings. After all, it is rational for FENs to work in a place where their education is valued the most. Next I examine the foreign education premium in more detail by estimating equation 2separately for each of the six employer settings. Each regression controls for a full set of variables as in the 4 th specification in Table 2, including types of nursing degree, domestic and foreign experience, squared terms of experience, dummies for gender, race, marital status, children, position, unit, patient types, located in MSA, and states. Table 3 presents the estimates and shows foreign education premium only exists in a hospital setting (column 1)."}, {"section_title": "FENs are more concentrated in hospitals", "text": "More specifically, the returns on pure foreign and mixed education in hospitals are 3.7 percent and 5.2 percent, respectively. The foreign education premium is higher in hospitals than in the overall nursing labor market. These estimates suggest the positive returns on foreign nursing education are at least partially driven by the foreign education premium in hospitals. Unlike the aggregate labor market, there is no foreign education penalty in the other five employer settings (columns 2 to 6). "}, {"section_title": "FENs are more likely to have a bachelor's degree", "text": "Since nurses with only foreign education are much more likely to have a bachelor's degree, the overall foreign education premium could reflect the hourly wage advantage of BSNs relative to diploma and associate degree recipients, ranging from one to two dollars (Figure 1). However, the matter is further complicated by the fact that a larger share of US-RNs hold a master's or higher degree, compared to FENs (Table 1). As illustrated in Figure 1,  The positive returns on mixed foreign and domestic education in Table 4 support the immigrant human capital investment (IHCI) model introduced by Duleep andRegets (1999, 75 2002). The IHCI model formalizes the theory of human capital transferability discussed in Chiswick (1978)  FENs from English speaking countries by 4.7 percent. Given that the literature typically shows low transferability of human capital from non-English speaking nations, it is unexpected to find foreign nurses from countries with an official language other than English experience no wage penalty. These estimates confirm the labor market of nurses is unique and suggest the foreign education premium in nursing can be largely explained by positive returns on foreign education from English speaking countries."}, {"section_title": "D. Sensitivity Analysis", "text": ""}, {"section_title": "Overtime Pay", "text": "This section examines the robustness of the estimates with respect to overtime pay. Because overtime hours are paid at a higher wage rate, hourly wages may be higher for FENs if they work more overtime. As mentioned earlier, hourly wages are constructed by dividing annual salary by the product of weeks and usual hours worked. The survey asks how many hours a respondent is scheduled to work during a week, including on-cal duty and overtime hours. Next I test the sensitivity in the estimates by excluding overtime workers. This robustness check is based only on the data in 2004, which was the first year when the information on overtime hours became available. I estimate the returns to foreign education using the full 2004 NSSRN and its two sub-samples-nurses who worked no voluntary overtime hours and those who worked no overtime hours at all. Each regression controls for work settings, types of nursing degree, domestic and foreign experience, squared terms of experience, dummies for gender, race, marital status, children, position, unit, patient types, located in MSA, and states. Column 1 of Table 7 contains estimates of the returns to foreign nursing education in 2004. Contrasting with estimates based on the 1988-2004 data, the foreign-educated do not earn a premium in the 2004 NSSRN. Eliminating nurses who worked voluntary overtime hours reduces the sample size from 17,755 to 14,735, though the returns on foreign and mixed nursing education remain statistically insignificant (column 2). Restricting the sample to nurses with no overtime hours reduces the number of observations by another 1,695 and has no effect on the significance of the returns to foreign and mixed education (column 3). This robustness check confirms there is no foreign education penalty in nursing and the estimates are not sensitive to the inclusion of overtime workers. It is worth noting that due to the limitation of the NSSRN, this analysis cannot capture the wage premium associated with working night shifts. If FENs are more likely to work night shifts, their average hourly wage will be higher than that of US-RNs. Another sensitivity analysis is needed to examine whether the foreign education premium is robust to day-night shift differential. It would be of interest for future research in the area to distinguish between day and night shifts when comparing wages of US-RNs and FENs."}, {"section_title": "Imperfect Competition in the Labor Market", "text": "The nursing occupation is unique due to its highly unionized nature. Theoretically, unions can bargain for wages above the equilibrium level; empirically, union members receive higher wages than their non-unionized counterparts. Therefore, FENs may have an overall advantage if they are more likely to join unions. Because the question about unionization was first asked in 2004, the sample in this part of the analysis is drawn from the 2004 NSSRN. Table 8 contains unionization rates for foreign-and U.S.-educated nurses and indicates pure FENs are notably more likely than other nurses to join a union. The unionization differential between FENs and US-RNs may reflect findings in existing studies that FENs are more concentrated in urban areas, where union representation is more prevalent than in rural areas (Xu et al. 2010). While the literature does not discuss the effect of unions on the relative value of foreign nursing education, it is predicted that unions would compress wage differentials within a sector. Unions may therefore reduce the gap between the returns on foreign and domestic nursing education. Although state dummies are included to capture the interstate wage differences, such as those caused by different levels of unionization, it is worth investigating whether the power of unions affects the relative return on foreign education. To examine the impact of unions on the returns on foreign nursing education, I split the sample into Right to Work (RTW) and non-Right to Work states and include a dummy variable for individual union status. Theoretically, the differential between the returns on foreign and domestic education should be smaller in non-RTW states because of higher union presence. Table 9 presents returns on foreign education in RTW and non-RTW states and does not support the theoretical prediction, since the returns on foreign education are insignificant in both samples (Rows 1 and 2). The estimates imply unions do not play a significant role in compressing the wage differential between FENs and US-RNs. As expected, union members receive a wage premium, ranging from 4.3 to 5.3 percent (Row 3). The similarity between FEN premium in RTW and non-RTW states suggests the overall FEN premium between 1988 and 2004 is likely not driven by FENs' higher rates of unionization. Another factor that may contribute to imperfect competition in the nursing occupation is the presence of monopsony. The market for hospital nurses is a common textbook example of monopsony. Specifically, it is argued that hospitals possess monopsonist power over nurses and set the wages at sub-competitive levels. Empirical results on monopsony, however, are mixed at best. On the one hand, small estimates of RN labor supply elasticities facing hospitals imply the existence of a significant level of monopsony power in the nursing market (Staiger et al. 2010;Sullivan 1989). On the other hand, some studies find hospital concentration does not affect nursing wages and conclude there is no evidence supporting the classic monopsony model (Adamache and Sloan 1982;Hirsch and Schumacher 2005). Nevertheless, these studies do not examine whether monopsony plays a role in relative returns on foreign nursing education. If FENs are willing to work for lower wages than US-RNs, hospitals' monopsony power could be strengthened. Since empirical estimates presented in this study do not suggest FENs taking lower wages, monopsony should have little or no impact on FENs' relative wages. Furthermore, given that unionization is potentially a strong countervailing force to the monopsony powers exercised by hospitals, imperfect competition likely has limited effect on estimates in this study (Link and Landon 1975)."}, {"section_title": "V. Conclusion", "text": "This empirical research analyzes the returns to foreign human capital in nursing using a In terms of implications for the literature, this study calls for caution when making generalizations about the transferability of foreign education. Future research on foreign human capital should take into account the heterogeneity in the labor market. In addition, the estimates suggest that foreign education penalty in occupations with licensing requirements should be minimal. It would be of interest to investigate the international transferability of human capital in similar occupations, such as physicians, medical technicians, and physical therapists. The research also generates important immigration and educational policy implications for the United States. The estimates provide evidence against the notion that immigrants are \"cheap labor\". At least in the labor market of nurses, the foreign-educated are not paid less than their native counterparts. Provided that foreign nursing education is highly transferable, recruiting FENs using temporary work visas may be one way of addressing the shortage in the short run. It should be emphasized that there are ethical concerns regarding recruiting nurses from developing countries that also experience a nursing shortage. The effect of FENs on native nurses' employment opportunities and career advancement, rather than wages, remains to be examined. Another solution is to increase funding for nursing education and encourage domestic students to enter the field. Furthermore, it will be helpful to draft policies to improve the hospital work environment and retain nurses in the long run. An important issue beyond the scope of this essay concerns the effect of hiring nurses from abroad on the quality of domestic patient care. In order to fully understand the impact of foreign nurses on the U.S. healthcare system, future studies should investigate whether the increased presence of foreign-trained nurses directly affects patient outcomes, such as mortality and infections."}, {"section_title": "Figure 1", "text": "Mean Hourly Wage by Highest Nursing Degree Type (1988( -2004 Note: Weighted by survey sampling weights.    Note: Robust standard errors clustered on states in parentheses. * significant at 10%; ** significant at 5%; *** significant at 1%. Each regression includes controls for types of nursing degree, squared terms of experience, gender, race, marital status, children, position, unit, patient types, in MSA, states, and in-MSA dummy interacted with states.     2009). This research aims to examine whether risk-aversion plays a different role in health insurance coverage for the highly-educated and less-educated populations. Using the pooled 1998-2006 National Health Interview Survey (NHIS), I estimate a series of probit regressions to compare the immigrant-native differential in uninsured rates for two education levels, controlling for risk preference, demographic characteristics, employment, income, and health status. In addition to current insurance status, I also evaluate the differential in take-up rates for individuals who have health insurance available at work."}, {"section_title": "B. Econometric Specification", "text": "In order to examine the immigrant-native insurance disparity and the role of risk attitude, I estimate the following equation using a probit model: 105 The probability of being uninsured is assumed to be a function of immigrant status, health status, and other individual characteristics. is a dummy variable and equals one for the foreignborn. The coefficient thus captures the difference in the probabilities of being insured between immigrants and natives. X includes age, type of highest degree, female, race, married, family size, type of employment, family income, and region of residence. The equation allows for yearto-year variation in insurance patterns by including year fixed effects, . Health status is taken into account by including dummies for having excellent and very good health. To understand the effect of risk attitude on health insurance purchases, I estimate equation (2) using a probit model: where measures the correlation between risk attitude and being insured. Given the considerable differences between well-educated and less-educated immigrants documented in Table 1, both equations are estimated separately for the college-educated and less-than-college samples."}, {"section_title": "C. Results", "text": ""}, {"section_title": "Health Insurance Disparity between Immigrants and Natives", "text": "I begin the analysis by estimating the relationship between the probability of having health insurance and immigrant status using a probit model. The first specification controls for year fixed effects, health status, and demographic variables contained in X, as described in the previous section. The intervals of family income are $15,000-$24,999, $25,000-$34,999, $35,000-$44,999, $45,000-$54,999, $55,000-$64,999, $65,000-$74,999, and $75,000+. The second specification includes measures of health risk behaviors. Table 2 reports marginal probability effects of immigrant status on having insurance coverage in the working-age population with valid family income. Columns 1 and 2 contain estimates in the less-educated sample, whereas results in Columns 3 and 4 are based on the college-educated population. Column shows estimates from the first specification and indicates the probability of an immigrant without college education having insurance is 10.9 percentage points lower than that of a native-born individual. The coefficients on demographic characteristics show that women and married individuals are more likely to have insurance. Hispanics are at a greater disadvantage, relative to other racial and ethnic groups. Perhaps due to financial constraints, the probability of being insured reduces slightly with the number of people in the family. It is expected that the type of employment has significant effects on the availability of health insurance. Government employees often have more generous benefits than those working for private companies. However, self-employed individuals do not have access to a large health plan and frequently have to purchase private coverage at a much higher cost. The unemployed and those outside of the labor force may not be able to afford private insurance. Income increases purchasing power and should be negatively correlated with being uninsured. The estimates support most of these hypotheses. Compared to workers in private companies, federal, state, or local government employees are 10.7 percentage points more likely to have coverage. The selfemployed and unemployed individuals are 22.9 and 20.4 percentage points less likely to be insured, respectively. However, those outside of the labor force are 3.5 percentage points more likely to be insured, contradicting what one might expect. One explanation is that these individuals may qualify for public assistance and are therefore covered under government programs. The demand for health insurance is a function of health status, though the effect is ambiguous (Bass 2006). Being unhealthy likely increases the demand for medical services and thus health insurance. On the other hand, individuals in poor health or those with pre-existing conditions may be denied private insurance coverage. The estimates demonstrate less-educated individuals in excellent health are 1.5 percentage points more likely to be insured, suggesting unhealthy individuals may have greater difficulty obtaining insurance. As expected, higher family income increases one's probability of having coverage. Relative to individuals with family income under $15,000, those with family income of $25,000 and above have a higher probability of being insured. Persons with family income between $15,000 and $25,000 have the lowest insurance rates, possibly because their income precludes them from public coverage yet private insurance is not affordable. Column (2) reveals that the insurance gap between immigrants and natives increases slightly from 10.9 to 11.7 percentage points, once risk-seeking behaviors are added to the model. Smokers and heavy drinkers are less likely to be insured. Since health risk factors are negatively correlated with being insured, there may be advantageous selection, as predicted by Hemenway (1990) and de Meza and Webb (2001). There is little change in the other coefficients in this specification. Column (3) contains estimates of equation (1) in the college-educated population and illustrates that the immigrant-native insurance gap is smaller than that in the less-educated sample. While education has been known to improve access to health insurance, prior research has not examined the highly-educated population. The estimates in this table suggest that college education cannot completely close the insurance gap between immigrants and natives. Most of the other covariates have similar effects on insurance rates as in the less-than-college sample. College-educated Hispanics have the lowest insurance rates. In addition, college-educated women and married individuals are more likely to have insurance coverage. The likelihood of being insured decreases slightly with one's family size. Contrasting with the estimates in the lesseducated sample, highly-educated individuals who are outside of the labor force are more likely to lack insurance. Given their higher family income, college-educated individuals probably are not eligible for government-sponsored coverage. Interestingly, insurance rates for individuals who are in excellent and poor health are not significantly different. Since the highly-educated are more likely to work for employers who offer insurance, having poor health may not preclude them from obtaining group coverage. Estimates of equation 2based on the college-educated population are presented in Column (4). The immigrant-native differential in health insurance has reduced slightly from 3.1 to 3.0 percentage points. Although educated smokers are less likely to be insured, the correlation between heavy drinking and insurance coverage is not statistically significant. These results suggest there is no evidence of adverse selection in the college-educated sample. The other coefficients remain quantitatively similar to those in Column (3). Table 2 demonstrate that, ceteris paribus, immigrants have lower rates of health insurance than their native counterparts. While less-educated immigrants have an 11 percentage points lower probability than natives to be insured, highly-educated immigrants remain vulnerable. The immigrant-native gap is around 3 percentage points in the collegeeducated sample. Risk attitude plays a somewhat different role in the highly-educated and lesseducated populations. Smoking reduces the probability of being insured in both samples, but heavy drinking only has an effect on insurance rates in the less-than-college sample."}, {"section_title": "The estimates in", "text": "The literature documents immigrants as a group are less likely to work for an employer that offers health insurance. The next section examines how employer-sponsored coverage contributes to the immigrant-native disparity in health insurance."}, {"section_title": "Employer-Sponsored Health Insurance (ESI)", "text": "To understand how ESI affects the health coverage differential, I limit the sample to workers and include a dummy variable for having health insurance available at work in each specification. The NHIS asks adult workers whether health insurance was offered to them through their work place. This question ensures a positive answer to indicate the respondent is eligible for ESI rather than simply being in a firm that offers insurance. This section of the analysis focuses on private insurance rather than combining all types of insurance, since ESI is classified as private insurance. Table 3 presents estimates of the differential in having private health insurance between immigrant and native workers from two probit models for the collegeeducated and less-than-college samples. In panel A, the sample includes all workers. The lesseducated immigrant-native differential is 5.7 percentage points in the first specification and slightly increases to 6.4 percentage points when risk measures are added (Columns 1 and 2). The estimates in Columns 3 and 4 reveal a private insurance gap of 1.9 percentage points, between college-educated immigrants and natives. As expected, having ESI significantly improves insurance coverage for both groups. The probability of workers with ESI being insured is 39 percentage points higher for the less-educated and 20 percentage points higher for the collegeeducated (Row 2). Since the disparity is notably smaller in the sample of workers, after accounting for the availability of ESI, these estimates illustrate that ESI plays a crucial role in explaining immigrants' lower rate of insurance coverage. 4 Risky behaviors again reduce the probability of having insurance for workers of both education levels, suggesting no evidence of adverse selection. It is possible that some immigrants choose not to take up ESI due to lower expected usage of medical services or imperfect knowledge of medical costs. I consider this possibility by exploring the immigrant-native differential in take-up rates. The same series of probit regressions are estimated using the sample of workers who have health insurance available at work. Panel B of Table 3 contains the results and illustrates immigrants of both education levels are less likely to take up private insurance, conditional on working for an employer that offers coverage. The gap is quite small, ranging from 0.7 to one percentage point. The difference in the ability to purchase private coverage between immigrant and natives is taken into account by controlling for income. Without including risk variables, the immigrant-native insurance gap is the same in both education levels. The inclusion of risky behaviors has no effect on immigrant-native differential in the college-educated sample but increases the less-educated gap by 0.4 percentage point. Buchmueller et al. (2007) conduct a similar analysis using workers of all education levels in the 2001 Survey of Income and Program Participation (SIPP) and find little difference in takeup rates between immigrants and natives. The estimates on take-up rates in this study provide implications for future research and suggest it would be of interest to investigate why some immigrants, including the well-educated, remain uninsured when coverage is available."}, {"section_title": "V. Discussion", "text": "The present research contributes to the growing literature on immigrant-native insurance disparities in two key ways. First, the study examines current insurance status, employersponsored health coverage, and insurance take-up rates, whereas most papers consider only insurance status. Second, the analyses are conducted separately for the highly-educated and lesseducated samples to take into account heterogeneity in the population as well as different risk attitudes between the two groups. This study brings attention to college-educated immigrants, which is a group that has been neglected in the literature due to their relatively high socioeconomic status."}, {"section_title": "111", "text": "Analysis based on the pooled 1998-2006 NHIS illustrates that immigrants of both education levels have lower rates of health insurance coverage, after adjusting for demographic characteristics, employment, income, and health status. Much of the disparity can be explained by immigrants' lower probability of working for an employer that offers health insurance, which confirms results in prior research. While the unexplained gap is small, it would be of interest for policy-makers to understand reasons behind the take-up differential. It might be helpful to consider non-financial barriers, including the availability of information regarding how to purchase insurance at work and which plan will provide adequate coverage. Risk plays an important role in insurance status for individuals of different education levels, though heavy drinking does not have significant explanatory power for insurance coverage in the college-educated sample. I find no evidence of adverse selection, since the estimates reveal a negative correlation between risk-seeking behaviors and insurance coverage. In general, immigrants are less likely to engage in risky behaviors, contradicting common belief. Immigrants have increasingly become the focus of policy debates to expand insurance coverage. The present research confirms results in previous studies and finds unexplained insurance disparities between less-educated immigrants and natives. Even though the public may not consider college-educated immigrants to be particularly vulnerable, this study demonstrates they are still more likely to be uninsured. In fact, the immigrant-native gap in take-up rates is similar in the college-educated and less-than-college populations. Because highly-educated individuals earn more than the less-educated, college-educated immigrants are often ineligible for Medicaid even if they become naturalized citizens. Outreach efforts must therefore be extended to highly-educated immigrants to encourage them to take up employer-based health insurance or purchase private insurance. Greater education, including information in non-English languages, both at the workplace and at health insurance exchanges could help immigrants understand how to obtain appropriate insurance coverage. Moreover, future policies should take into account the considerable differences in the demographic and employment characteristics between highly-educated and less-educated immigrants. The decision to purchase health insurance may differ between the two groups. Workers with higher income are actually found to be less responsive to price of health insurance (Blumberg, Nichols, and Banthin 2001). Initiatives aimed at improving insurance coverage for less-educated and undocumented immigrants, such as vouchers and tax credits, may be ineffective among highly-educated immigrants.  Notes: Marginal effects reported. Weighted by sampling weights. Robust standard errors in parentheses. Each regression also controls for age-squared, education, race, region, and year fixed effects. *** p<0.01, ** p<0.05, * p<0.1. 118 "}, {"section_title": "Figure 1 Individual's Decision to Purchase Health Insurance", "text": "Source: Adapted from Blumberg and Nichols (2004)."}, {"section_title": "120", "text": ""}, {"section_title": "CHAPTER 5", "text": ""}, {"section_title": "Conclusion and Policy Significance", "text": "This dissertation includes three essays and examines various aspects of high-skilled immigration in the United States. The research focuses on the high-skilled labor market, whereas previous studies either treat all immigrants as a homogeneous group or focus on the low-skilled. The first essay investigates the wage consequences of high-skilled immigration. The second essay evaluates the international transferability of human capital in nursing. The third essay compares immigrant-native health insurance disparities in highly-educated and less-educated populations. Another key contribution of this dissertation is the utilization of high quality data sets. Using a rich data set on the high-skilled population and incorporating a new instrumental variable based on education fields, the first essay finds a significant wage effect of collegeeducated immigrant that was not found in past studies. In the second essay, a survey of the nation's registered nurses, along with the ability to control for additional individual characteristics than are available in other data sets, allows me to estimate a more accurate return on foreign education. The analysis in the third essay is based on a data set that contains measures of risk attitude, which are found to be crucial determinants of health insurance demand. More precise estimates of insurance take-up rates are also possible due to the available details on employer-sponsored insurance. Altogether, this dissertation brings to light the value of quality data sets in empirical analysis. In the first essay, I evaluate the effect of high-skilled immigrants in science and engineering on wages of similarly-skilled U.S. natives. The extensive literature on all immigrants finds no significant impact of immigration on native wages. Using a factor proportions model, I estimate the elasticity of substitution between foreign-and U.S.-born workers with a bachelor's 121 degree or higher. Empirical results cannot reject the hypothesis that immigrants and natives are perfect substitutes within the same skill group. Because the presence of immigrants in an occupation is endogenous, an instrumental variable approach is employed to calculate the wage impact of increased immigration. I introduce a new instrument, using the fact that many immigrants were educated in their home country and chose the field of study based on their home labor market conditions. This instrument passes both the weak instrument and underidentification tests. The instrumental variable estimates show that a ten percent increase in employment due to an influx of high-skilled immigrants reduces wages of natives in the same occupation by 2.8 to 4.4 percent. These results are consistent with theoretical predictions that increased labor supply puts downward pressure on wages. However, the increased supply of immigrants in engineering, computer, and mathematical sciences does not lower wages of natives in these occupations. A series of robustness checks reveal that the effect of immigration varies across subsamples. Specifically, immigration has larger negative wage effects on male native workers but does not reduce wages of female natives. In addition, the adverse wage impact is more severe on older natives due to lower occupational mobility of older workers. Because there is growing demand for workers on the coasts, the negative wage effect is slightly larger on natives in interior areas than natives on the coasts. Finally, the estimates are not sensitive to the assumption of zero occupational mobility or the inclusion of non-workers in the construction of immigrant concentration in an occupation. The second essay investigates the transferability of foreign human capital in the occupation of nursing. The immigration literature shows that the returns to foreign education are lower, though previous studies typically use indirect information on foreign education or ignore the heterogeneous nature of foreign human capital across occupations. The labor market for 122 nurses is especially important because of the growing nursing shortage and its potentially negative impact on the quality of health care. Wage regressions reveal that nurses who obtained basic nursing education outside the U.S. earn a four percent premium relative to U.S.-educated nurses. Additionally, immigrant nurses with only foreign education do not suffer a wage penalty. These estimates contrast with past research and highlight the heterogeneity in the value of foreign human capital. The results also suggest foreign education penalty in occupations with licensing requirements should be minimal. More in-depth analysis indicates that the foreign education premium is driven by nurses from English-speaking countries and hospital nurses located in areas with severe shortages. Foreign nurses likely have a higher level of English proficiency than average immigrants, because 85 percent of FENs come from English-speaking countries. Given that proficiency in the destination language increases earnings, it is expected that the returns on foreign human capital would be higher for nurses than in the general population. The unexpected finding is that foreign nurses from countries with an official language other than English experience no wage penalty, confirming the labor market for nurses is unique. Furthermore, part of the foreign education premium can be explained by foreigntrained nurses working in cities with severe shortages, where recruiters are willing to pay higher wages. Finally, the results are not sensitive to overtime pay, even though foreign-educated nurses work more overtime hours than U.S. nurses. Estimates based on Right to Work (RTW) and non-Right to Work states suggest that unions do not play a significant role in compressing the wage differential between foreign-and U.S.-educated nurses. The third essay answers two questions on health insurance. First, does the immigrantnative disparity in health insurance coverage differ across education levels? Second, can risk attitude predict the demand for insurance? My analysis illustrates that immigrants have lower 123 rates of health insurance coverage, controlling for demographic characteristics, employment, income, risk attitude, and health status. Though less-educated immigrants are at a larger disadvantage than well-educated immigrants, a significant immigrant-native coverage gap still exists in the highly-educated population. Much of the disparity can be attributed to the differential between immigrants and natives in the likelihood of working for an employer that offers health insurance. Having coverage available through work reduces the probability of being uninsured by 20 and 39 percentage points for the college-educated and less-educated workers, respectively. Conditioning on working for an employer that provides insurance, immigrants, regardless of education level, are less likely to take up coverage. The estimates also indicate that health risk-seeking behaviors play an important role in insurance status for individuals of both education levels. The correlation between risk and insurance coverage is negative, suggesting no evidence of adverse selection. Contrary to common perception, immigrants are not more likely to engage in risky behaviors. Empirical results in this dissertation have important policy implications as the U.S. discusses the overhaul of immigration and health care systems. The first essay finds a negative effect of high-skilled immigration on wages of U.S.-born workers in certain occupations. One potential strategy may be to impose limits on work visas issued to occupations that are more adversely affected by immigration. University scholarships may be given to encourage domestic students to pursue careers in occupations that heavily rely on immigrant workers due to labor shortages. Nevertheless, restricting high-skilled immigrants to keep native workers' wages higher could mean forgoing significant benefits from immigration, including increased economic activity, knowledge flows, innovation, and diversity."}, {"section_title": "124", "text": "The second essay indicates that foreign-educated and domestically-trained nurses are viewed as close substitutes by U.S. employers. The licensing requirement provides information for domestic employers, who may otherwise have difficulty evaluating foreign credentials. Recruiting licensed nurses from abroad could be one way of filling vacant positions with qualified nurses temporarily. However, additional analysis of the relative quality of patient care provided by foreign nurses is necessary to give informed policy recommendations. Furthermore, there are ethical concerns regarding hiring nurses from developing countries that also experience a nursing shortage. The third essay suggests immigrants, regardless of education level, are less likely to have health insurance. The immigrant disadvantage in insurance take-up rates among highly-educated individuals is an unexpected finding, given that college-educated immigrants outperform their native counterparts in the labor market. Employers, practitioners, and policy makers must continue to remind highly-educated immigrants about both the benefits of obtaining health insurance and the costs of being uninsured in the long run. In total, these essays show that high-skilled immigrants are distinctively different from the low-skilled in terms of socioeconomic characteristics, human capital, and health outcomes. Therefore the separate empirical analyses and policy considerations discussed in this dissertation are justified."}]