[{"section_title": "Abstract", "text": "In 2006, a social marketing campaign was developed to increase the installation of rollover protective structures (ROPS) on unprotected New York tractors. Using data gathered from the program's hotline, the impact of price increases on farmers' interest in ROPS is examined. Pricing data were obtained for all rigid ROPS kits commercially available in the U.S. since 2006. These data were stratified into two groups of ROPS suppliers: (1) tractor manufacturers that sell ROPS for their own tractors, referred to in this study as original equipment manufacturers (OEMs), and (2) aftermarket (AM) ROPS suppliers. The trend in price increases was contrasted with the change in the consumer price index (CPI), the probability of retrofitting within quintiles of cost was estimated, and the increase in ROPS prices over time was plotted. The average price increase for a ROPS kit (excluding shipping and installation) over the six years of the study was 23.3% for OEM versus 60.5% for AM (p < 0.0001). Out-ofpocket expenses held steady for OEM versus a six-year increase of $203 for AM (p = 0.098). The probability of a farmer retrofitting dropped monotonically from 66.9% in the lowest ROPS cost quintile to 23% in the highest. If these trends continue, the proportion of inquiries resulting in a ROPS retrofit will fall below 20% by 2020 for AM ROPS. Based on other trends identified in the literature, it is reasonable to assume that decreases in ROPS installation are likely to affect the tractor owners who are most likely to need these safety devices."}, {"section_title": "", "text": "hazards in the agricultural work environment (BLS, 2012a (BLS, , 2012b (BLS, , 2012c NIOSH, 2011) . Despite the numerous risks that exist on farms, tractors have consistently remained the most frequent cause of death on U.S. farms, with overturns accounting for the highest proportion of tractor-related deaths (Murphy, 1985; Hayden et al., 1995; Myers et al., 1998; NIOSH, 2006) . Although many factors have been associated with the probability of an overturn fatality such as age of the victim, age of the tractor, commodity, role on the farm and region, the most significant association is the absence of a rollover protective structure, typically known as ROPS (Myers, 2003; Loringer and Myers, 2008; Myers, 2008; NASS, 2008; Cole et al., 2009; Myers and Hendricks, 2009 ). These structures, which consist of a rollbar or crush-proof cab and safety belt, provide a protective zone around the tractor operator in the event of an overturn and are 99% effective in preventing fatal injury (NIOSH, 1993) .\nIn a 2006 study of ROPS prevalence and overturn fatality trends, Myers and Hendricks (2009) reported a nearly 20% increase in ROPS protection (from 38% to 59%) between 1993 and 2006. In roughly the same time period, there was a 28.5% decline in overturn fatality rates. A similar relationship between ROPS protection and overturn deaths has been documented in Sweden, where overturn fatalities dropped significantly in relation to increases in ROPS protection (Thelin, 1998) . Unfortunately, 40% of U.S. tractors still lack ROPS, with higher proportions of unprotected tractors documented in the northeast (50% to 60%) (Loringer and Myers, 2008) .\nOver the past decade, considerable research has been dedicated to identifying effective ways to encourage farmers to install ROPS protection on unprotected tractors. These efforts include industry and Farm Bureau initiatives, community-level campaigns and social marketing, ROPS engineering improvements and safety programs (Murphy et al., 2010) . Although these efforts differ somewhat in their approach, most have attempted to address the pre-eminent barrier to retrofitting, that of cost (Murphy et al., 2010) .\nOne particular program, the New York ROPS Rebate Program, has utilized both promotional activities and a cost-sharing incentive to increase the installation of ROPS on farms (Sorensen et al., 2008) . The program was launched in 2006. At that time, the costsharing incentive provided 70% of the cost to retrofit up to $600. However, over the past six years, the price of ROPS has continued to increase. In order to maintain demand, the New York ROPS program has been forced to steadily increase rebate support, in the face of considerable financial challenges. The purpose of this article is to look at trends in ROPS pricing from 2006 to 2012 and to reflect on how these pricing trends are likely to impact the demand for ROPS and the success of existing ROPS installation programs."}, {"section_title": "Methods", "text": ""}, {"section_title": "ROPS Hotline", "text": "In 2006, the New York Center for Agricultural Medicine and Health (NYCAMH) launched a social marketing campaign in New York to encourage farmers to install ROPS. The program features targeted messaging and financial incentives, both coordinated through a service-oriented ROPS hotline. In the first year of the program, farmers were given a 70% rebate for the entire cost (parts, shipping, and installation) of a ROPS retrofit up to a cap of $600. In response to increases in ROPS prices, the rebate cap has increased three times over six years to its present limit of $865.\nTo participate in the rebate program, interested farmers, who are residents of New York State, can contact the toll-free ROPS hotline, where they can obtain information about the types of ROPS models available, their cost, and supplier information. Once the farmer has selected which option to purchase, the farmer contacts the hotline again to obtain approval before purchasing a ROPS. Based on discussions with the hotline coordinator (B. Bayes, New York ROPS Rebate Program Hotline Coordinator, personal communication, 9 July 2012), a farmer's decision to retrofit is thought to be based on two costs. The first is the cost of the ROPS kit plus shipping (although shipping costs are covered by some suppliers). The second is the total out-of-pocket expense, which is calculated as:\nOut-of-pocket expense = (ROPS kit + Shipping + Installation) -Rebate.\nFor subjects who purchased basic rollbars (i.e., folding ROPS; ROPS with canopies and cabs were not included in the pricing analysis) and completed the retrofit, these two costs were recorded from the invoice. For subjects who opted not to retrofit, the cost of the ROPS was based on the least expensive rollbar available, as this was by far the most commonly chosen option among farmers who retrofitted their tractors. Shipping and installation costs for those opting not to retrofit were based on the average cost for all retrofitted tractors. Thus, an out-of-pocket expense was created for any inquiry, whether or not it resulted in a retrofit."}, {"section_title": "Statistical Analyses", "text": "The mean change in retail price for all available ROPS kits, which did not include shipping and installation, was plotted annually from 2006 to 2011. As with the mean changes in retail prices, a corresponding plot of maximum prices (not include shipping and installation prices) was created. These plots were stratified into two groups:\n(1) tractor manufacturers that sell ROPS for their own tractors, referred to in this study as original equipment manufacturers (OEMs), and (2) aftermarket (AM) ROPS suppliers. OEMs are manufacturers that fabricate ROPS to fit the tractor models that they manufacture, such as John Deere and Kubota, whereas AM manufacturers, such as Saf-T-Cab and Bare-Co, build ROPS for tractor models that are produced by other manufacturers. Both OEM and AM ROPS are largely designed for tractors manufactured prior to 1985. Many of these tractors do not have ROPS since ROPS were only offered as an option at the time of purchase prior to this date. The mean change over the six years was compared between OEM and AM using 2 × 6 (manufacturers × years) analysis of variance (ANOVA).\nThe expected change in all ROPS kit prices based on the annual consumer price index (CPI) was superimposed on the graph of mean changes. These values were produced for OEM and AM by applying the CPI for each year to the price of the ROPS for 2006 to correct for inflation (2006 being the base year for adjustment).\nOut-of-pocket expenses for all inquiries (those resulting in retrofits and those not) were also plotted over the six years for OEM and AM. This change over time was contrasted between the two manufacturing types using the same ANOVA model described above.\nIn order to assess the effect of price increases on ROPS demand, graphs were also created showing the proportion of farmers who retrofitted during the program based on quintiles of ROPS price plus shipping costs and out-of-pocket costs. The proportion of farmers who completed retrofitting was compared across the quintiles using chi-square.\nLogistic regression equations to predict the probability of retrofitting over time were fit to the AM and OEM suppliers. In addition, a regression was fit for both groups combined to predict the probability of a retrofit as a function of both year and the cost of the ROPS kit plus shipping. This equation was then used to contrast the number of predicted retrofits based on the actual cost increase over time versus the predicted number of retrofits had the cost increase followed the change in the CPI. Figure 1 shows the average increase in ROPS kit prices between 2006 and 2011 as well as the change that would have been a result of inflation alone (AM CPI and OEM CPI). The difference between OEM and AM in the trend of average price increase (not adjusted for inflation) over time was significant by ANOVA (p < 0.0001). This was due to a change in AM from $849 to $1,363 from 2006 to 2011 versus a change from $491 to $605 in OEM. As shown, the change in OEM was similar to what would have been predicted based on the CPI, whereas AM greatly exceeded this expected change."}, {"section_title": "Results", "text": ""}, {"section_title": "Analyses of Price Changes Based on All Commercially Available ROPS Kits", "text": "The use of means obscures the fact that the maximum ROPS kit prices for some tractor models have become inordinately expensive (not adjusted for inflation). As shown in figure 2, the maximum AM ROPS kit price in 2006 was $1,276. By 2011, the maximum AM ROPS kit price was as high as $2,500."}, {"section_title": "Analyses Based on New York ROPS Rebate Program Inquiries Database", "text": "Comparison of out-of-pocket expenses over time (not adjusted for inflation) between OEM and AM also showed a group × time interaction that approached, but did not reach, significance (p = 0.098) ( fig. 3 ). This interaction was characterized by essentially no change in OEM (from $263 in 2006 to $260 in 2012) versus a large increase in AM (from $461 in 2006 to $664 in 2012). This reflects the program's periodic decisions to increase rebate amounts to partially compensate for ROPS price inflation. For the years 2007, 2008, 2009 , and 2012, ROPS rebate amounts were $600, $703, $765, and $865, respectively. There was a limited decrease in the proportion of inquiries resulting in retrofits as a function of ROPS plus shipping cost between the second and fourth quintiles (not adjusted for inflation). However, the decrease in the proportion of inquires was more extreme in the first and fifth quintile. This decrease extended from 66.9% retrofitting in the lowest quintile ($0 to $663) to 23.1% in the highest quintile ($1,197 to $3,645) . This overall trend is significant by chi-square (p < 0.0001) ( fig. 4) .\nThe percentage of inquiries resulting in retrofits as a function of out-of-pocket expenses (not adjusted for inflation) is depicted in figure 5 . As illustrated in the figure, after dropping between the first and second quintiles, the percentage of inquiries plateaus from the second to the fourth quintiles before dropping again between the fourth and fifth quintiles. This trend was also significant by chi-square (p < 0.0001) ( fig. 5 ).\nThe overall proportion of inquiries resulting in retrofits for AM declined from 43.5% in 2006 to 20.0% by 2012, a percent decrease of 54.0%. The corresponding decrease over the same period for OEM was from 82.1% to 46.5%, a percent decrease of 43.3%. However, the changes in the proportion of inquiries fluctuated from year to year, as shown in figure 6 .\nThe slope of the regression lines to predict retrofitting as a function of intake year were negative for both OEM (-0.1477, p = 0.0004) and AM (-0.0631, p = 0.0846). From these regressions, it is predicted that, if this overall trend continues, the proportion of inquiries for OEM that will result in actual retrofits will drop to 20.5% by 2020. For AM, it is predicted that this proportion will fall to 18.8% by 2020.\nThe logistic regression to predict the probability of a retrofit based on intake year and ROPS kit plus shipping cost for the two groups combined showed a significant slope for ROPS kit cost (-0.00178, p < 0.0001). However, the slope for intake year was not significant. Using this equation, it was predicted that, had the price increase followed the change in the CPI, an additional 90 inquiries would have resulted in retrofits."}, {"section_title": "Discussion", "text": "Although several barriers to ROPS installation have been identified in the agricultural safety and health literature, cost has been one of the most consistently and prominently featured barriers (Struttmann et al., 2001; Hallman, 2005; Sorensen et al., 2006; Sorensen et al., 2008) . As the data from the New York ROPS hotline indicate, the relationship between cost and demand is highly significant. As illustrated in figure 5, most program participants were unwilling to pay more than $600 in out-of-pocket expenses to retrofit. Customer satisfaction surveys taken with participants of the New York program support this assumption, with 87% stating that their ideal out-of-pocket cost was $600 or less.\nSeveral recent publications examining the presence of non-ROPS tractors on U.S. farms indicate that economics is a strong predictor of the presence of ROPS. Myers (2010) stated that \"the prevalence of non-ROPS tractors becomes higher as the farm's economic activity and status become more limited.\" Using information gathered from the 2002 Census of Agriculture, Myers (2009) identified similar associations, i.e., lower ROPS prevalence on small farms, on farms with limited income, on farms with few hired workers, and on farms with older tractors. Unfortunately, the price of ROPS has risen considerably in the past six years, especially for AM ROPS. Although shipping costs on average increased over this same period (from $76 to $140), the $60 price increase is marginal when compared to increases in ROPS pricing. These AM price increases are significantly higher than those for OEM tractors and higher than would be expected by predicted inflationary increases (CPI) for the same time period. As indicated in figure 2, the maximum price for just the AM ROPS kit has doubled in the past six years, with some ROPS kits costing $2500. This price is four times what most farmers seem willing to pay.\nDespite periodic increases in rebates offered by the New York program, farmer's outof-pocket costs for AM ROPS have continued to climb from 2006 to 2011. With limited funding from state or private donors, it will be difficult, if not impossible, to continue to increase rebates to adjust for the increasing expense of AM ROPS.\nThese price increases have already impacted the demand for AM ROPS, with the proportion of inquiries resulting in retrofits steadily dropping since 2006. According to the New York Program Hotline Coordinator, roughly 60% of tractors retrofitted through the program are OEM tractors (John Deere or Kubota) (B. Bayes, New York ROPS Rebate Program Hotline Coordinator, personal communication, 30 August 2012).\nBased on trends identified in our analyses of both ROPS kit pricing and the demand for ROPS, the proportion of inquiries resulting in retrofits through the New York program is predicted to drop to roughly 20% by 2020. Although this decline is steeper for AM ROPS, the OEM price increases seen since 2009 will eventually impact this group of tractor owners as well.\nAccording to data gathered in Sweden over the past few decades, the rate of overturn fatalities varies little for ROPS prevalence rates ranging between 40% and 75%. When ROPS prevalence rates exceed 75%, overturn fatality rates approach zero (Springfeldt, 1996; Springfeldt et al., 1998; Thelin, 1998) .\nBased on ROPS prevalence trends in the U.S., ROPS prevalence is predicted to reach 75% nationally by 2015. However, in areas where slower increases in ROPS prevalence have been documented, such as the Midwest and Northeast, this level is not predicted to be reached until 2020 or beyond. These increases in ROPS prevalence are largely driven by the purchase of new tractors, rather than the installation of ROPS on older tractors (Hard and Myers, 2011) . It is therefore possible that decreases in demand for ROPS retrofits will be offset by the replacement of older tractors with newer ROPS-equipped models.\nIt is important to note, however, that the increase in ROPS prevalence in Sweden was driven by regulation, not the attrition of older tractors as described above for the U.S. In the U.S., small farms with limited income and few hired workers are less likely to have ROPS protection. Many farms fitting this description can be found in states with high rates of overturn, most of which are near the Appalachian Mountains. ROPS adoption in these regions has proceeded at a slower pace than in the rest of the country (Hard and Myers, 2011) .\nBecause regulation may provide a more uniform distribution of ROPS protection than attrition (since it is driven by mandate vs. finances), it is possible that 75% ROPS prevalence will not have the same effect in the U.S. as it has had in Sweden. Given this, the rise in ROPS kit pricing, especially for AM ROPS, will likely make retrofitting an unattainable safety practice for those who are most likely to need it, i.e., farmers 19(2): 115-124 123 operating in high-risk states with minimal income and few hired workers."}]