[{"section_title": "Introduction", "text": "The news of COVID-19 re-infection after months of recovery in a male patient recently showed how the immune response should work. This suggested that the immune system through its memory keeping abilities might have remembered its previous encounter with SARS-CoV-2 and swung into action, preventing the re-infection before it could do much damage [1]. On the contrary, more severe symptoms of re-infection cases were reported by public-health workers in Nevada [2]. This had left scientist and researchers with the questions of the possibility of the immune system failing to protect against the virus and also leaving the system more prone to SARS-CoV-2 viral attack. Duelling anecdotes are common in the see-saw world of the COVID-19 pandemic, and a firm conclusion cannot be drawn about long-term immune responses to SARS-CoV-2 from just a few cases [2].\nIt was believed for months that the second infection (re-infection) was merely a continuation of the first, but recent findings in the disparity in variants between the sequencing of the viral genome of first and second infections from Hong Kong and Nevada teams respectively seemingly rule out the initial belief [1, 2, 3]. It is also worthy of note that a general conclusion cannot be drawn from only two sets of cases as reported by Hong Kong and Nevada teams, and it is still unclear how frequently re-infections can occur. With over 26 million known coronavirus infections worldwide so far, a few re-infections might not be a cause to worry. More information on the prevalence of re-infection is needed. Since the initial wave of the pandemic, some regions had experienced fresh outbreaks, predisposing people to be susceptible to SARS-CoV-2 re-infection. In the Hong Kong re-infection case study, it was reported to have occurred after he had travelled to Spain and was screened for SARS-CoV-2 at the airport on his return to Hong Kong. Also, following the relieve from the first wave of the pandemic, scientists in public-health laboratories are beginning to find their feet again, expanding their horizon of epidemic surveillance in areas of tracking re-infections, protocols that can rapidly sequence large numbers of viral genomes from positive SARS-CoV-2 tests. All of these will make it easier to find and verify re-infections in the near future.\nCases with possible re-infection with SARS-CoV-2 have been recently reported in different parts of the world [4]. In many of these instances, it is difficult to differentiate a diagnostic true reinfection or a positive Polymerase Chain Reaction (PCR) as a result of the body forming a memory cell of a previous episode of an infection.\nCases of prolonged PCR-positive result had been reported among some individuals who have recovered from the SARS-CoV-2 infection [5]. The duration of viral RNA detection has been shown to vary. In some instances, viral RNA is detected 104 days after the onset of symptoms from upper respiratory samples [6, 7, 8]. More so, intermittent negative PCR tests have been reported in some patients, especially when SARS-CoV-2 concentration in the specimen becomes relatively low or undetected by the PCR test [4].\nIt is noteworthy that the detection of SARS-CoV-2 RNA does not always represent viable infectious virus in a patient. Additional challenges of lack of testing facilities and genetic sequencing can also lead to the error of classifying suspected cases as 'confirmed' re-infections. This is further complicated by the lack of established protocol and criteria for the identification of re-infections. Consequently, there is a need for additional tests to confirm for the viability of the virus and test results must be interpreted alongside the clinical and epidemiological presentation of individual patients.\nRecent published data describing re-infections based on genetic sequencing as confirmation of second infections with SARS-CoV-2, following a first confirmed infection will provide insight into the features and recurrence of re-infection is pivotal, as it will influence our understanding of acquired immune response following initial SARS-CoV-2 infection [1]. Furthermore, media reports of cases in the Netherlands, Spain and several additional cases globally that are under investigation may also be of importance [9, 10, 11, 12]. Hence, this article sought to offer detailed biology of SARS-CoV-2 re-infections and their implications on immune response milieu, diagnostic laboratory tests and control measures against COVID-19."}, {"section_title": "SARS-CoV-2 mutation mechanisms", "text": "To understand how SARS-CoV-2 enters the cell, there is a need to discuss the virus mutation mechanisms. Generally, SARS-CoV-2 enters the cell using the human angiotensin-converting enzyme (ACE)-2 and human proteases as an entry activator [13]. This entry is through its receptor-binding domain (RBD) proteolytically activated by human proteases [14], and mediated by a viral spike protein which is a glycoprotein with two domains S1 and S2. The domain S1 initiates infection by interacting with host receptor ACE-2 and inducing conformation changes, spike protein S2 that acts as a class 1 viral fusion protein which mediates virion fusion to the cell membrane [13].\nA study conducted in the United States of America showed that SARS-CoV-2 spike putative PPC site mutation affected its cleavage to S1 and S2, as the mutant SARS-CoV-2 S-protein was no longer cleaved. This could result to poor PPC motif fusion of SARS-CoV-2 during viral packaging, a step critical for viral entry into HeLa cells, Calu-3 cells, and MRC-5 cells [13].\nAs SARS-CoV-2 continues to adapt to its human host, a mutation known as D614G makes was seen in the virus's spike protein. While the D614G mutation forms a part of a clade known as the G clade. A clade is like a lineage in a phylogenetic tree [15]. Clade G is mostly prevalent in Europe and it carries the D614G in the virus spike protein [16]. Korber et al. [15] found that the G clade varied from the original form from Wuhan and is linked to 3 other mutations indicating that the D614G is more transmissible than the original Wuhan form. Aside from this, there are ˃ 8000 reported single nucleotide polymorphisms in the SARS-CoV-2 genomes than could result to changes in its infectivity. However, the D614G pattern is consistent throughout the globe with very rare exceptions. In another study, it was proved that the dominant form of SARS-CoV-2 is the variant carrying the D614G spike mutation, which enables the primary interaction of the virus with the host cell. Although, other non-mutated spike protein also interacts with the host protein [17]. Mutations occur within coronaviruses in three mutually inclusive processes. First, during viral replication some mutation may arise due to a copying error. However, this can be reduced in SARS-CoV-2 because coronavirus polymerase enzyme contains a proofreading mechanism [18, 19]. Second, coinfection of same host due to a recombination between two viral lineages may trigger genomic variability [20]. Third, mutations acquired through evolution can undergo induction by host RNA editing mechanisms which is associated with innate immune response [21, 22, 23]. Currently, there is no evidence that recurrent mutations in SARS-CoV-2 can lead to increased viral transmission. A recent study done in the United Kingdom showed that recurrent mutations in SARS-CoV-2 are not associated with increased viral transmission [23]. Instead, it is triggered by host immunity through RNA editing systems which are expected to be selectively neutral. Conversely, these mutations can be used to monitor the spread of SARS-CoV-2 [24].\nOne study by Becerra-Flores and Cardozo [25] showed that the G614 variant in spike had higher infectiousness and spread more rapidly than D614. This finding has an important implication for vaccine development and immunotherapeutic intervention. Vaccine platforms that elicit broadly neutralizing antibodies against both D614G and D614 should be considered. Furthermore, there are concerns that COVID-19 patients carrying D614G mutant might not respond to transfusion of neutralizing antibody (Nabs) from a donor with an S protein variant. Despite the significance of the immunotherapeutic use of Nabs in some COVID-19 patients, they could potentially trigger immunopathogenic processes in COVID-19 patients with dissimilar viral genome content or enhanced infectivity [25]. Interestingly, the risk of being hospitalised with G614 spike-pseudotyped viruses was less significant. The study found that there was no significant impact on disease severity, but G614 is associated with higher case fatality rates (proportion of people who die from COVID-19 among all diagnosed individuals whether hospitalized or not) across countries [25]. In terms of mortality data, a national study done in China demonstrated that deaths from COVID-19 in countries out of China was three times higher (15.2%) compared to 5.6% in China [26]. This could be due to the emergence of viral mutations and evolution capability of SARS-CoV-2 over time. However, it remains unclear if the different case fatality rate reported across countries may be the import of clade's differences in virulence as observed by a study in the United Sates [27].\nSARS-CoV-2 mutations are in the S protein (nt23403), RNA polymerase (nt14408), RdRp (nt14408), and nucleoprotein (nt28881) [28,29]. A study done in China showed that mutations could occur in various regions of the SARS-CoV-2 virus like the ORF1ab, S, ORF3a, ORF8, and N regions. The study showed a mutation rate of 30.53% and 29.47% in ORF8 and ORF1a, respectively [28]. Similarly, in an evaluation study of emerging SAR-CoV-2 mutation hotspots across 4 geographic areas, Pachetti et al. [29] showed that mutations located at positions 2891, 3036, 14408, 23403, and 28881 were mainly observed in Europe, while those located at 17746, 17857 and 18060 were present in North America. This finding suggests a differential pattern of mutation across the countries due to founder effect.\nMutation of SARS-CoV-2 occurs in distinct patterns across countries. As demonstrated by data from CoV_GLUE S-D614G and nsp-12-P323L, all continents had the two main mutations that determined the virus clade G except for three cases in Asia. However, D614G in the S protein was often found co-evolving with the P323L mutation in the nsp12 protein and is found in 2342 and 2318 samples, respectively. Both mutations – D614G and P323L were reported in Switzerland, Spain, Italy, and France. Furthermore, ORF8-L84S is the third most frequent mutation that determines the virus clade S found. This was found in 740 sequences reported in 71 European cases reported by Coppée et al. [30]. Meanwhile, association of ORF8 mutation in S clade with mutations in ORF3a, nsp4, and the N proteins of SARS-CoV-2 has been demonstrated by Lorusso et al [31]. This has implication for possible reinfection potential.\nA study demonstrated that SARS-CoV-2 has mutated in such a manner that facilitated its rapid transmission all over the world [32]. Virus mutation may well pose a huge challenge to COVID-19 vaccine – nevertheless this can be prevented. If SARS-CoV-2 mutates as result of its reaction to a COVID vaccine, there are various paths it might assume. Evolution- and mutation-proof vaccines provides protection against all circulating strains, so that entrants of new strains are covered by the vaccine. To achieve this, an extra effort will be needed during vaccine clinical trials. For instance, by testing upper respiratory swab samples of people who have received the experimental vaccine, researchers can tell the virus suppressed level in subjects. Furthermore, by analyzing the whole genome of SARS-CoV-2 in vaccinated people, it might be possible to study the evolutionary escape process (if present). Blood samples from vaccines can be used to work out the number of sites on the SARS-CoV-2 that are being attacked by vaccine-induced immunity. These put together can provide detailed information about the mutation and evolution processes taking place in SARS-CoV-2 so that adjustments be provided in an updated vaccine candidate during further re-designing and development stages."}, {"section_title": "Biology of SARS-CoV-2 re-infection", "text": "Early experimental study showed that re-infection by coronaviruses is possible. However, little was known about the possibility of re-infection by SARS-CoV-2 since the COVID-19 pandemic is still in its early phase [33]. A study on rhesus macaques showed that re-infection could not occur after challenging the monkeys with the same dose of SARS-CoV-2 strain as the first infection [34]. However, recent findings have shown that re-infection is possible, specifically with a different strain, with confirmed cases of re-infection in Hong Kong [1] and Nevada [3]. To et al. [1] and Edridge et al. [33] suggested that natural infection may be responsible for re-infection in coronaviruses (HCoV-NL63, HCoV-229e, HCoV-OC43 and HCoV-HKU1), and this could be a general occurrence for all coronaviruses, including SARS-CoV-2.\nDifferences were observed in the genomes of confirmed re-infection cases of SARS-CoV-2. The differences between the initial and subsequent infection of the viral genomes are attributed to the clade/lineage, the number of single nucleotide variants (SNVs), the difference in the amino acids and number of dinucleotide multi-nucleotide variant (MNV) [1, 3]. Although the re-infection case in Nevada, USA belongs to the same clade as the first infection, clade 20C, there are some genomic differences as obtained from the genomic sequence analysis (Table 1).\nAccording to Jain et al. [35], clade 20C possess genomic variants in the regions C14408T, A23403G, C1059T, and G25563T. However, viral particle B has an additional variant in the region C3037T [3]. The mutation in the viral genome A is missense; however, viral genome B included a synonymous mutation in the C3037T region [27]. While the A23403G occurred in the S region, the other mutation occurred in the ORF1ab region, which is the longest ORF in the SARS-CoV-2 genome [36]. The extra change in the S region could be responsible for the severity in the re-infection case in the Nevada case.\nAccording to the To et al. [1], they highlighted that the viral genome in the first episode of infection in the re-infection case in Hong Kong was of the GISAID Clade V, Next strain clade 19A, Pangolin lineage B.2 and with a probability of 0.99; while the re-infection viral genome was of the GISAID Clade G, Next strain 20A, Pangolin lineage B.1.79 with a probability of 0.70. Specifically, lineage B.1 belongs to variant G614, which is widely distributed globally with substitution in the regions C241T, C3037T, C14408T and G23403A; while lineage B.2 belongs to the variant V251 [37]. Furthermore, these two viral genomes differ from one another by changes in the amino acids in the spike protein, accessory proteins (ORF3a, ORF8 and ORF10), nucleoprotein, membrane protein and non-structural proteins (NSP3, NSP5, NSP6, NSP12) [1]. The genome of the first virus is related to the Clade GR obtained in England between March and April 2020 [1], with varying nucleotide and amino acids mutations (GISAID Database). Analysis of 10,022 samples to understand the genomic variability of SARS-CoV-2 also showed that G614 variant had been the most common variant since the onset of the pandemic in December 2019 {Koyama, 2020 #462} [36]. Evidence has shown that G614 has a higher titre of viral particles in upper respiratory tract specimens [15, 37], but it is associated with lower RT-PCR cycle thresholds and not necessarily increased diseases severity [15].\nThe re-infection case in Belgium showed that the first infection belongs to the lineage B.1.1 while the second infection belong to lineage A, with eleven genomic mutations identified in the two strains [38]. According to Gupta et al. [39] there were some genetic variations in the case of re-infection among the two healthcare workers identified in India. Using WGS, there were six non-synonymous (NS) variations in patient 1 when the two virus strains were compared. Virus strains in patient 2 showed nine NS variations between the two strains in the different genomic regions. Most of these variations were observed between the orf1b and envelope protein region."}, {"section_title": "B cells and interferon response in COVID-19 ::: Immune response during SARS-CoV-2 infection", "text": "Type I interferons (IFNs) are immunoregulatory cytokines that play important role in immune response to viral infections. Studies have shown that Type I interferons (IFNs) affects both innate and adaptive immune responses [53, 54]. They enhance B cells response to viral infection, cytotoxic production and neutralizing antibodies production. However, unregulated IFNs can lead to autoantibody production [53]. The study by Bastard et al. showed that autoantibodies generated by B cells in 10% of patient with life-threatening COVID-19 pneumonia targeted type I IFNs [54]. These autoantibodies counteract the ability of IFNs to block SARS-CoV-2 infection thereby, making the host more susceptible to viral infection and in turn more severe symptoms [54].\nAdditionally, immunological retention is an important aspect of reboust immunity against SARS-CoV-2 infection. Based on previous reports that indicated COVID-19 patients to have exhibited varied immune responses, a recent study provided details on the use of cell-based immune indicators for improved patient outcomes in convalescent plasma specimens [55].\nBasically, response to viral antigens by human B cells is by secretion of germline or near-germline antibodies from plasmablasts on the exterior of the follicles [55]. As soon as the T cells bind to the CD40 surface markers, resulting to the release of specific cytokines, B cells go into a process referred to as class switching. Consequently, they will now be found inside the germinal cores within various lymphoid organs and develop functionally. This brings about the production of long-lived plasma cells and memory B cells both of which can respond to a recurrent issues with similar or another antigen [55].\nPlasmablast increase in the early B cell response has been proposed to result to poor patient outcomes. Contrarily, memory B cells produced post SARS-CoV-2 infection confer strong specific immunity. They are both seen in the classical CD27+ class-switched type, activated CD24-form and the natural CD27 + type, which is similar to an innate immune cell, with both IgG and IgM markers.\nA new study discovered that higher number of memory B cells may indicate an efficacious response to an acute infection and aid in understanding T cell response. Both switched and unswitched memory B cells are associated with a shorter length of symptoms [56]. The degree of IgM + memory is highly associated with anti-RBD IgG1 antibody response. Hence, it seems like some COVID-19 patients do present a memory response that is protective, either before or after the production of the IgM + memory cells [56].\nCertain B cell memory cross-reacts with past coronavirus infections. Nevertheless, the anti-RBD IgG1 response is proportional to the IgM + memory cells, since the IgM + memory cells do not produce switched immunoglobulins. Thus, researchers concluded that, coronavirus infections possibly produce a good amount of IgM + cells, some of which go into germinal cores and change to IgG1 production. This capacity of IgM + memory cells to transfer to germinal core following activation is very common, and might be beneficial in inducement of immunity to pathogens like the coronaviruses with various extremely similar strains [55].\nAn apparently illogical discovery was that T bet + B cell occurrence did not correlate with that of resting memory B cells, since the former is important in B Cell immunity formation. One justification may be that they are not a crucial aspect of recovery, but are limited to acute and chronic viral infection. This part will require additional studies to explain the processes involved [56, 57, 58, 59]. Alternative explanation for the increased convalescent rates with higher amount of memory B cells is that these cells form part of a bigger pool, resulting to better T cell facilitation of B cell germinal center responses in unexposed individuals during primary infection. This elucidation is plausible since memory production is strictly connected to the production of specific antibodies against the responsible agent [56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66]."}, {"section_title": "Antibody response in Severe/ICU/deceased patients with COVID-19 ::: Immune response during SARS-CoV-2 infection", "text": "Majority of SARS-CoV-2 infected persons develop antibodies to the viral S and N proteins, which are mostly used as the antigens in COVID-19 serological assays. The S- protein is an essential target for broadly neutralizing antibodies against SARS-CoV-2, as they prevent viral entry into susceptible host cells [67]. Available data on the role of anti-SARS-CoV-2 in viral clearance, modulation of COVID-19 severity, and the durability of humoral immune responses after primary SARS-COv-2 infection is limited. Furthermore, an improved understanding of humoral immune response to SARS-CoV-2 is crucial to direct strategies useful in vaccination production and immunotherapeutic (such as the use of neutralizing antibodies or convalescent plasma).\nClinical findings on the longevity of anti-SARS-CoV-2 titers are not in full conformity with one another, with some reports showing swift waning of anti-SARS-CoV-2 IgG about 90 days following after infection [48]. However, others studies reported stable anti-SARS-CoV-2 IgG titers detected several months after infection [68]. sentially, anti-SARS-CoV-2 responses appear to rise in patients with severe COVID-19 compared to those asymptomatic or with mild symptoms. This observation has raised concerns about the effectiveness of humoral immune response against SARS-CoV-2 infection (Figure 2). However, a new finding suggested that the quality of anti-SARS-CoV-2 IgG and neutralizing antibody rather than quantity predicts the clinical outcome and prognosis of COVID-19 [69]. The study applied a panel of sero-diagnostic assays on COVID-19 patients who have convalesced or died due to COVID-19 [69].\nSerum anti-SARS-CoV-2 IgM and IgG are mainly detected between 1- and 2-weeks post onset of symptoms (Figure 2). Whereas, SARS-CoV-2 RNA levels decline as the neutralizing antibody titters rise. Essentially, increased NAb have been demonstrated in patients with severe COVID-19. However, little is known about the involvement of humoral immune responses on COVID-19 induced-lung diseases. Of note, humoral immune and B-cell responses to SARS-CoV-2 infection are short lived. This suggests that immunity following SARS-CoV-2 infection may drastically decline 12–24 months after primary infection [70].\nAnti-SARS-CoV-2 IgM in severely infected COVID-19 patients in the ICU gets activated at the early days (1st week) post infection continues to rise until it peaks at the end of 3rd week. By the end of the 5th week, IgM levels begins to decline with a concomitant maintenance (plateau) of anti-SARS-IgG level after it got peaked at the 3rd week. The IgG persists in serum and also detectable for about 12–24 months post infection. Patients with more severe illness show higher antibody titers compared to those with milder illness. IgM and IgG levels reached their peak at weeks 4 and 6 respectively. Outpatients had lower IgM and IgG levels than inpatients. Dead patients had highest antibody level. However, antibody response in severe COVID-19 vary in individuals depending on prevailing co-morbidity and other clinical conditions of the patients."}, {"section_title": "Laboratory diagnosis of SARS-CoV-2 re-infection", "text": "To differentiate between SARS-CoV-2 positive cases, especially with prolonged viral shedding, from cases with true re-infection, epidemiological and virological data from every infection incidence needs thorough assessment.\nCOVID-19 compatible symptoms in a person that tested positive to SARS-CoV-2 need to be assessed, and a swab taken for laboratory analysis. Some other respiratory viruses, such as seasonal influenza, causes COVID-19 similar symptoms and should be considered as differential diagnoses. Outlined below are the main criteria that should be fulfilled to identify true re-infection in combination with individual overall clinical assessment [43].a.Laboratory confirmation of two different strains of infection (the incident is determined or supported by phylogenetic and epidemiological data) with timely classified illness/infection episodes (least estimated period)b.Additional investigation of suspected or confirmed/probable re-infections, to further validate that re-infection occurred and document patients' characteristics after exposure in the two infection episodes will provide better insight into the causes of re-infection. Such knowledge could further provide guidance on public health interventions."}, {"section_title": "Criteria for SARS-CoV-2 reinfection diagnosis", "text": "False positive SARS-CoV-2 RT-PCR can occur due to error during pre-analytical and analytical phases of testing, especially during sample collection and testing. Contamination during analysis can also lead to false positive result and it was stated that test procedure with high sensitivity and specificity could lead to a low positive predictive value in areas with low SARS-CoV-2 infections [43].\nThe period between the first infection and supposed re-infection might play a role in determining true infection. Due to decline in antibody levels with subsequent waning immunity, infection between a confirmed RT-PCR negative test after infection and another positive result could be considered as a re-infection. This is however, dependent on the longer time lapse between these two events. In contrast, another infection after a confirmed RT-PCR negative result with a short time-lapse will probably be the detection of the residual viral particle as supposed to a re-infection.\nPresence of viral RNA fragments in the absence of viable virus can bring about positive RT-PCR result. This false positivity could be ruled out by:a.Virus culture: A positive culture will indicate a viable virus and a true re-infection has to be ascertained by further investigating if the second infection is of a different strain. However, a negative culture result will indicate a non-viable viral RNA shedding which cannot be ascribed to an ongoing infection [43].b.Viral load quantification using the cycle of threshold (CT) value of PCR has shown to correlate with the viability of the virus. According to a recent pre-published study, a viral load of 6.610 RNA copies/mL could make the probability of detecting the virus less than 5%. However, this method could not be relied upon as it has not been established and validated for this purpose [43].c.Sequencing and phylogenetic analysis using whole-genome sequencing (WGS) could be a tool to evaluate the probability of a second infection as re-infection. However, care has to be taken when using this method as there is the plausibility of virus mutation within the host, in the case of one strain infection, and simultaneous infection with two different virus strains.\nSARS-CoV-2 can infect a host alongside other seasonal coronaviruses, with re-infection with β-CoV hCoV-OC43 reported in some studies 90 days after the initial COVID-19 infection [70]. Modelling has shown that there is an average of 45 weeks of protective immunity against hCoVOC43 and hCoV-HKU1 before re-infection can occur [70]. Nevertheless, re-infection with other coronaviruses can occur with stable and high antibody titres. In a study where 133,266 laboratory-confirmed cases were evaluated with 243 positive swabs after 45 days of their first SARS-CoV-2 infection, it was found that 54 of these cases had re-infection considering their Ct values or symptoms of COVID-19 [71]. However, these cases cannot be determined to be true re-infection because neither WGS nor viral culture was used to identify these cases. Yet, the risk and incidence of re-infection was estimated to be 0.04% (95% CI: 0.03%–0.05%) and 1.09 (95% CI: 0.84–1.42) per 10,000 persons respectively [71].\nThe media is inundated with potential cases of re-infection which are under investigation; however, six cases of confirmed SARS-CoV-2 re-infection have been reported to date. Although, re-infection is a rare scenario coupled with non-traceability of samples from the first episode and previously positive laboratory results in some settings, increase in testing of symptomatic and asymptomatic persons will increase the likelihood of identifying re-infection cases. This could help in understanding the factors that favour re-infection.\nIn a recent review study to understand the infectiousness of SARS-CoV-2, five of the re-infection cases were included [4]. No onward transmission to close contacts was observed in the cases of re-infection. Also, there is limited scientific evidence to support the infectiousness of a re-infected person and based on the small sample size of the re-infected cases with non-employability of WGS to decipher the phylogeny, these cases might not be actual cases of re-infection. However, symptomatic and asymptomatic re-infected individuals should be managed as if it is the first infection while ensuring COVID-19 universal precautions."}, {"section_title": "Clinical and laboratory features of SARS-CoV-2 re-infection cases", "text": "In August, 2020, the previous study reported, based on whole-genome sequencing and serological data, the evidence of re-infection in a 33-year-old Hong Kong resident with dissimilar viral strain from the first infection which was 142 days apart (Table 1). Following first episode of the symptomatic viral infection, clinical hallmarks of the infection which include dry cough, sore throat, pyrexia and headache lasted for 72 h with detectable neutralising immunoglobulin which began to wane within 8 weeks as these symptoms were resolved with therapeutic intervention. The resolution of the clinical manifestations was further marked by the absence of detectable viral nucleic acid for two consecutive PCR testing using samples from the throat and the nasopharyngeal tract. The waning effect of these immunoglobulins was predicated on predisposing the patient to the second wave of infection by a different viral strain from a dissimilar lineage with 24 nucleotide variants compared to the first strain and was observed to be characterised by no clinical manifestations which is associated with low antibody titers, slightly raised C-reactive protein and a relatively elevated viral load with progressive decrease over a period. The evidence for re-infection of these different strains was further consolidated by the phylogenetic tracing of the first strain from Hong Kong while the second strain was contracted from Spain were [1].\nFour months earlier, similar viral hallmarks (dry cough, nausea, sore throat, diarrhoea and headache) were reported in a 25-year-old resident male of Washoe in Nevada, USA. The immunocompetent patient, who had no history of underlying pathology, was observed with symptoms which resolved with steady improvement between April and May 2020 during the period of isolation. However, towards the end of the following month, the symptoms resurfaced with evidence of atypical pneumonia as revealed by chest radiography. Further observation revealed that the patient presented with hypoxia and breathing discomfort. During the two clinical presentations by the patient, serological markers (IgM/IgG) were detected, and nucleic acid amplification was performed using nasopharyngeal swabs to confirmed the COVID-19 status. Genomic analysis of the samples collected for the positive results of April 18, 2020 (first instance of infection) and June 5, 2020 (second instance of infection) which revealed two negative COVID-19 outcomes between these periods, revealed that a significant difference in the nucleotide sequence of the viral isolates collected during these two waves of infection. The second wave of infection was observed to be characterised with a more severe form of the viral infection with a more robust immune response compared to the first wave of infection. The computed genetic discordance disclosed value of 83.6 as opposed to 23.1, which serves as the natural rate of substitution. The findings revealed that the patient contracted two genetically different viruses on two distinct occasions which clearly defeats the possibility for herd immunity [3].\nSimilar to the reported cases in Hong Kong and the United States, the third evidence of re-infection was reported with a first wave of infection in March 2020 in a 51-year-old woman from Belgium with similar clinical presentations (pyrexia, muscular weakness, dyspnea, dry cough, headache, chest pain, loss of smell and taste) of symptomatic re-infection no less than 3 months and 3 days following a moderate COVID-19 re-infection. Unlike previous cases, although she was reported to be immunocompetent, she had a respiratory disorder (asthma) which was managed using corticosteroids. Apart from slight elevations in the liver enzyme profile, biochemical and haematological analysis revealed no obvious signs of pathology with a 94 % oxygen saturation. After a three months period, her symptoms were observed to relapse with similar complaints of the first wave of infection (dry cough, headache, rhinitis and muscle weakness) and no migration history. Although the severity of this second episode of infection was milder compared to the first episode, it resolved within a shorter period (7 days) and both samples from the first and second episodes tested positive for immunological markers (IgM/IgG). Genetic discordance was observed between the viral isolates from the first and second episodes of infection based on 11 nucleotide variants which further buttressed the evidence for infections with two genetically distinct viral strains [38].\nAnother case of re-infection was also reported in Ecuador which was in contrast to the Nevada case but similarly to the cases of Hong Kong and Belgium, the genetic confirmation test revealed two waves of infection (in May and in July 2020 respectively) which had a second episode of infection that was much more severe with a surge in antibody titers (IgM/IgG) compared to the first episode of infection which were four weeks apart during when the COVID-19 status of the patient was confirmed to be negative using RT-PCR [52].\nIn the case of India which involved reported evidence of asymptomatic re-infection in two healthcare professionals (male and female aged 25 and 28 respectively) unlike previous reports, RT-PCR confirmed their two episodes (5th and 17th of May 2020; and 21st August and 5th September 2020) of positive COVID-19 status with three months apart during when they were confirmed negative on 13th and 27th May 2020 respectively. Genomic and phylogenetic analysis was used to confirm the genetically dissimilar viral strains which ruled out any suspicion for viral shedding or reactivation [39]. More recently on 25th September, 2020, Mahallawi reported another case of SARS-CoV-2 reinfection in Saudi Arabia [40]. This was case of a 31-year-old man that presented with myalgia, headache (with no other symptoms) and was not suffering from any chronic disease."}, {"section_title": "SARS-CoV-2 mutations and consequences on laboratory tests", "text": "Following the fast and pandemic-scale spread of COVID-19, mutations in SARS-CoV-2 has raised new diagnostic challenges which include the redesign of the oligonucleotide sequences used in RT-qPCR assays to avoid potential primer–sample mismatches, and decrease sensitivities [72]. Reportedly, as at 30th March 2020, of all high coverage of 1825 SARS-CoV-2 genome sequences deposited in the Global Initiative on Sharing All Influenza Data (GISAID) database [73]. About 79% (26 of 33) of the primer binding sites used in the RT-qPCR assays were mutated in at least one genome [73]. Of significance was the GGG substitution to AAC at the beginning of the binding site of the forward primer in the gene that encodes for the nucleocapsid phosphoprotein. The AAC variant was found in 14% (258 of 1825) of the genomes isolated and sequenced in 24 different countries.\nDespite the possibility of sequencing errors, the consistent detection of some specific variants, there is need to continue to optimise the oligonucleotides used in assays being developed. The global sharing of SARS-CoV-2 genomes and the frequent updating of reports on sequence analysis that are available on the GISAID4 website will help facilitate oligonucleotide optimisation.\nSince the emergence of SARS-CoV-2 continuous efforts have been made to map its genetic diversity and identify variants/mutants that have a selective advantage [74]. Some key variations of interest include changes in immune targets, such as the spike glycoprotein; changes in primer binding and probe-binding sites, which can reduce the sensitivity of diagnostic tests; and genetic variations that might affect transmissibility and virulence [75, 76, 77].\nFor instance, the Cobas® system (Roche) uses a dual target assay to detect SARS-CoV-2, with qRT -PCRs targeting both the ORF1ab region and the E –gene [78]. During SARS-COV-2 testing, Artesi et al [78] found out that most SARS-COV-2 test were negative at the E-gene and positive for ORF1ab region. However, the Cobas Roche system classified the diagnostic result as Subsequent genomic sequencing showed mutation that interfered with E-gene during qRT-PCR [78]. However, the C > U transition at position 26,340 of the SARS-CoV -2 genome during sequencing could be responsible for negative E - gene RT -PCR. Available evidence suggests that there was heavily interference most likely at the E-gene domain [79].\nIndeed, mutation in SARS-COV-2 genes used in COVID-19 Diagnostics have occurred (Table 2). These mutations can affect the accuracy of RT-PCR test by producing false negative result in a single qRT-PCR primer/probe assay [78]. Thus, during SARS-COV-2 assay, two or more positions of the viral genome should be targeted, as mutations in all targeted genes in very unlikely for now. However, there is the need for continuous global molecular surveillance of SARS-CoV-2 to promptly detect future mutation that could affect RT-PCR test results.\nIn another instance, Sun et al. [79] reported a 12-bp deletion on E gene on mutant and wild-type SARS-CoV-2 strains isolated from the same clinical sample. Furthermore, Ziegler et al. [80] found that a single nucleotide polymorphism (SNP) in the E gene SARS-CoV-2 from a patient interfered with detection in a widely used RT-PCR assay. Consequently, this underscores the necessity of targeting two independent essential genes of SARS-CoV-2 for reliable detection.\nGetting an adequate epidemiological data about the global COVID-19 pandemic requires accurate RT-PCR testing to identify SARS-CoV-2 infected individuals.\nArtesi et al [78] further identified a C-to-U transition at position 26,340 of the SARS-CoV-2 genome which is associated with failure of the cobas® SARS-CoV-2 E-gene qRT-PCR in eight patients. This work highlights the necessity of monitoring SARS-CoV-2 for the emergence of SNPs especially in the case reinfection which might negatively affect RT-PCR assays used for COVID-19 diagnostics."}, {"section_title": "Personal measures ::: Implications of SARS-CoV-2 re-infections on pandemic control measures", "text": "Personal measures are aimed at depleting the risk of transmission of SARS-CoV-2 infection through human-to-human contact and interaction in order to persevere and avoid mounting overwhelming challenge on an individual's adaptive immunity. These personal measures range from hand hygiene, physical distancing to the proper handling, usage and disposal of personal protective equipment (PPE).\nDespite the advocacy to adhere to these personal precautionary measures, the rebellious quest to return to \"normal life\" without adhering to these safety precautions is evident through global anti-face mask protests in Spain [89], Rome [90] and the UK [91]. These actions which have become a setback against tackling the pandemic have the potential to induce subsequent waves of re-infection which interferes with adaptive immunity and ensures that long-term immunological response by the body to the virus is compromised.\nAdaptive immunity mainly involves the synthesis and defensive roles of cytotoxic T cells (killer or CD8+ T cells) and B cells (immunoglobulin-producing plasma cells) which are responsible in ameliorating the severity of COVID-19 re-infection [1].\nFollowing the viral invasion of the biological system, IgM is released within a week to two weeks which is mobilised to tackle the infection before gradually waning in a matter of months. Within 2–3 weeks following recovery, IgG antibodies are released. Previous studies which conducted whole-genome sequencing in four health professionals in Mumbai, India and in a 33-year-old resident of Hong Kong to confirm re-infection reported the absence of detectable IgG antibodies which could be associated with their mild illness following their first infection. The levels of the immunoglobulins in COVID-19 asymptomatic individuals with their mild symptoms have been observed to be lower compared to their counterparts with severe cases [92]. By implication, the rapid waning levels of immunoglobulins expose these asymptomatic patients to be more prone to a second wave of infection which may present more severe hallmarks of the disease compared to those who are critically ill if the personal safety measures are not in place. A previous study revealed that anti-SARS-CoV mounted against the spike protein was correlated with a severe form of acute pulmonary injury [92].\nAt the time of re-infection, the 33-year-old resident of Hong Kong had no detectable IgG but developed detectable antibody following 5 days post hospitalisation [1]. The absence of detectable neutralising antibodies as observed both in individuals who recovered from COVID-19 infection [93] and asymptomatic patient [48] does not necessarily imply that the biological system of these patients did not mount immunological response but could actually be that the waning effect of the antibodies secreted in response to the virus was below the limit of detection of the assays used for the investigation of anti-SARS-CoV-2 in body fluids collected within 5–8 weeks after the onset of clinical manifestations. This further implies that the low antibody titers in these patients can predispose them to re-infection which is possible within 4 and a half months following the first episode of symptomatic viral infection. Hence it becomes clear that herd immunity by natural infection is not sufficient to shield the body against the virus [1].\nApart from the B cells, T cell immunity has been revealed to sustain the defensive momentum by inducing long-term immunity which mainly targets the structural proteins of the virus [94, 95, 96, 97]. While T helper cells were demonstrated to be instrumental in targeting both structural (membrane, spike and nucleoprotein) as well non-structural (nsp3, nsp4) proteins and ORF8, cytotoxic T cells were shown to target ORF8, ORF3a and nsp6. These cells have been detected in patients who recovered from COVID-19 infection following several months post initial infection [98]. The T helper cell response is mainly elicited in response to mutation at amino acid 222 of the spike protein [99].\nIn order to guarantee its survival against the immunological response of the biological system, generational strains of the virus have developed ways of evading the immune system by undergoing over 30 mutations within 8 genomes and resulting in cases of a second episode of infection which either present with mild or severe symptoms compared to the initial episode of infection. These cases of re-infection have been confirmed using whole-genome analysis to indicate that the viral strains which induce the first and second episodes of infections originate from dissimilar lineages with up to 24 nucleotide variants, hence both strains vary from each other. Unlike the first episode, the second episode of infection is characterised with raised levels of C-reactive protein (biomarker for acute infection), relatively elevated viral load and seroconversion of IgG against SARS-CoV-2.\nIn order to evade the attack of neutralising antibodies against its spike protein [100], viral mutations of its spike protein amino acids emerged through natural selection, features of recent epidemiology and random genetic drift. This led to different amino acid residues (L18F, Q780E, D614G and A222V) of the spike proteins between the viral strains responsible for the first and second episodes of infection. Previous studies have provided evidence that reveals that samples from 614G infections have raised levels of viral RNA and produced antibody titers in pseudo-viruses from in vitro experiments [101, 102]. Although these studies established the relationship between D614G and replication, it remains unclear whether these mutations are responsible for re-infection and if individuals who contract the infection for a second time with a viral strain that has amino acid variations in its spike protein are able to transmit the virus."}, {"section_title": "Environmental measures ::: Implications of SARS-CoV-2 re-infections on pandemic control measures", "text": "These measures aimed at diminishing the risk of viral transmission to the individual through contact with inanimate and contaminated objects [103]. The survival duration is dependent on several factors which include the type/nature of the surface and specific viral strain in addition to relative humidity and temperature."}, {"section_title": "Organisational measures ::: Implications of SARS-CoV-2 re-infections on pandemic control measures", "text": "These are aimed at minimising the probability of exposure and transmission of SARS-CoV-2 through both non-pharmaceutical and pharmaceutical approaches. Several concerns have been raised on the possibility of amino acid variants of the spike protein to aid the virus in evading vaccine-induced immunity. However, this may be unlikely as these mutations (e.g., D614G) are not localised within the receptor-binding domain (RBD) of the viral spike protein but situated between each of the spike protomer that stabilises the mature trimeric form located on the viral surface through the hydrogen bonding. As a result of this, the amino acid changes do not influence the immunogenicity of the RBD receptors, which are thought to be vital for immunoglobulin neutralisation. However, it remains unclear the specific impact of these mutations on the spike protein's role in viral entry and fusion with the host's angiotensin-converting enzyme receptor as well as the influence of the mutation on the therapeutic entry inhibitors.\nBecause more clarity is required on the role of these mutations during natural infection by SAR-CoV-2, it is recommended to the consider the existence of these mutations during vaccine design and administration [104]. In order to prevent subsequent cases of re-infection, it is imperative that vaccination studies should not just be restricted to those who never had the infection but also for those who have recovered from the infection. Furthermore, booster doses of these vaccines should be considered since these therapeutic agents may not be able to provide lifelong defence against SARS-CoV-2 through a sustained immunological response to the virus [1]."}, {"section_title": "Conclusion", "text": "Patients with SARS-CoV-2 re-infections are highly unlikely to be due to natural viral evolution and the implications are that SARS-CoV-2 can adapt with enough genetic agility to avoid an innate immune response in a manner to re-establish detectable levels of infection in an individual. Hence, this underscores the need for further investigations to provide more robust genomics and immunology data and their correlates with transmissibility and viral shedding. These could help to predict the likelihood of SARS-CoV-2 re-infection and the potential of re-infected symptomatic and asymptomatic persons to transmit the SARS-CoV-2 at a second instance. There is a need to have a globally accepted and adhered standardize and robust laboratory criteria and case definitions for SARS-CoV-2 re-infection to avoid mis-diagnosis, especially in developing countries."}, {"section_title": "Author contribution statement ::: Declarations", "text": "All authors listed have significantly contributed to the development and the writing of this article."}, {"section_title": "Funding statement ::: Declarations", "text": "This research did not receive any specific grant from funding agencies in the public, commercial, or not-for-profit sectors."}, {"section_title": "Data availability statement ::: Declarations", "text": "Data will be made available on request."}, {"section_title": "Declaration of interests statement ::: Declarations", "text": "The authors declare no conflict of interest."}, {"section_title": "Additional information ::: Declarations", "text": "No additional information is available for this paper."}]