[{"section_title": "Abstract", "text": "This study aiming to determine the metaphorical perceptions of prospective teachers regarding Turkey's education policies was modelled in the 'phenomenological pattern' which one of the qualitative research methods. The study group was 150 prospective teachers. Data was collected using a metaphor form and via focus group interviews. Descriptive analysis and content analysis techniques were used for data analysis. Prospective teachers produced 135 valid metaphors. The most frequently repeated metaphors were chameleon, jigsaw puzzle, play dough, exchange rate, seasons, Black Sea's weather, domino stones, human life, Indian silk, swamp, traditional agriculture, tuning of the oriental instrument, vegetable soup, and weather forecast. The main categories were uncertainty, changeability, inevitableness, subjectivity, anxiety, desperation, instability, inconsistency, and awareness. The metaphors and focus group interview results show that the prospective teachers perceive negatively the frequent changing policies and educational practices."}, {"section_title": "Introduction", "text": "During the last decades, especially in OECD (Organization for Economic Cooperation and Development) countries, a significant increase in the number of comparative studies focusing on educational achievement has been observed. Findings of studies such as the Programme for International Student Assessment (PISA), the Progress in International Reading Literacy Study (PIRLS) , and the Trends in International Mathematics and Science Study (TIMSS) reveal the differences in performance of students in OECD countries. Thus, decision makers for educational policies need to respond to criticisms about the effectiveness of their educational systems. In recent years, OECD countries have adopted the national policies in their educational systems to improve the quality of education through promoting teacher selection, provision of teacher initial and in-service training, quality of the curriculum, educational accountability, and use of resources to improve schooling.\nIn modern times, education is defined as an assurance of young generation's preparation for the challenges that will be faced in future (Warnock, 1977) . This preparation process includes at least three elements: (i) the preparation for business life, (ii) the preparation for fulfilling of dreams, and (iii) the preparation for a dignified life (Aspin & Chapman, 2005) . Today, education is perceived as a process ensuring individual improvement in line with innate abilities and the process for selffulfilment (Aggleton & Rowe, 2002) . In this sense, education is seen as a process through which students' intelligence development should not be reduced to professional or utilitarian aims (Peters, 2010) .\nEducation refers to organized activities aiming to improve human life and humanity in every way with goals such as economic and social development, productivity, social welfare, tolerance, justice and happiness. Notwithstanding that it is not possible to predict the value and importance of educational investments, instantly. This is because improvements in individual and society can completely be seen only in future (OECD, 2010) . Actually, to be well educated and participate in work force are two key factors to be beneficial for development of any state (Carter, 2008) . Otherwise, the individuals are called a 'brain waste' because they have college degrees and they are unable to find responding jobs proper to their skills. These results are dampening income growth for college graduates in industrial countries and forcing them into occupations not requiring a high level education. Here, there is a criticism on education policies that the graduates have no sufficient encouragement to be functional for development of their state (Spring, 2009 ). On the one hand, there are not enough jobs in economy for graduates and on the other hand, it is not possible to calculate the demand for labour force in the developing sectors (Brown & Lauder, 2006) . Consequently, we need a permanent, consistent, scientific and sustainable education policy (Aydın, 2015) .\nIt is understandable that education is one of the most controversial topic because it is closely related to a very large segment of the society (Phillips, 2001) . Therefore, education policy has a high priority on the agenda of governments across the world because the outcomes of education policy are important for economic prosperity and social citizenship (Bell & Stevenson, 2006) . The schools provide for students a common set of values and knowledge, thus create a basis for citizenship and functioning democratic society. Schooling also contributes to the scientific and cultural progress of the society and plays an important role in economic and social growth by ensuring the conditions for employment (Olssen, Codd, & O'Neill, 2004) . Baldwin (1976) defined 'policy concept' as the formulation of rules, norms and the prescriptions intended to govern the subsequent decisions and actions of government. This concept also includes forecasting, strategic planning and implementation dimensions (Aydın, 2015) . The 'policy' is usually summed up as the process including the main components such as (i) agenda setting, (ii) policy formulation, (iii) decision-making, (iv) implementation, and (v) monitoring and evaluation (Court, Mendizabal, Osborne, & Young, 2006) . The concept of 'educational policy', which is expressed as a reflection of the 'policy concept' can be defined as the assessing of the educational outputs, trying to understand how the curriculum is being implemented, or to what extent it meets the aims of the education (Hacsi, 2003) .\nEducation policy varies according to governing structures. In the countries where the centralisation is efficient, the source of educational policy is often the central authority. It is indeed a case that policy of educational institutions, both for the public and private sectors, mainly derives from state legislation and directives (Dye, 1992) . In democratic countries, the education policies directly and profoundly affects the economy, the security of borders, and the quality of the national life so it is determined by considering the strength of the schools, colleges, and the universities (Brademas, 2002) . Another value of democratic education policy is that without it we would not be able to live as the citizens of a free and self-governing nation (Short, 2005) . Democratic education policy is vital to educate the citizens and to prepare potential public leaders. Certainly, democracy cannot survive unless those who make choices are wise, and we should rely on the schools to foster democratic attitudes (Darom, 2005) .\nThe rapid change in all areas of life also accelerated the change in education policies (Cummings, 2010) . Consequently, this rapid change cause many radical changes in educational institutions, such as teaching programs and teacher assessment (Furlong & Phillips, 2001) . Today, in evaluation of the education policies, it is preferred to establish quality assurance for consumers by creating standardized evaluation systems and a competition-based environment on the basis of accountability (Nitta, 2008) . Although Turkey's education policies have a long past, sweeping changes were made following the foundation of republic in education policies, as well as in all other policies. After the law enacted on March 3, 1924 , all schools were linked to the Ministry of Education, the problem of different education systems abolished to build integrated single education system (Arı, 2002) .\nThe Law No. 222 on Primary Education and Education, issued in 1961, enforced the compulsory education period to be 8 years between the ages of 7-14 (Resmi Gazete, 1961) . Eight year uninterrupted compulsory education was adopted in parliament on 18 August 1997 and implemented throughout the country since 1997-1998 academic year (Resmi Gazete, 1997) .\nWithin the last two decades rapid changes have occurred in education system. The Turkish Education Ministry has made numerous changes and regulations in school managers' appointment and relocation policy. Secondary school curriculum changed in 2004. Duration of high school education increased to 4 years from 3 years in 2005. Instead of OKS (Secondary Education Institutions Selection and Placement Examination), Level Placement Examination (SBS) implemented in 2007, for 6th, 7th and 8th grade students. Student selection examination system (OSS) (applied for 10 years) changed in 2010. Higher education transfer exam (YGS) and undergraduate placement examination (LYS) systems were put into practice. In 2010, instead of the two-stage SBS, single test model was applied. All general high schools were turned into Anatolian high schools with a circular issued in 2010. In 2012, 8-year uninterrupted education system in primary education was abandoned, and 4 + 4 + 4 system was put into practice. The TEOG (Transition from Primary Education to Secondary Education) exam was applied to 8th grade students to entry high school. In 2017, changes were made in primary, secondary and high school curricula. In 2017, the Ministry of Education announced that TEOG exam was removed and the 'Parent Preferential Free Registration System' was introduced. In 2017, university entrance examinations were changed, Basic Qualification Test (TYT) and Higher Education Institutions Examination (YKS) were put into practice."}, {"section_title": "Assembling a methodological and theoretical framework", "text": "The Effects of policy implementations in education are the key factors because education has a great impact on the economic, social, political and cultural development of the society. It was clear that the prospective teachers were among the most affected groups from the education policies implemented in Turkey. Because, every year 60.000 prospective teachers in different branches graduate from the education faculties and a total of one million teacher candidates are waiting for appointment as a teacher.\nIn previous studies (Nalcacı & Bektas, 2012; Ozdemir, 2012; Ozdemir & Akkaya, 2013; Yuner & Ozdemir, 2017; Saban, 2008) it is generally focused on the metaphorical perceptions of participants related to the 'school' as an institution. Besides, Bozpolat (2015) , Dogan and Kavtelek (2015) focused on the metaphoric perceptions of the participants related to the 'education and learning'. Orucu (2014) , and Sezgin-Nartgun and Gokcer (2014), aimed to reveal the metaphoric perceptions of participants on school management and educational policies related to teacher education.\nThe studies evaluating the educational policies in Turkey are limited (Adem, 1997; Buyukboyaci, 2015; Meşeci-Giorgetti & Batır, 2008; Saglam, Ozudogru, & Ciray, 2011; Tural & Karakutuk, 1991) . In these studies, in general, it was focused on the factors influencing educational policies in certain periods of Turkey. It was predicted it would be more convenient for prospective teachers to express their opinions through the metaphors because considering some of them may have reservations to express directly the effects of education policy on their improvements. Actually, metaphor is a conceptual expression of the meaning of a situation for an individual. Therefore, metaphor is evaluated as the process of seeing and understanding. From this point, the metaphor is seen by individuals more important and effective mental production than the expression of an analogy concept (Musolff, 2012; Steen, 2011) . The premise behind this methodology is 'human beings use the analogies directly and consciously to describe their experiences and beliefs.' So, the researchers examining the metaphors can begin to uncover the meanings beneath these analogies (Zheng & Song, 2010) . Under completely different research conditions, a study in experimental psychology shows that metaphors induce both attention-directing and cognitive processes (Moser, 2001) . Metaphors enable to 'learn and know' based on the individual's understanding of his/her life environment and events and the meaning in their life experiences (Yildirim & Simsek, 2013, p. 238) . The metaphor is formed by expressing explicitly or implicitly that X is a Y phenomenon. This also allows that the metaphor to be perceived as a powerful mental model (Saban, 2008) . Moser (2000) , specifies the metaphor analysis as a useful method accessing tacit knowledge and exploring social and cultural processes of understanding. Because the metaphor is deeply related to the experience and perception of the individual in relation to a particular situation (Eraslan, 2011) ."}, {"section_title": "Method", "text": "This study was modelled in phenomenological pattern which is one of the qualitative research methods. In phenomenological researches, it is aimed to put out individuals' cognitive constructs stored in their minds by looking closely to the interpretations concerning their experiences (Creswell, 2003; Lodico, Spaulding, & Voegtle, 2006) . In addition, a qualitative research design demonstrates the wide range of excitement existing in the relationship between subjectivity, self-reflection, and adherence to the methodical procedures (Schmitt, 2005) .\nStudy Group: The study group was 150 prospective teachers attending Ordu University Education Faculty in the academic year 2016-2017. This group was determined by using maximum variation sampling method. A maximum variation sample is constructed by identifying key dimensions of variations and then finding cases that vary from each other as much as possible. Employing maximum variation sampling, researcher can identify essential features and variable features of a phenomenon as experienced by diverse stakeholders from varied contexts (Gentles, Charles, Ploeg, & McKibbon, 2015; Suri, 2011) .\nThe focus group was determined according to the metaphor analysis results as the focus group. After identification of the categories, the focus group interview process put into practice to obtain indepth information related to these categories. For this purpose, the interviews were conducted in nine groups and there were seven participants in each group. asked the prospective teachers they should think about the education policies implemented in Turkey during their education periods. Secondly, it was asked that they should simulate something about these applications affecting themselves. Thirdly, it was asked that they should think about the reason of this analogy and to write a meaningful explanation as a 'justification' consisting one or two sentences in empty places on the form."}, {"section_title": "Focus Group Interviews:", "text": "The focus group interview is defined as a carefully planned series of discussions aiming to obtain participants' perceptions about a predetermined subject in a moderate and non-threatening environment (Cokluk, Yılmaz, & Oguz, 2011) . Focus group methodology is one of several tools that educators can use to generate valid information important to the advancement of programs, communities, and organisations (Grudens-Schuck, Allen, & Larson, 2004) . Firstly, in this process, it was determined the most frequent metaphors. Secondly, 63 interviewers were determined among the participants based on volunteerism. Thirdly, nine groups were consisted of seven seaters. Fourthly, the focus group discussions were continued with focus group discussions on the each group using metaphors in the nine different categories. These interviews continued for six weeks. A student recorded the participants' views during the interviews.\nData Analysis: Data analysing process was continued by using descriptive analysis and content analysis techniques. The metaphors were analysed in four stages, namely (i) coding and elimination, (ii) category development, (iii) validity and reliability, and (iv) data presentation and interpretation.\nCoding and elimination: At this stage, the metaphors were listed in alphabetical order on the excel table. For this purpose, a sequential number was assigned for each participant. In this process, it was aimed whether the participants write out a certain metaphor in a clear way. For this, each metaphor was encoded (e.g. \"play dough\", \"swamp\", etc.). Then, it was eliminated the eight forms leaving blank or containing any metaphor images. Although some participants expressed a certain metaphor image but, they did not offer a rational reason for this metaphor. In addition, some participants instead of offering a metaphor image in general, they have shared personal thoughts on educational policies. Depending on all these reasons, the eight forms was eliminated and excluded from the analysis.\nCategory development: At this stage, the metaphors were examined in terms of the relationship between 'the source' and 'the reason'. In this process, it was removed seven datasets from the analysis process having no logical association between the source and the reason. Thus, 135 valid metaphors were determined. As a result of this review, each metaphor was associated with a particular theme, taking into account the reasons. For convenience in creating categories, the metaphors and the reasons considered in the same category were showed with the same colour on the excel table, and it was used a different colour to separated different category. This process was continued until remaining any metaphor is not shown in a certain category. In the end, nine different conceptual categories were identified."}, {"section_title": "Validity and reliability:", "text": "To increase the accuracy of this study, data were collected on the basis of the volunteerism among the prospective teachers who were directly affected from the topic. In order to contribute to the originality of the research, direct quotations were used, so that the identities of the participants were kept secret. In addition, data collection and analysis process was described with all the details (Yildirim & Simsek, 2013, p. 256) . To ensure the reliability of this study, the expert opinion was consulted to confirm whether the metaphors shown in the nine conceptual categories were correctly represented within the specified conceptual category. For this purpose, an excel table used for analysis was given to a faculty member who is in the department of educational sciences in the same faculty. I t was asked the faculty member to match metaphor images with a conceptual category (so that no metaphor image is excluded) using this list. Then, the matches were compared. It was applied the formula \"Reliability= Consensus / (Consensus + Dissidence) × 100\" to determine the reliability of the coding (Miles & Huberman, 1994, p.64) . The agreement between the two coders was calculated as 130 / (130 +5) × 100 = .96.\nData presentation and interpretation: data were presented as the frequency (f) and percentage (%) values. In addition, the opinions which the best represent each category were presented. For this purpose, the striking views of the participants were presented as [P1], [P2], and [P3]. In the conclusion section, the evaluations related to the all categories were given."}, {"section_title": "Results", "text": "In this section, the descriptive analysis results are given. Prospective teachers produced 135 valid metaphors. Most frequently repeated metaphors were chameleon (f=10), jigsaw puzzle (f=9), play dough (f=5), exchange rate (f=3), seasons (f=2), Black Sea's weather (f=2), domino stones (f=2), human life (f=2), Indian silk (f=2), swamp (f=2), traditional agriculture (f=2), tuning of the oriental music instrument (f=2), vegetable soup (f=2), and weather forecast (f=2).\nThe metaphors and main categories are presented in Table 1 . In Table 1 , it is appear that the inevitableness main category includes greatest number of metaphors (n=19). The uncertainty main category includes 16 metaphors. In addition, the most frequent metaphor is jigsaw puzzle (f=7) in this category. The changeability category includes ten metaphors. In this category, the most frequent metaphor is chameleon (f=10). Some metaphors such as exchange rate, domino stones, jigsaw puzzle, and play dough are seen in two different categories. This is because during the category creating process the reasons explaining the metaphor were considered.\nThe frequency of the main categories are presented in Diagram 1."}, {"section_title": "Diagram 1. The main categories.", "text": "In Diagram 1, the uncertainty (f=23), changeability (f=22), and inevitableness (f=20) rank as the first three categories. The other categories are namely, subjectivity (f=14), anxiety (f=14), desperation (f=13), instability (f=12), inconsistency (f=11) and awareness (f=6).\nIn this section, the focus group interviewers' opinions are exemplified. During focus group interviews following question was asked to participants including a metaphor. 'What does the metaphor of 'jigsaw puzzle' evoke to you?' The participants' names are imaginary. The views containing the striking justifications are shown as following:"}, {"section_title": "Category 1. Uncertainty", "text": "In this category, the metaphors 'jigsaw puzzle', 'exchange rate', 'vegetable soup', and 'adolescent behaviour' are interviewed, respectively.\nMr. Can: I believe that the education policy in Turkey is like jigsaw puzzle. Because, something are constantly done, and then changed again. We do not have a sustainable educational policy and as if there are missing pieces it cannot be completed."}, {"section_title": "Ms. Sezgin:", "text": "The education policy in Turkey is like exchange rate. It is very difficult to predict what will happen tomorrow. Because, it's not clear."}, {"section_title": "Mr. Karaman:", "text": "Because, it's all hodgepodge. Every new change putting into practice confuses teachers and students' minds.\nMs. Altun: I think that the education policy in Turkey displays an ambivalent feature. It is just like adolescent behaviour. Because, the adolescents often behave ambivalently."}, {"section_title": "Category 2. Changeability", "text": "In this category, the metaphors 'chameleon', 'human life', and 'seasons' are interviewed, respectively."}, {"section_title": "Ms. Yilmaz:", "text": "The chameleon changes its colour according to the environmental conditions. The education policy in Turkey is similar to chameleon. Because, its colour and shape change according to government policies, such that the education policies are re-determined according to the every new Minister of National Education. It does not show consistency, it changes constantly."}, {"section_title": "Ms. Guner:", "text": "The human life is in constant changes. The education policy in Turkey is similar with human life. Because, it can change at any moment like human life."}, {"section_title": "Mr. Yalcin:", "text": "The education policy in Turkey is like seasons. Just like the seasons, it shows a variable structure. Because, the new changes are observed constantly depending on the changing conditions."}, {"section_title": "Category 3. Inevitableness", "text": "In this category, the metaphors 'lifespan of a butterfly', 'the traffic in Istanbul', 'dartboard', 'swamp', 'labyrinth', 'earthquake' are interviewed, respectively."}, {"section_title": "Ms. Altan:", "text": "The education policy in Turkey is like the lifespan of a butterfly. Because of these implementations we are trying to fit a lot of things in a short time.\nMr. Tatli: I believe that it's similar to the traffic in Istanbul. Because, every individual in the system carries anxiety to reach a place in time as like the traffic in Istanbul."}, {"section_title": "Ms. Guzel:", "text": "The education policy in Turkey is like a dartboard. Due to the policies implemented in education system I feel as I turn into target board."}, {"section_title": "Ms. Odabasi:", "text": "If the appropriate policies do not set, the system will continue sinking."}, {"section_title": "Mr. Taskin:", "text": "If someone gets in, cannot go out again, helplessly wallows in it.\nMr. Taskin: The education policy in Turkey is like a labyrinth. Because, someone once gets inside he/she cannot go out again.\nMs. Toprak: I think, so that the education policy in Turkey is similar with an earthquake. The constantly changing policies affect our lives negatively like an earthquake."}, {"section_title": "Category 4. Subjectivity", "text": "In this category, the metaphors 'play dough', 'microphone', and 'scenario of series' are interviewed, respectively.\nMs. Ceylan: I believe that the education policy in Turkey is like a play dough. Because, it is shaped according to the political understanding. Handling it, is trying to shape it as he/she wants.\nMr. Guleryuz: I think so that, the education policy in Turkey is like a microphone. The person getting the microphone talks what he/she wants.\nMs. Yuksel: I insist that the education policy in Turkey is like a scenario of series. Namely, the writer writes it according to his/her own point of view."}, {"section_title": "Category 5. Anxiety", "text": "In this category, the metaphors 'Indian silk', a metaphor refers to something precious and hard or impossible to find , 'intelligence cube game', 'broken scales', and 'doctor's prescription' were interviewed, respectively.\nMs. Celik: I think so that the education policy in Turkey is like Indian silk. Because, it is very difficult to find another example in the world.\nMs. Alper: I believe that the education policy in Turkey is like the intelligence cube game. The new things are constantly being tried, but there are no results."}, {"section_title": "Mr. Aydogdu:", "text": "In my opinion, the education policy in Turkey is like the broken scales. Sometimes it seems like it measures correct, but it actually measures wrong."}, {"section_title": "Ms. Aygun:", "text": "It is really that Turkey's education policies evoke the doctor's prescription. Because, if the wrong policies implement they do not provide an improvement in education like the wrong drug interaction."}, {"section_title": "Category 6. Desperation", "text": "In this category, the metaphors 'autumn', 'passengers waiting for a train', 'sandglass', 'nonstitched dresses' were interviewed, respectively."}, {"section_title": "Mr. Sahin:", "text": "The education policy in Turkey is evoking the autumn. Because, the policies putting into practice do not brighten our hopes."}, {"section_title": "Ms. Bulut:", "text": "The education policy in Turkey is reminding me the passengers waiting for a train. Because, due to these policies the people want to get on the train but just watch the train."}, {"section_title": "Mr. Topuz:", "text": "The education policy in Turkey is reminding me the sandglass. Because, it is inverted periodically but nothing changes except time goes by."}, {"section_title": "Ms. Kartal:", "text": "The education policy in Turkey evokes the non-stitched dresses. Because, it is just repairing of the old but nothing changes."}, {"section_title": "Category 7. Instability", "text": "In this category, the metaphors 'Black Seas' weather', 'paving stones', 'climate', 'traditional agriculture', 'crazy consumer' were interviewed, respectively.\nMs. Alkin: Because, it's hard to know what will happen. An application is first started, 1-2 years later it is abandoned and another application put into practice. The education policy in Turkey is just like the Black Sea's weather."}, {"section_title": "Mr. Uzun:", "text": "In my opinion, the education policy in Turkey is like the paving stones. Instead of the long-term applications it can be mentioned that the education policies are implementing trial-anderror-based. Just like paving stones, it is constantly disassembled and rearranged.\nMr. Topuz: In recent years, the climate has been heavily influenced by environmental factors. The education policy in Turkey is just like the climate. Because, it is affected by differences in understanding."}, {"section_title": "Ms. Engin:", "text": "In traditional agriculture, it is very difficult to predict how much the harvest will be. It is not easy to predict the outcomes of the educational policies in Turkey. When viewed from this angle, the education policy in Turkey is just like the traditional agriculture.\nMs. Kara: Since every year a different model is being tested, I believe that the structure of political practices in education is just like the crazy consumer's behaviour."}, {"section_title": "Category 8. Inconsistency", "text": "In this category, the metaphors 'tuning of the oriental music instrument', 'reform movements', 'waves of the Black Sea', 'the ship without route', 'wind' were interviewed, respectively."}, {"section_title": "Mr. Duzgun:", "text": "If the accord is not good the listeners do not enjoy the music. In my opinion, the education policy in Turkey is similar to tuning of the oriental music instrument. Because, unless the policies are consistent, the desired result is not obtained."}, {"section_title": "Ms. Sarı:", "text": "The education policy in Turkey is similar to reform movements during Ottoman Empire. Because, every minister makes the new regulations, but a certain standard cannot be met."}, {"section_title": "Ms. Guldalı:", "text": "It is really that the education policy in Turkey evokes the waves of the Black Sea. Because sometimes it goes up, sometimes goes down, sometimes pulls in it, and sometimes lifts out."}, {"section_title": "Mr. Gungor:", "text": "In my opinion a chance based strategy is followed in the educational implementations. That's why it evokes a ship without route."}, {"section_title": "Ms. Ergen:", "text": "In my opinion Turkey's education policy constantly changes its direction. That's why the education policy in Turkey evokes the wind that changes its direction, constantly."}, {"section_title": "Category 9. Awareness", "text": "In this category, the metaphors 'kiwi fruit', 'rainbow', 'bank officer', 'raindrops', 'oil paintings' were interviewed, respectively."}, {"section_title": "Ms. Caglayan:", "text": "The education policy in Turkey evokes the kiwi fruit. Because, the education policies appeal to everyone and have a different impact on everybody.\nThe education policy in Turkey evokes me the bank officer. Because, the bank officer offers different alternatives. I just need to look at it in a positive way."}, {"section_title": "Ms. Altındal:", "text": "In my opinion, education policy in Turkey addresses to every student, each one is considered as a colour of the rainbow."}, {"section_title": "Ms. Avci:", "text": "In my opinion, the education policy in Turkey creates a different feeling on every individual. That's why it is similar to the raindrops."}, {"section_title": "Ms. Tuna:", "text": "In my opinion, the education policy in Turkey is similar to the candy floss. Because, every innovation breaks monotony and excites students like the candy floss.\nMr. Cepni: I think so that the education policy in Turkey is like the oil paintings. So that the education policies are interpreted differently from person to person."}, {"section_title": "Discussion and Conclusions", "text": "This study aims to determine the metaphorical perceptions of prospective teachers regarding Turkey's education policies. Prospective teachers produced 135 valid metaphors. As a result of the content analysis nine main categories were determined. The categories are namely, uncertainty, changeability, inevitableness, subjectivity, anxiety, desperation, instability, inconsistency, and awareness. These results show that prospective teachers almost have a critical perspective related to the educational policies implemented in Turkey. The metaphors and focus group interview results show that the prospective teachers perceive negatively the frequent changing policies and educational practices. Actually, the education policies create the sense of 'uncertainty' in prospective teachers. Similarly, in a study conducted by Sezgin-Nartgun and Gokcer (2014), the participants use game, puzzle, labyrinth, chameleon, colonist policy, wind rose, politics, decaying building, ragtag metaphors related to the Turkish Education Policy. March and Simon (1959) , and Morris (1997) state that the educational systems suffer from uncertainty, therefore it is difficult to identify appropriate innovations. In addition, Olssen, Codd and O'Neill (2004) assert that the policies in democratic communities must be determined considering the needs of nationwide community.\nThe findings from metaphors and the focus group interviews show that the education policies in Turkey create a perception of the inevitableness in prospective teachers. Stromquist (2005) , states that the schools are the most basic institutions of the education system that have conventional ways of operating, so it is difficult and often unnecessary to engage in drastic changes in education policies. The findings from metaphors and focus group interviews show that the prospective teachers have the perception that educational policies are subjective because they are determined by a small group. In fact, the education policies should be determined with wide participation. Thornburg (2002) , offers that the suggestions of the parents, educators, and business leaders about educational problems should be considered to make improvement.\nFindings indicated that the prospective teachers are anxious because of the educational policies putting into practice. Similarly, in previous studies conducted by Sezgin-Nartgun and Gokcer (2014) , and Orucu (2014) the participants have increasing anxiety for their future life because of the education policies implemented in Turkey. The results also show that the prospective teachers have the perception of desperation. It can be said that this is a disturbing situation. Without happy and hopeful teachers, we cannot give hope to our students. In fact, Noddings (2003) , states the happiness should be an aim in education, and a good education system should contribute significantly to individual and collective happiness. Prospective teachers perceive the education policies as instable and inconsistent. Actually, education policies should be determined, consistent, and sustainable. Whitty (2005) , asserted that we need to recognise that educational policy that ignores wider social issues 'will be not only blind but also harmful'. In contrast, prospective teachers produced some metaphors that these education policies create 'awareness'. This results show that the prospective teachers have also produced the positive meaning units. Moreover, education should ensure awareness for people in any case.\nBased on these results it can be suggested that the policy makers should determine the steady and reliable policies consistent with Turkey's own dynamics. And the education policies should give confidence and determination in a participatory way in Turkey. In education policy determining process, the individual and common requirements should be considered. The education policies should be long-term and visionary. In addition, a national education policy should embrace the participation of all sections of society, these policies should not change depending on each government and"}]