[{"section_title": "Abstract", "text": "Abstract One theory of age-related cognitive decline proposes that changes within the default mode network (DMN) of the brain impact the ability to successfully perform cognitive operations. To investigate this theory, we examined functional covariance within brain networks using regional cerebral blood flow data, measured by 15 O-water PET, from 99 participants (mean baseline age 68.6 ± 7.5) in the Baltimore Longitudinal Study of Aging collected over a 7.4 year period. The sample was divided in tertiles based on longitudinal performance on a verbal recognition memory task administered during scanning, and functional covariance was compared between the upper (improvers) and lower (decliners) tertile groups. The DMN and verbal memory networks (VMN) were then examined during the verbal memory scan condition. For each network, group differences in node-to-network coherence and individual node-to-node covariance relationships were assessed at baseline and in change over time. Compared with improvers, decliners showed differences in node-to-network coherence and in node-to-node relationships in the DMN but not the VMN during verbal memory. These DMN differences reflected greater covariance with better task performance at baseline and both increasing and declining covariance with declining task performance over time for decliners. When examined during the resting state alone, the direction of change in DMN covariance was similar to that seen during task performance, but node-to-node relationships differed from those observed during the task condition. These results suggest that disengagement of DMN components during task performance is not essential for successful cognitive performance as previously proposed. Instead, a proper balance in network processes may be needed to support optimal task performance."}, {"section_title": "Introduction", "text": "The default mode network (DMN) of brain activity was first described in 1997 by Shulman and colleagues Shulman et al., 1997) , and has since become one of the most widely studied networks in brain aging (Dennis & Thompson, 2014; Hafkemeijer, van der Grond, & Rombouts, 2012) , neurodegenerative disease (Zhou & Seeley, 2014) and dysfunction (Buckner, 2013; Kesler, 2014) . This network, thought to be involved in selfreferential processes (Gusnard, Akbudak, Shulman, & Raichle, 2001; Shulman et al., 1997; Spreng, Mar, & Kim, 2009) , spontaneous thought , memory processes (Andreasen et al., 1995; Greicius & Menon, 2004) and perhaps information consolidation and stabilization (Boly et al., 2008; Buckner & Vincent, 2007; , gained special attention within the neurodegenerative field due to the involvement of regions that are particularly prone to the accumulation of pathology in aging and Alzheimer's disease (Buckner et al., 2005; Morris et al., 2001) .\nEarly studies of age-related differences in default mode activity patterns also suggested a possible role of the network in cognitive decline. These studies found reduced task-related deactivation or increased baseline activity in regions commonly associated with the default mode during task performance in older individuals (Grady, Springer, Hongwanishkul, McIntosh, & Winocur, 2006; Lustig et al., 2003; Persson, Lustig, Nelson, & Reuter-Lorenz, 2007) , leading to the theory that an inability to inhibit or shift resources from default mode processes to those involved in the task at hand would result in lower cognitive performance (Grady et al., 2006; Lustig et al., 2003) . Other studies of individuals with cognitive impairment supported the findings, showing that those with mild cognitive impairment and Alzheimer's disease (Dennis & Thompson, 2014; Hafkemeijer et al., 2012 ) also exhibited differences in default mode function, particularly network connectivity.\nSeveral studies have since examined the DMN and its role in cognition. These studies have shown that the degree of task-related DMN deactivation is related to the degree of difficulty on a variety of tasks (McKiernan, Kaufman, Kucera-Thompson, & Binder, 2003; Persson et al., 2007; Rombouts, Barkhof, Goekoop, Stam, & Scheltens, 2005) . It has also been shown that greater deactivation is associated with better task accuracy (Pihlajamaki & Sperling, 2009) , and that the degree of deactivation is less in older individuals who show subsequent cognitive decline (Persson et al., 2008) . These results support the suggestion that greater suppression of default mode activity promotes better cognitive performance. However, there are other findings to the contrary. Decreased functional connectivity in the anterior portion of the DMN has been associated with lower executive function (Damoiseaux et al., 2008) , and increased functional connectivity between medial prefrontal and posterior cingulate regions of the default network has been associated with better memory performance (AndrewsHanna et al., 2007; Esposito et al., 2006; Hampson, Driesen, Skudlarski, Gore, & Constable, 2006) and executive function (Andrews-Hanna et al., 2007) . Taken together, it is fair to say that we still do not fully understand the role of the DMN in cognition. Furthermore, although longitudinal studies of default mode function in older populations are beginning to emerge (Persson, Pudas, Nilsson, & Nyberg, 2014) , we have yet to fully understand the changes that occur within this network with increasing age.\nHere, we examine both default and task networks over a 7 year period in Baltimore Longitudinal Study of Aging (BLSA) participants who decline in memory performance during that time and those who do not. Using biennial evaluations of brain function, measured by regional cerebral blood flow 15 O-water positron emission tomography (rCBF PET) which is an indirect marker of neuronal activity (Jueptner & Weiller, 1995) , we assessed regional covariance within the DMN and within a network activated during a verbal recognition memory task. Because our PET rCBF scans were acquired as a summed image over a period of 1 min, the method does not produce the same temporal dynamic signal profile used in studies of functional connectivity with functional magnetic resonance imaging (fMRI). Nevertheless, the concept of connectivity was originally conceived and developed using PET data (Friston, Frith, & Frackowiak, 1993; Herbster et al., 1996; Horwitz, Duara, & Rapoport, 1984) , and recent studies of regional covariance within the default mode network examined with fluorodeoxyglucose (FDG) PET data closely approximate functional connectivity findings observed with fMRI (Passow et al., 2015; Riedl et al., 2014) . Both FDG and rCBF PET techniques are indirect measures of neuronal function and are correlated with one another, as glucose transport to metabolically active areas is provided by localized increases in CBF (Tatlidil, Luther, West, Jadvar, & Kingman, 2000; Wong et al., 2006) . Thus, covariance analyses using rCBF can also be viewed as a potential marker of functional connectivity in the brain when considered in conjunction with other factors that may play a role in rCBFdefined brain activity levels.\nWe examined rCBF covariance within the DMN and verbal memory networks (VMN) during the performance of a verbal memory task to assess the characteristics of both networks during memory processes. Because the majority of default mode studies use data from the resting state, we also analyzed DMN covariance during rest. We divided our sample of 99 cognitively normal participants into tertiles based on changes in their verbal memory task performance over time, and examined differences between the upper and lower performance groups. Our goal was to characterize group differences in longitudinal change in both default and task networks, in an effort to better understand the contributions of these networks to cognitive performance decline in older individuals as they continue to age."}, {"section_title": "Methods Participants", "text": "We used data from 99 cognitively normal older participants in the neuroimaging substudy (Resnick et al., 2000) of the BLSA (Shock et al., 1984) ; mean age at baseline = 68.6 (7.5 SD), 57 males, 42 females) who had PET imaging assessments for at least 3 annual visits. None of the participants had a history of central nervous system disease (epilepsy, stroke), psychiatric disorders, severe cardiac disease (myocardial infarction, coronary artery disease requiring angioplasty or bypass surgery), or metastatic cancer at enrollment. All remained cognitively normal throughout the study. The local Institutional Review Board approved the research protocol for this study, and written informed consent was obtained at each visit from all participants.\nPET scanning parameters PET scans were administered at baseline and annual follow-up intervals through year 9 of the study. Each PET session included a resting-state scan and a scan during performance of a verbal memory task. The order of scans was counter-balanced across individuals, but remained constant within an individual across years (see (Beason-Held, Kraut, & Resnick, 2008) .\nApproximately thirty minutes before the first PET scan, participants were shown a list of 20 target words for the verbal task on a computer screen. They were instructed to silently examine each item and try to remember it for later. For the verbal memory task, approximately 40 test items were shown during the PET image acquisition interval. Twenty of these were novel distractor items intermixed with the original 20 target items. Stimulus presentation began with isotope injection. After the isotope reached threshold level in the brain, scanning occurred for 60 s while task performance continued until the subject completed 40 trials. During the task, participants were asked to indicate whether or not they had seen each item before by pressing buttons in their right or left hands (a detailed description of the task can be found in (Beason-Held, Golski, Kraut, Esposito, & Resnick, 2005; Golski, Zonderman, Malamut, & Resnick, 1998) . Accuracy and reaction times were recorded throughout the task. To reduce practice effects over time, two forms of the task were administered. One form was given on odd years, and one form on even years. Due to differences in performance levels on the two forms of the verbal task, scans from odd years were used in the analyses to maximize data points for the present study (e.g. 1,3,5,7,9) . For the resting-state scan, participants were instructed to keep their eyes open and focused on a computer screen covered by a black cloth for the 60 s scanning interval.\nPET measures of regional cerebral blood flow (rCBF) were obtained using water were injected as a bolus. Scans were performed on a GE 4096+ scanner, which provides 15 slices of 6.5 mm thickness. Images were acquired for 60 s from the time the total radioactivity counts in the brain reached threshold level. Attenuation correction was performed using a transmission scan acquired prior to the emission scans."}, {"section_title": "Group designation", "text": "For each participant, performance change over time was calculated for the verbal memory task using a linear mixed model. The performance change was based on task accuracy at each assessment, measured by sensitivity score (i.e. hits adjusted for false positives). The individuals were then divided into tertiles, and data from the upper and lower tertile groups were compared. Linear mixed models were used to assess group differences in baseline and longitudinal change in verbal memory performance."}, {"section_title": "PET image preprocessing and mixed model analysis", "text": "Image preprocessing was performed using Statistical Parametric Mapping (SPM5; Wellcome Department of Cognitive Neurology, London, England). For each participant across follow-up sessions, PET images were realigned to the first session, spatially normalized to MNI template space with 2 × 2 × 2 mm resolution, and smoothed using a full width at half maximum of 12 mm. Voxel rCBF values for all images were ratio adjusted and scaled to a mean global flow of 50 ml/ 100 g/min.\nThe data were analyzed in 3 stages. First, we defined the voxels involved in the default mode and verbal memory networks using the whole sample of participants. The default mode rCBF pattern of brain activity, defined as activity occurring in the resting-state relative to the task activation state, was determined by contrasting the rest condition with the verbal memory condition (rest-verbal) at baseline, controlling for baseline age and sex. The verbal memory rCBF pattern of activity was defined by contrasting the verbal memory condition with the rest condition (verbal-rest) at baseline (significance threshold p ≤ 0.005, spatial extent 50 voxels), again controlling for age and sex. Next, network nodes were defined based on the local maxima of activity produced in each contrast. For each node, age and sex adjusted rCBF values were extracted from 10 mm spheres centered on the local maxima derived from each contrast. Finally, the rCBF values from each local maxima or node in the default and verbal memory networks were used in covariance analyses to assess the functional relationship between regions.\nAll covariance analyses were performed using the R Statistical package (R version 3.0.1). Two types of analyses were performed. We calculated Bnode coherence^and Bnode covariance^and determined differences between the upper and lower tertiles of participants in these measures. BNode coherence^examined the overall relationship between a single node and the rest of the network as a whole. BNode covarianceê xamined the relationship between two individual nodes.\nIn the node-to-network coherence analyses, rCBF in a single network node was correlated with the rCBF in each of the other nodes in the network, and the group difference in mean correlation levels for each single node was assessed. Thus, coherence was calculated by summarizing the average association between a given node and all other nodes in the network to provide a measure of how strongly related a given node is to the entire network. High coherence signifies that a given node is strongly coupled with all other nodes in the network. Our approach is similar to previous network applications in fMRI (Horovitz et al., 2009; Uddin et al., 2008) and PET (Herbster et al., 1996) that assessed the correlation between a node and the rest of the network.\nBNode covariance^analyses were then used to determine the node-to-node differences that drive the observed group difference in the single node coherence analysis (Horwitz, Grady, Schlageter, Duara, & Rapoport, 1987) . Thus, in the node covariance analysis we reexamined all node-node pairs for those single nodes that showed significant group differences in node coherence. Using a method comparable to that developed by Horwitz et al. (Horwitz et al., 1987) , we examined group differences in the correlation between rCBF in the significant single nodes from the previous step and rCBF in each of the other nodes within the network individually.\nAll analyses were performed for the default mode and verbal memory networks during the verbal memory condition, and for default mode network during the rest condition alone. Both baseline and longitudinal analyses of coherence and covariance were performed as described below.\nBaseline coherence: node-to-network analysis The coherence analysis was used to summarize group differences in the association between blood flow in one region and blood flow in all other regions in the network. For this analysis, we first determined the group difference in the association between a given node (region i ) and every other node using linear regression. For each model, rCBF in region i was set as the outcome, rCBF in region j , cognitive_group (upper vs. lower tertile) and cognitive_group x region j interaction were set as a predictors. Next, we extracted the interaction betas and standard errors for each node i -node j pair and used a fixed effects meta-analysis model (metafor package in R) to determine the mean group interaction effect across all node-node pairs for a given node. Thus, the resulting fixed effects beta for node i represents the average group difference in the association between rCBF in node i and rCBF in all other nodes in the network. A single fixed-effects beta was calculated for each node and the Bonferroni procedure was used to correct for multiple comparisons. This analysis was performed for both the default mode and verbal memory networks during the verbal memory scan condition, and for the default mode network during rest.\nBaseline covariance relationships: node-to-node analysis For each single node showing a significant coherence difference between upper and lower tertile performance groups, node-node covariance was examined to determine the specific node-node relationships that contribute to the group differences in coherence. For these post-hoc analyses, we simply examined the cognitive_group x region j interactions that were entered into region's meta-analysis in the coherence analysis above. Thus, for each node-node pair we evaluated whether the two cognitive groups differed in the association between rCBF in the predictor node and outcome node (cognitive_group x region j interaction term; p < 0.05 uncorrected).\nLongitudinal coherence: node-to-network analysis As in the baseline analyses, coherence was calculated to summarize the association between a given node and all other nodes in the network using a meta-analysis. Here, we began with a given region (region i ) and analyzed group differences in the mean change in correlation between that region and every other region in the network (region j ) using a generalized least square (gls) model. Time was coded as Byear^(e.g. 1,3,5,7,9). As in the baseline analyses, region i was set as the outcome, and the predictors included region j , cognitive_group, year, all the 2-way interactions, and the three-way interaction year x cognitive_group x region j . To calculate the group difference in the change in the mean correlation over time between a given node (region i ) and all other nodes in the network, the beta and standard error values from the three-way interaction term were extracted for every region i -region j combination, and a metaanalysis procedure was performed. Correction for multiple comparisons was performed using the Bonferroni procedure.\nLongitudinal covariance relationships: node-to-node analysis For the longitudinal covariance analyses we again used a generalized least square model as outlined in Longitudinal Coherence section. For single nodes showing a significant coherence difference between groups, we re-examined the year x cognitive group x region j interaction terms that were entered into the meta-analysis above to identify the node pairs driving the observed coherence effect (p < 0.05 uncorrected)."}, {"section_title": "MRI scanning", "text": "Scanning was performed on a GE Signa 1.5 Tesla scanner (Milwaukee, WI). A 3-D T1-weighted spoiled gradient refocused (SPGR) MRI scan (35 ms TR, 5 ms TE, 24 cm FOV, 45°flip angle, 256x256 matrix, 0.94x0.94 mm voxel size, 1.5 mm slice thickness, 124 slices) was obtained at each imaging visit."}, {"section_title": "MRI volume calculation", "text": "The MRI scans were segmented into gray matter, white matter and cerebrospinal fluid, and spatially normalized into stereotactic space using a high-dimensional elastic warping method (Davatzikos, Genc, Xu, & Resnick, 2001 ) and a volumepreserving transformation (Shen & Davatzikos, 2002) . Binary maps of the DMN and VMN clusters were generated from the PET analysis, and total volume of gray + white matter were calculated within each cluster for each participant. The total volume of each region was then included as a covariate to control for the effect of tissue loss on network covariance patterns."}, {"section_title": "Results", "text": "Group designation For each participant, the performance change on the verbal task was calculated across years 1-9 using linear mixed models. The mean assessment or scan interval of all participants was 7.4 (1.5) years; 61 % of the group had 9 assessments, 27 % had 7 assessments, and 12 % had 5 assessments. The sample was then divided into tertiles to compare the performance of the upper and lower tertile groups (Table 1) . There were no significant differences between the tertile groups in age, sex, inter-scan interval or Mini-Mental State Exam performance levels at baseline or in change over time (pooled estimate t-test p's > 0.30). Linear mixed model analysis of the data showed that at baseline, the lower tertile group had significantly higher mean verbal memory performance compared with the upper tertile group (DF = 146, t = 3.89, p < 0.0002; Fig. 1 ). There was also a significant group difference in longitudinal change in verbal memory performance (t = 9.51, p < 0.0001), with significant improvement in verbal performance over time seen in the upper tertile group (t = 6.91, p < 0.0001) and significant decline in performance seen in the lower tertile group (t = 6.55, p < 0.0001). The upper tertile group will be referred to as the cognitive improvers (CI), and the lower tertile group will be referred to as the cognitive decliners (CD).\nThe default mode network The rCBF pattern of activity within the DMN is shown in Fig. 2 . Because most standardized atlases of default mode activity are based on the activity patterns observed in young subjects, we elected to define the network within our own group of older participants. The DMN regional activity pattern found in this sample is similar to that previously described by our group (Beason-Held, Kraut, & Resnick, 2009 ) and includes regions commonly observed in young subjects (Yeo et al., 2011) . We included all local maxima observed in the pattern of default activity in this group of participants to define the network nodes, including those seen in the insula and entorhinal cortex. Additionally, although we used the local maxima of activity from baseline to determine network nodes, further examination of the rCBF activity patterns showed no significant change in the regional local maxima over time, which is in line with previous findings from our lab (Beason-Held et al., 2009 The verbal memory network The rCBF pattern of activity within the verbal memory network (VMN) is shown in Fig. 2 . rCBF values were extracted from bilateral local maxima in orbitofrontal cortex (BA 11), bilateral medial frontal cortex (Med Fr; BA 8), bilateral middle frontal gyrus (MFG; BA 47), bilateral anterior insula, right inferior temporal gyrus (ITG; BA 20), bilateral inferior parietal cortex (BA 40), right brainstem, and left cerebellar regions."}, {"section_title": "Baseline coherence: node-to-network analysis", "text": "The first step in the analyses was to examine the baseline relationship of each node within the DMN to the network as a whole, and determine group differences in these node-tonetwork relationships. These results describe the nodes which showed differences in node-to-network relationships between the decliner and improver groups.\nDMN during verbal memory 4 nodes within the DMN showed greater coherence levels in decliners relative to improvers at baseline during the verbal memory condition ( Table 2 ), suggesting that these nodes are more strongly associated with the overall DMN in the decliner group at baseline during verbal recognition memory. These included bilateral medial frontal, right MTG, and bilateral precuneus nodes (Table 2) ."}, {"section_title": "VMN during verbal memory", "text": "No nodes within the verbal memory network differed in coherence levels between decliner and improver groups at baseline. It should be noted that analyses performed without correcting for tissue volume of the activated regions did show a difference in one node between decliner and improver groups, but this difference was no longer significant when volume was included in the model. DMN during rest 12 nodes within the DMN showed differences in coherence levels between decliner and improver groups at baseline (Table 2 ). These nodes all showed greater coherence in the decliner group, again suggesting that the nodes are more strongly associated with the network at baseline. The nodes were located in the left ACC, bilateral insula, right STG, bilateral MTG, left MOG, bilateral PCC and precuneus regions, and the right cuneus. Together, these results show node-to-network differences in the DMN but not the VMN during verbal recognition performance at baseline. These node-to-network differences were reflected as greater coherence in decliners relative to improvers, and suggest that the DMN is not inactive during cognitive performance. Instead, the greater DMN coherence was observed when the decliner group performed at higher levels than the improver group.\nAlthough the DMN examined during the resting state exhibited the greatest number of node-to-network differences between the groups, it is of also interest that middle temporal and precuneus nodes that show greater coherence in the DMN during the verbal task also show greater coherence during the resting state, suggesting that decliners show some similarities in overall node-to-network coherence between the two states.\nBaseline covariance relationships: node-to-node analysis After determining the regional nodes which showed group differences in node-to-network coherence, we then examined the individual node-to-node relationships of these areas to define specific regional associations that could be driving the differences in network coherence.\nNo follow-up node-to-node analyses were performed for the VMN due to the lack of significant group differences in node-to-network relationships in the previous step.\nBecause there were no significant group differences in node-to-network relationships in the previous step, no follow-up node-to-node analyses were performed for the VMN.\nDMN during rest Group differences were seen in the strength of covariance over time between the left insula and the right ACC, and the left insula and bilateral PCC regions. The left entorhinal cortex and showed a group difference in the change in covariance with the left STG. In all cases, these relationships declined in strength over time in the decliner group, while increasing (insular associations) or remaining stable (entorhinal association) in the improver group (Table 4 , Fig. 4 ). These results show that the DMN undergoes changes over time in the decliners during the verbal memory performance. These changes are reflected as greater coherence and covariance in medial temporal lobe structures and declining covariance in posterior precuneus regions. DMN changes during the resting "}, {"section_title": "DMN during verbal memory", "text": "The 4 nodes that demonstrated greater baseline coherence in decliners showed 10 individual associations with other regions that were stronger in the decliner group at baseline. The medial frontal, middle temporal and precuneus nodes exhibited stronger relationships predominately with temporal lobe regions including the temporal pole, entorhinal cortex, hippocampus and superior temporal gyrus. A detailed list and illustration of the node-to-node associations are shown in Table 3 and Fig. 3 ."}, {"section_title": "DMN during rest", "text": "The 12 nodes that demonstrated greater baseline coherence showed 30 individual associations with other regions that differed between the groups. These correlations were stronger in the decliner group. The insula, MTG, PCC and precuneus regions exhibited the largest number of increased node-to-node covariance levels, with stronger relationships most prominently observed with medial frontal and temporal regions including the temporal pole, entorhinal cortex and hippocampus (Table 3, Fig. 3) .\nTogether, these results illustrate the individual node-tonode relationships for the regions that showed node-tonetwork coherence differences in decliners. These results show altered DMN covariance in the decliner group at baseline, particularly in temporal lobe regions. Although temporal lobe regions make up a large percentage of node-to-node differences within the DMN during both task and rest, the specific node-to-node relationships are not the same for the two conditions. In contrast to similarities in the node-to-network results noted in the previous section, these more specific findings suggest that resting state regional relationships are not an exact proxy for DMN function during memory performance.\nOnly two nodes showed group differences in the change in correlations between a single node and the rest of the network over time. These nodes were located in the left insula (Beta = −0.028, corrected p = <0.001) and left entorhinal cortex (Beta = −0.020, corrected p = 0.043). The insular node also showed group differences in the baseline analyses."}, {"section_title": "Longitudinal coherence: node-to-network analysis", "text": "In the next analysis, we determined the change in node-tonetwork coherence over time for each node in the DMN and VMNs. This step allowed us to identify nodes that show a significant change in coherence, and determine group differences in the change over time. The direction of coherence change is evaluated in the subsequent node-to-node level analyses.\nDMN during verbal memory Two nodes showed group differences in the change in correlations between a single node and the rest of the network over time. These nodes were located in the right entorhinal cortex (Beta = 0.021, corrected p = 0.040) and right precuneus regions (right Beta = 0.037 corrected p < 0.001). The precuneus node also showed group differences in the baseline analyses. VMN during verbal memory No nodes showed group differences in the change in correlations over time. As in the baseline condition, analyses performed without correcting for tissue volume of the activated regions did show a difference in one node between decliner and improver groups, but this difference was no longer significant when volume was included in the model."}, {"section_title": "Longitudinal covariance relationships: node-to-node analysis", "text": "This analysis allowed for the identification of individual nodeto-node relationships in areas of significant coherence change over time, and the assessment of the direction of the change in the regional relationships. These results describe significant changes in regional relationships which were greater in the decliner relative to the improver group.\nDMN during verbal memory DMN nodes assessed during the verbal condition showed both directions of change over time in the decliner group. Entorhinal relationships with the hippocampus and parahippocampal gyrus showed greater increases in decliners relative to improvers. Precuneus associations with the temporal pole showed declining covariance in decliners, with stable covariance observed in improvers (Table 4 , Fig. 4 )."}, {"section_title": "Discussion", "text": "In this longitudinal study, we demonstrate that functional relationships within brain networks differ between participants who improve their verbal memory performance over time and those who decline. Differences in covariance were found in the default mode network during verbal memory performance, and these differences were observed at baseline and in change in covariance strength over time. In contrast, no significant differences were seen in the verbal memory network between the two groups. Because the networks were examined during memory performance, these findings suggest that the default mode network plays a role in cognitive performance. Early studies of the DMN found that deactivation of the network during task performance was decreased in older individuals compared to younger and middle-aged individuals (Grady et al., 2006; Lustig et al., 2003; Persson et al., 2007) , leading to the default mode interference theory. According to this theory, the inability to suppress default mode activity during task performance is thought to result in increased interference which negatively affects performance levels (Grady et al., 2006; Lustig et al., 2003) . Subsequent studies provided further support by demonstrating that the degree of DMN deactivation (Persson et al., 2007) and functional connectivity (Esposito et al., 2006; Greicius, Krasnow, Reiss, & Menon, 2003) differed based on task demands, with minimal network differences seen during low demand tasks and greater differences observed during high demand tasks. Fig. 3 Illustrations of the nodes showing significant differences in single node coherence and their individual node-to-node relationships. Red nodes illustrate differences between the improver and decliner groups; significant single nodes showing group differences in coherence are outlined in yellow, nodes affected by differences in individual node-tonode relationships of the coherence nodes are outlined in black. Green nodes showed no group differences in coherence or node-to-node relationships. DMN relationships are shown during task and rest conditions, VMN relationships are shown during the task condition. All patterns represent greater relationships in the decliner group relative to the improver group Here, we address the role of the DMN in cognitive performance by examining default mode and verbal memory task networks in older individuals from the BLSA. Although all participants in this study were cognitively normal, high performing older adults who have been followed in the study for many years, these participants demonstrated changes in task performance levels as they continued to age. Using changes in task performance levels over time, we divided our participants into tertiles, and examined differences in network covariance as a marker of functional connectivity between the upper and lower tertile groups. The upper tertile group showed a pattern of improved performance over time, likely representative of a practice effect resulting from repeated exposure to the task. The lower tertile group, while not impaired on the task, exhibited a significant decline in task accuracy over time. Interestingly, the decliner group performed better than the improver group at the initial assessment, perhaps contributing the significant downward slope of performance over time. While regression to the mean may account, in part, for the observed differences in change over time, it is also possible that the early spikes in performance and covariance patterns represent early compensatory brain changes that precede future performance decline (Filippini et al., 2009; Fleisher et al., 2009 ). Another possibility is that the decline over time may be due to secondary cognitive processes related to deficits in learning or long term memory across visits. That is, perhaps the decliner group is incapable of learning the task to the same extent as the improver group over time, and therefore does not exhibit the improved performance levels resulting from repeated testing."}, {"section_title": "Networks during verbal memory", "text": "At baseline, four nodes within the DMN showed differences between the improver and decliner groups when the network was examined during the verbal memory scan condition. These group differences were seen in the way each node interacted with the network as a whole (coherence), and in individual node-to-node relationships (node-to-node covariance). The affected regions primarily involved medial frontal and precuneus nodes, but also included a node within the middle temporal gyrus. In all cases, the nodes exhibited increased network coherence in the decliner compared to the improver group. The decliner group also showed greater node-to-node covariance strength between the medial frontal cortex and regions in the temporal lobe, including the temporal pole, entorhinal cortex, and hippocampus. In contrast, the VMN showed no differences between the groups at baseline, demonstrating that of the two networks examined, functional covariance differences between decliners and improvers were limited to the DMN during task performance. At first glance, it would appear that the increased DMN covariance during verbal memory performance in decliners fits with the theory that cognitive impairment results from the inability to suppress default mode activity during task performance. However, our results are contrary to this theory. At the initial baseline assessment, the subsequent decliner group outperformed the improver group on the recognition memory task. It is while the decliner group exhibited greater task accuracy that the widespread increases in DMN coherence and node-to-node covariance strength were observed. This suggests that higher network coherence and node-tonode DMN relationships during task performance may not be associated with reduced cognitive performance as previously proposed.\nIn terms of longitudinal network function, entorhinal and precuneus nodes of the DMN exhibited longitudinal changes in coherence in the decliners relative to the improvers during verbal memory performance. These nodes, in turn, demonstrated a combination of both increasing and decreasing relationships with other network regions over time. Increasing covariance was observed between the entorhinal cortex and medial temporal regions such as the hippocampus and parahippocampal gyrus. Decreasing covariance was seen between the precuneus and the temporal pole. These results, in part, support the longitudinal findings of Persson and colleagues (Persson et al., 2014) . Using functional MRI data, they found no significant changes in specific node-to-node DMN connectivity between the medial prefrontal cortex, medial parietal cortex and lateral parietal regions over a 6 year period in older individuals. Our data show no changes in these particular associations either, but we do see changes over time in covariance between other DMN nodes. The VMN again showed no significant differences between the groups when examining longitudinal changes in covariance.\nThe pattern of both increased and decreased longitudinal DMN covariance seen in the decliner group suggests that changes to multiple DMN components may occur over time in the older brain. The decline in precuneus covariance suggests that this region of the DMN is disengaging over time during task performance. This, in theory, should promote cognitive performance under the default mode interference hypothesis, yet it is during this time period that the decliners show a significant decrease in task performance. In contrast, the increased covariance between medial temporal lobe regions could support the default mode interference hypothesis, especially if these regions are upregulating default mode processes as opposed to task performance processes. In either case, these types of changes could represent a loss of functional regulation over time."}, {"section_title": "DMN during the resting state", "text": "At baseline, half of the nodes in the DMN showed differences between the improver and decliner groups when examined during the resting state. These differences were seen in node-to-network coherence, and in node-to-node covariance relationships. The nodes demonstrating greater network coherence in the decliner group were located within the anterior cingulate, insular and temporal regions, as well as the posterior cingulate/precuneus regions. These nodes also showed greater node-to-node covariance strength with each other and with regions in the medial temporal lobe and medial frontal cortex, including the entorhinal cortex and hippocampus. In all cases, the decliners exhibited stronger correlations than the improver group.\nThese results show that participants with differential cognitive performance exhibit differences in functional covariance during the resting state, and these differences are reflected as increased covariance levels between most nodes of the DMN at the cross-sectional baseline assessment in participants who subsequently show performance declines. Previous studies have found age-related differences in functional connectivity levels during the resting state alone. Connectivity decreases with age have been seen within both anterior (Damoiseaux et al., 2008) and posterior (Grady et al., 2010) default mode regions. Although these findings show that network changes occur from young to older adulthood, these age-related differences are not consistent with the present findings where we compare two groups of age-matched participants.\nIn terms of longitudinal changes, we found that only two DMN nodes displayed differences in change over time: the insula and entorhinal cortex. Both of these nodes exhibited a decrease in coherence over time in the decliner group. These nodes also showed declining covariance strength between the insula and anterior and posterior cingulate nodes, and between the entorhinal cortex and superior temporal gyrus in decliners, while improvers showed increasing (insular) or stable (entorhinal) relationships over time. These findings fit more closely with previous studies of aging and age-related disease particularly in relation to posterior cingulate and temporal lobe connectivity changes (Andrews-Hanna et al., 2007; Campbell, Grigg, Saverino, Churchill, & Grady, 2013; Schwindt et al., 2013; Supekar, Menon, Rubin, Musen, & Greicius, 2008) , but the decline in covariance is again noted in during the period of worsening task performance in the decliner group."}, {"section_title": "Covariance and cognition", "text": "Overall, we find greater network changes in older individuals with declining memory performance relative to those who do not decline. During task performance, differences were observed in the DMN but not the VMN, and these DMN differences occurred in both anterior and posterior network nodes. Greater coherence was observed in the decliner group at baseline when they were performing at higher levels than improvers, and the covariance levels between individuals nodes both increased and declined with declining cognitive performance over time.\nPrevious cross sectional studies have shown that the prefrontal and posterior cingulate cortices are inversely correlated with one another when comparing rest and memory states, suggesting that task performance modulates DMN connectivity between these regions (Greicius et al., 2003 ). Yet, DMN connectivity is not disrupted during low demand tasks suggesting that the brain is also capable of dual network processing (Greicius & Menon, 2004; Persson et al., 2007) . There is also evidence of increased connectivity levels in relation to cognitive performance. Hampson and colleagues (Hampson et al., 2006) were among the first to suggest that increased DMN connectivity may be beneficial to cognitive performance. They found that increased connectivity between medial prefrontal/anterior cingulate and posterior cingulate DMN regions was positively related with task performance levels in young to early middle aged individuals. An additional study (Esposito et al., 2006) also found that increased connectivity strength of the anterior cingulate region correlated with increased memory performance in younger individuals. Together, these findings suggest that the DMN may play a critical role in cognition.\nIt is difficult to determine the exact contribution of these DMN changes to cognitive performance, yet it is reasonable to theorize that involvement of any given network during cognition may not be an all-or-none phenomenon. It seems more likely that synergistic interaction or perhaps synchrony between multiple brain networks is needed for proper performance and, as our results suggest, an imbalance in optimum processes within any participating network may contribute to task decline. This idea has been previously proposed (Andrews-Hanna et al., 2007; Grady et al., 2010) but often overlooked in default network literature.\nAlthough the resting state differs from a guided cognitive activation state, we also found significant group differences in DMN covariance at rest. Further, the direction of change in the resting state covariance was similar to that seen during task performance. While the specific node-to-node changes in default covariance were not the same as those observed in the task condition, these findings support other studies of resting state network function examining group differences in individuals with cognitive impairment and those currently cognitively normal but at greater risk of future impairment.\nSeveral studies of differences between normal individuals and individuals with Alzheimer's disease (AD) have found increased connectivity in medial prefrontal, hippocampal, posterior cingulate and occipital regions of the DNM in AD (Gardini et al., 2015; K. Wang et al., 2007; L. Wang et al., 2006; Zhang et al., 2009) , illustrating that all changes in this network may not reflect decreased connectivity. More relevant, however, are the studies that examined functional connectivity in older participants at greater risk for AD but without current symptoms (Filippini et al., 2009; Fleisher et al., 2009) , and cognitively normal individuals with subjective cognitive complaints who are at higher risk for subsequent cognitive impairment (Hafkemeijer et al., 2013) . In these cases, increased connectivity was observed in medial prefrontal, lateral and medial temporal, and posterior cingulate regions in those at greater risk of future disease or impairment. Because of the increased likelihood of subsequent cognitive impairment in these groups, the authors generally conclude that the increased connectivity in some parts of the DMN may compensate for disruptions in other parts of the network.\nAlthough our findings support the occurrence of increased connectivity in the DMN during the resting state in individuals with differential cognitive performance, it is difficult to attribute the differences to impending cognitive failure, as our participants remain cognitively normal more than 10 years after the last PET assessment.\nTogether, our study illustrates that subtle changes in brain network relationships occur in cognitively intact older adults with declining cognitive performance. Although the results show that activity levels within these network regions are associated with one another which may be suggestive of connectivity between regions, PET data lack the temporal dynamic signal profile of other imaging modalities that allows for a more conclusive assessment of regional connectivity. Additionally, other factors related to rCBF differences between the groups should also be considered. It is possible that group differences in early disease processes, including subclinical cerebrovascular disease or the preclinical onset of AD neuropathology, could drive alterations in cerebral perfusion and neurovascular coupling that may contribute to the observed differences in regional covariance. Until we are able to determine neuronal processes related to the covariance changes, the exact contributions of these relationships to cognitive performance remain to be defined."}]