[{"section_title": "", "text": "Becoming literate includes the acquisition of numerous foundational skills that support being able to read and write. While reading development has received considerable attention, the ability to write and its commensurate components have been slighted. In 2003, the National Commission on Writing declared that writing was the most neglected basic skill in U.S. schools (see Graham & Perin, 2007) . Currently, however, there is a call for a stronger focus on writing and supporting students' achievement in this fundamental, but complex, competency. Various stakeholders are more vigorously raising expectations for students' writing development, especially among more academically vulnerable populations, including English learners (ELs). Essentially, writing has become a gateway skill for advanced educational opportunities; both the ACT and SAT exams added assessments of writing in the last decade. But writing has also gained in its role in social communication. More daily communications are done via email and text messaging-although less formal in their structure-making the content and format of written messages a documented indicator of communicative competence and viable means to interact socially with others and do business.\nIn 2011, the National Assessment of Education Progress (NAEP; National Center for Education Statistics, 2012) initiated a computer-based writing assessment that involves 22 tasks, including intertextual comparisons of videos, photographs, and animation to support synthetic responses composed on laptops. These expectations are daunting for most students and the 2011 scores indicate that less than one third of eighth-grade students performed beyond the basic level. The overall scores were weak, but especially for some minorities and ELs. The average NAEP writing score for Latinos was 136, compared with 158 for Caucasians and 165 for Asians. For eighth-grade ELs, the average score was 108 compared with 152 for non-ELs. Thus, one significant achievement gap in contemporary U.S. schools is that separating ELs from non-ELs. Because ELs are learning to write while still developing English language proficiency, this disparity is not surprising, but deserves to be a priority among educators and researchers. In particular, the development of academic language in English that characterizes school-based reading and writing should be a focus of research that can inform instruction.\nThe underdeveloped English writing competency (as noted by standardized test scores) among ELs is a complex issue influenced by numerous linguistic, scholastic, social, economic, and researchbased elements. English as a second language instruction should include support of and instruction in listening and speaking, reading, and writing, but attention to second-language (L2) writing has often been delayed or neglected. With the stronger focus on reading that accompanied responses to the No Child Left Behind Act of 2001 (2002) legislation, attention to writing remained scant, especially in English as a second language programs. Additionally, ELs have tended to have less access to educational resources and greater challenges in receiving academic support in their first language or in English (De Jong & Harper, 2005) . Many teachers admit that teaching writing is difficult and that they are not adequately prepared to do so, especially for students who may be thinking in another language while trying to communicate in English (Cartiera, 2006) . Moreover, research efforts targeting EL writing have been lacking. In their landmark synthesis of EL literacy research, as August and Shanahan (2008) noted the paucity of research on EL writing. They included only four studies on writing in their analyses, pointing out that not enough is known about L2 writing development even from the primary grades and that rigorous research is needed to improve instruction in this core academic area. The only study of writing in elementary grades in that review (i.e., Davis, Carlisle, & Beeman, 1999) recognized that cross-linguistic transfer plays an important role in L2 writing. First-language (L1) elements can transfer to L2 writing, but that transfer can be both positive and negative, which complicates the instructional process for less-informed teachers. Teachers often struggle to discern both the message and the language structures that ELs demonstrate in their writing, confounding the instructional support that ELs many need to be writing on par with their English-only (EO) peers.\nNot surprisingly, low writing ability is associated with lower academic achievement, increased school dropout rate, crime, drugs, and depression (for a review, see Graham & Perin, 2007) . Weak writers are also less likely to extend learning in the content areas (Graham & Perin, 2007) . With more sophisticated reading and writing expectations across subjects areas as expressed in the Common Core State Standards (CCSS; Council of Chief State School Officers and the National Governors Association, 2010; Troia, & Olinghouse, 2013) m vulnerable students could be more at risk for poor performance (Baker et al., 2014) . Nearly 30 years ago, the Task Force on Racism and Bias encouraged \"frequent, meaningful opportunities for students to generate their own text\" and \"frequent writing by assigning topics for a variety of audiences and purposes\" (National Council of Teachers of English, 2002, p. 4) . This advice has not been well heeded across grade levels, and once again, writing is a focal issue among notable educational entities. For example, the U.S. government's recent Educator's Practice Guide (Baker et al., 2014) for preparing elementary and middle-school students makes four, research-based recommendations for ELs; two involve writing:\nRecommendation 2: Integrate oral and written English language instruction into content-area teaching. Recommendation 3: Provide regular, structured opportunities to develop written language skills. Thus, there is an urgent need for concerted instruction and research that target EL writing development, in grades well before the achievement gap has broadened and in classrooms typical of EL circumstances. Heeding the call for emic and comparative studies of EL writing (Leki, Cunningham, & Silva, 2008) requires an understanding of and regard for the language development process, the nature of writing instruction, feasible measurements of writing achievement, and awareness of the salient characteristics of EL writers. Currently, the focus is on moving teachers and students beyond a reliance on personal narratives to informational texts-the kinds of writing that require analysis and interpretation and that relate more closely to learning academic content (Baker et al., 2014) . In fact, while long overlooked in national policy, educational reform, and curriculum development (Harris, Graham, Brindel, & Sandmel, 2009; McCardle, Miller, & Long, 2014) , writing is a hot topic and the kinds of writing being promoted and assessed are increasingly more expository in nature. Understanding how informational writing can be taught and developed in the early grades could help fill a gap in writing research and contribute to an understanding of the literacy skills that are needed to support content-area learning, even among younger students."}, {"section_title": "Theoretical framework", "text": "This investigation of writing development is directed by a sociocognitive theory of language development and the role of informational writing instruction in elementary grades. In the following paragraphs I review sociocognitive theory and present a summary of L1 and L2 early writing development. I then describe some common instructional practices and argue for inclusion of informational report writing as an intermediate step for exploring expository genres (Tower, 2003) .\nSociocognitive theory (Bandura, 1989 (Bandura, , 2001 ) highlights both the social and cognitive aspects of human development, that as social creatures, our thinking and learning are contextual. Humans learn and use language intentionally and in discrete situations (i.e., to make requests, seek forgiveness, explain), all in relationship to others. Writing, similar to oral language, develops as internalization of language from social action in specific contexts (Dyson, 1982) . Literacy environments, observations of reading and writing, and social interactions can invite dialogic participation in literacy, helping students to become aware of and to appropriate language use from others. Appropriation and construction of oral and then written language, is not merely copying, or passive imitation (Chapman, 1995) ; learners benefit from exposure to more adept language users who then can promote choice and creativity that support learners' developmental communicative approximations. In writing, such communicative approximations require attention to purpose, audience, meaning, content, and forms or structures-an array of subordinate elements that can challenge beginners to cognitively manage the process. For example, as is known about the development of orthography, spelling words can be so demanding of young writers that other writing skills are often ignored. Teachers can lessen the cognitive demand, in this case for spelling, by posting topic-related words on the board so that young writers can focus on more text-based elements, while using the spellings provided to communicate their ideas. Thus, a teacher's planning and means of support are integral in high-quality writing instruction.\nAn important goal for writing is to facilitate more linguistic experimentation among writers, so that writing is not just about generating words and sentences, but making a text (Chapman, 1995) . By exposing students to \"valued genres, teachers can provide students an explicit grammar of linguistic choices, both with and beyond the sentence, to produce texts that seem well-formed and appropriate to readers\" (Hyland, 2003, p. 18) . There is evidence that a sociocognitive approach to writing instruction and development offers a promising perspective for writing instruction and is \"certainly worthy of continued research\" (Hess & Wheldall, 1999, p. 20) especially among writers with learning challenges (Graham & Sandmel, 2011) ."}, {"section_title": "Writing development", "text": "Writing development is complex and not yet well understood. While most research on writing has focused on Grade 6 and above (Hillocks, 1986) , there may be important differences between primary students' writing development and that of older students (Tower, 2003) . Primary students transition from labeling to telling about experiences, described as writing from the inside out (Tower, 2003) . Research on older students highlights their efforts to meet external criteria or forms with less of a development focus. A critical period of writing development has not yet been identified, but is hypothesized as being early (Berninger & Richards, 2002) . Younger writers have more limited metacognitive and metalinguistic control; without guidance, they tend to write whatever comes to mind in whatever order-often speech written down in simplistic fashion (Fang, 2014) . McCutchen (1994) contended that younger writers frequently lose the anchor topic of their writing, which can result in a collection of unrelated sentences. As demonstrated by Calkins (1986), Routman (2005) , and others, young writers can respond well and develop early writing competencies. Supporting younger writers at the early stages could improve awareness of language as a written code and encourage more writing. Unfortunately, poor beginning writers often continue to struggle through the upper grades (Juel, 1988) . Preventing difficulties in young writers may be the key to solid development, increased stamina, and motivation thereafter.\nStudies on the development and complexity in children's writing, which typically targets story writing, have shown that before children start school, most already understand the underlying features of storytelling (Martens, 1996) . In many beginning writing programs, students are encouraged to use their personal experiences to write narratives that relate events in their lives or their individual preferences. This focus on first-person narrative assumes that students have had comparable experiences that they would want to share in writing and that storytelling is a culturally developed skill that can be leveraged for writing purposes. This common practice is not without merit as it utilizes oral language skills and personal experiences as a premise for writing, but many educators are now calling for more attention on informational writing (Baker et al., 2014; Chapman, 1995) . A focus on informational writing could augment the story writing that is prevalent and could appeal to young writers who desire to use writing as a way of thinking about the world. If writing within \"meaningful contexts with authentic purposes\" (Hyland, 2003, p. 27) , young composers can rely on the context for substance in their writing, allowing them to focus on the requisite transcription skills. A focus on writing to inform could increase and improve general writing proficiency among young writers in the current information-oriented milieu."}, {"section_title": "L2 writing development", "text": "L2 writing has been summarized by Hyland, (2003) as being similar to L1 development with respect to general composing and stage progression. However, lower English proficiency students often struggle with expected English competencies and may not transfer L1 strategies to L2 writing. Research has shown that L2 writers experience difficulty setting goals, plan less, and produce less. Notably, L2 writers are more challenged to produce accurate and effective texts fluently, yet spend more time on revision, (Hess & Wheldall, 1999) . Thus, young ELs are vulnerable as writers in important ways. They tend to be less experienced writers and can be more challenged to use their linguistic resources to accomplish writing tasks, making them more dependent on instruction. Weaker writers evidence performance deficits that can include the inability to stay on topic, less textual cohesiveness, low productivity, poor organization, and reliance on simple sentences and basic vocabulary. Importantly, weaker writers may simply be na€ ıve about what characterizes and the value of good writing (Wong, 1998) .\nMost adults take reading and writing for granted, having forgotten the early stages of its many complex subprocesses. Many literate persons cannot appreciate what it may be like to learn to read and writing in a language in which one is not yet orally proficient. To navigate instructional tasks assigned by most teachers in the United States, ELs must comprehend and use English. But, they are likely still mentally processing their thoughts in their L1. In a sense, because of this bilingual interplay, L2 writing can be more resourced than L1 writing, but the use or transfer of resources is not direct, especially in young writers (Connor 1996; Leki, 2003) . Beginning L2 writers do not often have the richer oral language platform commonly existing in students' L1 that helps students have something to say in their writing. To offset this weaker English-oral language platform, teachers can increase the amount of talk that precedes writing activities-to provide and practice orally the language that is key to communicating about a topic. Fortunately, young writers tend to be more optimistic and hopeful (Calkins, 1983; Leki et al., 2008) about being writers, and L2 writers appear to be \"less inhibited by teacher-editing and feedback\" (Hyland, 2003, p. 36) . Therefore, writing instruction during the early grades may entail more engagement, despite the extra mental work that ELs must do to communicate in English."}, {"section_title": "Instructional practices", "text": "Writing instruction has been studied from various research perspectives and via disparate research questions. Hillocks's (1986) study of writing interventions noted several modes of instruction, with the largest effect size for the \"use of materials and problems that cooperatively engage students in specific writing processes to meet instructional goals\" (as summarized in Graham & Perin, 2007, p. 346) . These instructional goals can be targeted with varying degrees of structure, including controlled writing, guided writing, and free writing. Controlled writing can entail handwriting, copying, and dictation. Guided writing describes the imitation of model texts while free writing entails the independent use of patterns, structures, and genre characteristics (Hyland, 2003) . Teachers can promote verbal interaction and task negotiation that scaffold students' development via \"a process of contextualizing-modelingnegotiating-constructing\" (Hyland, 2003, p. 21) , which requires direct instruction, especially in the initial stages. This notion of giving learners the language they need can be especially strategic for ELs who are simultaneously negotiating multiple subprocesses. Thus, writing teachers strive to guide learners \"to use language patterns to accomplish coherent, purposeful prose-to develop insights about communicating via print. The central belief here is that we don't just write, we write something to achieve some purpose\" (Hyland, 2003, p. 18 ).\nWriting involves word-level skills, cognitive abilities, and higher order skills. Even mastering basic transcription skills (handwriting and spelling) for L1 speakers is difficult in the early grades. ELs must simultaneously develop low-level transcription skills, along with genre-specific discourses (i.e., language foundations and communication processes) while processing in a language they are still learning. According to current language development standards, listening, speaking, reading, and writing should be integrated in a mutually reinforcing manner in daily lessons for ELs (Echevarria, Short, & Powers, 2006) . Inclusion of these various language domains complicates an already challenging expectation for writing instruction. Typically, as noted, poor writers write little and slowly (Berninger et al., 1997; Wong, 1997) . Reluctant writers tend to generate briefer, safer texts, and often rely on transcriptions and one-to two-word topics, shunning opportunities for free writing. To make grade-level achievement and eventually be college and career ready, all students need instruction to develop the discourses that are expected in school and life. The CCSS ( Council of Chief State School Officers and the National Governors Association, 2010) call for more instruction of expository genres and emphasize more exposition of content learning. High-stakes assessments are increasingly including writing proficiency measures as part of students' literacy competencies. Yet, until recently there have been limited researched recommendations for teaching informational writing (Knudson, 1989) and its many genres, especially amid diverse student populations. Instructionally, one way to support informational writing is to present mentor texts that model the genre (Calkins, 1986) , which can support students' awareness of the forms and functions, before moving on to more independent writing. But, even without exemplar book models, teachers can model informational writing and engage students in talk that supports writing and learning in content areas.\nA models approach (Hillocks, 1986) or modeled writing (MW) in this case, provides conventions for purposeful written discourse while fostering creativity. There have been previous iterations of a models approach to writing. For example, in the Language Experience Approach (LEA; Hall, 1999 , Stauffer, 1980 ) students share an experience and the talk that surrounds it, which is then recorded and becomes a text that students can read. Variations of the LEA have successfully supported ELs in language acquisition. For example, if students work with a teacher to co-construct a message that is recorded, the text can be used for reading and, then, as a prompt for more writing among the students. Another, long-standing writing activity, dictation is the practice of listening to and then writing down words, sentences, or passages that are presented orally by the teacher. As an orthographic task, dictation is sometimes a component in phonics or spelling programs as a means of practicing selected words or targeted patterns or elements in context (Gillet & Gentry, 1983) . Despite its inclusion in some program prescriptions, dictation is not often a staple in writing programs, nor do many teachers explore ways to maximize dictation-type activities for the benefit of ELs, yet being able to accurately record information in a second language can be very empowering to L2 students.\nOther educators have used and described various writing activities as guided writing, shared writing, and interactive writing (Button, Johnson, & Furgeson, 1996; Collom, 1998; McCarrier, Pinell, & Fountas, 2000; Meeks & Austin, 2003; Smith & Bean, 1980) . These related terms and approaches generally entail teacher-led activities that help students collaboratively attend to and develop writing skills. While the degree of writing done by the students may vary, the goals include extended discussion of a selected topic and the composing of a text via input and participation of students. In the Picture Word Induction Model (Calhoun, 1999; Wood & Tinajero, 2002) , the discussion of a picture helps to generate the content for the collaboratively constructed text.\nOne goal of the following study was to contribute to a school's focus on personal narrative writing by offering an ELfriendly writing pedagogy that supported informal report writing as a transition from predominantly narrative writing to expressing ideas as information. Selected forms of informational writing, as expressions of understanding of content and language (Tower, 2003) , were facilitated by the teacherresearcher who modeled and co-constructed initial sentences with students to establish the purpose and topic. These shared sentences were used to anchor the students' writing and allow them to extend their texts more individually. The overall goals included supporting young writers to write more and to use informational writing to extend content learning."}, {"section_title": "Methods", "text": "As an extension and variation of collaboratively constructed writing, the MW intervention described in this study is an example of stacked instruction-teaching that leverages recommended components and combines them in potentially synergistic ways (Mohr, Dixon, & Young, 2011) . Akin to the component building recommended by Slavin and Calderon (2001) , combining viable methods of writing, (e.g., modeling, dictation, and elaboration) could produce richer, more productive lessons. In this study, the synthesized approach exposed students to writing that modeled informational discourse that they rehearsed, analyzed, practiced, and extended. The goal was to transition from other-regulated (the teacher) to more self-regulated writing using explicit instruction (Englert, Raphael, Fear, & Anderson, 1988 ) that then launches students in their writing. In this MW format, the teacher modeled the planning, text generation, and transcription of the first few statements targeting a specific informational topic. Once the shared text was reviewed and well rehearsed, the teacher dictated the sentences to students who did their best to write them. Students then extended the co-constructed sentences with free writing. Students were relieved of determining topic, content, and language in the process of generating the initial sentences. Thus, they did not select their own topics, but could take the writing topic in their own directions after the quick dictation task. Appendix A presents a step-by-step delineation of the MW method used in this project.\nIn this investigation I sought to explore the potential of MW in primary classrooms. Specifically, the study targeted the following research question: How would use of MW (a customized, synthetic writing approach) support writing development among EOs and ELs in a Grade 2 writing program?"}, {"section_title": "Setting and context", "text": "The present study was the focal point of a yearlong formative design experiment (Reinking & Bradley, 2008) with seven Grade 2 classrooms in a recently recognized exemplary school in the southern United States. The school had just received exemplary status from its state board of education, despite having a high percentage of minority and EL students. The school principal believed that the school's academic success was, in part, due to his curricular goals, which included a school-wide focus on writing. Following a pilot study with positive out-comes for L2 writers at a different school, I sought to explore a version of MW, especially for ELs, in a real-world context to determine its success in implementation and its ecological validity. The school and its Grade 2 classrooms provided an authentic instructional environment to evaluate the MW instruction with ELs and EOs, in that it afforded \"naturally occurring variation … not unnaturally constrained\" (Reinking & Bradley, 2008, p. 18 ). In such contexts, not everything can be analyzed; there is a need for focus. Therefore, in part, the intent included \"engineering particular forms of learning and systematically studying those forms of learning within the context\" (Cobb, Confrey, diSessa, Lehrer, & Schauble, 2003, p. 9) . The writing emphasis in this context actually involved interaction between two writing programs, two languages, and two genres. A key aim was to possibly substantiate that MW has a role in accelerating writing productivity, sometimes referred by Graham and colleagues as writing output, and complexity in expository compositions of young writers.\nThis yearlong intervention began with 105 second-grade students assigned to seven classrooms with a total of eight teachers (one classroom included several students with special education designation and was taught by two teachers working as an instructional team). All the teachers were experienced, although one teacher who had taught Grade 1 for many years had been moved by the principal to join this Grade 2 team and was, therefore, new to the grade level. The teachers were all women (seven Caucasian and one Latina) and two were fluent in Spanish. These teachers taught in the two bilingual (Spanish-English) classrooms, but several dozen Spanish-speaking ELs were distributed among the other five mainstream classes. In fact, 51% of these second-grade students were Latino and 40% were Spanish-speaking ELs. The teachers of the bilingual classrooms referred to the G omez and G omez 50-50 Dual Language Enrichment Model (G omez, Freeman, & Freeman, 2005) as a guide for their curricular plan, but the school also had local guidelines for its transitional bilingual program. In these Grade 2 bilingual classrooms, reading and language were initially conducted in Spanish. An added block in English was added once students reached a level 20 on the school's reading assessment (Developmental Reading Assessment; Beaver, 2002) . Both languages seemed to be used flexibly, and although I observed and sometimes used Spanish during interactions in the bilingual classrooms, all MW lessons were conducted in English.\nThe school principal was a teacher trainer and promoter of Write From the Beginning (WFtB; Buckner, 2000) . He enthusiastically promoted WFtB, but was also positive about having a university researcher join the Grade 2 team to explore language and writing development among the second-grade students. I met with the principal and the teachers together and apart several times to discuss the program and its impact (lack of space prohibits a lengthy discussion of the principal's relationship with the teachers or his interactions regarding the program, but the teachers were expected to comply with the WFtB program and the district's many mandates, which expected regular writing instruction). The teachers taught WFtB lessons approximately twice a week throughout the school year, which was double the amount of time spent on MW. Fortunately, although always very busy, the teachers were also cooperative of the following research goals:\nObserve the writing development of second-grade students to understand ways to ameliorate instruction Observe the implementation of WFtB across a grade-level program Compare the writing development and achievement of bilingual, EL, and native English-speaking second-grade students Assess aspects of writing development beyond the planned program assessments Initiate and monitor a MW experience focusing on informational writing for selected second-grade students The last three of these goals are addressed in this report."}, {"section_title": "Study schedule", "text": "I attended the Grade 2 language arts block from the first day until the end of the school year. I attended Monday through Friday, for the first semester, then two to three days a week during the spring term. I initially observed in all seven classrooms, assisted teachers and students, and administered some early assessments. The Primary Writer Self-Perception Survey (PWSPS; Mohr, 2013) was used to interact more personally with the students during the early days of school. The Survey uses five questions to elicit students' notions about writing and themselves as writers. It was administered early in the school year and again at the end of the year (EY) to determine if second-grade students participating in a writing program evidenced positive or negative views of themselves as writers and if their understanding of writing developed during the school year. Results (more fully reported elsewhere) indicated that these second-grade students maintained a positive view of writing and that the greatest increase in positive self-efficacy was clinically significant among male ELs (Mohr, 2013) .\nIn addition to being a part of the initial assessment processes during the first few weeks of school, I also taught lessons to review handwriting in each classroom to get to know students and function as a part of the grade-level team. I all the students' names and interacted with them in class and at lunch and recess. I the school during the entire language arts block from 8:30 a.m. until lunch on a regular basis, sometimes teaching lessons or tutoring students. I also made several presentations to the teachers and administrators to explain the research goals and the characteristics of the MW that I had planned and implemented."}, {"section_title": "Participants", "text": "With Institutional Review Board (IRB) approval, I sent informational letters and consent forms home in late September. Of "}, {"section_title": "THE JOURNAL OF EDUCATIONAL RESEARCH", "text": "the 105 second-grade students, 70 students (67% of secondgrade students) and their parents consented to be in the study (Table 1) . These students were disproportionately distributed across the seven classrooms. Random assignment of students to the conditions, while highly desirable, was not practical. Some elements of quasiexperimental design were achieved in that the participating students were assessed before assignment to groups in order to determine any differences among students that would warrant the use of prescores as a covariate.\nIn negotiation with the teachers, I selected four classrooms in which to deliver the MW instruction. These included the two bilingual classrooms where MW was presented as whole-group instruction and contributed to their English language arts curriculum. In two other mainstream classrooms, MW was delivered to smaller groups of consenting students in an area of the classroom while the respective teachers worked with other students. These arrangements were negotiated with the teachers to accommodate their preferences and goals for their language arts block. Thirtyeight students participated in the MW group, which included 21 students from the bilingual classrooms and five other ELs. There were 32 students in the control group; of these, eight were classified as ELs. Thus, due to inclusion of students in the bilingual classrooms, there were more ELs in the MW group, affording a fuller view of writing development in bilingual and EL students."}, {"section_title": "Writing assessments", "text": "In addition to the PWSPS, other assessments were administered at both the beginning of the year (BY) and end of the year (EY), including the English and Spanish versions of the Elementary Spelling Inventory (Bear, Templeton, Invernizzi, & Johnson, 2000) which were used by the school (and not addressed here) and the contextual writing subtest of the Test of Written Language (TEWL-2; Hresko, Herron, & Peak, 1996) . This subtest is a picture-prompted spontaneous writing task. At BY, students were shown a picture of children playing in a park and instructed to use the picture to write a story. Students were allowed to write in English or Spanish for this baseline assessment. As part of the school's writing program, these second-grade students also wrote an initial composition for their teachers that was scored by the teachers according to the adopted WFtB Grade 2 writing rubric (see Appendix B). Data from compositions from BY were compared to EY compositions graded using the same rubric. While other measurements may have multiplied the available data, I complied with the school's request and kept the assessments to a minimum. Buckner's (2000) WFtB is promoted as a K-5 developmental program for school-wide writing success. The program promotes both narrative and expository writing, each utilizing the thinking maps common visual language. Teachers are expected to build on and extend the instruction of previous grades by using modeled instruction, improvement rubrics, and focused minilessons. The focused holistic scoring criteria for writing include five criteria for Grade 2-the focusing writer: main idea, supporting details, coherence, organization, and conventions. None of these elements specifically targets narrative elements, which was the priority for this Grade 2 program. The WFtB writing evaluation targeted productivity, clarity, and organization, regardless of theme. However, the school used a rubric that recognized nine elements (as shown in Appendix B) with a dominant focus on logically sequenced sentences, but also including standard spelling, mechanics, appropriate descriptive language, and transition words. The BY prompt was to \"Tell about the best birthday you ever had.\" The EY prompt was to \"Tell about the best vacation.\" These topics are typical of the general prompts used at the school each year, but arguably privilege students whose families take vacations and enjoy birthday celebrations. I could not change the school's writing prompts as they were used across the district to promote reliability and to compare schools' performances.\nThe TEWL-2 contextual writing subtest entails 14 items that are scored from 0 to 3 depending on the quality or quantity of the targeted criteria (see Appendix C). Although both the WFtB and TEWL-2 contextual writing subtest award points for logical sentences, standard spelling, topic or lead sentences, and description, they differ on the scoring of other items. The WFtB values mechanics, details, and transition, while the TEWL-2 writing task targets more aspects, including the number of words and sentences, pronouns, characters, story structure, and theme. The BY picture prompt was children playing in a park and the EY prompt was a birthday party scene, including a blindfolded boy hitting a piñata. The TEWL-2 more appropriately assessed aspects of story construction and provided information about this genre. According to the examiner's manual, the TEWL-2 0 s contextual writing subtest is highly reliable, with a median percentage of agreement for six examiners across 25 samples of .94 (Hresko et al., 1996) .\nAt BY, 20 students in the bilingual classes (29% of the total sample) chose to write their compositions in Spanish. The respective teachers scored the WFtB compositions, so the bilingual teachers scored those written in Spanish. The TEWL-2 compositions that were written in Spanish were translated by I into English and then scored along with those generated in English. At EY, only eight students (11%) produced their compositions in Spanish. Culture relates to and affects language use, which was an initial concern for me to appreciate the bilingual students' writing development. However, the picture prompts were culturally relevant for these secondgrade students and all were able to respond in writing to the pictures of playing in the park and celebrating a birthday. Thus, the writing prompts were considered appropriate elicitations and the students' compositions demonstrated writing production. The scoring procedures targeted content that was comparable across English and Spanish (e.g., naming items in the picture, recognizable theme, topic sentences, sequence of events), so although not ideal, using translations of texts written in Spanish afforded information about the students' writing development and achievement from beginning to end of the school year.\nOnce early assessments were completed and the classroom teachers had finalized their schedules, I initiated the MW program in the four classrooms (two whole and two smaller groups of second-grade students who had permission to participate in the MW). All students received instruction from their respective teachers in compliance with the WFtB program, which required weekly planning and writing opportunities. Approximately eight months later, the students completed end-of-year assessments that included another WFtB composition and an alternate form of the TEWL-2 contextualized writing subtest."}, {"section_title": "Modeled writing", "text": "The MW (Mohr & Mohr, 2009) used in this study is a brief, teacher-directed lesson framework that incorporates a contextbased discussion (Saunders & Goldenberg, 1999) that ELs can use to launch a writing assignment. As delineated previously and in Appendix A, it is a customized writing process utilizing aspects of the LEA, interactive writing, and sentence dictation that includes eight steps that are accomplished in approximately 30 min. In this context, MW provided a shared experience for oral language discussion, followed by co-constructed expository sentences that were reread, analyzed, and reviewed before being removed from sight. The co-constructed English sentences were then dictated to students. While sentence dictation can be a challenge for L2 writers, in this case, the sentences were co-constructed in front of the students, analyzed linguistically, and read repeatedly. After the shared construction and review of the writing model, students were encouraged to work quickly, do their best to spell out the dictated sentences, and then to extend them with three or four more sentences of their own. To use any time remaining, students could draw an accompanying picture to show their understanding of the topic.\nIn the course of the year, the MW group completed twentyfour 30-min sessions (S. . For the MW sessions, I conferred with the grade-level teachers to target topics for discussion and elaborated writing. The goal was to focus on informative writing, specifically description, explanation, reporting, and procedural how-to compositions. The topics were selected to align with Grade 2 subjects and seasonal topics of interest, and thus were not planned at the outset, but used to support instruction and student engagement with the Grade 2 curriculum. The topics were predominantly science or social studies related (22 of 24), such as describing the outside and inside of pumpkins or squash, summarizing a trip to a dinosaur museum, explaining what makes a good pet, and inspecting, drawing, and describing spring flowers. It was the intention of this formative design to not impose upon the ecologies of these classrooms, but to support the regular program with a customized opportunity to write informational texts grounded in the instructional program. As the year ensued, opportunities arose for five descriptive texts, 10 explanatory texts, five reporting texts, and four how-to, procedural texts targeting approximately equal numbers of science and social studies topics. Examples of MW compositions are presented subsequently. The underlined portion represents the co-constructed anchor sentences that the students then wrote from dictation before adding their own sentences to extend the writing. It is interesting to note how the students leveraged some of the language used in the anchor sentences in their personal extensions.\nAn explanation based on a science experiment conducted early in the year:\nA force is a power to push or pull. Air can push up. Gravity pulls down. We did a xperiment on a ball and blow dryer. The wind pushet it up. (Antonio, EL)\nAn explanation based on a discussion of a shared reading about sound:\nSound is a wave of noise. The blue whale is the loudest animal. We measure sound in decibels. A rockenship is so loud it can kill you if you are to close. People cant hear every sound and that is good because we could go crazy. (Daniela, EL) A report based on a news video on the Internet about midyear:\nIn January, a little white dog fell in the water. It was in trouble. A man came to help. He took his pants off. He lowerd down. He jumped in the water and saved the dog. He gave the dog back to its owner. She was worried. (Maya, EL)"}, {"section_title": "Analyses", "text": "The WFtB writing sample provided a criterion-referenced measure of writing skills and competencies, whereas the TEWL-2 subtest afforded a norm-referenced assessment of writing. In this pretest-posttest design, the analyses included calculation of descriptive statistics and two-tailed t tests to compare groups at BY and EY on total raw and subscores on the WFtB rubric and the TEWL-2 contextualized writing subtest. An analysis of covariance (ANCOVA) using the BY scores as a covariate was included in a model to determine whether gains by group, language, and gender were significant and how much of the variance in the dependent variables (writing scores) was due to the MW treatment. The pretests (WFtB writing samples and the TEWL-2 written compositions) were administered before assignment to the MW and control (WFtB only) groups and alternate forms of the same assessments were completed at the end of the school year. The respective classroom teachers administered the WFtB writing tasks (supporting ecological validity) and I administered the TEWL-2 writing test to add reliability to the assessment process. Because the students could not be randomly assigned, various measures of writing (i.e., WFtB, TEWL-2, and their item subscores) served to reduce the effects of potentially confounding variables, such as teaching style or class configuration."}, {"section_title": "Findings", "text": "The data allowed comparison of the participating secondgrade students by language (EO and Spanish-dominant ELs), by group (WFtB only and MW), and gender. A oneway between-subjects ANCOVA was carried out to assess the impact of MW on the writing performance of secondgrade students who were participating in the school-wide implementation of the WFtB program. Checks of the data confirmed homogeneity of variance and a linear relationship between the prescores on the assessments and a type 2 sum of squares accounted for missing data in the unequal samples. However, on the WFtB postscores this relationship was not parallel, requiring the use of a generalized linear model to determine differences. The betweensubjects factors comprised student groups divided by native language, treatment or control, and gender. The betweensubjects effects based on gender were not significant and were thus removed from the model. The results presented below are sorted by the two assessment measures and compared by language (EO and EL) and group (MW and control).\nWrite from the beginning personal narratives The rubric for the WFtB narratives includes nine elements, four scored from 0 to 1, four scored from 0 to 2, and one item scored from 0 to 8, for a total of 20 possible points (see Appendix A). Three of the nine elements are considered basic writing skills: decipherable spelling, capitalization/punctuation, and spacing. The other six elements are considered content proficiencies: logical sentences, descriptive language, follow-up sentences, lead sentences, closing sentence, and transition words. BY narrative scores for both groups were normally distributed, with ELs scoring significantly below the EOs on the total rubric scores, t(68) D ¡4.365, p D .0001. The EO mean total of 12.21 exceeded the EL mean total of 8.19, even though some of the Spanish-dominant students selected to write in Spanish, their primary language and were scored by their respective bilingual teachers.\nOverall, according to the WFtB rubric scored by the respective teachers at the start of Grade 2, these second-grade students did well on spacing, logical sentences, spelling, and capitalization/punctuation, which reflect basic writing skills (rather than content or narrative elements). The weakest scores at the start of Grade 2 were for: descriptive words, closing sentences, transition words, and lead sentences. Writing productivity was a notable issue for the Spanish-dominant students; the EL mean for sentences was 3.84, compared with 6.18 for the native-English speakers. The ELs scored significantly lower than the EO second-grade students on four items: logical sentences, descriptive language, follow-up sentences, and lead sentences, which indicates that the ELs simply wrote less, even when writing in their L1.\nAt EY, the narrative scores for the ELs were below, but not significantly different than, those of the EOs, t(68) D 1.393; p D .168. Thus, while the ELs started the year with significantly lower scores on narrative writing, they were much more similar to the EOs at EY (EO M D 17.18 vs. EL M D 16.06). The point gains for ELs (M D 7.88) exceeded those for EOs (M D 4.97), t(68) D ¡2.815; p < .006. At year's end, the ELs actually exceeded the EOs on means for logical sentences (7.47 vs. 7.03), while the EOs scored significantly higher on descriptive language, closing, and transitions. Thus, the use of descriptive language remained weak among ELs, but on six of the nine items, the ELs were much more comparable to EOs at EY."}, {"section_title": "Group comparisons", "text": "Analyses of the groups were then made to determine the effects of the MW on students' writing growth. Those subsequently participating in the MW program had a mean total score of 9.16 at BY, compared with the control group, which had a mean of 11.81. The BY narratives for both groups (MW and controls) were normally distributed, with the MW group significantly below the control group on the total rubric scores, t(1) D ¡2.68; p < .009. Thus, when scored by their respective classroom teachers, at BY, the control group scored on average more than two points higher than did the MW group and the EO students as a group averaged four points higher than the EL group.\nHowever, the EY narratives were not normally distributed, requiring nonparametric analyses. A generalized linear model used BY total scores as a covariate for comparing EY total scores and determine student gains. The EY narrative scores for the MW group were significantly different than those of the control group (MW total M D 17.26 vs. control total M D 15.97), F(1, 67) D 8.149. The effect size of .96 is considered strong even though effect sizes for interventions in early grades and small groups of students tend to be larger than for those in older and larger groups (Lipskey et al., 2012) . Comparisons between the MW and control groups indicate that at EY, the MW students gained 8.08 points, while the controls gained 4.16 points-a significant difference."}, {"section_title": "High and low items and group comparisons for the WFtB narratives", "text": "At BY, the control group showed significant strengths in descriptive language, follow-up sentences, and transitions. The MW group did not evidence any statistically significant strengths over the control group at the start. At EY, these second-grade students showed higher scores overall, with the greatest gains in transitions and descriptive language. Although evidencing no superiority at BY, the MW group scored significantly better in number of logical sentences and outscored the control group in five of the nine elements (see Table 2 ). The control group mean EY scores exceeded those of the MW group for descriptive language, lead sentences, and closing sentence. It should be noted that the MW activity did not address closing sentences at all because the approach helped initiate student writing with anchor sentences. Thus, providing a closing sentence was not targeted and this competency would not be expected to show significant gains in the treatment group due to the MW protocol. Indeed, this element showed the lowest gain score among the MW students. The lower scores on descriptive language and lead sentences may indicate a need for more focus on these expected writing components within and beyond the use of MW. One item on the WFtB assessment is number of logical sentences, which relates to writing productivity. The MW group had a mean average of 4.39 sentences at BY and a mean of 7.79 sentences at EY. As shown in Table 2 , this gain of 3.30 sentences is nearly six times the mean gain of the control group (BY D 5.97, EY D 6.56) and a statistically significant difference, t(1) D 4.053, p < .001. With much more written content, these students were \"eligible\" for more points related to the other scored items. However, it should be noted that the MW group scored lower at BY and, thus, had a more room to improve, especially in the amount of writing they could generate."}, {"section_title": "TEWL-2", "text": "All TEWL-2 compositions were scored by two trained raters and achieved an initial 83% absolute agreement across the 14 items (see Appendix C) for the 70 compositions. However, agreement was quite high (ranging from 77% to 100%) on 11 of the items. There was less agreement on the three remaining items, including the use of pronouns as referents, a recognizable theme, and of a topic sentence. The raters reviewed the scoring instructions and discussed specific discrepancies, then independently rescored the TEWL-2 compositions. Because the TEWL-2 includes 14 items with four possible scores along a continuous scale, intra-class coefficients were then computed for the14 items (per the recommendation of M. Graham, Milanowski, & Miller, 2012) . The intraclass coefficients ranged from 0.56 to 1.00, with all but one above 0.75 indicating sufficient reliability.\nBY raw score comparisons were made across the EOs and ELs and across the MW and control groups. The EOs and the ELs scored quite similarly (EO mean total score, 19.67 compared with EL mean total score 19.50, t(68) D 0.150, p < .881. At EY, the EOs and ELs mean total scores were again quite similar (EO mean total score D 26.49 and EL mean total score D 25.59). The mean total scores for gender were also not significantly different. Thus, on the TEWL-2, these second-grade students performed similarly regardless of first language, which was not the case on the teacher-scored personal narratives discussed above.\nAt BY, the MW group outscored the controls, which was unexpected, given the scores on the WFtB writing samples at BY and because there were more bilinguals and ELs in the MW group. However, the difference between the mean scores on the TEWL-2 by group (MW D 20.39 and control D 18.52) at BY was not significant. As shown in Table 3 , the MW group outscored the control group on nine of 14 items at BY and the same or above the control group on all items at EY.\nAt EY, the MW group total mean on the TEWL-2 was 28.27, while the control group mean was 25.53; this difference between groups was significant, t(1) D 63.69, p < .001. However, the MW group had a higher mean score at the beginning (20.39 vs. 18.52) so the gain scores of the control group were comparable to that of the MW group (8.01 vs. 7.87). These mean gain scores were not significantly different. Interestingly the ELs in the MW group outscored the EOs in the control group (27.00 vs. 24.25). A one-way between-subjects analysis of covariance was carried out to compare the group gains made in writing achievement. Checks were carried out to confirm homogeneity of regression and linear relationship between the covariate and dependent variable. The between-subjects factor comprised two groups: MW and control. The covariate comprised BY TEWL-2 total scores, which were significantly related to the EY scores by group: F(1, 60) D 4.81, p < .032, partial h 2 D .074. Adjusting for this covariate resulted in a statistically significant effect of the between-subjects factor group, F(1, 60) D 13.87, p < .001, partial h 2 D .188. The adjusted mean score for the MW group was 28.35 compared with 23.07 for the control group. According to the TEWL-2 examiner's manual (Hresko et al., 1996) , a total score of 20.39 (the mean score for the MW group) for beginning second-grade students has a norm curve equivalent (NCE) of 57; whereas a total score of 18.52 (the mean for the control group at BY) has an NCE of 51. At EY, the NCE for the MW group was 74 and 67 for the control group. Converting the scores to percentiles reveals that the MW group began the year at the 66% percentile and scored at EY at the 87% percentile, while the control group began at the 55% percentile and ended at the 79% percentile. Essentially, these second-grade students evidenced strengths in writing in comparison to national norms even at the outset, which could be attributed to the school's focus on writing and their instruction in first and Grade 2. However, it is important to note that the students receiving the MW intervention made more improvement during Grade 2 than did their peers who only participated in the WFtB program. It is important to note that the MW group achieved higher scores on all the TEWL-2 items at EY even though the MW program targeted informational writing and the TEWL-2 expected and allotted points for various narrative elements."}, {"section_title": "High and low subscores", "text": "The t test comparisons showed significant differences in favor of the MW group on the use of pronouns, topic sentences, spelling, and characterization at BY. The control group outscored the MW group at BY on naming objects, number of sentences, and theme. However, at EY, the control showed no significant advantage on any items, but the MW group scored significantly higher on number of sentences, theme, going beyond the picture, and use of monologue/dialogue. These results are intriguing because the MW intervention did not target monologue or dialogue. The greatest gains for the MW group were for recognizable beginning and ending (MW D 1.11, control D 0.40) and number of sentences (MW D 1.03, control D 0.00). Sizable increases were also made by the MW group on using characters (0.86) and writing beyond the picture (0.84). Notably, the MW group showed significant improvement in generating more sentences on both of the year-end assessments.\nAmong the control group, the only comparable gains were for the number of words over five letters spelled correctly (gain of 0.98)-a spelling outcome. This is notable in that the control group had more room for increase from beginning to end because the BY total mean was lower than that of the MW group. One aspect of note is that gain scores were small for a few items because these second-grade students scored very high at BY on the number of words (Item 2) and the number of words of five or more letters if spelled correctly (Item 3). Both groups essentially ceilinged on these items and had no room in the scoring protocol to show growth. But, productivity is an important aspect of writing development, so post hoc tests accounted for the number of words and number of sentences. Extant research has indicated that bilinguals and ELs tend to write less than their English-fluent peers and that such proxies provide information about writing achievement (Restrepo et al., 2010) . Generating more text correlates with higher scores on writing tasks.\nAs shown in Table 4 , a comparison of these proxies indicates greater productivity in the control group at BY and EY. The gain scores in words were also higher among the control group, which included more EOs. However, the MW group made comparable gains in mean number of sentences. These data indicate that the control group generated more words than did the MW group who wrote less overall, but interestingly outscored the control group on other items. Notably, the ranges for these proxies were very large. Some of the second-grade students wrote very lengthy compositions of up to 156 words in 21 sentences. There were definitely some students who felt compelled to write considerable amounts of text, which could reflect some individual interests, experiences, or teacher expectations. In fact, in two of the seven classes, there were clusters of girls who seemed particularly interested in writing and who were driven to produce more than others. None of these students was in the MW group and their impact was confirmed in a group by gender interaction on the TEWL-2 proxies. From other studies on written expression, numbers of total words written expected of second-grade students range between 14 and 34 in the fall and 24 and 48 (Malecki & Jewell, 2003) , with a weekly word growth of 0.35 (Tadatada, 2011) . Thus, measuring the writing productivity of these second-grade students allows for comparison with other related studies. In this case, these second-grade students were comparatively productive writers."}, {"section_title": "Discussion", "text": "The MW approach used in this efficacy study yielded significant effects for both EOs and ELs (including bilingual) when compared to the WFtB program. Compared to BY differences between EO and EL students, which were significant in favor of EO students, the EY total mean scores for EOs and ELs were not significantly different, indicating that the ELs were more like their peers by EY. Although the ELs in this study did not overcome the EOs, they did write on par with their EO peers on the postassessments, making strong gains on several subskills. Importantly, all MW subgroups outscored those in the WFtB-only groups. The difference between the end-of-year adjusted means on the standardized writing assessment (TEWL-2) was 5.28 points in favor of the MW group, F(1, 66) D 13.87, p D .001.\nThis study adds to the extant literature on early-grade and EL writing in several ways. Results support the use of MW as an efficient, complementary, component to promote writing development for both young EO and EL students. The described MW is practical, entailing only one 30-min session per week. The contentbased writing lessons were planned around the existing science, social studies, and seasonal curricula to extend students' writing of reports, descriptions, and procedural texts across subject areas, including art production. MW as implemented, engaged students in discussion and co-construction of English sentences that helped focus students on some key content vocabulary and academic sentence structure that they then used to anchor their compositions. While this approach structured their writing to some degree, the intervention did not overly constrain the information being reported or explained; nor did it impose strict genre formats for the students. In this case, the goal was to help students get started with several basic sentences about interesting topics and to encourage them as writers of informational texts. As a part of the larger experiment, students' perceptions of themselves as writers were assessed at the beginning and EY. Analyses of the Writer Self-Perception Survey are reported elsewhere (Mohr, 2013) but it is interesting to note that adding a focus on informational writing (via MW) improved achievement in EO and EL writers without reducing interest and motivation for writing. Despite its success, this investigation yielded several challenges and inconsistencies. In this case, MW was added to the school's use of an established writing program. Thus, any interpretation of the outcomes must acknowledge the school's concerted focus on writing and the grade-level commitment to the WFtB program. The findings evidence that a focus on writing in early grades can accelerate students' writing development as these students scored relatively well on the standardized test of writing (TEWL-2) even at BY. Moreover, there seemed to be a global impact on writing for students in the MW group. Despite a focus on informational writing, the MW appears to have positively influenced the writing of narratives, which was an unexpected transference outcome that warrants further interpretation and research. In particular, it is unclear why MW group surpassed the control group on theme, writing beyond the picture, and monologue/dialogue (on the TEWL-2) as these were not skills emphasized in the MW program, except that the informational writing approach did support writing about a main idea or topic and encouraged students to take their writing in their own directions. It could be that the MW group efficacy for writing grew and a consequence is that they wrote more, and thus, earned more points on the standardized assessment.\nA salient finding in this study is that getting students to write more appears to be critical to achievement. These students increased their writing production on both assessment measures, which increased the likelihood of higher scores on other scored items, such as writing beyond the picture in the TEWL-2 test and for the number of logical sentences on the WFtB scoring rubric. Writing achievement is a function of productivity and complexity (Restrepo et al., 2010) , and productivity may need to precede a focus on writing complexity among beginning writers as generating more writing allows for more content. The informational writing in this study supported writing productivity, not merely to add sentences, but to communicate more information about the topics. The positive relationship between productivity and complexity should encourage teachers to promote more writing among students so that they can evidence their broader language skills and build writing versatility and stamina.\nWriting complexity is a challenging construct and the subscore results in this study are informative. The WFtB rubric scores indicate a need for more use of descriptive language. This seems to be a practical recommendation for beginning writers of both narrative and informational compositions, but adding description could be focus for revision, a part of the writing process not emphasized in this setting. Additionally, although MW served to anchor the students in a few topical sentences while launching their own writing on a topic, MW did not similarly support how to conclude their compositions. Most of these students ended their writings when time ran out, without a strong focus on conclusions. Classroom teachers using MW could choose to return to generated texts for some revision and attention to closing sentences in order to extend the value of MW lessons.\nThe writing assessment of students' personal stories used by the school targeted production mechanics, and paragraph elements, rather than aspects of narratives, such as first-person voice, pasttense verbs, description of events, and voice. The TEWL-2 standardized assessment focused more on narrative elements. Therefore, the assessments did not focus on the informational elements promoted by MW. The frequent mismatch between instruction and assessment tools has been noted by others regarding evaluation of quality of writing (Graham, MacArthur, & Fitzgerald, 2013) and deserves attention given the emphasis on informational writing in the CCSS (Council of Chief State School Officers and the National Governors Association 2010) for English language arts. There is great need for more appropriate measures of younger students' informational writing achievement."}, {"section_title": "Limitations", "text": "While encouraging in its results, there are limitations inherent in this study. First, the sampling was a convenience, not random, selection of students. The statistical power of the study was limited by the sample size and the number of variables. The findings are limited by the specific measures used and the timing of the assessments. It was not possible to measure all skills more comprehensively due to time and resource constraints, as well as ethical considerations regarding adding assessments to a curriculum that included numerous, regular student evaluations. The use of two different measures of writing-one criterion-referenced and one norm-referenced-served to increase content validity and the use of the school-adopted writing assessment rubric likely contributed to ecological validity. Use of teacher-scored and researcher-scored assessments helped counter possible teacher or researcher effects, and using two pretests also helps to reduce regression effects. The possibility of novelty or disruption effects were addressed by my participating in the program for a full academic year. There was minimal attrition. Importantly, the participating school had had a curricular focus on writing, prior to the MW intervention, which likely influenced the higher standardized writing scores at BY and EY. There may have been possible maturation effects and an instrumentation concern because of ceiling effects.\nAs noted, neither of the writing assessments specifically evaluated attributes of expository writing. However, using the school-adopted writing rubric and a standardized test to measure writing allowed some triangulation of writing competencies. Teachers were trained to score the WFtB compositions and did so at least three times during the year, but the reliability of teacher scores can only be assumed. The school's decision to focus on narratives, yet not to weight narrative elements on its assessment indicates a need for alignment between the process and products targeted in instruction and assessed by corresponding rubrics. The TEWL-2 afforded a more reliable metric of students' writing skills. However, the writing scores reported here reflect what is measured by the selected assessments, not specifically the informational reporting targeted in the MW. Despite these constraints, the writing scores used in this analysis provide an interesting picture of Grade 2 writing and a compelling comparison of EO and EL writing in a program focused on writing development.\nAnother limitation is that although the MW sessions were all conducted in English, a portion of the bilingual students wrote their pre-post compositions in Spanish, requiring translation into English prior to scoring. Although their inclusion complicated the comparison between EO and EL groups, their compositions represented the students as developing writers and afforded an authentic representation of their writing behaviors. If forced to write in English, some of these students would have likely generated less text, minimizing their abilities to communicate in writing. It was not possible to extend the study beyond Grade 2 in order to examine how the students' written expression in English or Spanish reflected the benefits targeted in the MW or the WFtB approaches in subsequent years."}, {"section_title": "Conclusion", "text": "Given the encouraging results, this study warrants further investigation of the effects of MW as one component to a writing program. It merits replication and comparison with other writing approaches with younger students. This MW program focused on contextualized informational writing, which conforms to the expectations of the CCSS, but investigation of MW for various genres and in different grade levels would extend this study in important directions. Targeting different school curricular foci might engage students differentially, as writing quality is usually correlated in some way to students' interests and engagement (Pajares, 2003) . Emphasizing more descriptive language and revising the written texts in subsequent writing sessions, as indicated in this study, would afford other ways to measure its impact on students' writing.\nThere is a paucity of research regarding the sentence length and complexity of ELs (Restrepo et al., 2010) . In this study, students averaged approximately 10 words per sentence, with minimal changes during the year. Sentence complexity is sometimes evaluated with a subordination index, which is the average number of clauses per sentence for a sample. Informational writing tends to be more complex, with longer sentences and more clauses. Further researchers should attend to these aspects, especially if they are targeted in the anchor sentences that are modeled for students to use and extend. Sentence combining is a typical activity that could easily be modeled and encouraged during the MW sessions.\n\"For many children, writing expository information can be cumbersome and tedious. The task often seems overwhelming\" (Paquette & Fello, 2012, p. 236) . In current writing curricula, even first-and second-grade students are expected to write informative or explanatory texts in which they introduce a topic, use facts and definitions to develop points, and provide a concluding statement or section (Council of Chief State School Officers and the National Governors Association, 2010). To do as expected by the CCSS for informational or explanatory texts, students must accurately communicate information. MW as designed in this study is one way to initiate younger students to having something to say and getting several co-constructed sentences written down that can be extended more individually. Fluent language-generating processes are associated with quality writing (Gregg, Coleman, Stennett, & Davis, 2002) . The MW approach offers a viable complement to other language arts programs and a window into the processes of ELs as they orchestrate their developing language skills and linguistic resources."}]