[{"section_title": "Immigrants Learning English in a Time of Anti-Immigrant Sentiment", "text": "Clarena Larrotta, Texas State University Immigrants bring a wide variety of skills that favor the market productivity and add to the economic life of the country. They contribute to the development of the U.S. economy through the skills they bring to the market (cognitive skills such as abstract thinking, non-cognitive skills such as motivation and initiative, and specific skills such as the ability to operate machinery) and through the small business they own. Lancee and Bol (2017, p. 696) assert that different types of skills are relevant on the labor market: cognitive skills, non-cognitive skills, and specific skills. Likewise, Costa, Cooper, and Shierholz (2014) explain that:\nImmigrants have an outsized role in U.S. economic output because they are disproportionately likely to be working and are concentrated among prime working ages. Indeed, despite being 13 percent of the population, immigrants comprise 16 percent of the labor force…the share of immigrant workers who own small businesses is slightly higher than the comparable share among U.S.-born workers. Immigrants comprise 18 percent of small business owners. (p. 3) Despite being a significant force in the development of the economy and the contribution they make to the demographic diversification and cultural growth of the country, immigrants are currently not welcome in the United States. In fact, in 2016, the United States resettled 97,000 refugees; however, this number dramatically decreased in 2017 when it resettled only 33,000 refugees (Pew Research Center, 2018) . This decrease in numbers is the product of new immigration policies aiming to further restrict who enters the country. Mr. Trump's presidential campaign was full of anti-immigrant rhetoric particularly against Mexicans and Muslims (Kteily & Bruneau, 2017 To no one's surprise, after his election, President Trump´s administration has issued repressive and punitive policies and has encouraged raids performed by the U.S. Immigration and Customs Enforcement Agency (ICE) throughout the country. ICE manages detentions and the removal of people who have already been arrested for immigration violations. However, recently, ICE has targeted community centers, among"}, {"section_title": "Forum: Immigration and ESL", "text": ""}, {"section_title": "(Part 1 of 3)", "text": "Correspondance: Clarena Larrotta, larrotta@txstate.edu other places, offering education services to the immigrant community, and workplaces where immigrants are known to attend. This shift in ideology criminalizing immigration has made it more difficult for the United States to honor its humanitarian obligations when the assumption is that refugees, asylum seekers, and immigrants in general, are potential terrorists. The public, in particular those who lack information and knowledge about the complexities of immigration and the many reasons why people migrate, may end up believing what they hear from official government sources who are against immigration and immigrants. As Olivia Waxman (2018) writes in her report for Time, \"placing immigration in the national security sector reveals a changed focus on the idea of potential safety threats represented by immigrants, asylum seekers and refugees.\" Waxman further explains that:\nIf immigration is an economic or work-force issue, it would make sense to place it under the oversight of departments that deal with those issues. Placing immigration in the national security sector, however, reveals a changed focus on the idea of potential safety threats represented by immigrants, asylum seekers and refugees. That shift didn't start with the attacks of 2001. Immigration had been mixed in with national-security issues during the Clinton administration, too, especially after the first World Trade Center bombing on Feb. 26, 1993 (para 9).\nThe U.S. government has had mixed feelings about immigration and immigrants at different times in history. At present, a strong anti-immigrant sentiment has resurfaced in the country. There is no doubt that this anti-immigrant rhetoric has been promoted by the current president and the immigration policies issued during his administration.\nThe new immigration policies are negatively impacting immigrants living and arriving in the United States. The fear caused by these policies is not just product of enforcing the laws, but is a deliberate tactic of the anti-immigrant strategy of self-deportation. \"The Trump administration actions amount to an all-out attack on immigrants and immigrant communities\" (Goodman, 2017, p. 152) . This anti-immigrant sentiment has generated anxiety and confusion among immigrants who are afraid of being deported. Even immigrants who are legal residents fear losing their jobs or their work permits. They also fear traveling out of the country, there is reasonable doubt of being unable to return to their jobs and lives in the United States if they are denied re-entry at the border or the airport. Immigrants with a green card can still be deported from the United States if they have been convicted of a felony or crime, or if they fail to properly file tax returns, or if they have participated in public welfare programs. For undocumented immigrants, life in the United States is even more complicated. The Pew Research Center (2017) reports an estimated 11 million unauthorized immigrants living in the United States. Undocumented immigrants fear being apprehended and deported and this makes their mobility and participation in community events more difficult. They often isolate themselves and are easy prey for abuse. As Lalami (2018, p. 13) reports:\nWhen undocumented workers are free to work, they provide cheap and unprotected labor. When they are detained in immigration jails, they become sources of revenue for private prisons, where they can be forced into unpaid labor. Either way, they make money for others, while they and their families remain vulnerable to being broken up.\nRegardless of legal status (i.e., documented or undocumented), living as an immigrant has become more difficult nowadays in the United States. Rules and policies that applied to immigrants a couple of years ago do not apply today. Every day new immigration policies and difficult situations arise adding uncertainty, anxiety, and fear to the life of different immigrant populations in the United States.\nA specific example relates to how communitybased education centers have been targeted by ICE due to the large number of immigrants attending the programs they offer. Among the services that adult education centers offer, English as a second language (ESL) and literacy classes constitute important services addressing the immediate educational needs of immigrant adults and families. Adult ESL programs serve a diverse array of immigrant students, including young adults, parents, and senior citizens with a wide range of educational background as well (Lukes, 2009, p. 8) . Adult learners attending ESL classes come from various population groups; they could be either documented or undocumented immigrants (Wrigley, 2013; Young-Scholten, 2015) , refugees (Young-Scholten, 2015), or migrant workers (McLaughlin, Rodriguez, & Madden, 2008) . Due to their immigration and legal status, and their work conditions, this group of adult learners is directly impacted by immigration policies. For example, in a recent article published by the Chronicle of Higher Education, Field (2017) describes the irregular attendance patterns in adult education programs across the country. The following is a summary of relevant data she provided in her newspaper article on March 22, 2017:\nAt Louisiana Delta Community College, in Monroe, less than a quarter of the 200 enrolled students are attending class; at Linn-Benton Community College, in Albany, Ore., no one has enrolled in the ESL program since January... In San Diego and San Jose, CA, programs have seen declines of around 15 percent, compared with the fall semester and last year… In Tupelo, MO, the number of Hispanics enrolled in GED and parenting classes fell from 25 to three, following raids in Jackson, 175 miles southwest, and the deportation of four local residents…In Illinois and California, some ESL programs have experienced drops in attendance, while others have witnessed growth…At Triton College, in River Grove, Ill., enrollment is down 15 percent from last spring. But at Moraine Valley Community College, in Palos Hills, Ill., just 20 miles south, it is up in 9 percent...In Chicago, enrollment in citizenship classes at the Pui Tak Center nearly doubled from January to March; Centro Romero, a nonprofit organization in Chicago, gained 49 new students in January and 53 in February, up from a dozen most months.\nRegardless of the political climate, learning English continues to be a compulsory need of adult immigrants. However, attending ESL classes has become a hazard for some immigrants who feel vulnerable and perceive attending adult education centers as unsafe.\nAnalysis of data from the 2012 Program for the International Assessment of Adult Competencies (PIAAC) that directly assessed literacy and numeracy across multiple countries indicated that U.S. immigrant adults with lower proficiency in English literacy were more likely to report poor health (Batalova & Fix, 2015) . There is a direct correlation between speaking the language and the wellbeing of a community. Thus, weak skills in English translate into inadequate access to health care. In addition, not learning English can lead to social isolation and lack of participation in everyday activities beneficial to individuals and society.\nKnowing English means being able to obtain a better-paying job, becoming self-sufficient, having access to services and culture, having a wider access to information and knowledge, developing a sense of belonging, and finding the courage to apply for citizenship. Often, immigrants have families who depend on them and their income. Their children may be attending school and their immediate family members (e.g., spouses, parents, and siblings) have settled in the local community where they have created a new life away from their country of origin. Most immigrants do not wish to return to their homelands; they hope to stay in the United States to make a living, even if this means hiding and limiting their circle of friends and activities to a small segregated community or neighborhood. Consequently, those who are undocumented are the ones at most risk of being detained, deported, and lose everything they have worked for. Undocumented immigrants are aware of their reality and live in fear. There are plenty of stories of parents who have said good bye in the morning, went to work, and were unable to come back for supper. Being an undocumented immigrant means facing a constant risk of deportation.\nBecause of the raids performed by ICE, many ESL and adult literacy learning programs housed at community-based centers, churches, and libraries have started to offer workshops on immigration issues and have also invited expert guest speakers (e.g., immigration attorneys, counselors, and immigrant activists) to provide legal guidance and professional counseling to their students. Also, adult educators and program administrators have been forced to face the ethical dilemma of either denouncing or protecting undocumented immigrants attending their programs. For many years, adult educators and programs have welcomed undocumented students in their classes, however, recent anti-immigrant policies and the anti-immigrant political climate have made it more difficult for them to protect this population of adult learners.\nRecently, instructors and program administrators have created materials such as identification cards with key phrases in English and handouts with relevant information that their students can use if they face detention or are interrogated on the street by police officers or immigration officers. Another aspect of the efforts in helping students feel safe attending ESL and literacy classes has been geared towards educating immigrants about human rights and their legal rights. Therefore, the recent anti-immigrant and political climate has created more work for program administrators, instructors, and volunteers working at adult education centers, community-based programs, churches, and libraries. Nevertheless, more work does not necessarily means obtaining more resources or a larger budget to offer adult education services to the community.\nLikewise, adult educators and program administrators have realized the importance of providing resources and support for the emotional needs of their learners. \"The immigration process is unquestionably linked to major adjustment stressors\" (Perez Foster, 2001, p. 154) . In general, immigrants face emotional and physical challenges before deciding to leave their countries, during their immigration journeys, and after immigration. For example, anxiety, depression, and posttraumatic stress disorder (PTSD) have been associated with immigration trauma (Perez Foster, 2001) . Leaving what is familiar behind, leaving their relatives behind, or leaving their countries due to war or persecution are examples of the causes of the trauma they face before immigration. Arriving in a new country is also a shock for many. Experiencing the new culture, speaking a new language, making new friends, getting a job and surviving the new place can be challenging as well. Therefore, more than ever, adult educators are now feeling the pressure to understand how to best serve their students within the present political and social conditions they face outside the classroom.\nAs Pratt-Johnson (2015) noted: \"In recent years, laws that appear calculated to harass or punish immigrants -especially undocumented immigrants and their families-have been passed in many states, such laws also provide a source of on-going stress and anxiety for English learners and their families\" (p. 144). A learner who does not feel safe in the classroom will hardly be able to concentrate, study, or participate in adult education or language learning. Through the ESL and literacy classes, immigrant adults should be able to acquire essential tools such as communication strategies to share feelings, ideas, and doubts with other people. Above all, they should feel safe and engaged in learning (Buttaro & King, 2001) .\nFurthermore, community and adult education centers have realized the need to offer additional civics classes and citizenship classes since many of their students have decided to become American citizens. According to recent Bureau of Immigration statistics reports, there are around 13.1 million permanent residents living in the United States. Of these, 8.8 million are eligible to apply for U.S. citizenship (see http://dhs.gov). Following the immigration bans implemented by President Trump's executive order, many students attending ESL and literacy programs decided that applying for U.S. citizenship would be more efficient than renewing their green cards or work permits. However, according to the quarterly report issued by Homeland Security, \"approximately 264 thousand aliens obtained lawful permanent resident (LPR) status in the first quarter of Fiscal Year 2018 (FY18 Q1). They represent an almost nine percent decrease from the same quarter in FY 2017.\" In other words, even if more immigrants decide to become U.S. citizens, this does not necessarily mean they will be able to reach their goal. Becoming a U.S. citizen is a long, expensive, and complex process.\nAs a result, adult learning centers have started to organize workshops to help their students with citizenship applications and are also offering free classes to help applicants prepare for the U.S. citizenship test and interview. There are many materials available online to study and prepare for the citizenship test (test and interview DVDs, study guides, U.S. history cards, citizenship test apps, etc.). Nevertheless, not knowing how to use the computer or lacking confidence about how to file the citizenship application online are barriers for some immigrants and could become a service provided by adult education centers. The application form and the application process are long and a bit intimidating if the applicant lacks in computer literacy or does not understand, read, or write English. Being able to prepare their U.S. citizenship form online (Form N-400) could save immigrants a lot of money and could help them avoid hiring an immigration attorney, which adds to the already high cost of the citizenship application.\nIn conclusion, becoming an immigrant to the United States whether documented or undocumented, is more complex and less attractive at present. A strong anti-immigrant sentiment has resurfaced in the country making immigrant life more difficult. Immigration policies are a moving target and are negatively affecting individuals, families, and entire cities. The work of adult educators and literacy educators has doubled. They cannot just teach language, or math, or literacy. They must teach the whole individual and assist immigrants in identifying resources and providing for their emotional needs. More than ever, adult immigrant learners need to be resilient and persistent if they wish to learn English and succeed in their immigration journeys. However, learning English will not be enough; they will also need to learn how to deal with immigration trauma, learn about their legal rights, and make informed decisions about where to study, work, and live. Achieving the American Dream has become harder than ever; only those who are resilient and resourceful will succeed. More than ever, adult immigrants need to make use of their talents, human capital, and social capital to be able to stay and prosper in the United States."}]