[{"section_title": "FOREWORD", "text": "The U.S. Geological Survey (USGS) conducted a Pressure Sensor Workshop, oriented toward the measurement of stage in surface waters, in Denver, Colorado, July 28-31, 1992. Twenty attendees from the U.S. Geological Survey and the National Oceanic and Atmospheric Administration gave presentations concerning their experiences with the use of pressure sensors in hydrologic investigations. This report is a compilation of the abstracts of the presentations made at the workshop. Workshop participants concluded that each of the sensors evaluated by the U.S. Geological Survey has strengths and weaknesses. Personnel contemplating the use of pressure sensors discussed at this workshop should contact workshop attendees and consult with them about their experiences with those sensors. The attendees preferred to use stilling wells with float-operated water-level sensors as the primary means for monitoring water levels. However, pressure sensor systems were favored as replacements for mercury manometers and as alternatives to stilling wells at sites where stilling wells are not practical or cost effective. The U.S. Geological Survey has directed that all mercury manometer pressure sensors be replaced or removed from service by October 1, 2002. Presently the USGS is testing and investigating other types of submersible and nonsubmersible pressure sensors as possible replacements for the manometers. These replacements must meet USGS accuracy and reliability requirements. Attendees at a pressure transducer-packer workshop, June [25][26][27][28]1991, suggested that a followup workshop on surface-water applications for pressure sensors be conducted in July 1992 to provide an informal forum for the sharing of information about and experiences with the use of pressure sensors in surface-water investigations. This followup workshop was held at the USGS National Training Center (NTC). At the workshop, attendees from the U.S. Geological Survey and the National Oceanic and Atmospheric Administration (NOAA) presented 20 technical papers describing the installation, operation, accuracy, cost, and reliability of pressure sensors. One sensor in particular was deemed unsatisfactory because of problems resulting from changing air temperatures. Some of the other sensors did not meet accuracy requirements or were unreliable for longterm use because of excessive drift from the calibration standard, and some sensors were compared for accuracy and reliability to manometers or float-type gages. Other papers addressed the causes, detection, and correction of error in pressure sensors. The attendees presented a preferred water-level accuracy statement for WRD (Water Resources Division of the USGS) standards to a committee made up of representatives from the Office of Surface Water and the Regional Surface Water Specialists of the USGS. The Committee met and presented an alternative accuracy statement to the workshop attendees. The alternative accuracy statement was approved by the workshop attendees and was forwarded to the WRD Instrumentation Committee for comment. Representatives of six commercial pressure sensor vendors made technical presentations and exhibited their products. Attendees had the opportunity to meet directly with the vendors and discuss the instrumentation on an individual basis. Participating vendors and workshop attendees are listed in appendixes 1 and 2, respectively. Attendees reached consensus on the following points. Accuracy standards Workshop attendees proposed three alternative standards on the measurement accuracy of pressure sensors for consideration by the Regional Surface Water specialists and the Chief of the Office of Surface Water: 1. ±0.01 ft over the total range of stage; 2. 0.1 percent of the total head of water over the orifice, but not less than 0.01 ft (0.01 ft to 15 ft of head); and 3. 0.2 percent of stage over the orifice, but not less than 0.01 ft (0.0 ft to 7.5 ft). The majority of the workshop participants favored the second alternative. However, after a review of the alternatives by the Office of Surface Water staff and the Regional Surface Water Specialists, the third alternative, which had been the workshop participants' second choice, was forwarded to the WRD Instrumentation Committee for comment. The Office of Surface Water subsequently established accuracy goals for collection of surface-water stage (water-level) or gage-height data, which are set forth in appendix 3."}, {"section_title": "Foreword III", "text": ""}, {"section_title": "Sensor development", "text": "The Hydrologic Instrumentation Facility (HIF) should pursue the continued development by industrial suppliers of submersible and nonsubmersible pressure sensors for measuring stage. Proposed workshops 1. A similar technology-transfer workshop should be held in about 2 years. A followup workshop scheduled sooner would not leave sufficient time for significant advances or testing of new sensors beforehand. 2. In about 1 year, the HIF should set up a training workshop on pressure sensors. In the interim, the HIF should develop a videotape training tool for the PS-2 pressure sensor."}, {"section_title": "Pressure sensor testing", "text": "The HIF should continue to test the H310 submersible pressure sensor from Design Analysis Associates (DAA). The DAA H320 (temperature and conductivity sensor) and H350 (nonsubmersible pressure sensor) should be tested when they become available. The HIF should also be encouraged to test the Bartek acoustic noncontact water-level sensor with multiple calibration points."}, {"section_title": "Pressure sensor procurements", "text": "The availability of the PS-2 pressure sensor from the USGS contract ended September 30,1992. No plans were formulated at the workshop for a future procurement. The HIF should ensure that purchases of the Paroscientific PS-2 and DAA sensors can be made under waivers approved by the General Services Administration. DAA could provide 10 H350 nonsubmersible pressure sensors to the USGS for testing at the HIF and field offices. The HIF should coordinate this testing."}, {"section_title": "Instrumentation evaluation", "text": "The WRD's Branch of Instrumentation should provide a list of the workshop abstracts and authors as a reference for districts contemplating use of new pressure sensors. Encouragement should be given to district personnel to initiate a dialogue with workshop participants to aid in evaluations of hydrostatic pressure sensor application. Water-level sensing Stilling wells should be used whenever possible as the primary means for monitoring surface-water levels; pressure sensor systems should be used as a secondary means."}, {"section_title": "Bubbler systems", "text": "The HIF should develop a simplified bubbler system that has fewer components and is less subject to leaks and therefore more reliable."}, {"section_title": "Sammy L. Wilboum Hydrologic Instrumentation", "text": "Facility Field Coordinator The Wisconsin District of the U.S. Geological Survey has studied urban runoff in Wisconsin communities for more than 20 years. During these studies, a variety of different stage-sensing and data-recording equipment have been used for monitoring runoff events. Recent discussions with Campbell Scientific, Inc. (CSI), Logan, Utah, resulted in development of a prototype double-bubbler system by CSI that can measure stage at three separate orifices using a single pressure transducer. This system was tested in the Wisconsin District during July 1992. Bubbler systems detect level by measuring the pressure of gas forced through a tube into the water. The pressure of the gas in the tube is equal to the hydrostatic pressure at the exit point. The doublebubbler technique permits automatic calibration of the pressure transducer in the field. The result is a highly accurate measurement that is not dependent on temperature or subject to long-term drift. The calibration is accomplished by measuring the pressure at a userdefined time interval (generally once per hour) at two points 2 to 3 ft apart. A stilling well in the gage house or the channel is used for the fixed-distance measurement. Only one pressure transducer is used; solenoid valves switch the bubbler lines to the pressure transducer. Flow control valves and a rotameter are used to provide a constant bubble rate in each bubbler line. The double-bubbler is housed in a single enclosure, which includes a CR10 data logger, a pressuredistribution manifold, solenoid valves, and flowcontrol valves. Six valves allow the measurement of two calibration points, atmospheric pressure, and as many as three stages. If the fixed calibration points are in a stilling well, either of the calibration points can be used for the stage reading. Unused ports on the manifold can be plugged. The Wisconsin District tested a prototype double-bubbler during a 2-week period. The transducer used in the double-bubbler was calibrated using a separate standpipe with two orifices 2.0 ft apart. Three orifices for the double-bubbler system were installed near the base of an 8-inch inside-diameter plexiglass cylinder. Water level in the test cylinder was controlled by a peristaltic pump and float attached to a 10-turn precision potentiometer. Data obtained from the three orifices were compared to the stage recorded from a shaft encoder and a potentiometer, both of which were attached to a float in the test cylinder. During the first test series, the bubble rate was set to 60 bubbles per min and the stage was varied from 0.0 to 4.5 ft. The mean difference between the potentiometer stage and the double-bubbler stage was 0.002 ft, with a standard deviation of 0.006. A maximum difference of 0.015 ft and a minimum difference of -0.014 were observed. During the second test, the bubble rate was increased to 180 bubbles per min. The mean difference was 0.001 ft, with a standard deviation of 0.003. The maximum difference decreased to 0.008 ft and the minimum difference decreased to -0.007 ft. The double-bubbler system is a reasonable instrument to use when more than a single stage needs to be measured. When monitoring flow in storm sewers, stage may be measured at the approach, throat, and exit of a flume. Headwater and tailwater elevations may also be measured for flow determination at dams and culverts. Preliminary tests, in the office, showed that the double-bubbler measurements from the three separate orifices are repeatable and within 0.015 ft of the stages recorded from a potentiometer. Additional testing needs to be done to determine the optimum bubble rate needed for the most accurate stage measurement and to minimize the gas consumption rate. The double-bubbler also needs to be tested in the field to assess its performance under a range of field conditions."}, {"section_title": "Evaluation of a Double-Bubbler System for Sensing Water Levels 3", "text": "Comparison of WaterGage II and Mercury-Type Manometers at Three Streams in Michigan The U.S. Geological Survey (USGS) has begun phasing out mercury-type manometers used to gage water levels at data-collection stations because of environmental concerns. An alternative technology, known as a WaterGage II balance-beam manometer, was evaluated in the Michigan District of the USGS. In this study, the WaterGage II was chosen for evaluation because it was compatible with existing analog recorders and its dollar cost was appreciably less than that of some other equipment. Both types of manometers sense pressure (which converts to water-level elevation) through a gas-bubbling system that terminates at a fixed-position orifice. Stage was monitored by a mercury-type and a WaterGage II manometer at two gaging stations in northern Michigan from October 1991 to June 1992. The manometers were installed with their orifices in a stream channel at stations where frequent fluctuations in stage occur during hydroelectric-power operations. At a third station along a different stream, a WaterGage II manometer was installed to monitor static water levels in a stilling well for comparison with the turbulent conditions at the two other gages. The third installation was located on an unregulated stream where flow is relatively stable. At this station, the gage was operated for only 24 days; the other gages were operated for 274 days. The absolute differences between daily mean stage monitored by the two types of instruments at all the stations was ±0.01 ft for a minimum of 55 percent of the time and a maximum of 76 percent of the time. The same differences were ±0.02 ft for a minimum of 79 percent of the time and a maximum of 100 percent of the time. The absolute recorded differences between \"instantaneous (maximum and minimum)\" stage was ±0.01 ft for a minimum of 48 percent of the time and a maximum of 50 percent of the time, and ±0.02 ft for a minimum of 72 percent of the time and a maximum of 85 percent of the time. Greater stage fluctuations were recorded from the WaterGage II during a steady streamflow condition than from the mercurytype manometer during the same condition. The WaterGage II responds to physical changes (that is, air temperature in direct contact with the instrument and minor pressure changes at the sensing orifice) more than the mercury-type manometer. The degree of accuracy is hard to determine for the WaterGage II because recorded fluctuations are caused by a variety of physical conditions. Although the WaterGage II is more sensitive, it does not appear to be more accurate than the mercury-type manometer. The differences in values measured by the two types of equipment were consistent among the three study sites. Further study of the WaterGage II manometer would be necessary to determine the cause of diurnal fluctuation in stage during steady-flow conditions and to test the reliability of instantaneous stage measurements over a greater range in stage than was monitored in this study. The WaterGage II is an alternative that can be used to replace mercury manometers at sites where there is a need to operate other mechanical equipment, such as encoders for data-collection platforms, automatic digital recorders, graphic recorders, and telemetry systems. Installation is simple and straightforward. A WaterGage II can be attached to the existing orifice lines and the constant-differential regulator and sightfeed or to Fluid Data's safe-purge system. The safepurge system was designed to eliminate the possibility of oil getting into the gas pressure lines; however, some inherent problems must be addressed. Stepping and painting (the pulsation of the mercury) are problems with the mercury manometer. The WaterGage II also has stepping and painting problems, but they can be reduced or eliminated with simple adjustments during calibration. Calibration of the WaterGage II is not as simple and straightforward as installation. Time and patience are required because of the time necessary for the instrument to stabilize after each adjustment is made. Calibration is accomplished by manipulating three adjustments: the inlet valve, the sensitivity potentiometer, and the summit trigger-switch potentiometer. To effectively make these adjustments, an electronic extender board is needed. The extender board, which permits the electronics module to be brought outside the housing, can be purchased from the manufacturer or can be constructed by almost any electronics shop. To accomplish calibration, the instrument shelf must be stabilized and the instrument leveled. The WaterGage II must be calibrated for gas density at each site, thereby rendering the instrument site specific. The WaterGage II can be removed and recalibrated for different sites with minimal adjustments. A calibration log for each instrument is suggested, inasmuch as each poise (the movable weight) has a weight unique to the site. If a WaterGage II is removed and relocated to another site, the known weight of the poise is needed to compensate for gas density. At sites where WaterGage II's have been installed, maintained properly, and calibrated correctly, readjustments have been rare. The Kentucky District of the U.S. Geological Survey has several WaterGage II's installed and operating at sites ranging from small \"flashy\" streams to large rivers. Thus far, few problems have been encountered with use of the WaterGage II. Calibration is the most critical element in the WaterGage II's performance due to its extreme sensitivity and orifice-line orientation. Gas leaks and electrical problems are the most common causes of problems. In 1991, the U.S. Bureau of Reclamation (USER) notified the U.S. Geological Survey (USGS) of its intent to remove the electrical line that provided power for winter operation of streamflow gaging station 12362500, South Fork Flathead River near Columbia Falls, Montana. The existing concrete gage house and stilling well were also in need of extensive repair or complete replacement. The USGS, faced with the need to develop an alternative heating system for winter operation and to either repair or replace the existing well, decided to evaluate a stage-sensing alternative to the stilling well. The large stage fluctuations of 5 to 6 ft that are common at this site during power-generating cycles, the extreme winter temperatures, and the high humidities make this an ideal test site for new equipment Because the USGS had about 1 year before implementation was needed, the alternative system could be operated along with the existing stilling well, and the resulting stage records could be compared. (See table 1.) The streamflow gaging station is located in northwestern Montana near Glacier National Park at an elevation of about 3,000 ft above sea level. The station is 1.7 mi downstream from the dam of Hungry Horse Reservoir, which has a capacity of about 3.5 million acre-ft and is used primarily for hydroelectric power generation. Stage data are currently provided by a float system in a stilling well. The float system drives a digital punched-paper-tape recorder, a Stevens A-35 (1) graphic recorder, and a Stevens selsyn-servo unit that provides real-time data to the power house for dam operation and relays data to the GOES (Geosta- tionary Operational Environmental Satellite) system for use in the regional USBR HYDROMET data network. The cooperating agency is interested in maintaining a graphic recorder at the station along with the real-time equipment. The USGS is presently determining the most appropriate way to provide these services should the stilling well need to be replaced. A WaterGage II balance-beam manometer system, a nonsubmersible pressure-sensor system manufactured by Fluid Data Systems, was evaluated as an alternative to the present system. The equipment provides features that would allow the USGS to maintain its current level of service to the cooperating agency. The features include a nitrogen bubbler system and a mechanical output shaft that will operate a graphic recorder and, as an option, will drive a shaft encoder for a data-collection platform. The WaterGage II also is available with an optional transmitting potentiometer for interfacing with an electronic data logger. Installation of the WaterGage II, completed in late November 1991, was fairly simple. The equipment requires about the same space in the gage house as a mercury manometer system. A standard orifice was installed along with the Fluid Data Systems sightfeed. Initially, the hydrographers had difficulty understanding the electronic adjustments required for three potentiometers, one of which is not easily accessible and is not mentioned in the manual provided by the company. The electronic adjustments include a servogain adjustment for sensitivity, a zero adjust for small corrections to the reference, and a notch switch control for a time delay similar to that on a manometer servocontrol unit. Sensitivity can also be adjusted to some extent using a needle valve on the orifice input line. The system was installed during a period of medium to low stage. The orifice was attached to a metal rod driven into the streambed about 10 ft from the bank in 2 to 3 ft of water. One problem  immediately became apparent the WaterGage II is extremely sensitive to instantaneous stage fluctuations due to water-level surges in the river. The damping effect on these fluctuations provided by the stilling well was apparent. Surge in the well had previously been observed at high stages because of increased velocities, hydraulic conditions in the channel, and proximity to the dam outlet. However, with the orifice for the WaterGage II extending into the flow, changes in stage were sensed immediately and the graphic pen trace became nearly 1 in. wide. Hydrographers have since learned how to dampen the response. The authors also realize that, with virtually instantaneous pressure readings, increased fluctuation in recorded stage over that now obtained from the well would have to be accepted. When stages are low, little or no difference was observed in water-surface elevation recorded by the WaterGage II and the stilling well. Minor differences between the readings from WaterGage II and the stilling-well equipment con-tinue. However, in most instances the difference is small and within acceptable accuracy criteria. Most problems seem to result from large, rapid stage changes of 3 ft or more. Because changes occur within minutes, the WaterGage II seems to have difficulty tracking the changes. For example, with rising stage, the readings tend to stabilize about 0.1 to 0.2 ft less than the well record; with falling stage, the readings tend to remain 0.1 to 0.2 ft higher than the well record after the stage stabilizes. The problem may be improper gain adjustment, or perhaps may be related to procedures used in the initial setup. On the basis of operating experience from November 1991 to May 1992, the WaterGage II seems to be an adequate alternative stage-sensing system. The problems encountered thus far probably can be overcome. If the system continues to be reliable, it could be an acceptable alternative to the mercury manometer."}, {"section_title": "Evaluation of a Nonsubmersible Pressure Sensor in Montana 11", "text": "Evaluation of the Balance-Beam Manometer The U.S. Geological Survey tested balancebeam manometers at two test sites from January to July 1992. The sensor evaluated is the WaterGage II, which is manufactured by Fluid Data Systems and designed to operate with a pressure head of 0 to 25 ft. At both test sites, the WaterGage II is installed in a 4-by 6-foot unheated and uninsulated wooden shelter with a standard U.S. Geological Survey bubble system and sightfeed. All bubble-gage sensors can indicate some deviation from the base reference gage due to orifice conditions, problems associated with vibration, and air temperature fluctuations. Site one is on Cherry Creek at Parker, Colorado (station 393109104464500). At this site, Cherry Creek has a typical sand channel subject to continual scour and fill. Normal range-in-stage is expected to be less than 5 ft but could exceed 15 ft under extreme conditions. The stream end of the orifice is installed in a gravel pack muffler and is buried 4 to 8 in. below the surface of the sand. No gage pool exists. Site two is at the mouth of Sand Creek near Commerce City, Colorado (station 394839104570300). This site also has a sand channel, but intermixed with the sand is a large quantity of concrete rubble that gives the streambed some stability. Normal range-instage is expected to be less than 5 ft but could exceed 10 ft under extreme conditions. The stream end of the orifice is installed using a standard 2-inch galvanized steel orifice cap located about 6 in. above the streambed with a 2-inch steel pipe serving as a protective conduit. At low stages, an ideal gage pool exists; at higher stages, the low-flow control is completely submerged, and the orifice end is subject to considerable velocity. At both sites, the WaterGage II operated under variable temperature conditions with no apparent drift. At site one (Cherry Creek), deviation from the base reference gage (ranging from -0.01 to +0.05 ft.) remained relatively constant from April to July. This deviation might be due to sand affecting muffler performance or slight movement of the orifice anchorage. At site two (Sand Creek) significant deviation from the base reference gage was noted on three occasions of higher stage and velocity (March 4-5 and June 1), but the WaterGage II returned to within ±0.02 ft on subsequent inspections. These deviations are partly the result of higher velocities at the unprotected and unshielded orifice or possibly the result of a lag between sensor and river stage during rapidly rising and turbulent stage conditions. Comparisons between the base reference gage (a vertical outside staff at both sites) and the WaterGage II are presented in tables 2 and 3. Overall, the performance of the WaterGage II has been satisfactory. As with all bubble-gage sensors, other independent variables can affect the back pressure at the sensor location, and the uncertainties associated with determining the true stage at sand-channel sites generally result in questionable stage data. The ability of the WaterGage II to operate a strip-charttype recorder (as well as other types of recorders) is an important consideration because this allows for quick evaluation of the operation of the sensor system at the time of gage inspection.   The Portland Field Office of the U.S. Geological Survey currently is operating five PS-2's (Paroscientific pressure transducers) interfaced with CR10 (Campbell Scientific, Inc.) data loggers. These instruments were decided upon because (1) CR10 data loggers were available in our office; (2) PS-2's had been tested by the HIF; and 3PS-2's were readily available from the HIF. Programming a CR10 data logger to record SDI (serial-digital interface) data is simple because the SDI sensor is doing the processing. The CRIO's continuously collected and stored data from the PS-2's without problem. The CR10 and PS-2 have a power consumption of 0.02 ampere-hours per day (0.6 amperes per month) while collecting data at 30-minute intervals. No data have been lost owing to battery failure. Installation of the PS-2 is simplified if used to replace a manometer because the existing gas-purge bubbler system is used. The PS-2 comes from the HIF equipped with the appropriate hardware to connect it to a conoflow unit A standard SDI cable is available from HIF with a connector on one end for the PS-2. The opposite end terminates with bare wires that connect to the CR10. Two types of commands, regular and extended, are used with the PS-2. Regular commands are used to identify the address of the SDI sensor, initiate a measurement, and send data. Extended commands are used to set operating parameters in the PS-2. The Portland Field Office has been setting two internal parameters in the PS-2 zero adjust and user adder. The zero adjust parameter is set to read zero while the gas-purgê bubbler system is at atmospheric pressure. After reconnecting the orifice line, the PS-2 measures the depth of water over the orifice. At all PS-2 installations, this depth-of-water value has agreed well with a physical measurement of depth of water over the orifice. Any difference between the depth-of-water value and the reference gage reading is the value coded in the user-adder parameter as an offset for correcting to the present datum. The remaining operating parameters are used as they were set at the HIF. Operating parameters are stored in nonvolatile memory and remain intact if power is disconnected. The PS-2's determine average water pressure over a period of 12 or 16 seconds depending on the unit. This period could be altered in the future because occasional gage-height fluctuations up to 0.02 ft have been recorded in apparently stable water-level conditions. A longer averaging period can serve to smooth the effects of fluctuating pressure differences. In November 1991, three PS-2/CR10 units were installed in central Oregon. These gages are located at approximately 6,300 feet above sea level and were operated through a temperature range of-16to33°C (3 to 91 °F). Stage record from the PS-2 at the Paulina Lake gage agreed with the outside staff gage within 0.02 ft throughout a 0.6-foot range. Total range in stage collected by this PS-2 was 0.8 ft. The Paulina Creek PS-2 agreed with observed outside reference gage readings within 0.05 ft. Accuracy of the reference gage (tape down) is assumed to be ±0.03 ft. In March, 1992, a mercury manometer was removed and a PS-2 installed at the South Fork Bull Run River. This site is unusual because the PS-2 and orifice are located 450 feet downstream from the shelter where the CR10 and other monitoring equipment are installed. All PS-2 readings agreed with the outside staff gage within 0.01 ft throughout a 1.5-foot range in Oregon District Experiences Using Paroscientific Pressure Transducers interfaced with Campbell Scientific Data Loggers stage. Total range in stage recorded at this site by the PS-2 has been 2.4 ft. The PS-2 stage data collected at this site agree well with a nearby comparison site equipped with a stilling well. In March 1992, a manometer was removed and a PS-2/CR10 was installed at McKenzie River below Leaburg Dam. All PS-2 readings have agreed with the outside staff gage within 0.01 ft throughout a range in stage of 5.7 ft. In conclusion, the PS-2/CR10 instrumentation has been easy to install and has worked well at these installations in Oregon. Several new sites equipped with PS-2's will be installed in the near future and mercury manometers will be replaced with PS-2 instrumentation."}, {"section_title": "Digital Pneumatic Tide Gages at National Oceanic and Atmospheric Administration: A Progress Report", "text": "Pneumatic tide gages, commonly known as bubbler gages, have been used by the National Ocean Service (NOS) as the backup or primary gages in permanent stations of the National Water Level Observation Network (NWLON) and Global Sea Level network and in NOAA ship-operated hydrographic surveys. It is a proven, simple, and rugged instrument, especially suitable for open coastline and remote area installations. The greatest advantage of the bubbler gage is that it places the pressure transducer package on shore and leaves only pneumatic tubing and a pressure port in the water, thus greatly increasing the reliability and maintainability of the measurement system. However, the operation of these gages has been hampered by several problems, including cumbersome and less accurate data processing of analog charts, large wind wave-induced noise in the data record, clogging of dampening valve, and excessive gas consumption caused by leakage. Because of the fundamental soundness in the basic design concept of the bubbler gage and its unique application characteristics, the gage has been upgraded to conform with present NOS data-collection, processing, and accuracy requirements. The upgrade activities included studies to improve the understanding of the gage operating mechanism and measurement errors and engineering efforts to implement the design changes. Engineering efforts are centered in several key areas. The first was the replacement of an analog mechanical chart recorder with an electronic data- collection platform (DCP), which provides data storage and several means of data telemetry. To be fully compatible with present NOS water-level measurement requirements, Sutron 9000 and 8200 DCP's, recently developed under the NOS Next Generation Water Level Measurement System program, are used. Data telemetry by means of satellite, telephone, and onsite communication using portable computers has been employed. A line-of-sight radio communication mode is currently being developed. The gage hardware has been redesigned. It consists of high-quality control valves and fittings to eliminate leakage; reliable pressure regulators to maintain constant gas flow; valves for periodic venting to monitor the pressure transducer zero readings; new orifice designs to mitigate the measurement errors caused by water currents and waves; and a new mechanical dampening coil to replace the existing dampening valve. A long-term field experiment is being conducted to evaluate candidate pressure transducers. Five pressure transducers of four types quartz crystal, capacitive, piezoresistive, and miniaturized OEM (Original Equipment Manufacturer) design have been undergoing evaluation in a coastal environment for more than 2 years. Sensor characteristics, such as linearity, hysteresis, repeatability, and long-term drift were studied. Preliminary data show that the quartz crystal and capacitive sensors outperform the others. Another effort is the design and testing of a dual-orifice bubbler gage, in which two orifices are installed with a known vertical separation between them. The dual-orifice system has the potential to provide more reliable water-level measurement in areas where large water-density changes occur with the tidal cycle. Two design configurations have been studied: a single pressure transducer that is switched between two vertically separated orifices and a full dual system having a separate pressure transducer for each orifice.\n"}, {"section_title": "History of the Use of Submersible and Nonsubmersible Transducers in Arkansas", "text": "By Terranee E. Lamb 1 In 1987, the Arkansas District of the U.S. Geological Survey began a search for a water-level sensing instrument to replace the mercury manometer in use at streamflow gaging stations because problems with the mercury manometer system were resulting in excessive lost record. Several instruments were evaluated as possible replacements for the manometer. One was a Setral 20-pound-per-square-inch model 270G nonsubmersible pressure transducer. This instrument, which requires a 24-volt power supply, was used in conjunction with a Synergetics data-collection platform programmed to turn on the power for 15s, once every 15 min, to obtain a reading. This instrument system was installed on an existing bubbler system at a stage-only gage in August 1987 and has performed reliably since that time, except for occasional problems with leaks in the bubbler system. The accuracy of this particular nonsubmersible transducer is ±0.1 ft, which was acceptable for the stage-only application. However, the accuracy of the instrument limited its use in many stage-discharge applications, and efforts to locate a replacement for the manometer continued. Because many of the problems with the manometer were related to gas leaks in the bubbler system, a submersible transducer was purchased and evaluated. The instrument tested was a Geocon 5-pound-persquare-inch submersible vibrating wire transducer. It was installed at a streamflow gaging station where it was operated for several months. Problems experienced with this instrument included erratic readings and instrument failures during periods of rain or excessive humidity. A submersible pressure transducer constructed from an inexpensive ($65) 5-pound-per-square-inch nonsubmersible transducer also was evaluated. These Assistant District Chief, U.S. Geological Survey, District Office, 2301 Federal Office Building, 700 West Capitol Avenue, Little Rock, Arkansas 72201. transducers were enclosed in plastic pipe to make them waterproof and were vented to the surface. The system worked but the inexpensive transducers produced erratic results and were not considered suitable for use at stage-discharge gages. Two Druck PDCR 130/D pressure transducers, one 5-pound-per-square-inch model, and one 15pound-per-square-inch model also were tested. These transducers were installed in tandem at a gage site, which had a range in stage of 30 ft. The tandem configuration provided greater accuracy at lower stages and sufficient measurement range to cover the entire range of stage. These instruments were reliable but were not adequately temperature compensated. The next instrument tested was a Paroscientific PS-2 nonsubmersible transducer, which could accommodate the necessary range in stage of more than 48 ft. This instrument, which is relatively expensive ($4,000 to $5,000), was rented from the U.S. Geological Survey's Hydrologic Instrumentation Facility. The PS-2, as does the mercury manometer, uses a bubbler system. It has proved reliable except for occasional leaks in the bubbler system. A Waterlog H300 series submersible pressure transducer manufactured by Design Analysis was evaluated in the summer of 1990. It proved to be reliable and the accuracy seemed to be comparable to that of a manometer. Fourteen of these instruments are now being used for various applications in Arkansas six in a wetlands project to measure water levels in shallow aquifers; two (installed in tandem) on a stream with a range in stage of 40 ft; and the remaining six at streamflow stations on large and small streams. On the basis of the results of tests of several instruments, some submersible transducers are suitable alternatives to the mercury manometer for sensing water-level changes in field applications. They are\nsmall, have no moving parts, consume little power, be best. The bubbler system is hard to maintain due to and are relatively inexpensive. leaks and malfunctioning valves. The accuracy of the Experience in the Arkansas District also has system is affected by temperature changes, which also demonstrated that a replacement for the mercury cause leaks. The bubbler system requires large heavy manometer that does not use the bubbler system would dangerous high-pressure gas bottles to operate."}, {"section_title": "Comparison of Two Pressure Sensors", "text": "By Bill Bemis 1 During 1990During , 1991During , and 1992, a pressure sensor system (PSS-1) has been in use by the Pueblo Subdistrict of the U.S. Geological Survey at two stream gages. The PSS-1 system consists of a frequencyoutput Paroscientific pressure transducer mounted inside an environmentally sound enclosure. An electronic data logger, signal conditioning electronics, a data-storage module, and the necessary interfacing also are mounted within the enclosure. Campbell Scientific's CR10 data logger and SM192 data-storage module are presently used in the PSS-1 system. The Paroscientific pressure transducer used in the PSS-1 is expensive but is claimed to maintain an accuracy of ±0.01 ft of water over its operating temperature range of -40 to +65 degrees Celsius. The pressure range of the transducer is 0 to 30 pounds per square inch (0 to 70 ft of water). The PSS-1 unit was first installed beside a STACOM manometer. Stage values recorded by the PSS-1 agreed with the manometer readings within 0.02 ft of water. Once this accuracy was determined and some familiarity with the PSS-1 unit was gained, the manometer was removed. Because the PSS-1 was fairly expensive, an alternative, less-expensive pressure transmitter was purchased and tested. Using the PSS-1 as the control, a Druck PTX 620 pressure transmitter was installed at station number 07103780, Monument Creek above North Gate Boulevard, at the U.S. Air Force Academy, Colorado. A Synergetics 3400 data-collection platform (DCP) was used to measure and transmit the stage readings from PTX 620. These readings were compared to those recorded by the PSS-1 system. The PTX 620 pressure transmitter, like the PSS-1 unit is not a submersible transducer and was designed for use with a bubbler system. The PTX 620 costs about 15 percent as much as a PSS-1 unit, but a DCP or data logger is required to measure and record the readings. The operating temperature range of the PTX 620 is -9 to +48 degrees Celsius. The transmitter has a two-wire 4-to 20-milliampere output that represents its pressure-measurement range of 0 to 10 pounds per square inch (0 to 23 ft of water). The transmitter's current-loop output was run through an external 250-ohm precision resistor to produce a voltage ranging from 1 to 5 volts. This voltage was recorded by the Synergetics DCP as feet of water. Comparison of the two systems began on March 15, 1992, and is ongoing (July 1992). From April 8 to April 30,1992, the pressure readings from the Druck transmitter deviated gradually from those of the PSS-1 unit and reached a worst-case difference of -0.5 ft of water. This fluctuation may be attributed to lack of temperature compensation in the transmitter, the drift characteristics of the transmitter, or any of several other factors. The Druck was recalibrated onsite on April 30 and rechecked on May 1. Before and after this period, the PTX 620 was within ±0.04 ft of water of the PSS-1 maximum, minimum, and mean pressure values. From March 15, 1992, to June 15, 1992, pressure was 3.91 to 4.78 ft of water. Considering the cost and the effect of temperature variations on the transmitter, the PTX 620 performed within the manufacturer's stated accuracy of ±0.08 percent for nonlinearity and hysteresis and the temperature range error of ±0.5 percent, except for the period from April 8 to 30, 1992."}, {"section_title": "2Z", "text": "Various Sensors Used in Monitoring Water Levels by the Sacramento Field Office, California District of the U.S."}, {"section_title": "Geological Survey By Michael D. Webster 1", "text": "The Sacramento Field Office of the U.S. Geological Survey operates and maintains approximately 90 continuously monitored streamflow, ground-water, and water-quality sites. Data from most of these sites are recorded on electronic data loggers. Water-level sensors operated by the data loggers include Handar 436A and 436B encoders, Paroscientific PSS-1 and PS-2 pressure transducers, Design Analysis H300 pressure transducers, Druck PDCR830 pressure transducers, Geokon vibrating wire pressure transducers, Lundahl Instruments ultrasonic sensors, and Fluid Data Systems water gages. Since the late 1980's, two ground-water sites have required continuous monitoring. The first site is a subsidence study site near Woodland, California, which has four 2-inch wells. Druck 830 series pressure transducers have been used to monitor ground-water elevations for these wells. Seasonal water-level changes at each well are more than 100 ft. The success rate for these two transducers under these conditions is low. In an effort to test different sensors for the Hydrologic Instrumentation Facility, a 30-pound-per-squareinch H300 transducer was installed in one of these wells. Although the water elevation still has to be chased, the reliability and accuracy of the data have improved. The second site is near Zamora, California, and is part of the Central Valley Aquifer Project. The site has three wells, two of which are artesian. Seasonal water-level changes are in the order of only a few feet. Geokon vibrating wire pressure transducers are used to monitor water elevations and barometric pressure. These transducers, under these conditions, have been very reliable, with only one transducer failure and accuracies of ±0.04 ft for the period of record. Six PSS-l's were purchased from the Hydrologic Instrumentation Facility in 1989. Five have been installed to date. Accuracy and reliability have been very good with only one failure caused by an electrical storm. In 1991, a PS-2 was received from the Hydrologic Instrumentation Facility for field testing purposes and was installed at South Fork Yuba River at Jones Bar near Grass Valley, California. The PS-2 is operated along with a USGS mercury manometer. Data from both sensors is compared with reference gage readings. Accuracy of the PS-2 has been within ±0.02 feet of the reference gage since installation. Reliability and accuracy of water-level sensors is dependent on site selection and environmental conditions at the site. Pressure transducers have proved to be very reliable in water-level monitoring when configured properly to a site. The Washington District of the U.S. Geological Survey installed six Design Analysis, Inc., model H300, Waterlog submersible strain-gage pressure transducers to measure stage in reservoirs and streams. Submersible transducers are a promising alternative to other methods of stage measurement. The H300 transducers interface with data loggers commonly used by the USGS and are easy to install. They are less expensive than many types of stage measuring instruments and require only a small instrument enclosure instead of the much larger gage houses required for stillingwell and mercury-manometer systems. Data reliability appears to be high. Field installation of the H300 should include the manufacturer's dry-air system, which prevents moisture buildup in the transducer vent tubing. The accuracy performance of the transducer should be documented by periodic calibration checks because of the possibility of drift from manufacturer accuracy specifications. Five of the H300's tested had a range of 15 pound-per-square-inch (34.6 ft) and were installed in streams. One transducer, with a 30-pound-per-squareinch (69.2 ft) range, was installed in a reservoir. Design Analysis, Inc., also manufactures a 5-poundper-square-inch (11.5 ft) transducer. Proprietary software and electronic circuitry that compensate for error due to offset, nonlinearity, and temperature change are installed with the transducer. Available signal outputs include serial-digital interface (SDI-12), RS-232, and frequency. In these installations, all transducers were programmed for SDI output, with pressure head in units of pounds per square inch, and interfaced with Sutron model 8200 data loggers. In the data logger, stored slope and offset factors convert transducer units to stored values of gage height in units of feet. The Supervisory Hydrologist, U.S. Geological Survey, Field Headquarters, 1201 Pacific Avenue, Suite 520, Tacoma, Washington 98402. H300 transducers were installed in streams where they can be well protected in galvanized pipe, kept clear of sediment, and removed for calibration. The H300 is designed for vertical suspension, but most installations in Washington were in pipes at angles ranging from 20 to 60 degrees off vertical. Pipe diameter was 2 inches. The transducer was secured to a heavy flexible rod inserted in the pipe for easy removal and stability. Both static tubes and crest-stage-gage orifice caps were used to eliminate velocity-head effects on the pressure transducer. Velocities were probably in excess of 4 feet per second near some transducers. No effects from stream velocity were documented, but further tests are needed at higher velocities. Because the H300 is a gage pressure transducer, it needs internal venting through a tube to the atmosphere. Design Analysis, Inc., has developed a dry-air bottle that terminates the vent tube from the transducer in adesiccantand air-filled chamber, which eliminates the possibility of moisture entering the transducer. The dry-air bottle is installed in the instrument shelter with the data logger and will interface with many types of vented gage pressure transducers. During the test period, there were no electrical, mechanical, or water-leakage failures with the six transducers. The test periods for three transducers were approximately 1 year, and, for the others, 4, 6, and 8 months. Gage-height readings at an outside star! gage were obtained frequently (sometimes daily) and compared with recorded values of gage height from the transducers. For two of the 15-pound-per-squareinch stream transducers and the 30-pound-per-squareinch reservoir transducer, a time-series plot of the staff gage and transducer readings indicated the possibility of time-related and stage-related deviations from the end-point reference line of the transducers. Subsequent dead-weight tester checks conducted by the USGS Hydrologic Instrumentation Facility and"}, {"section_title": "Installation and Operation of Submersible Pressure Transducers Design Analysis Model H300", "text": "confirmed by Design Analysis, Inc., determined non-due to moisture that affected test results because they lineal deviation of as much as -0.8 percent at full-scale were shipped for testing without the vent tube conoutput of 35 ft. The manufacturer indicated that there nected to the dry-air bottles. In subsequent tests, the was a high probability of some component damage performance of other H300 transducers was within specifications."}, {"section_title": "Evaluation of Pressure Transducers on Small Drainage Areas near Steamboat Springs, Colorado", "text": "By Ed A. Wilson 1 In August 1984, the Meeker, Colorado, field headquarters of the U.S. Geological Survey, in cooperation with Steamboat Springs, Colorado, installed five gaging stations to monitor inflows and outflows on Fish Creek Reservoir (1,840 acre-ft) and Long Lake Reservoir (400 acre-ft). These gages are near the Continental Divide and vary in elevation from 9,860 to 10,000 ft. The drainage areas range from 0.71 to 4.78 mi2. The 24-year annual average (1961-84) snow depth for April is 133 in. with a water equivalent of 50.7 inches. Until August 1989, the equipment at these sites consisted of analog-to-digital recorders (ADR's) and 4-inch stilling wells. Complete gage-height records were very difficult or impossible to collect with this equipment. In early fall (October to November), ice formed in the wells and the floats froze in place. During winter, the gages were covered by 10 to 12 ft of snow. In spring, the snow melted and either electrical contacts had been corroded by moisture or the ADR paper tape had gotten wet and jammed in the punch block, rendering the ADR recorder inoperable. It was common to lose 5 to 6 months of gage-height record with this equipment. Early spring is a critical period for collecting accurate records in order to define the leading edge of the spring runoff hydrograph. However, the ADR recorder usually was not operating in early spring. As a result, the quality of the published streamflow records is classified as poor. In August 1989, Telog data loggers with Druck 5-pound-per-square-inch submersible pressure transducers were installed to evaluate their functionality under these climatological conditions. Manufacturer's specifications for this equipment stated 0.1 percent resolution from 0 to 11.56 ft and temperature range Supervisory Hydrologic Technician, U.S. Geological Survey, Subdistrict Office, Wayne Aspinall Federal Building, 4th and Rood Avenue, Room 223, Grand Junction, Colorado 81502. error of 0.5 percent from -2 to 30 °C. The data logger is enclosed in a weather-resistant enclosure with a 5-micron filter and desiccant pack to reduce instrument failure due to moisture. Power was supplied from five lithium penlight-size batteries with an operating life of 18 months at 25 °C. Memory size for the data logger is 6,500 data values or 270 days of hourly gageheight readings. The data values are retrieved and the data loggers are programmed with an IBM AT/ PS-2compatible laptop computer with 640 kilobytes of RAM (random access memory); MS-DOS, version 3.3 or higher; and a hard disk. Equipment at all five sites was installed and operational in 2 days. The results in the first year of operation were good. Four sites recorded complete gage-height record for the year, and one site lost 2 to 3 months of record due to battery failure. Agreement between recorded gage heights and outside gage readings was within 0.02 ft, when the head was less than 5.0 ft. Excellent results have been obtained since the first year of data collection. The submersible transducers produced more complete records under these climatological conditions than did the ADR recorder and 4-inch stilling wells. However, the laptop computers needed to retrieve data and configure data loggers are inconvenient and unreliable in this environment where air temperatures are often below 5 °C. The transportation of these laptops on snowmobiles, horseback, or trail bikes poses logistical problems. The use of exchangeable data cards or data-transfer storage units would enhance the flexibility of maintaining this type of instrumentation. The lack of a digital readout for gage height and the inability to update the gage-height without the use of a laptop computer is a major handicap to operations. The use of electronic data loggers and transducers is a good approach to the collection of hydrologic data; however, considerable training is necessary. Because of the potential for contamination of water bodies should mercury spills occur within the gage house area, the Caribbean District of the U.S. Geological Survey, like many other districts, is in the process of replacing its mercury manometers, which measure stream stage, with balance-beam manometers. To evaluate the performance of the balance-beam manometers, the district concurrently operated a WaterGage II balance-beam manometer and a STACOM mercury manometer at a gaging station on the Rio Grande de Loiza during much of November 1991. The stage at this gaging station is affected by releases from a reservoir located about 1 mi upstream. When the gates at the dam are opened, the rate of change at the gage can be as much as 10 ft in 30 min. A comparison of the records for the two manometers indicated that the mercury manometer responded to rapid changes in stage more slowly than did the balance-beam manometer. As an example, during a short duration release from the dam on November 8, 1991, the mercury manometer registered a peak of 16.10 ft and the balance-beam manometer registered a peak of 21.20 ft. The actual peak registered at a creststage gage at the site was 21.34 ft. Base stage before the release from the dam was 3.25 ft. Thus, during a rise in stage of about 18 ft in a few hours, the mercury manometer underregistered the peak stage by about 5.10 ft. These results indicate that the balance-beam manometer might be a more reliable instrument for obtaining peak flows in flashy streams than the mercury manometer. The stagesensing equipment tested includes mercury manometer, balance-beam manometer, nonsubmersible transducer, and submersible transducer systems. All equipment tested that utilizes a nitrogen gas pressure system for operation is connected to a common orifice.\nThe two stream-gaging stations are inspected weekly by personnel from the Council Bluffs Field Office. During these inspections, the actual river stage is measured using an outside reference gage, and the stage indicated for each stage-sensing device is recorded for comparison with actual river stage. All the stage-sensing equipment is reset to the outside reference gage at 6-week intervals. Data for each stagesensing device being tested are transmitted to the Iowa District Office at 4-hour intervals using satellite telemetry. Data are also retrieved from an onsite data logger on a monthly basis and are stored on standard computer disks. All stage-sensing equipment was installed in the two stream-gaging stations by July 1, 1992. The tests will be conducted until July 1993. The test data will be compiled and statistical analysis of the results will be performed after the completion of the test. "}, {"section_title": "Stage-Accuracy Considerations", "text": "The U.S. Geological Survey is responsible for the majority of the streamflow data collected in the United States. In 1991, the USGS was responsible for the collection of surface-water discharge records at 10,473 stations, of which 7,346 were continuousrecord stations and 3,127 were partial-record stations. Stage-data records were also obtained on streams, reservoirs, and lakes at an additional 2,126 stations (Condes de laTorre, U.S. Geological Survey, written commun., 1992). The purpose of this report is to discuss considerations applicable to the establishment of accuracy goals or standards for the collection of stage data at discharge gaging stations. Considerations of stage accuracy at sites for which discharge is not computed are beyond the scope of this report. The present USGS standard for stage accuracy for discharge stations is that the accuracy goal for stage measurement is ±0.01 ft for daily discharge stations. Less accuracy is allowed where special conditions exist, such as places where the uncertainty of flows is great because of channel instability. Three models for a stage-accuracy standard are discussed. The first is the \"Best-Accuracy\" model. This model assumes the collection of data in the most accurate manner throughout the range of stage, regardless of the effect on the accuracy of the discharge record. The current USGS standard of collecting stage data with an accuracy of ±0.01 ft throughout the range of stage generally conforms to this model. The second model is the \"Instrument\" model. This model assumes an accuracy goal as a percentage of the range of stage rather than as an absolute most accurate practical value. A model with an accuracy statement of ±0.1 percent of full range value would have, for example, an allowable error of ±0.01 ft for a 10-foot range of stage, while the allowable error would be ±0.03 ft for a 30-foot range of stage. These errors would be applicable throughout the range of stage. The third model is the \"Equal Discharge Accuracy\" model. This model requires that the discharge obtained from a stage-discharge relation is within a constant accuracy percentage throughout the range of flow. In the \"Best-Accuracy\" and the \"Instrument\" models, the stage accuracy, in feet, is constant throughout the range of stage resulting in a variable discharge accuracy depending on the stage being measured. For both of these models, the discharge error will be relatively large at low stages with a lesser discharge error at high stages. In the \"Equal Discharge Accuracy\" model, the stage accuracy is allowed to change with stage in order to allow a constant percent error limitation in the discharge value. Examination of a number of stage-discharge ratings shows that for high flows at many stations, stage accuracies of ±0.1 ft will provide discharge accuracies to within 5 percent. At high flows at some stations, stage accuracies of even less than ±0.1 ft can provide highly accurate discharge values. At low stages, however, the accuracy goal of ±0.01 ft, now used by the U.S. Geological Survey, may give discharge values that are less accurate than ±5 percent. The acquisition of stage data within an error less than ±0.01 ft is generally not practical at most sites. In order to establish a stage-accuracy standard that provides for high accuracies of discharge at lower stages and also allows for less accurate stage determinations at higher stages without diminishing discharge accuracy that can be obtained from a practical perspective, the following policy is proposed. The goal for stage accuracy at discharge stations is ±0.01 ft or 0.2 percent of the stage above the point of zero flow, whichever is larger. This policy recommends the collection of stage data with an accuracy of ±0.01 ft up to a stage of 5.0 ft.\nAt a stage of 10 ft, the stage accuracy will be ±0.02 ft. discharge accuracies. One result of this proposed pol-This proposed policy seems to be a reasonable com-icy will be to make it possible for a larger number of promise in allowing for a relaxation of stage accuracy instruments to be used to collect stage data while conat high stages without significantly compromising tinuing to provide for discharge data of acceptable accuracy."}, {"section_title": "Analysis of Errors in Stage Measurements by Pressure Sensors", "text": "By William H. Kirby 1 Although pressure sensors often are thought of as stage-sensing instruments, such a designation is not strictly correct, and an uncritical assumption that it is true can lead the user into error. It is true that pressure in a standing liquid is proportional to the depth below the surface, but this simple law is not sufficient for practical determination of stage from pressure measurements. At a minimum, one also needs to know (that is, make an independent measurement of) the height above the stage datum of the point where the pressure is measured. The effects of water-density changes and water motion also need to be assessed and, if necessary, accounted for. If the pressure sensor is not submersible, some mechanism, such as a bubbler system, must be provided to transmit the pressure from the water to the sensor; the effects of this system on the relation between pressure measured by the sensor and actual pressure in the water body then must be assessed and accounted for. In many practical streamflow measurement applications, these complicating effects are negligible, but, in many other applications, they are not. Although the instrument manufacturer may be responsible for the accuracy with which the pressure sensor measures the pressures applied to its input port, the instrument user needs to be aware of sensor-performance characteristics such as drift, hysteresis, and temperature sensitivity. In addition, the instrument user is responsible for recognizing the field situations in which stage can be determined from pressure measurements, for installing the pressure sensor and ancillary equipment so that the recorded pressure does accurately indicate the stage, and for interpreting the pressure records correctly in terms of stage. The relation between stage and measured pressure can be affected by many factors, including: obstruction of the orifice or other connections between the water body and the pressure sensor vertical movement of the orifice or sensor with respect to the gage datum stagnation pressures (pileup or drawdown) due to velocity of water flowing past the orifice changes in density of river (or lake) water due to changes in temperature or sediment concentration differences in gravitational acceleration (g) between sensor calibration site and stage measurement site (gravity anomalies) weight of purge-gas and atmospheric columns in bubbler systems changes in instrument and bubbler-system characteristics (including gas weights) due to temperature changes rate of rise of water level relative to purge-gas flow rate in bubbler systems (surge and wave-action effects). The effects of most of these factors have been evaluated and the results are available in the published literature. The one factor that is virtually impossible to analyze theoretically is the obstruction of the orifice or other connection between the pressure sensor and the water body. Because the pressure differential across the obstruction cannot be predicted, the pressure sensor reading does not have any theoretically definable relationship to the pressure or depth in the water body. Corrections can be made only by direct observation of the stage by staff or wire-weight gage, or by tapedown from a reference point. Every effort therefore should be made to ensure and verify that the orifice, bubble tube, and other connections between the pressure sensor and the water body are free of obstructions, and to obtain direct stage observations whenever the pressure sensor is inspected. Although detailed theoretical analyses of many types of errors are available, these analyses commonly require knowledge of auxiliary information that is not usually available or is not feasible to obtain. Examples of such information include current velocity or stagnation pressure at the orifice, temperature of the gas in the bubble tube, local gravity anomaly, and, in many cases, elevation of the orifice relative to gage datum. Thus, it is essential that stage measurements made with pressure sensors be verified and corrected or calibrated, if necessary, by comparison with direct measurements of stage by staff gages, wire-weight gages, or other means. All pressure-sensor sites should be equipped with crest-stage gages and crest-stage readings and high-water marks used routinely (not just after the annual flood) to verify the peak pressure-sensor readings. A record should be kept of comparative readings of the pressure sensor and the reference gages. It is especially important to keep these records for high stages, using crest gage readings and highwater marks. Any adjustments (resetting) of the pressure sensor (or reference gages) should also be recorded, as should any corrections applied to the recorded gage heights. The record should be reviewed periodically to detect any relations between magnitude of corrections and stage, or any progressive trends in adjustments, which might indicate heaving or settling of some part of the gage house or appurtenant structures or supports. If a relation between correction and stage is found, that relation can be used as the basis for adjusting the scale factor of the pressure-stage relation in the pressure sensor. The adjustment can be made directly in the pressure sensor if it is built with an embedded microprocessor. Otherwise, the adjustment can be made in the data logger. Instructions for performing the adjustment are given in the operating manuals of the pressure sensor and data logger. In evaluating the importance of various error sources, it is necessary to consider the purpose for which the stage record is being collected and the effect of stage errors on the accomplishment of that purpose. In most U.S. Geological Survey stage-measurement applications, stage is collected as a means for computing stream flow from a stage-discharge relation. Because stage-discharge relations commonly plot on log-log paper as lines (or smooth curves) with slopes between about 1.5 and 3.0, a given percentage error in stage results in a percentage error in discharge of about 1.5 to 3 times as much. Therefore, a given absolute error in stage, say 0.01 ft, has more effect on the percentage error of the computed discharge at low stages than at high stages. U.S. Geological Survey stage-measurement accuracy goals traditionally have been expressed as absolute rather than percentage values. It should be noted that commonly quoted expressions of pressuresensor accuracy, although expressed as percentages, are expressed as percentages of the full-scale reading rather than as percentages of the indicated reading. Thus, they actually are expressions of absolute rather than percentage stage accuracy. This is in contrast with the expression of discharge accuracy, which is expressed as a percentage of the indicated value. A clear understanding of the differences between percentage and absolute accuracy is necessary for realistic appraisal and assessment of various accuracy claims and goals."}, {"section_title": "Testing of Submersible Pressure Transducers Installed in Crest-Stage Gage Pipes", "text": "By William R. Kaehrle 1 and Kirk G. Thibodeaux2 The U.S. Geological Survey (USGS) has undertaken the task of evaluating submersible pressure transducers subjected to velocity fields. The pressure transducers, obtained from various vendors, were tested in the jet tank facility of the USGS hydraulics laboratory at the Stennis Space Center in Mississippi. Initial testing of the transducers placed them directly in the velocity field. The results of this testing showed that the pressures registered by the transducers were reduced by 30 to 50 percent of the velocity head. This reduction error, expressed as stage, ranged from a low of 0.01 ft at a velocity of 1.2 ft/s to a high of 0.51 ft at a velocity of 8.0 ft/s. With the underregistration error in mind, the pressure transducer was shielded from the velocity field by inserting the transducer into a vertical creststage gage (CSG) pipe. Initial testing on an empty vertical CSG pipe revealed that, as long as the CSG's bottom cap inlet holes were within 20 degrees of their proper orientation, there would be no drawdown error in the pipe below a velocity of 4 ft/s and a drawdown error of only 0.05 ft at 8 ft/s. In order to determine whether installing a pressure transducer in a CSG would affect the transducer, two makes of transducers were tested in CSG pipes at velocities of 0 ft/s and approximately 4 and 8 ft/s. One of the transducer types was also tested at a velocity of approximately 1 ft/s. Each transducer and CSG assembly was tested by rotating the assembly ±40 degrees from proper inlet-hole orientation in 10-degree increments about a vertical axis. As with the CSG alone, as long as the CSG's bottom cap inlet holes were within 20 degrees of their proper orientation, the transducer would give acceptable stage results. In \"what if scenarios, the transducer/CSG assembly was tilted 30 and 45 degrees to simulate installations on sloping stream banks. As with the vertical configuration, the assembly was rotated about its center axis to angles of ±40 degrees in 10-degree increments. The velocities used in this portion of the testing were the same as for the vertical configuration. Results were similar to those of the vertical configuration tests. Other knowledge gained in the testing of the pressure transducers was that extreme care must be taken to ensure that the transducer is centered in the CSG pipe and is fixed so as not to float or move in the pipe. Precautions must be taken to ensure that the transducer is replaced in the same location in the pipe after it has been removed for cleaning or maintenance. The transducer's cable should never be kinked because of the diaphragm venting requirements. If the transducer's cable is not shielded, it must be either arranged so that it is not in a loop or securely fastened so that it cannot move during use. The transducer's resolution should also be understood prior to use. Additionally, when using a submersible transducer, users should exercise extreme care to monitor transducer \"drift\" and wet-dry cycle induced diaphragm damage. Additional details on these tests are available from the USGS Hydraulics Laboratory, Stennis Space Center, Mississippi.\nTesting of Pressure Sensors at the Hydrologic Instrumentation Facility SyPhillipW. Potter 1 Responsibility for the testing and calibration of pressure transducers (PT's) for use in the collection of hydrologic data rests with the Hydrologic Instrumentation Facility (HIF) of the U.S. Geological Survey (USGS). As part of a program set up by the Water Resources Division's (WRD's) Instrumentation Technical Advisory Subcommittee (ITAS)/Instrumentation Coordination Committee (ICOM), USGS datacollection personnel can request that commercially available PT's be purchased by the HDF and tested or that USGS-owned PT's be tested and calibrated. Requests for purchase and testing of commercially available PT's are initiated by field personnel using a request form, which can be obtained by electronic mail from the HIF instrumentation coordinators. When this form is completed and returned to the HIF, the PT of interest is added to the list of equipment recommended for testing. Equipment on this list is prioritized for procurement and testing at the next ITAS/ICOM meeting. If the PT of interest is considered of high priority, the equipment will be purchased and tested to determine its suitability for use in USGS data-collection activities. Results of all equipment tests by the HIF are printed in the WRD Instrument News and are released to personnel of the Water Resources Division on the instrument continuum of the nationwide electronic information system of the USGS. Requests for testing and calibration of USGSowned PT's generally are made to the HIF instrumentation coordinators. The instrumentation coordinators forward the requests to the Systems Application Team. The Systems Applications Team schedules the test and provides the requester with a cost estimate for the equipment tests and calibration. Engineering Technician, U.S. Geological Survey, Hydrologic Instrumentation Facility, Building 2101, Stennis Space Center, Mississippi 39529. For some WRD studies, PT's must be calibrated to meet specific accuracy standards established by the USGS and be traceable to the National Institute for Standards and Technology (NIST). If this type of calibration is required, the HIF sends the PT to the National Aeronautics and Space Administration (NASA) contract laboratory at Stennis Space Center for NIST-traceable calibration. The cost of calibrating the PT to meet these accuracy standards depends on the time and effort required to calibrate the instrument and process the calibration data. The cost averages about $1,200 per week of effort. The HIF maintains PT calibration capability but cannot calibrate to the accuracy standards that NASA requires of its onsite contractor. HIF testing equipment and pressure sensors, however, are sent periodically to NASA's onsite contract laboratory for calibration to NIST accuracy standards. For most WRD datacollection activities, PT's calibrated at the HIF provide an acceptable level of accuracy. Calibration of PT's at the HIF is accomplished using an Ametek pneumatic pressure tester ( fig. 1). A pressure regulator and nitrogen cylinder are connected to the inlet valve of the pressure tester. A Paroscientific model 740 pressure sensor and the PT are connected to the outlet valve. The inlet valve allows pressure (from the nitrogen cylinder) to be applied to the ceramic ball on the center cylinder of the pressure tester, as shown in figure 1 (the ceramic ball floats on a cushion of nitrogen gas). The outlet valve allows a known pressure from the Ametek pressure tester to be applied to the PT. Different weights on the weight carrier, which rests on the ceramic ball, can be used to maintain a precise constant pressure for calibration purposes. Each of the weights is made of precisionground stainless steel and is engraved with its own serial number and weight. (When working with the weights, white cotton gloves must be worn because any contaminants, such as body oil, dust, or dirt, can affect the weight.) During calibration of a PT, the pneumatic pressure tester is commonly housed in an enclosure to eliminate air and temperature currents. The HIF has two such testers, the accuracies of which were within 0.010 percent of reading after NASA laboratory calibration. The accuracy of the Paroscientific model 740 in-line pressure sensor used to measure the pressure being applied to the PT is reported by the manufacturer to be 0.01 percent of full scale. A Campbell Scientific CR10, which can be read to at least four decimal places, is used to read output from the PT. Calibration generally requires PT output values with at least five significant figures. Calibration of PT's at the HIF is commonly conducted over a range of temperature and humidity in environmental chambers. A programmable environmental chamber, pressure controller, and digital piston gage make it possible to automate the testing of the PT's for a range of pressures, temperatures, and humidities. The accuracy of the pressure controller and piston gage setup is listed by the manufacturer as 0.01 percent of the reading. The calibration of PT's normally involves several tests. One test involves increasing the applied pressure from zero to full scale and then reducing it to zero. This test, which is conducted at room temperature, will indicate hysteresis and linerarity in the PT output. A second test involves similar increases and decreases in pressure applied to the PT at both ends of the temperature range. This test, which is conducted in an environmental chamber, will indicate hysteresis at different temperatures and will indicate whether the temperature compensator is working properly. If the unit has no temperature compensator, this test can be used to determine the magnitude of the error caused by changes in temperature, the drift of the zero calibration point, and the stability of the slope of the output curve. A third test involves the measurement of a constant pressure (at both ends of the pressure range) across a wide temperature range. This test determines the sensitivity of the PT to temperature changes. A fourth test involves periodically increasing the applied pressure from zero to maximum pressure and then venting the PT. This procedure, which is carried out at room temperature, is repeated several times a day for a number of days. This test determines the repeatability of the PT measurements. In a fifth test, if time permits, the submersible transducer is placed in water, and pressure readings are recorded for 6 months to 1 year. This test is used to determine long-term drift in the unit. Laboratory calibrations of PT's are advantageous because they can be performed under tightly controlled conditions, and they can be checked against known accurate pressure standards. This produces data that indicate the true accuracy of each pressure transducer during the period tested.  The California District of the U.S. Geological Survey shipped two new (October 1991) WaterGage II balance-beam manometers to the Hydrologic Instrumentation Facility (HIF) in December 1991 to conduct tests for diurnal temperature errors found in earlier models. These WaterGage II's were taken to the National Aeronautics and Space Administration (NASA) Standards and Calibration Laboratory operated by Sverdrup Technology, Inc., at Stennis Space Center, Mississippi. The HIF requested a standard laboratory calibration at 25 °C using the most accurate National Institute for Standards and Technology (NIST) traceable pressure standard. The laboratory staff adjusted the two units according to the manufacturer's instructions to ensure that the units were set to local conditions before calibration. Calibrations were requested at 50,0, -20, and -40 °C for comparison with calibrations at 25 °C. The first calibration was conducted under near ideal laboratory bench conditions at 25 °C. A constant known test pressure was applied at 5-foot intervals from 0 to 50 ft to establish a baseline calibration for each WaterGage II unit. Calibrations were then conducted at the other temperatures using an automated pressure standard and the NASA environmental chamber. The chamber was needed to maintain a constant temperature for each calibration run. The maximum errors, which were the difference between the WaterGage II shaft positions as read from the basic data recorder display and (or) the WateiGage n dial and the pressure standard values, for both WaterGage II units ranged from 0.02 to -0.02 ft with a hysteresis of 0.03 ft for laboratory calibrations at 25 °C under near ideal conditions. The output errors of the two WaterGage II units ranged from 0.14 to -0.09 and 0.08 to -0.13 ft at constant controlled temperatures of 50,25,0, -20 and -40 °C in the environmental chamber tests. Two problems were observed in the environmental chamber tests that contributed to these errors. The WaterGage II adjustment potentiometers located on the electronics board were continuously re-adjusting in response to vibration generated by the air circulation fans and motors in the chamber. With the chamber turned off, the potentiometers were reset to the correct position according to the manufacturer's instructions, and the potentiometer knobs were glued to their cases. This resulted in improved test results, but another problem was noted. The WaterGage II output shaft position and dial readings were unstable when the chamber was cycling to the next temperature, when there were air currents from the chamber fans, or when the chamber door was opened. The laboratory staff used duct tape to seal all the holes and joints in the two units and installed a temperature sensor on the WaterGage II base plate. Usually 2 hours was required for the WaterGage II internal temperature to equal the chamber temperature, but the WaterGage n unit required an additional 10 hours at a constant temperature and pressure to produce a stable shaft position and dial reading. All readings were taken at a constant chamber temperature and with the fans off to eliminate air currents and vibrations. The resultant maximum errors were -0.05 ft at 50 °C, 0.04 ft at -20 °C, and 0.05 ft at -40 °C for one WaterGage II unit, and -0.04 ft at 50 °C, 0.04 ft at -20 °C, and -0.06 ft at -40 °C for the second WaterGage II unit. These results were better than the first series of chamber tests but worse than the bench calibration tests at 25 °C, indicating that the Fluid Data Systems WaterGage II Laboratory Test Results calibrations of the two WaterGagell units changed over the duration of the tests. The HIF conducted cold temperature test cycles on one of the WaterGage II units. These test cycles confirmed the calibration shift problem that occurred when the potentiometer shafts were not secured (glued down) and uncovered another problem that indicated an erratic shaft output when condensation developed on the inside of the WaterGage II unit. During the initial setup of the WaterGage II unit in the chamber at room temperature, the WaterGage II dial was set according to the manufacturer's instructions to read 0.00-foot water level by venting to the atmosphere. The WaterGage II dial reading was 0.30 ft of water when the WaterGage II was vented again to atmosphere while the chamber was at -20 °C. This 0.30-foot shift showed the combined effects of the unsecured potentiometers and temperature change. The reference instrument (Pressure Sensor 2) also in the chamber was reading 0.004 ft of water when the pressure was vented to atmosphere at -20 °C. The WaterGage II did not return to the 0.00-foot output shaft position after the unit dried at room temperature, but it reached a stable 0.19-foot output. This 0.19-foot reading indicated a shift in zero calibration point for the unsecured potentiometer. Condensation occurred during the time the environmental chamber was being brought up to room temperature after being at -20 °C for 84 hours. Condensation was observed, through the chamber window, on the poise and front panel of the WaterGage II before the chamber door was opened. During the time that condensation was on the WaterGage II, the Water-Gage II dial reading was observed to vary rapidly back and forth through zero from a high of 1.84 ft to a low of -1.44 ft when the actual pressure was 0.00 ft (vented to atmosphere). In tests of the two October 1991 models with potentiometer shafts secured locked and joints sealed, uncorrected temperature errors ranged from -0.05 to 0.04 and from -0.04 to 0.04 when temperature changed from 50 to -20 °C. These test results indicate that all WaterGage II units should be checked for temperature error so that previously collected data can be corrected. The HIF suggests that all WaterGage II units be calibrated in the gaging shelter using a portable pressure standard periodically to determine the temperature correction over the range of temperature and stage that occurs at each station. Alternatively, the WaterGage II units can be sent to an NIST-traceable calibration laboratory that has a temperature chamber. If the stage temperature error is larger than acceptable, the WaterGage II internal temperature must be recorded at the same interval that stage data are recorded so that the stage data can be corrected. The potentiometer shafts should be secured (glued in place) after all adjustments are made. In the gaging shelter, the WaterGage II unit should be isolated from vibration, mounted to a shelf that remains level in all directions, shielded from air currents, and protected from condensation and large daily temperature changes to ensure stable and repeatable pressure measurements."}, {"section_title": "Pressure Transducer Characteristics and Manufacturer's Specifications", "text": "By Roy A. Johnson 1"}, {"section_title": "INTRODUCTION", "text": "The U.S. Geological Survey commonly utilizes pressure transducers to monitor water levels in streams, lakes, and reservoirs. The performance of these pressure transducers depends on several characteristics of the transducers as well as the particular operating environment. There are standardized testing procedures documented for determining these characteristics, but many manufacturers use their own nonstandard testing methods."}, {"section_title": "TRANSDUCER CHARACTERISTICS", "text": "The performance of a pressure transducer is affected by several characteristics. These performance characteristics are commonly listed by the manufacturer on the specification sheet for the particular transducer. Transducer characteristics can be grouped into four basic categories: static characteristics, dynamic characteristics, environmental characteristics, and reliability characteristics. Many of these characteristics may not apply. Others may greatly affect the performance of the transducer and the accuracy of the data after the transducer is in its operating environment. The terminology and methods of specifying these characteristics must be understood for the prospective user to select a pressure transducer appropriate to the intended application. This paper describes some of the terminology commonly used in manufacturer's specifications."}, {"section_title": "Static characteristics", "text": "Static characteristics pertain to the performance of the transducer at room conditions with no sudden Electrical Engineer, U.S. Geological Survey, Hydrologic Instrumentation Facility, Building 2101, Stennis Space Center, Mississippi 39529. changes in the measured pressure. The testing required to determine these characteristics is conducted at industry-accepted room conditions of temperature, humidity, and barometric pressure. Physical phenomena such as mechanical shock, vibration, and acceleration are not a part of static testing. Static characteristics are commonly listed on the specification sheet for the transducer, but they can also be grouped together to produce a static error band. A static error band is used as a method of incorporating the worstcase error for each of the individual static characteristics into a single specification or graph. The individual static characteristics include linearity, repeatability, hysteresis, zero shift, and sensitivity (slope) shift. Most of these error components are specified as a maximum percentage of the transducer's full-scale output (FSO). The full-scale output of the transducer will normally be given in pounds per square inch. Linearity is an important characteristic. Many types of transducers exhibit a nonlinear output If the output is nonlinear, a simple straight-line equation (y = mx + b) cannot properly transform the raw data from the transducer into the appropriate units of pressure or depth. A complex polynomial equation may be required with such transducers. Most electronic data loggers and data-collection platforms (DCP's) have the capability of performing simple straight-line equations (multipliers and offsets), but many cannot perform any complex calculations. Some transducers have a typically nonlinear output but are fairly linear within a part of their total pressure range. If the measured pressures remain within this linear part of the transducer's range, the nonlinear transducer may perform acceptably with a straight-line equation applied to its output. Some manufacturers build transducers that have a large pressure range but specify an operating pressure range that is only a fraction of this total range. This is done to limit the range of the measured pressures to a linear portion of the output curve of the transducer. Repeatability and hysteresis are two static characteristics that a user cannot easily compute. These characteristics are functions of the physical and electrical makeup of the transducer. Manufacturers that perform \"burn-in\" cycles and high-temperature accelerated aging of their transducers can improve these error sources. Repeatability is a measure of a transducer's ability to reproduce the same output reading when the same pressure is applied. It is specified as the maximum difference between output readings, collected during two consecutive calibration cycles, and expressed as a percentage of the transducer's FSO. Hysteresis is also expressed as a percentage of the transducer's FSO and is very similar to repeatability. Hysteresis is a measure of the maximum difference in the transducer's output at any one pressure value when that pressure is approached with increasing and then decreasing pressures. Zero shift and sensitivity shift, collectively called drift, can also be very dependent on the amount of burn-in or aging done by the manufacturer. These characteristics are specified as the maximum shift that will occur in the transducer's output curve during a specified period of time. Many transducers will exhibit relatively fast drift during the first few days or weeks of operation but will tend to stabilize and cease drifting after a period of time. Drift can normally be handled by performing onsite calibrations of the transducer. Most transducers have little sensitivity shift but can show a significant zero shift. Zero shift can normally be corrected in the field with no need for precision pressure standards by simply \"venting\" the transducer to atmospheric pressure and zeroing its output. Correcting a sensitivity (slope) shift in the field is a more difficult task and is not possible at many installations."}, {"section_title": "Dynamic characteristics", "text": "Dynamic characteristics are those that determine how the transducer will perform when subjected to sudden changes in pressure. If a pressure transducer is subjected to an instantaneous \"step\" change in pressure, its output cannot instantly reach its maximum value. The rise time of the transducer or time constant provides a measure of the length of time required for the transducer's output to reach its new value after a sudden rise or fall in pressure. The method and amount of damping built into the transducer can greatly affect this transient response. Another way of specifying the transient characteristics of a transducer is through its response time. The response time is the length of time required for the output of the transducer to rise to a specified percentage of its final value when subjected to a step change in pressure. A specific measure of the response time for a transducer is the time constant, which is defined as the time required for the output of the transducer to reach 63.2 percent of its final value. The transient response is not a factor in selecting a transducer if sudden pressure changes do not occur at the operating site. However, some types of testing, such as pump tests on well-water levels, can require a transducer with a fast response time. Other applications, such as monitoring of wave heights, can require transducers with a very good transient response and settling time. Settling time is the time required for output of a transducer to stabilize after a sudden change in pressure. This can be a problem in transducers that have overshoot and undershoot problems."}, {"section_title": "Environmental characteristics", "text": "Environmental characteristics relate the performance of a transducer to temperature, vibration, and mechanical shocks. The manufacturer typically gives two sets of environmental specifications: operating conditions and nonoperating (storage) conditions. The operating conditions allow the transducer to function properly and within specified tolerances. The nonoperating or storage conditions are those that the transducer can withstand without damage; however, outside its operating conditions the transducer can fail to perform satisfactorily. Environmental characteristics affecting transducer performance include temperature, acceleration, vibration, orientation, ambient pressures, overpressures, and mechanical shock. The effects of temperature present some of the most serious problems when using pressure transducers. Thermal zero shift and thermal sensitivity shift are two of the most significant sources of errors in pressure transducer measurements. The effects of temperature on the output of a transducer are probably best handled by the manufacturer through built-in temperature compensation. In an environment where the temperature of the transducer does not fluctuate appreciably, the effects on the output of the pressure transducer can be insignificant. The transducer might be purchased from the manufacturer with calibration data furnished at the expected temperature. If a transducer is used in an environment where large variations in temperature occur, some type of temperature compensation must be performed. If the output of the transducer is not temperature compensated, a complex scheme could be required to correct for temperature. These schemes involve the individual calibration of each transducer at several temperatures spanning the operating temperature range. The temperature of the transducer must be measured in addition to the pressure output to perform the temperature compensation scheme. A temperature-dependent equation or series of equations must then be used to perform the correction of the measurement in the data logger or DCP being used to measure the transducer. Acceleration effects are not very significant when a transducer is firmly affixed to a stationary support. Vibration can be a factor if a transducer is on a bridge or along a railroad. Proper mounting and shock proofing of the transducer can alleviate these acceleration and vibration effects. Flowing water and wave action are two factors that can cause the submersible transducer to experience vibrations. Water flowing across the mounting system of the transducer or electrical cabling can also cause such vibrations. Some pressure transducers will produce an output that changes with varying physical orientations. If the manufacturer specifies a particular orientation, it should be used. Otherwise, the selected orientation should be set and should remain unchanged for the entire data-collection period. Physical orientation is very important for submersible transducers as drawdown and pile-up can create very large errors in flowing-water measurements. These events are very dependent on the orientation of the sensing element of the transducer in relation to the direction of flow of the water. The movement of the water can either add or subtract from the sensed pressure. Variations in ambient pressure can have some effects on pressure measurements. The flexible sensing element of a pressure transducer, or diaphragm, has a specified ambient position. If the ambient pressure changes, the ambient position of the diaphragm can change. The sensitivity of this sensing element can also change as ambient pressures change. Overpressures can have a similar effect on the sensing element of a transducer especially when the sensing element is not perfectly elastic. Overpressures can cause some slight permanent deformations to the sensing element. A pressure transducer should be selected with a pressure range large enough to handle any pressures that could be experienced at the operating site. The overpressure rating of the transducer specifies the pressure at which permanent damage or deformations of the sensing element or related parts will occur. The burstpressure rating is another specification that is much higher than the overpressure rating. The burst-pressure rating specifies the pressure at which physical failure of the transducer or its housing will occur. As with most delicate electronic instrumentation, severe mechanical shocks can cause permanent damage to a pressure transducer. Inside some pressure transducers, sensing elements are bonded to a mediacompatible diaphragm with adhesives that could become brittle with time. Small-diameter wires and fragile connections compose the internal part of most transducers and might not withstand severe mechanical shocks."}, {"section_title": "Reliability characteristics", "text": "Reliability characteristics determine the expected lifetime of a pressure transducer. Many environmental characteristics affect the reliability of a transducer. Reliability characteristics can be limited to those parameters that directly determine the useful life of the transducer. The operating life or the cycling life of a transducer determines the length of time the transducer can be expected to last when used in conditions that are within its specified operating conditions. Many manufacturers will present this specification as a mean-time-between-failures (MTBF) rating. This is a measure of the average length of time that a transducer can operate without failure. Some manufacturers will also specify the storage life of the transducer, which is the length of time the transducer can be stored with no deterioration of its performance. The burst-pressure rating can also be considered to be a reliability characteristic because the transducer becomes useless if its diaphragm or case is permanently deformed or ruptured. Many manufacturers do not specify any reliability characteristics. If a product line is relatively new, these specifications are often unavailable and there is no standard to use for determining the typical lifetime of the transducer. The testing required to produce reliability data is very time consuming and costly. The manufacturers who do provide such information often specify the MTBF rating based on either controlled testing or previous records of field use of the transducer. A list of numerous long-time users of a product line is a good indication of available support and followup procedures from the manufacturer."}, {"section_title": "APPENDIX 3. EXCERPTS FROM OFFICE OF SURFACE WATER STATEMENT ON STAGE ACCURACY", "text": "\"Surface water stage records at stream sites shall be collected using instruments and procedures that provide sufficient accuracy to support computation of discharge from a stage-discharge relation, unless higher accuracy is required. Instruments capable of sensing and recording stage with an accuracy of either 0.01 foot or 0.2 percent of the effective stage being measured, whichever is less restrictive, are to be used. At nonstream (reservoir, lake, estuary) sites, the same numerical accuracy goal applies unless higher accuracy is required. \"The accuracy goal is a combination of a percentage or relative accuracy at high stages and an absolute accuracy at low stages. For example, the required accuracy would be 0.06 foot at 30 foot effective stage, 0.02 foot at 10 feet, and 0.01 foot at all effective stages less than 5 feet. In this context, effective stage is the height of the water surface above the orifice or other point of exposure of the sensor to the water body; the instrument should be installed in the field with the orifice only sightly below the zero-flow stage. \"Higher stage measurement accuracy may be required for computation of storage changes in reservoirs or for computation of discharge using slope ratings or unsteady-flow models; in such cases, the instruments and procedures needed to achieve the required accuracy should be used. When field conditions such as high velocities, wave action, or channel instability make it impossible to collect stage data within the state accuracy criterion or to define an acceptable stage-discharge relation, stage data should be collected with the greatest accuracy practicable, using instruments and methods appropriate for the field conditions. \"The accuracy of surface water discharge records depends on the accuracy of discharge measurement, the accuracy of rating definition, and the completeness and accuracy of the gage-height record. Accuracies of discharge records for individual days commonly are about 5 to 10 percent Individual discharge measurements seldom are better than 2 percent. Stage discharge relations commonly have slopes of about 3 on logarithmic plots in which discharge is plotted as a function of effective stage (gage height minus offset, where offset commonly is approximately equal to gage height of zero flow). This implies that a 1 percent error in the effective stage input to the rating would translate into a 3 percent error in the computed discharge. The total uncertainty in discharge computed from a stage discharge relation is the square root of the sum of squares of this error and other unavoidable errors and approximations in the flow measurement and rating development procedures. Examination of the equation x = Vzz + l^r shows that improvement in the stage-accuracy component (z) much beyond the combined accuracy of the other error sources (y) will have rapidly diminishing effect on the improvement of the overall accuracy (x). Thus, although 0.01 foot stage accuracy may be needed at low stages and discharges, that degree of accuracy is not essential for accurate determination of discharge at high stages. The stage-accuracy goal stated above achieves an acceptable balance between stage-measurement accuracy and the other components of discharge-record accuracy. \"When evaluating instrument accuracy specifications, it should be noted that many instruments are rated in terms of full-scale percentage accuracy. An instrument with 50-foot range and 0.2-percent full-scale accuracy has an absolute error tolerance of 0.10 foot, applicable throughout the range of stage, and thus would not have sufficient accuracy at low stages.\""}]