[{"section_title": "Abstract", "text": "Nutrient rich water upwells offshore of Northwest Africa and is subsequently advected westwards. There it forms eddies and filaments with a rich spatial structure of physical and biological/biogeochemical properties. Here we present a high resolution (2.5 km) section through upwelling filaments and an eddy obtained in May 2018 with a Triaxus towed vehicle equipped with various oceanographic sensors. Physical processes at the mesoscale and submesoscale such as symmetric instability, trapping of fluid in eddies, and subduction of low potential vorticity (which we use as a water mass tracer) water can 5 explain the observed distribution of biological production and export. We found a nitrate excess (higher concentrations of nitrate than expected from oxygen values if only influenced by production and remineralization processes) core of an anti-cyclonic mode water eddy. We also found a high nitrate concentration region of ≈5 km width in the mixed layer where symmetric instability appears to have injected nutrients from below into the euphotic zone. Similarly further south high chlorophyll-a concentrations suggest that nutrients had been injected there a few days earlier. Considering that such interactions of physics 10 and biology are ubiquitous in the world's upwelling regions, we assume that they strongly influence the productivity of such systems and their role in CO 2 uptake. The intricate interplay of different parameters at kilometer scale needs to be taken into account when interpreting single profile and/or bottle data in dynamically active regions of the ocean.\n1 15 https://doi."}, {"section_title": "", "text": "The Deep SUNA was processed using Seabird UCI Version 1.2.1 in temperature/salinity (taken from the CTD) correction mode. At sea, nitrate standard solutions of 7 µmol/l and 14 µmol/l nitrate were used to obtain calibration point values. For this purpose, the nitrate standard of Merck Millipore Article No.: 1.19811.0500 was diluted accordingly with water and 35 g/l NaCl and 0.5 g/l NaHCO 3 . From the combination of these, the manufacturer suggests that one can achieve accuracies better than 120 2 µmol/l. A comparison to underway samples and CTD bottle calibration samples showed that they are in excellent qualitative agreement and a correction value of minus 1 µmol/l was determined. Especially where the samples showed values below 0.15 µmol/l (21.5-22.5 • N), the sensor showed very constant values around 1 µmol/l. We therefore subtracted 1 µmol/l from the sensor values and set the few values below 0 µmol/l to zero given that negative concentrations are not possible.\nThe saw tooth pattern of observations (see Figure 1 ) allowed for a clear sensor lag estimation as identical gradients were 125 traversed in opposite directions within short time periods. For oxygen we determined a sensor lag with respect to the temperature sensor of 2.5 s and for nitrate we determined a lag with respect to the temperature sensor of 20 s (though this may also be partially due to the separate data acquisition hardware of the nitrate sensor). Both sensor lags were corrected for. To further reduce inconsistencies from sensor lags, we only used data from downcasts thereby reducing our horizontal resolution to ≈2.5 km."}, {"section_title": "130", "text": "During the cruise, the traditional CTD rosette (Strass, 2019) was also deployed on average once a day. For the section presented here, the CTD rosette was deployed immediately before deployment and immediately after recovery of the Triaxus.\nWater samples from 6 depths were analyzed for inorganic nutrients (except for ammonium) (see below). We compared the properties measured by the rosette CTD and the Triaxus CTD in physical and TS space and did not detect systematic deviations.\nFurthermore, we emphasize that our goal here was not to describe highly accurate deep ocean parameters, but rather relative 135 5 https://doi.org/10.5194/os-2019-108 Preprint. Discussion started: 24 October 2019 c Author(s) 2019. CC BY 4.0 License.\ndifferences in oceanic parameters in the highly variable upper 350 m of the water column. This therefore does not require as much calibration effort as would typically be done for full ocean depth CTD rosette casts.\nHyperspectral downwelling irradiance at wavelength λ from 320 nm to 950 nm with an optical resolution of 3.3 nm and a spectral accuracy of 0.3 nm at depth z, E d (λ, z) down to the maximum light depth (mostly 0.1% of surface light) was measured by two identical irradiance radiometers (RAMSES ACC-2-VIS, TriOS GmbH, Germany). One was installed on a frame and lowered off the side of the ship before the CTD stations and the other one was installed on the Triaxus system. E d (λ, z)\ndata were further processed to the mean spectral diffuse attenuation coefficient for the upper 30 m, k d,mean (λ), including incident sunlight correction and correction for surface water waves following Mueller et al. (2003) and Stramski et al. (2008) , as detailed in Taylor et al. (2011) . To obtain the chlorophyll-a of seven major phytoplankton groups (diatoms, dinoflagellates, haptophytes, Prochlorococcus, cyanobacteria excluding Prochlorococcus, chlorophytes, and chrysophytes) within the upper 145 30 m from the radiometry data, we followed the method of Bracher et al. (2015) . Instead of using spectral remote sensing reflectance as in Bracher et al. (2015) , we applied the empirical orthogonal function (EOF) analysis to our k d,mean (λ) data set.\nSubsequently we developed multiple linear regression models with the HPLC pigment (see underway samples subsection below) based phytoplankton group chlorophyll-a (instead of using the phytoplankton pigment concentrations as in Bracher et al., 2015) as the response variable and EOF loadings as predictor variables. The model to predict seven phytoplankton groups was 150 relatively robust. More details on the data processing, model construction and cross validation results can be found in Bracher et al. (in prep) . Due to the passive nature of the sensor, the analysis is only available at day time. Here we only focus on the average over the top 30 m of the water column; vertical profiles of the phytoplankton groups along the saw-tooth pattern of our section are presented in Bracher et al. (in prep) .\nIn addition to the setup used here, the Triaxus contains a 1200 kHz upward and a 1200 kHz downward looking ADCP for the 155 estimation of turbulence and the ocean currents at higher vertical resolution as well as an EK80 echo sounder for the estimation of zooplankton and fish biomass. With a GAPS ultra-short base line system its position can be tracked exactly also when used in sea ice where a mechanism will pull the towing cable below the water line immediately behind the vessel. Furthermore, the Triaxus contains a Wetlabs AC-S spectral absorption and attenuation sensor which will in the future allow for phytoplankton group determination also during night time."}, {"section_title": "160", "text": "Laplacian splines under tension (Smith and Wessel, 1990) were used to interpolate all the section data onto a regular grid from 0-350 m and 19.9-22.4 • N with a grid spacing of 5 m respectively 0.02 • ≈2.2 km."}, {"section_title": "Vessel mounted sensors", "text": "The thermosalinograph data (Strass and Rohardt, 2019) from the water intake of RV Polarstern at 11 m depth was processed with standard methods as described in Rohardt (2018) ."}, {"section_title": "165", "text": "Furthermore, we used ocean velocity data from a RDI Ocean Surveyor 150 kHz ADCP (VMADCP) mounted in the hull of RV Polarstern 11 m below the surface (repository of the raw data: Witte, 2019 of the use of an identically processed data set, see von Appen et al., 2018) . Mean volume backscattering strength (MVBS) was calculated from the echo intensity of the VMADCP using the method of Deines (1999) ."}, {"section_title": "170", "text": "Surface currents were measured with an X-band marine radar mounted on RV Polarstern. The data acquisition and processing was done using the WaMoS 2 system as described in Hessner et al. (2019) . The ADCP velocity (and MVBS) gridding was only done from 20-250 m. Velocities in the grid closer to the surface than 20 m were added like this: 0-10 m gridded velocities are the WaMoS velocities, 10-15 m are 2/3·WaMoS velocities + 1/3·ADCP velocities at 20 m, and 15-20 m are 1/3·WaMoS velocities + 2/3·ADCP velocities at 20 m. 175"}, {"section_title": "Water sample data", "text": "Water samples were taken at six depths at the CTD stations prior to and after the Triaxus transect and continuously every 3 h (when the ship was moving) from the ship's seawater system (teflon tubing with a membrane pump). The CTD sampling depths varied, but were chosen to represent the vertical variation of the phytoplankton distribution, containing at least one sample below the chlorophyll-a maximum."}, {"section_title": "180", "text": "The samples for dissolved inorganic nutrient concentrations including nitrate, phosphate, and silicate were filtered through a 0.2 µm syringe filter and stored at -80 • C while at sea. Nutrient concentrations were assayed on an Evolution 3 Alliance Autoanalyser and calibrations were corrected for concentrations using certified reference material (CRM) 7602a (JAMSTEC; Japan) and MERCK STD (NIST-Standard). Concentrations were calculated by means of standard colorimetric techniques (Grasshoff et al., 2009) . At each sampling point duplicates of 4 L of seawater were filtered through a pre-combusted 0.7 µm 185 25 mm GF/F filter in order to assess particulate organic carbon (POC) (and particulate nitrogen (PN)). Samples were snap frozen in liquid nitrogen and stored at -80 • C while at sea. Total carbon and nitrogen elemental analyses were performed on an EuroEA Elemental Analyzer (Eurovector EA 3000; Italy).\nFor phytoplankton pigment analysis, immediately after sampling the water samples were filtered through Whatman GF/F filters. The filters were then shocked in liquid nitrogen and stored at -80 • C. The soluble organic phytoplankton pigment con-190 centrations were determined in the home laboratory using high-performance liquid chromatography (HPLC) according to the method of Barlow et al. (1997) adjusted to our temperature-controlled instruments as detailed in Taylor et al. (2011) . We determined the list of pigments shown in Table 2 of Taylor et al. (2011) and applied the method by Aiken et al. (2009) .\nThe chlorophyll-a concentrations of the same seven major phytoplankton groups as from the radiometry were calculated based on diagnostic pigment (DP) analysis developed by Vidussi et al. (2001) where we followed Losa et al. (2017) and then 195 modified that according to Bracher et al. (in prep) to also derive the chlorophyll-a for Prochlorococcus. The chlorophyll-a of Prochlorococcus sp. was directly given by the divinyl chlorophyll-a concentration. The total chlorophyll-a was determined from the sum of monovinyl-and divinyl-chlorophyll-a and chlorophyllide-a concentrations."}, {"section_title": "Satellite data", "text": "The delayed time product merged from all satellites called \"Global Ocean Gridded SSALTO/DUACS Sea Surface Height L4\" 200 and derived variables were downloaded from http://marine.copernicus.eu. We used the 1/4 • gridded sea level anomaly (SLA)\nproduct which provides daily values where the data for each day was calculated from the along track data within ±3.5 days of the nominal date. Hence, the gridded values for consecutive days are based on partially overlapping data and are consequently not independent. We also used surface geostrophic currents calculated from the absolute dynamic topography (SLA + geoid).\nThe NOAA Daily Optimum Interpolation Sea Surface Temperature (Reynolds et al., 2007) 3 Results and discussion"}, {"section_title": "Remote sensing information", "text": "The sea surface temperature (SST) during the Triaxus section is shown in Figure 2a with the cruise track around 21-22 • W. Cold The sea level anomaly (SLA) (Figure 2b ) reveals the presence of an anti-cyclonic eddy centered on ≈20.5 • W 21.5 • N. Anti-215 cyclonic geostrophic flow encircled the sea level maximum. The shipboard measurements along the cruise track from both the VMADCP and the WaMoS radar (green/magenta in Figure 2b ) agree well with the geostrophic flow from the satellites except for a deviation of the WaMoS velocity at the northern edge of the eddy. The thick magenta line highlights a westward advection pathway that extended from close to the coast to the cruise track between the two anti-cyclones (local SLA maxima) and the elongated cyclonic tongue to their south (depressed SLA). The water within that advection pathway was colder than the 220 ambient water at the same longitude to the north or south. However, surface fluxes (such as solar warming) and possible lateral entrainment during the westward advection likely increased the temperature of the water along the pathway from much colder temperatures in the upwelling region close to the coast. Depending on the dynamics and water mass anomalies, this advection pathway could also be called a \"mesoscale filament\".\nTracking of the positive sea level anomaly of the anti-cyclone back in time (see supplementary material) revealed that, 225 roughly one month prior, the anomaly had merged from two distinct anomalies. One of those anomalies appears to have formed at 20.5 • W 21.5 • N two months prior to our section while the other clearly originated in the upwelling region 2.5 months prior to our section. The distance of ≈360 km that it traversed in 2.5 months corresponds to a translational velocity of ≈0.06 m/s.\nThe peak azimuthal velocities of the anti-cyclone are ≈0.5 m/s indicating that the translational velocity is much smaller than the azimuthal velocity. Based on this we speculate that the anti-cyclone had a kinematically trapped core which was able to 230 transport the water in the core for great distances. During this transport the isolated core was subjected to biogeochemical processes (e.g. Karstensen et al., 2017) .\nWe now turn to the section data revealing the results of these processes in the filament and eddy. "}, {"section_title": "Physical properties", "text": "The Triaxus section from 19.9 • N to 22.4 • N and from the surface to 350 m is shown in Figure 3 . Potential temperature (Figure 3a) and salinity ( Figure 3b ) reveal spatial structures and small scale aspects that could be resolved at much higher resolution than by traditional CTD casts or with satellite observations. These spatial structures include an eddy, filaments, and mixed layer instabilities which we will present and discuss in detail below. In particular there was slightly colder water at the surface near 21 • N which was also much fresher than the water elsewhere at the surface. That was the mesoscale filament of upwelled water which moved westward as seen (and highlighted) in the remote sensing information. The anti-cyclone was located to the north 240 of the filament as will become clear below from the other parameters.\nPotential density ( Figure 3c ) and isopycnals (magenta lines in all section plots) reveal downward sloping isopycnals at the lower side (below ≈150 m) of the anti-cyclone (between 21.1 • N and 21.9 • N) and upward sloping isopycnals on its upper side (above ≈150 m). The stratification (Figure 3d ) in the center of the anti-cyclone (21.5 • N, 200 m) was slightly less than in the rest of the section at that depth marking the mode water (region of relatively weak stratification with upward displaced isopycnals 245 above and downward displaced isopycnals below) that the eddy was focussed around. The stratification also highlights the mixed layer depth (cyan in Figures 3c/d) which was determined from a density difference with respect to the surface of 0.05 kg/m 3 . The mixed layer depth ranged from roughly 20 m to 70 m, i.e. from quite shallow around 20.5 • N to much deeper on the rim of the anti-cyclone (21.2 • N and 21.9 • N). The density in the mixed layer within the anti-cyclone was significantly higher than waters further to the south. This implies the presence of a significant horizontal density gradient in the mixed layer."}, {"section_title": "250", "text": "These sections also show that the mesoscale filament near 21 • N corresponded to sloping isopyncals between upward doming in the south and downward displacements to the north.\nA temperature-salinity plot of all measurements of the section (Figure 4a ) highlights the isopycnal mixing between North Atlantic Central Water (NACW) which is warm and salty reminiscent of the subtropical North Atlantic, and the South Atlantic Central Water (SACW) which is fresher with its properties probably influenced by the tropical Atlantic or by AAIW. in the mixed layer in the southern part of the section, but it also contributed roughly half to the mixed layer in the northern part of the section. A narrow band (<20 km) of SACW at depth was also present north of the anti-cyclone (≈22.2 • N).\nNext we will examine the dynamics starting with the velocity structure. We investigate the velocity in the direction of the Since we do not resolve the velocity structure in the cross-track direction, we can only estimate one component of the relative vorticity ζ = ∂v ∂x − ∂u ∂y ≈ − ∂ur ∂yr , where u r is the cross-track velocity and y r is the along-track coordinate. This estimate of the relative vorticity normalized by the Coriolis frequency f , i.e. the Rossby number Ro, (Figure 5c ) shows strong velocity 275 gradients at the base of the mixed layer in the southern part of the section with relative vorticities of up to ±1. Since mesoscale flows would only have |Ro| 1 and the large Ro clearly appear to be located at the base of the mixed layer, this suggests that submesoscale mixed layer eddies or filaments were present there associated with distinct extrema of the NACW/SACW water mass fraction. The radius of these is 5-10 km, which is much less than the first baroclinic Rossby radius ( N f H) of ≈45 km in the region (Chelton et al., 1998) other words, we can use PV as a passive tracer of a water parcel's history. This is another piece of evidence suggesting that the mode water in the ACME originated in the upwelling region. At 20.3 • N at 50 m (the base of the mixed layer), PV was negative (it appears white in the figure as it is outside of the range of the positive logarithmic plot). This is an indication for symmetric instability which rapidly overturns and thereby brings the system back to neutral levels of zero PV (marginal stability). In the process it likely induced vertical mixing with implications for biogeochemistry (discussed in more detail in Subsection 3.5 290 below). At 20.4 • N it appears to also have recently injected fluid into the mixed layer as PV =0 there (if fluid would have stayed in the mixed layer for longer, the wind would have driven its PV to zero)."}, {"section_title": "Biogeochemical properties", "text": "Now we turn to the observed biogeochemical structure. Oxygen concentrations (section in Figure 6a ; averaged over the top 20 m in Figure 7a ) and nitrate concentrations (Figure 6b /7a) were measured by two independent sensors with different measurement 295 principles. Phosphate and silicate are not thought to be the limiting nutrients in this region (Bachmann et al., 2018) as is also suggested from the high phosphate and silicate concentrations detected in the underway (Figure 7a ) and CTD-rosette samples. Thus we consider nitrate as sufficient to study the nutrient availability for phytoplankton growth. In order to highlight similarities, the color axes between Figures 6a/b are reversed as nitrate is used up and oxygen is released during primary production. Thus as long as biology remains the primary influence on the two parameters, their relation follows a roughly 300 constant ratio which is typical for much of the world ocean and is related to the equivalent of a Redfield ratio (Thomas, 2002; Waite et al., 2015) and reflects the biogeochemical uptake of nitrate and stoichiometric release of oxygen during photosynthesis.\nOn first sight there is a lot of agreement between oxygen and nitrate overlaid on a pronounced variability (Figures 6a/b ).\nFollowing individual isopycnals below the mixed layer, SACW was more nitrate rich/oxygen poor than NACW suggesting that SACW may be older (having been removed from atmospheric fluxes in the mixed layer for a longer duration). The red 305 lines in Figure 6a indicate 100% oxygen saturation. Apparent oxygen utilization (AOU) is the oxygen concentration at 100% oxygen saturation (i.e. in diffusive balance with the atmosphere) as calculated from the measured temperature/salinity minus the measured oxygen concentration. The mixed layer was super saturated (negative AOU) in places both to the north and south of the anti-cyclone (Figure 7a ), suggesting that primary production had supplied oxygen to the mixed layer more recently than the gas equilibration time scale. The nitrate concentration in the mixed layer in this spring/summer condition was very low 310 (lowest underway measurement of 0.01 µmol/l at 21.6 • N), but e.g. at 20.9 • N there was actually still a significant amount (up to 5 µmol/l) in the mixed layer. At depth by contrast, just below 100 m especially in the southern part very nitrate rich values were reached (>20 µmol/l, Figure 6b ). Such concentrations, if upwelled into the euphotic zone, would have the capacity to support increased productivity.\nAOU is plotted versus nitrate concentration in Figure 6c . Most of the individual measurements (colored dots) are close 315 to proportional following the relation nitrate concentration = AOU/7.48. This value is within typical observations of scatter around the Redfield ratio for organic matter (Thomas, 2002; Waite et al., 2015) . However, not all individual measurements are directly proportional and the color indicates where there is nitrate excess, e.g. for the dark red dots in the bottom left of Figure 6c ; at zero AOU, zero nitrate concentration would be expected but in fact ≈5 µmol/l (i.e. an excess of 5 µmol/l) was observed. We note that this definition of nitrate excess is only based upon our measurements (Figure 6c )."}, {"section_title": "320", "text": "The spatial distribution of the nitrate excess (Figure 6d ) highlights the cool fresh mesoscale filament that came from the west which still had non-zero nitrate values in the mixed layer. A significant nitrate excess is also visible in the core of the anti-cyclone and in blobs in the thermocline in the south. We speculate that positive nitrate excess can originate from mixed layer water that was not equilibrated (equilibration here is understood as being where gas equilibration with the atmosphere has brought oxygen to 100% saturation and primary production consumed the nitrate to zero). Large undersaturation of oxygen 325 (as is common in the upwelled water in the Mauretanian upwelling system) may have led to strong oxygen fluxes from the atmosphere to the mixed layer. At the same time, the residence time in the upper ocean probably was not long enough for primary production to utilize available nitrate before the water was subducted. We hypothesize that the water in the core of the anti-cyclone during our section spent only a short time (∼weeks) in the mixed layer before being subducted (i.e. removed from equilibrating processes in the mixed layer) to form the anti-cyclone. Part of this hypothesis is that we assume that a nitrate 330 excess of roughly zero is present in the water when it is upwelled. This is based upon the assumption that, if, in our section, we sample water that will upwell in the future, it would be \"old\" (high AOU, high nitrate concentration) and would thus fall in the top right quadrant of Figure 6c , where we observe a very small nitrate excess as defined here. In a similar sense, the filament south of 21 • N must have been part of an offshore advection \"highway\" from the upwelling region whose advective time was short enough for the above argument to hold."}, {"section_title": "335", "text": "Considering the energy source for primary production, photosynthetically available radiation (PAR) as shown logarithmically in Figure 8a is affected by the sunset around 20.1 • N and the sunrise around 21.4 • N. During the day time, the euphotic depth (1% level of surface PAR) as shown by the red line varied between 50 m and 70 m. In the southernmost part of the section this limit for primary production coincided with the base of the mixed layer (cyan line). By contrast, in the northern part, light reached into the stratified water column below the nutrient depleted mixed layer. "}, {"section_title": "Biological properties", "text": "Phytoplankton standing stock in the water column can be inferred from chlorophyll-a fluorescence (Figure 8c ) or light attenuation ( Figure 8d ) with a number of assumptions. Here we compare the chlorophyll-a fluorescence sensor that is part of the Triaxus CTD with the underway samples of chlorophyll-a concentration from the mixed layer (Figure 7b ). The laboratory culture-based calibration of the fluorescence may be off by a factor of 2 due to species specific variations and envrionmental 345 adaptations and, during day time, photochemical quenching in the upper part of the water column can diminish significantly the chlorophyll-a fluorescence signal (Falkowski and Kolber, 1995) . In that situation the measured fluorescence is lower than the chlorophyll-a concentration present in the water column. This is apparent in the upper 20 m north of 21.7 • N. Light attenuation by contrast responds to any matter in the water, but in the open ocean observed here, that is primarily phytoplankton and its degraded particulate organic matter. The chlorophyll-a fluorescence from the Triaxus CTD may however be used to study rel- were high in the mixed layer which also corresponded to large particulate organic carbon (POC) values (Figure 7b ) together with considerable spatial variability in chlorophyll-a fluorescence.\nIn the anti-cyclone the Triaxus chlorophyll-a fluorescence data from the section (Figure 8c) indicates a deep chlorophyll-a maximum at ≈50-70 m in the stratified water column below the nitrate-deplete mixed layer. However, this may well be an 355 artifact of possible quenching of chlorophyll-a fluorescence during day light. In the southern part of the section (where measurements were taken during night time and therefore chlorophyll-a fluorescence data are more robust in indicating chlorophyll-a concentration), by contrast, the values in the mixed layer were much higher. Maxima of chlorophyll-a fluorescence and attenuation were observed where isopycnals were vertical in the mixed layer (Figure 8c/d) . At those locations, thermocline waters were outcropping and horizontal density gradients in the mixed layer were present, e.g. at 20.3 • N (chlorophyll-a fluorescence 360 maximum), 20.6 • N (attenuation maximum), and 21 • N. These mixing processes may be responsible for the high productivity in the southern sector, and will be discussed in more detail below. North of the anti-cyclone, light attenuation in the mixed layer and chlorophyll-a fluorescence also point to favorable growth conditions (this is below the depth where during day time photochemical quenching takes place enforcing the quality of these data). The reduction of the euphotic depth from 70 m just to the south to 50 m at 22.1 • N correlates with the increase of attenuation and it therefore may be the result of a higher concentration 365 of phytoplankton and associated colored dissolved and particulate organic matter. This suggests that the euphotic depth south of the anti-cyclone (where we have not measured it due to night time) would have been shallower, thereby inhibiting growth below the mixed layer there.\nIn the mixed layer, oxygen (Figure 7a ) was super saturated (negative AOU) in the southern part and nitrate remained available with especially large excess values at 20.9 • N. In contrast, in the northern part nitrate was low, but not entirely zero e.g. around 370 22.1 • N. The attenuation correlates very well with total chlorophyll-a concentration determined from the continuously measured spectrally resolved radiometric data via the EOF method (only available for the day time part of our transect) and with the chlorophyll-a determined from discrete water samples via HPLC analysis. This is because in these so-called optical case-1 waters (see Morel and Prieur, 1977) the light attenuation is determined mostly by the concentration of phytoplankton pigments and related colored dissolved and particulate organic matter. However chlorophyll-a determined from the fluorescence sensor 375 that is part of the Triaxus CTD agrees only qualitatively with the other chlorophyll-a estimations due to variation in the signal from the above mentioned photochemical and non-photochemical quenching and the phytoplankton species composition.\nThe relative contribution to the average surface (0-30 m) total chlorophyll-a concentration (Figure 7c ) based on the continuous radiometric data set available north of 21.6 • N reveals the following. South of 22 • N, the prokaryotic phytoplankton groups Prochlorococcus and all other cyanobacteria typically accounted for between 30% to 50% with in most cases one them The light attenuation significantly diminishes below the euphotic layer. Attenuation below approximately 100 m (Figure 8d ) 400 tends not to be due to living phytoplankton, but to exported carbon either in higher trophic levels or in sinking particles. At 20.7 • N there were high attenuation values which imply high particle concentrations roughly oriented in a vertical manner below the high nitrate/chlorophyll-a mixed layer. These potentially stemmed from fecal pellets produced by zooplankton feeding on the blooming phytoplankton. The attenuation further suggests that there were enhanced particle concentrations on the rim of the anti-cyclone, but with increasing depth the concentration maximum appears to be closer to the center of the anti-cyclone."}, {"section_title": "405", "text": "This is reminiscent of the \"wine-glass\" mechanism proposed by Waite et al. (2016) whereby secondary circulations associated with mesoscale eddies transport particles inwards as they settle in the frame of reference of the eddy.\nAcoustic mean volume backscattering at 150 kHz from the vessel mounted ADCP (Figure 8b) is primarily due to zooplankton and over a day-night cycle can map its diel migration. Throughout the night backscattering in and below the mixed layer was enhanced suggesting that zooplankton may have been feeding on the phytoplankton there. However, the day-night 410 cycle makes the acoustic mean volume backscattering difficult to interpret (Vélez-Belchí et al., 2002; Cisewski and Strass, 2016) . Simply following Figure 8b suggests that the zooplankton concentration at 21.1-21.3 • N, i.e. in the low productivity anti-cyclone was lower than in the productive frontal region south of it, but this may also entirely be an artifact of the diel migration."}, {"section_title": "Submesoscale structure 415", "text": "We now investigate in more detail the physical processes that may have contributed to supporting the higher productivity away from the influence of the anti-cyclone. A spatial and colorscale zoom on the upper water column of 55 km in the south of the section is shown in Figure 9 . Around 20.3 • N the mixed layer shoaled from 50 m to 20 m over a horizontal distance of under 10 km with isopycnals north of this location steeply dropping. Geostrophy lead to the opposing cross-track velocities of ±0.25 m/s with the cross-track velocity extrema in the stratified water column just below the mixed layer. N (Figure 5d ). We hypothesize that this made the region susceptible to rapid readjustment via symmetric instability associated with fluid exchange in the vertical and horizontal. Given that also PV (a dynamically active parameter, Figure 5d ) was enhanced at the surface, a simple diffusive 425 process bringing e.g. nitrate to the surface is not sufficient to explain the observations. Rather the vertical exchange likely also contained an exchange of fluid between the mixed layer and the thermocline below. From the available measurements it is not possible to distinguish whether this mixed layer/base of the mixed layer feature was an eddy, a front, or a filament, but it is clear that very active dynamics were associated with it.\nThe observation of negative potential vorticity suggests that the situation we observed is likely to have been ongoing for only 430 1-2 days. That time scale is similar to the phytoplankton doubling time in that part of the ocean meaning that a large number of doublings and associated POC increase/nutrient draw-down likely did not take place during the time that the situation had been ongoing. The biogeochemical measurements (Figure 9d -f) corroborate this. In the mixed layer less than a few kilometers north of the region of negative potential vorticity (i.e. north of 20.3 • N), the nitrate values were enhanced ( 2µmol/l) with lower (night-time) chlorophyll-a values than elsewhere in the mixed layer and slightly lower oxygen saturation. This suggests that 435 the nutrient-rich water from below the euphotic zone had been recently injected into the mixed layer with phytoplankton unable to take the nutrients up in the time available since injection. By contrast, it is likely that the dynamic physical environment had impacted the mixed layer both 5-10 km to the south and to the north in a similar manner (e.g. symmetric instability), several days to a few weeks earlier. We speculate that phytoplankton there grew to large concentrations which increased oxygen and drew down the nitrate. However, the achieved nitrate values are not nearly as close to zero as above the anti-cyclone where 440 the slower physical evolution of the system over months probably provided phytoplankton of all size classes sufficient time to reduce nitrate to the observed values of as little as 0.01 µmol/l."}, {"section_title": "Conclusions", "text": "In our study, we have shown the structure of an O(100 km) diameter anti-cyclonic mode water eddy, of an O(20 km) width mesoscale upwelling filament, and of several O(5-10 km) wide submesoscale mixed layer instabilities in the region offshore 445 of the Northwest African upwelling system. We used the physical observations to suggest explanations for the observed differences in the biogeochemistry and biology along the section both in the mixed layer and below. The single transect without cross-track resolution provides a snapshot of the processes that control the scales of biogeochemical variability in the region, but the lack of cross-track resolution does not allow us to scale this up to quantify the impact of these processes for the region.\nThe driving mechanism for the mixed layer eddies/filaments in the southern half of the section is not fully clear. The initial 450 creation of negative potential vorticity (PV) is likely to be a key driver. It seems highly probable that once the negative PV was created, symmetric instability would have restored the potential vorticity back to zero. Downfront winds may drive the PV to 22 https://doi.org/10.5194/os-2019-108 Preprint. Discussion started: 24 October 2019 c Author(s) 2019. CC BY 4.0 License. negative values, but at this point we lack a detailed understanding of the orientation of the fronts with respect to the wind. This would require surveys resolving two horizontal dimensions by a number of parallel sections.\nThe intricate interplay of different parameters at kilometer scale needs to be taken into account when interpreting single 455 profile and/or bottle data in such dynamically active regions of the ocean. Additionally, our observations reinforce the notion that the coupling and decoupling of biological and physical time scales plays a key role driving spatial variability. We documented physical forcing ranging in spatial scale from kilometers to hundreds of kilometers, covering time scales ranging from days (for mixed layer instabilities) to months (for ACME advection). These variations then interact with plankton communities at physiological time scales (hours to days) and ecological (weeks) time scales, resulting variously in either an 460 increase (where coupled) or a smoothing (where uncoupled) of the spatial variability. Finally, this study has demonstrated that the Triaxus platform in its present setup is an ideal tool for interdisciplinary research, especially where interesting physical and biological/biogeochemical dynamics with spatial gradients exist such as eddies, fronts, and filaments.\nData availability. The Triaxus, CTD, VMADCP, and thermosalinograph data are available at the Pangaea references listed in Section 2. The satellite data are available at the URLs listed in Section 2. The following data is provided as Supplementary Material:"}]