[{"section_title": "Abstract", "text": "To perform a joint analysis of multivariate neuroimaging phenotypes and candidate genetic markers obtained from longitudinal studies, we develop a Bayesian longitudinal low-rank regression (L2R2) model. The L2R2 model integrates three key methodologies: a low-rank matrix for approximating the high-dimensional regression coefficient matrices corresponding to the genetic main effects and their interactions with time, penalized splines for characterizing the overall time effect, and a sparse factor analysis model coupled with random effects for capturing within-subject spatio-temporal correlations of longitudinal phenotypes. Posterior computation proceeds via an efficient Markov chain Monte Carlo algorithm. Simulations show that the L2R2 model outperforms several other competing methods. We apply the L2R2 model to investigate the effect of single nucleotide polymorphisms (SNPs) on the top 10 and top 40 previously reported Alzheimer diseaseassociated genes. We also identify associations between the interactions of these SNPs with patient age and the tissue volumes of 93 regions of interest from patients' brain images obtained from the Alzheimer's Disease Neuroimaging Initiative."}, {"section_title": "Introduction", "text": "Many longitudinal neuroimaging studies concomitantly collect genetic and recurrent imaging data to track individual changes in brain structure and function over time. Several neurodegenerative disorders, including Alzheimer disease (AD), are hypothesized to occur from abnormal development of the brain, which may be caused by the additive and/or interactive effects of various risk genes and environmental risk factors, each contributing small individual effects. Thus, recurrent neuroimaging measures may lead to discoveries of the genetic pathways and the causal genes associated with the specific brain changes underlying such neurodegenerative disorders (Scharinger et al., 2010; Paus, 2010; Peper et al., 2007; Chiang et al., 2011a Chiang et al., , 2011b Saykin et al., 2015) .\nA standard statistical method used in longitudinal imaging and genetics studies is the massive marginal association (MMA) framework (Li et al., 2013; Zhang et al., 2014; Guillaume et al., 2014; Hibar, 2011; Shen et al., 2010; Bernal-Rusiel et al., 2013; Zhang et al., 2014) . This approach repeatedly fits a linear mixed effects model (or generalized estimating equations) for paired imaging phenotypes and genetic markers. Because the MMA framework entails numerous comparisons, it can detect only phenotype-marker pairs with extremely strong signals.\nSeveral attempts have been made to more precisely investigate the effect of multiple genotypes on longitudinal phenotypes. Chen and Wang (2011) proposed functional mixed-effect models with penalized splines and varying coefficients, but they focused on small number of predictors and number of response variables in a low-dimensional setting. Wang et al. (2011) used a sparse multitask regression to examine the association between genetic markers and longitudinal neuroimaging phenotypes. However, their model focused on subjects with the same number of repeated measures and ignored the spatiotemporal correlations of imaging phenotypes. Therefore, the multitask regression model may lead to loss of statistical power to detect phenotype-marker pairs with moderate to weak signals. Vounou et al. (2011) and Silver et al. (2012) proposed that a sparse reduced-rank regression model using penalized regression can detect the main genetic effects on longitudinal phenotypes. They, however, did not account for the spatiotemporal association among the longitudinal phenotypes, which is important for estimation and prediction accuracy. Moreover, none of these studies explored SNP-age interactions, which can reveal dynamic genetic effects on phenotypes.\nSeveral important statistical concerns are associated with the joint analysis of neuroimaging phenotypes and a set of candidate genotypes obtained from longitudinal imaging and genetic studies. First, the number of regression coefficients can be much larger than the sample size, denoted as N. Specifically, let d and p be the dimension of the responses and the number of covariates, respectively. Fitting a multivariate linear mixed effects model usually requires estimating a d×p matrix of regression coefficients, which can be much larger than N, even for moderately high d and p. Second, as illustrated in Fig. 1a , to improve prediction accuracy (Breiman and Friedman, 1997) , it is critically important to account for unstructured, withinsubject spatial correlations among multivariate neuroimaging phenotypes. Third, as illustrated in Fig. 2a , to improve both estimation and prediction accuracy, it is also important to account for withinsubject temporal correlation. Fourth, as shown in Fig. 2b ,c, the temporal growth pattern varies across regions of interest (ROIs) in the brain. Accounting for the overall longitudinal change of ROIs is required to increase the detection power of the genetic effects. Fifth, as shown in Fig. 2b , the genetic effects on ROI volumes can vary across time.\nHere, we have developed a Bayesian longitudinal low-rank regression (L2R2) model for the joint analysis of high-dimensional longitudinal responses and covariates. We integrated multiple robust methods to explicitly address the new challenges described previously. Our study has four major methodological contributions that were previously undescribed:\n1. To the best of our knowledge, L2R2 is the first model of its kind for jointly analyzing high-dimensional longitudinal responses and covariates, although several approaches have been used for highdimensional responses and covariates in cross-sectional studies (Rothman et al., 2010; Vounou et al., 2010; Zhu et al., 2014) . The L2R2 model also provides a set of standard inference tools (e.g. standard deviation) for determining various unknown parameters. Zipunnikov et al. (2014) proposed a functional principle components analysis for high dimensional (>10, 000) longitudinal responses, where the intercepts and slopes of time for all voxels were modeled by a few basis functions. However, their methods cannot handle high-dimensional responses and covariates simultaneously because the dimension of the covariance matrix that requires timeconsuming spectral decomposition equals the product of the dimensions of the responses and covariates. Z.-H. Lu et al. NeuroImage 149 (2017) 305-322 2. The temporal growth patterns of high dimensional responses were characterized by a penalized spline method. Although the spline method has been widely used in other studies (Eilers and Marx, 1996; Ruppert et al., 2003; Wood, 2006; Wu and Zhang, 2006; Lang and Brezger, 2004; Guo, 2002; Morris and Carroll, 2006; Greven et al., 2010) , most of these studies focused on univariate responses. We included a new set of coefficients for the high-dimensional geneage interactions to model the genetic effects on longitudinal trajectories of responses, which were different from previously reported coefficients corresponding to the main genetic effects that were timeinvariant (Marttinen et al., 2014; Zhu et al., 2014) . A low-rank regression model not only reduces the number of unknown coefficients, but also captures the low-rank structure of the regression coefficient matrix. 3. To efficiently model the correlation structure and increase the detection power of association between response and covariates, we used a sparse factor model (Bhattacharya and Dunson, 2011) to capture the spatial correlation and the structured random effects to model the temporal correlation of the longitudinal response variables. 4. We have developed a downloadable L2R2 package, which is available at http://odin.mdacc.tmc.edu/bigs2/."}, {"section_title": "Methods: L2R2 model formulation", "text": "Let y t ( ) ik ij be the j th observation at time t ij of the kth neuroimaging measurement (e.g. volume of ROI) for the ith subject for i nj m = 1, …, , = 1, …, i and\nbe a p × 1 vector of genetic predictors (e.g. p/2 genetic markers and p/2 gene-age interactions), and N m\nbe the total number of observations. To address the challenges of concomitantly analyzing high-dimensional longitudinal responses and covariates, we proposed the following L2R2 model: For each k, we have\nwhere β k is a p × 1 vector of coefficients for the genetic predictors, μ t ( ) k is a nonparametric function of t that characterizes the overall trajectories of the kth measurement across all subjects, \nwhere 0 is a vector of zero of appropriate dimension, and\nand d×d covariance matrices, respectively. We assumed that\nare independent for all i and t, b i and b ′ i are independent for i i ≠ ′, and ϵ t ( )\nTo address the challenges described above, we first incorporated the gene-age interactions into x i to model the dynamic genetic effects on individual brain development trajectories. The individual effect of a risk gene on brain development may vary across time. We used data published by the Alzheimer's Disease Neuroimaging Initiative (ADNI) to show the estimated trajectories with local polynomial regression (LOESS, Cleveland and Devlin, 1988) of subjects with and without the minor alleles for two selected phenotype-single nucleotide polymorphism (SNP) pairs (Fig. 2b,c) . There was a strong interaction effect of the SNP rs769451 and age on the right hippocampus. Ignoring such interaction in model (1) may inflate errors, decrease the detection power of important main genetic effects, and miss the age-dependent genetic effects on imaging phenotypes. In contrast, the interaction effect of SNP rs439401 and age on the left hippocampus was small. We need to efficiently distinguish the important interaction effects from others with negligible interaction effects.\nWe considered the p×d coefficient matrix\nthat characterizes the time-dependent and main genetic effects on the longitudinal phenotypes across all subjects and time points. Given the large d and p, the number of elements in B could be much larger than that of N. Moreover, as shown in Fig. 1a ,b, the elements in t y t y t y( ) = ( ( ), …, ( ))\nand x i were highly correlated because of the spatial pattern of brain structure and the linkage disequilibrium structure of SNPs, respectively. Therefore, the estimate of B was unstable and often exhibited horizontal-and vertical-banded structures (Fig. 1c) . These structures were more apparent after setting unimportant (i.e. insignificant) elements to zero (Fig. 1d) . Applying the characteristics of the coefficient matrix, we introduced a low-rank model for B as follows:\nwhere r is the rank or number of layers of B;\nT is the lth layer\nis a p r × matrix; Z.-H. Lu et al. NeuroImage 149 (2017) [305] [306] [307] [308] [309] [310] [311] [312] [313] [314] [315] [316] [317] [318] [319] [320] [321] [322] and\nis a d r × matrix. Moreover, u l and v l may be viewed as the coefficient of the linear combination of t y( ) i and x i , respectively. Rather than investigating the correlation between all phenotype-SNP pairs, we examined the relation between important linear combinations of similar phenotypes and those of similar SNPs. Because only a few sets of genetic variants were expected to be associated with each longitudinal phenotype, a relatively small r p d ⪡min( , ) and a sparse U were considered sufficient to represent the important structure of B. Model (2) considerably reduced the number of unknown parameters of B from pd to d p r ( + + 1) and increased the power for detecting the important associations.\nWe used μ t ( ) k to characterize the overall trajectory for the kth neuroimaging measure without consideration of any effects of genomic variables and prognostic factors. The solid curves in Fig. 2b ,c depict the LOESS estimates of the development trajectories of the right and left hippocampal volumes, respectively. We used a penalized spline model (Eilers and Marx, 1996; Ruppert et al., 2003; Lang and Brezger, 2004) to model μ t ( ) k with a polynomial of degree s given by\nwhere B t T ( ; ) m 0 is a basis function of t; T 0 is a vector of predetermined knots over the range of the t ij 's (e.g. the sample percentiles);\n, 1 −1 ; and (Eilers and Marx, 1996) , truncated power basis (Ruppert et al., 2003) , and wavelet basis (Morris and Carroll, 2006) . Using μ t ( ) k and the basis functions to flexibly capture the overall trajectories of the longitudinal ROIs measurements increases the detection power of the SNPs and SNP-age interactions and improves the prediction accuracy of responses at later time points.\nAnother issue in longitudinal studies that must be accounted for is the within-subject correlation among repeated measurements of each phenotype (Verbeke and Molenberghs, 2009; Hyun et al., 2016) . Various correlation structures can be formulated through t z b ( )\nWe examined the trajectories of all phenotypes across all subjects for the longitudinal data set obtained from the ADNI. The withinsubject association mainly occurred from the subject-specific intercept. The trajectories of the left lateral ventricle volume across all subjects are depicted in Fig. 2a . To generate these trajectories, we used a univariate random effect for each ROI by setting p b =1, t z ( ) = 1 i , and τ Σ I = b b d , where I d is a d×d identity matrix. In this case, the random effects of different ROIs were assumed to be independent.\nThe correlation structure among the multivariate phenotypes was modeled with another component in (1). The covariance matrix of phenotypic measurements across all subjects and all time points is depicted in Fig. 1a . Phenotypic variables usually exhibit group correlation structures; therefore, we used latent factors to capture these correlation structures. Specifically, we considered an exploratory method of using the sparse factor model (Bhattacharya and Dunson, 2011) \nas follows:\nwhere Λ is a d × ∞ factor loading matrix,\n2 . The structure of Λ and the number of factors were directly gleaned from the data.\nThe L2R2 in (1) with (2)-(4) incorporated can be rewritten in the matrix form\nThe notational definitions, prior distributions of the parameters and the technical details of the posterior computation were provided in the appendix.\n3. Simulation study"}, {"section_title": "Simulation setup", "text": "We used simulations to examine the finite-sample performance of the L2R2 model. We simulated Y according to model (5). We considered four cases with various dimensions and priors: (i) p=50, d=50; (ii) p=100, d=100; (iii) p=200, d=100; and (iv) p=400, d=100. The dimensions of these cases were comparable with the ADNI data set used in this study and with other related neuroimaging and genetic studies Zhu et al., 2014; Marttinen et al., 2014) . We chose the first n=100 subjects from the ADNI data set and selected the top p/2 SNPs from the top 40 genes reported by AlzGene database (www.alzgene.org of June 10, 2010. Each subject was observed m i times to replicate the ADNI data set, resulting in N=422 records. We used the p/2 SNPs and their interactions with age to form the X in model (5). The W in (5) contains q=15 columns, including the intercept, the standardized intracranial volume, sex, education, handedness, and the basis function of age. The basis function consists of age, age , age 2 3 , and the B-spline basis given the jth percentile, j = 0, 10, 20, …, 100. The elements of b were independently generated from a N(0, 1) distribution.\nThe following parameters in (5) were used in the simulation: The low-rank coefficient matrix B was generated with the true rank r = 3 0 in a moderately sparse case with 65% zero elements and in an extremely sparse case with 95% zero elements. Specifically, we set B UΔV = , where\n, and v V = ( ) lk as p × 3, 3×3, and d 3 × matrices, respectively. Moreover, we generated all elements u jl and v lk independently from a N p (0, 1) × binomial(1, ) 1 distribution and then normalized the columns of U and V have zero mean and unit variance. The value of p 1 was tuned so that approximately 65% of the elements of B were zeros. Each element of Γ was independently generated as a γ N\ne , where the precision matrix Σ e was first generated by\nfor j j ≠ ′, setting Σ AA = e T , and standardizing Σ e into a correlation matrix. The value of p 2 was tuned so that approximately 20% of the elements in Σ e were zeros, yielding the mean of the absolute correlations of Σ e at approximately 0.40.\nFor each case, 100 simulated data sets were generated. For each simulated data set, we ran the Gibbs sampler for 10,000 iterations after 5000 burn-in iterations. We chose noninformative priors for the hyperparameters and set a b c d e f = = = = = = 10 0 0 0 0 0 0 −6 . For the covariance parameter Σ e , we chose moderately informative priors to impose the positive-definite constraint.\nBesides modeling the trajectories of the response variables to improve detection power of the genetic variables, the splines in W could also be used to predict the response variables at later time points. We calculated the mean of the response variables X UΔV W Γ Z b + + pred pred pred T for every the subjects at one year after their last observation, where X pred , W pred , and Z pred contain the corresponding predictors for these subjects at the later time points. The prediction was based on X UΔV W Γ Z b + + pred pred pred T , where the hat represents the posterior means of the parameters and random effects. We compared the means and predicted means to check the prediction accuracy using the splines in W."}, {"section_title": "Comparison with four other state-of-the-art methods", "text": "We compared the L2R2 model with four state-of-the-art methods that were developed to establish the association between high-dimensional responses and predictors. First, we considered MMA analysis between the high-dimensional response variables and predictors. Each phenotype was regressed on the covariate matrix W and the residue was associated with each SNP in X with regression. We used the lme4 R package (Bates et al., 2015) for MMA.\nSecond, we considered the group-sparse multitask regression and feature-selection (G-SMuRFS, Wang et al., 2011) method, which is a representation of associating high dimensional imaging and genetic variables with regularization methods. The longitudinal volumes of ROIs were used as the response variables, and the X and W in L2R2 were combined as the matrix of predictors in G-SMuRFS. The spline basis in W modeled the overall longitudinal trajectories of the ROI volumes, and the SNP-age interactions in X represented the SNP effects on the longitudinal trajectories of ROIs. The large matrix of coefficients was estimated with penalty functions and optimization. Each covariate, SNP and SNP-age interaction formed a group in the penalty function. We used exp( − 7), exp( − 6), …, exp(2) as possible values of the tuning parameters in the G-SMuRFS method and performed a five-fold cross validation to choose the tuning parameters. G-SMuRFS did not make any assumption on the distribution and correlation structure of the response variables. In our longitudinal study, G-SMuRFS method did not explicitly account for the withinsubject temporal correlations and spatial correlations. Also, G-SMuRFS did not use dimension reduction for the coefficient matrix like the lowrank representation of B in L2R2.\nThird, we considered the Bayesian canonical correlation analysis (BCCA Klami et al., 2013 ) to obtain linear combinations of the response variables Y and the predictor X. The coefficients of the linear combinations were conceptually similar to U and V in (5), and we denoted their estimates by U ͠ and V ͠ , respectively. The coefficient matrix B was estimated by UV ͠ ͠ T . Gamma mixture multivariate normal distributions were assigned to U and V, and the correlation structure of the response variables and the SNPs were characterized by a factor model. We used the default setting of the companion R package and used eight components in the BCCA method. The R package cannot run a continuous predictor; therefore, we excluded the SNP-age interactions in X. Also, the package does not process covariates like W.\nTherefore, we regressed Y on W and applied the BCCA method to the residue and X. Unlike the L2R2 model, the BCCA method does not account for within-subject structural correlation or the interactions between SNPs and age. Fourth, we considered the Bayesian reduced-rank regression (BRRR) method developed by Marttinen et al. (2014) . Because the BRRR software package does not allow continuous predictors, we excluded the SNP-age interaction terms in X. We also set the rank to three and ran all of the other program parameters at their default settings. The BRRR method can process W directly, so we did not need to regress Y on W before hand. In contrast with the L2R2 model, the BRRR method does not account for SNP-age interactions or withinsubject structural correlation."}, {"section_title": "Evaluation", "text": "To evaluate the finite-sample classification performances of all five of the methods, we calculated the sensitivity and specificity scores of selecting the nonzero elements in the coefficient matrix B for each method. The following criteria were used for the selection of the coefficients in each method. As the G-SMuRFS method does not provide standard error estimate for each coefficient, the importance of the association between each pair of ROI and SNP/SNP-age interaction was determined by the absolute values of the coefficient estimates. For all other methods, the coefficients were selected if the absolute values of their standardized estimates (coefficient estimate over its standard error commonly used to account for the estimation uncertainty) were larger than a threshold. The sensitivity and specificity scores for a given threshold T 0 were defined as The four columns correspond to the settings (i) p=50, d=50; (ii) p=100, d=100; (iii) p=200, d=100; (iv) p=400, d=100. The first row shows the coefficients of the SNPs and the second row shows the coefficients of the interactions between the SNPs and subject age. The lines represent the L2R2 (black solid), BRRR (red dotted), BCCA (purple dashed), G-SMuRFS (blue dot-dash), and MMA (green dashed). (For interpretation of the references to color in this figure legend, the reader is referred to the web version of this article.)\nwhere\n0 , and T FP( ) 0 were the numbers of true positives, false negatives, true negatives, and false positives, respectively. Changing the threshold T 0 produced different sensitivity and specificity scores, generating the receiver operating characteristic (ROC) curves. In each ROC curve, the sensitivity was plotted against one minus specificity."}, {"section_title": "Results", "text": "The ROC curves of all four methods and the L2R2 model are depicted in Fig. 3 . ROC curves that are closer to the upper-left corner are more likely to identify true positives and control for false positives.\nIn all simulation settings, the L2R2 model outperformed the four competing methods because the L2R2 model was designed to specifically address the challenges described above. Among the four previously developed methods, the G-SMuRFS method had the best performance. However, the G-SMuRFS method did not characterize the correlation structure among the response variables like the L2R2 model did. Therefore, the G-SMuRFS method potentially increased the number of false positives. Consequently, when the number of phenotypic variables increased, the difference between the L2R2 model and the G-SMuRFS method for d=100 was larger in terms of main effects and interactions than that for d=50.\nThe BRRR and BCCA methods cannot process SNP-age interactions because of the limitations of their companion R packages. Therefore, they increase modeling error and reduce the power of detecting important main genetic effects in the presence of the SNP-age interactions. These limitations are worsened as the number of SNPs increases. Although the model setup of the BRRR method was similar to that of the L2R2 model, the prior setting for the BRRR method was more subtle and appeared to be more suitable for small numbers of responses and predictors. Thus, the BRRR method is very sensitive to the number of responses and predictors. The MMA method performed the worst, as it did not account for the correlation structure of responses and predictors or the spatio-temporal correlation structure of the longitudinal phenotypes.\nSelected spline functions in the true coefficients (Γ) and their corresponding estimates obtained from the L2R2 model and the GSMuRFS method are shown in Fig. 4a-b . It is apparent from these splines that the bias of the L2R2 model was smaller than that of the GSMuRFS method. The estimated trajectories with smaller bias enabled us to better predict the response variables of later time points. A scatter plot of the true means at later time points versus the predicted means across all subjects and response variables in a randomly selected data set is shown in Fig. 4c . The true and predicted means were close to each other, indicating that model (5) can accurately predict longitudinal responses.\nWe examined the Markov chain Monte Carlo (MCMC) convergence through calculation of Gelman and Rubin's shrink factors for all the parameter estimates obtained from three MCMC chains with different start values of parameters (Fig. 4d) . The MCMC chains appeared to converge after 2000 iterations, as the shrink factors for all the parameters were less than 1.2. Generating 4000 MCMC samples after discarding 4000 burn-in samples for the L2R2 model to fit the four cases (i.e. p=50, d=50; p=100, d=100; p=200, d=100; and p=400, d=100) took approximately 6, 14, 16, and 22 min, respectively, with a single core of an Intel Xeon E5520 CPU. In comparison, the GSMuRFS method took 8, 18, 30, and 90 s to fit the four cases, respectively. However, the MCMC samples of the L2R2 model allowed us to make statistical inferences on all parameter estimates, whereas this could not be performed with the G-SMuRFS method. It is important to note that statistical inferences made under a highdimensional setting require some resampling and splitting procedures (Meinshausen and Bühlmann, 2010) . In this case, the G-SMuRFS method would require processing of thousands of subsamples, which may be computationally demanding.\nWe determined the longitudinal trajectories of the neuroimaging ROI volumes, the effects of the significant SNPs on such longitudinal trajectories, and the dynamic genetic effects on the trajectories. We estimated the trajectories of all standardized ROI volumes on the basis of Γ and W (Fig. 6) . ROIs with decreasing volumes occurred in many regions of the brain, including the left and middle temporal gyri, the left and superior temporal gyri, and the left and right amygdala. ROIs with increasing volumes occurred in the hollow areas of the brain and areas of white matter and included the left and right lateral ventricles, the left and right frontal lobe white matter, and the left and right temporal lobes. Moreover, the trajectories of most ROIs demonstrated structural symmetry.\nBecause hippocampal atrophy and ventricular enlargement are consistent findings in patients with AD and mild cognitive impairment (Apostolovaetal, 2012), we depicted the effects of some SNPs on the longitudinal trajectories of the left and right lateral ventricles and the left and right hippocampi (Fig. 7) . Let A and a denote the major and minor alleles of a specific SNP, respectively. For each ROI, we depicted the mean trajectory associated with a selected SNP (black solid curves) and the mean trajectory corresponding to the three allelic combinations (i.e. AA, Aa, and aa) of the SNP (Fig. 7) . The minor allele of SNP rs10501608 increased the rate of hippocampal atrophy, whereas the SNP rs1354106 minor allele had the opposite effect. Moreover, the minor allele of SNP rs10501608 increased the rate of ventricular enlargement, yet the SNP rs10501604 minor allele had the opposite effect.\nWe plotted the primary SNP-age interaction effects, whose absolute standardized estimates were larger than the predetermined threshold, on the longitudinal trajectories corresponding to the top 10 genes (upper row) and the top 40 genes (lower row) (Fig. 8) . The plots revealed a generally symmetric pattern for the left and right hemispheres, which indicated the genetic effects on the longitudinal change of ROI volumes were symmetric. Some asymmetric longitudinal genetic effects also occurred. For example, in the analysis of the SNPs from the top 40 genes, only the left nucleus accumbens and the right subthalamic nucleus were associated with SNP rs2273684, whereas their contralateral counterparts were not substantially correlated with any SNP. With exception of the left and right lateral ventricles, the genetic effects on most ROIs in the left and right hemispheres occurred in the same direction. Because both the number of parameters and the threshold for significance increased with the number of top genes, the number of significant SNP-age interactions decreased with the number of top genes. However, the effects of significant SNP-age interaction detected for the top 40 genes were more substantial.\nThe significant SNP-age interaction effects of the ROIs depicted in Fig. 8 formed SNP-specific networks that we visualized with BrainNet Viewer (Xia et al., 2013) in Figs. 9 and 10. Among all the networks, each SNP-specific network demonstrated spatially adjacent patterns. Some SNPs were associated with many ROIs, although other SNPs were associated only with ROIs in a specific brain area. The networks could be considerably different for different SNPs in a gene. In each network the sizes of genetic effects on various ROIs was relatively homogeneous, whereas the those across different networks may be substantially different. The most significant SNPs were close to the ventricular system. Some ROIs in the frontal lobe were also associated with SNPs that exhibited small growth effects, but ROIs near the prefrontal cortex were not strongly associated with the SNPs in the top 10 and top 40 genes.\nWe used MMA based on linear mixed effects models where each SNP, its interaction with age, and the covariates in W were regressed on each ROI volume. The p-values of the significant coefficients are smaller than pr dr r 0.05/( /2 + + ) (Bonferroni correction with the number of parameter in the L2R2), even though the true number of regression parameter is much larger (pd). The number of significant coefficients is smaller if the true number of parameters is used for correction. We compared the important estimated associations with L2R2. The two ROIs identified in the case with top 10 genes were the left and right lateral ventricles. Twelve ROIs were found in the case with top 40 genes, ten of which were found by L2R2. The number of significant associations identified by MMA were much less than that of L2R2. L2R2 provided more power in identifying important pairs of ROIs and SNP-age interactions and revealed more SNPs that may alter the longitudinal trajectories of ROIs.\nThe results of G-SMuRFS were not directly comparable to those of L2R2 and MMA because G-SMuRFS does not provide standard error estimates or a cut-off for all pairs of association as in L2R2 and MMA. The importance of the SNPs and SNP-age interactions was ranked by the sum of the absolute values of the estimated coefficients across all ROIs. Nonetheless, we found the top ROIs and SNP-age interactions, and some of them overlap with those from L2R2 in the case with top 40 genes.\nWe built the networks of ROIs with two criteria to study the structure of the longitudinal volumes of ROIs. Let B int be the part of B corresponding to the SNP-age interactions, and B int std , be the standardized B int . Firstly, we selected the ROIs corresponding to the large diagonal elements of B B int std\nto form a network. The change of each ROI in the network was heavily associated with the SNPs. The network was a collection of important ROIs which were affected by the timedependent SNP effects. Secondly, we constructed networks based on Z.-H. Lu et al. NeuroImage 149 (2017) 305-322 the absolute values of every columns of the standardized V std , which is the standardized V. Each network was an important combination of the longitudinal ROI measurements, and was strongly associated with the joint effect of a weighted combination of SNPs and age-SNP interactions quantified by the corresponding column of U. The top 10 ROIs in the networks were listed in Tables 1 and 2 for the top 10 and 40 genes, NeuroImage 149 (2017) 305-322 respectively. Such networks were mostly symmetric for the left and right hemispheres, which also illustrated the genetic effects on the longitudinal volumes of ROIs are largely symmetric. The imaging phenotypes provided quantitative measurements of the morphometric changes of the ROIs, which may characterize the underlying degenerative process of AD and capture information mirroring patients' diagnostic status. We used a generalized linearmixed model with logit link to determine the associations between longitudinal diagnostic status and the ROI volume. We found that 70 of 93 ROIs and 69 ROI and age interactions were significantly correlated with longitudinal diagnostic status after applying the false discovery rate correction with the significant level 0.05. Tissues with ROIs that correlated with longitudinal diagnostic status included the hippocampus, cingulate cortex, amygdala, and lateral ventricles, in addition to many other areas of the brain. Moreover, most of the ROIs identified by the L2R2 model in Fig. 8 were among the 69 ROIs that demonstrated age-dependent interactions. The SNPs used in the L2R2 model were previously reported in a genome-wide association study of the diagnostic status of patients with AD. Our findings show that the longitudinal trajectories of many ROIs are highly associated with the longitudinal patterns of diagnostic status; therefore, these ROIs may serve as consistent surrogates for measuring AD progression.\nThe L2R2 model elucidated some ROI-SNP pairs that were reported in previous genome-wide association studies on the basis of diagnostic status, cognitive scores, and imaging measurements. For example, the SNP rs1354106, which occurs in the CD33 gene, was associated with a slower declining rate of the AD assessment scale cognitive score (Sherva et al., 2014) . Biffi et al. (2010) reported that SNP rs1408077, which occurs in the CR1 gene, was associated with disease status. Moreover, the SNP rs1408077 was related to the entorhinal cortex thickness (Biffi et al., 2010) and hippocampal atrophy (Lazaris et al., 2015) . The SNP rs6088662, which occurs in the PRNP gene, was associated with reduced hippocampal volume and cognitive performance in healthy individuals (Li et al., 2016) .\nMultivariate imaging measurements may provide additional information compared with univariate measurements, such as diagnostic status. Some ROIs that were not associated with diagnostic status in the generalized linear mixed model were associated with certain SNPs in the L2R2 model, such as the left and right thalamus, right medial frontal gyrus, and right lateral front-orbital gyrus. More ROI measurements yielded additional variation in the SNPs compared with that of diagnostic status. Thus, integrating multivariate imaging measurements with genetic variables and diagnostic status may provide a clearer picture of the biological processes occurring in AD (Zhao and Castellanos, 2016) ."}, {"section_title": "Real data analysis", "text": ""}, {"section_title": "ADNI data description", "text": "The ADNI was launched in 2003 as a 5-year public-private partnership by the National Institute on Aging, the National Institute of Biomedical Imaging and Bioengineering, the Food and Drug Administration, private pharmaceutical companies, and nonprofit organizations. The primary goal of the ADNI is to test whether serial magnetic resonance imaging (MRI), positron emission tomography, other biological markers, and clinical and neuropsychological assessments can be combined to measure the progression of mild cognitive impairment and early AD. Determination of sensitive and specific markers of very early AD progression may aid researchers and clinicians in developing new treatments and monitoring their effectiveness, as well as reduce the time and cost of clinical trials."}, {"section_title": "Preprocessing", "text": "The MRI data were collected across a variety of MRI scanners with individualized protocols for each scanner to obtain standard T1-weighted images, volumetric 3-dimensional sagittal magnetization prepared gradient-echo sequences, or equivalent images with various resolutions. The typical imaging protocol included inversion time=1000 ms, repetition time=2400 ms, flip angle=8°, and field of view=24 cm with a 256 × 256 × 170 acquisition matrix in the x y − , −, and z− dimensions, yielding a voxel size of 1.25 × 1.26 × 1.2 mm 3 . Standard steps such as anterior commissure and posterior commissure correction, skull stripping, cerebellum removing, intensity inhomogeneity correction, segmentation, and registration (Shen and Davatzikos, 2004) were used to preprocess the MRI data. We then carried out automatic regional labeling for the template and transferring the labels after the deformable registration of subject images. After labeling 93 ROIs, we computed the ROI volumes for each subject.\nThe Human 610-Quad BeadChip (Illumina, Inc., San Diego, CA) was used to genotype the subjects whose images in the ADNI database we analyzed, resulting in a set of 620,901 SNP and copy number variation markers. Because the Apolipoprotein E (APOE) SNPs rs429358 and rs7412 are not included in the Human 610-Quad Bead-Chip, they were genotyped separately. These two SNPs define a three allele haplotype, namely the ϵ2, ϵ3, and ϵ4 variants, and the presence of each variant was available in the ADNI database for all subjects. We used EIGENSTRAT software (package 3.0) to calculate the population stratification coefficients of all subjects. To reduce population stratification effects, we used images from only white subjects who had at least one imaging sample available (749 of 818 subjects in the ADNI data set).\nWe also performed quality control on this initial set of genotypes . To input the missing genotypes into our analysis, we used MACH4 software (version 1.0.16) with default parameters to infer the haplotype phase. We also included the APOE-ϵ 4 variant, coded as the number of observed ϵ 4 variants. We removed SNPs with more than 5% missing values and entered the mode for the missing SNPs. In the final quality-controlled genotype data, we removed SNPs with a minor allele frequency smaller than 0.1 and a Hardy-Weinberg p-value < 10 −6 ."}, {"section_title": "Data analysis", "text": "The aim of our analysis was to apply the L2R2 model to establish an association between the SNPs in the top AD-risk genes reported by AlzGene (http://www.alzgene.org/) and the volumes of 93 brain ROIs collected by the ADNI. We used the L2R2 model to carry out formal statistical inferences, such as the identification of significant SNPs and SNP-age interactions. In this data analysis, we included data from n=749 subjects and N=2817 MRI measurements, resulting in an unbalanced data set. Among the subjects, 41 had only one observation and another 67 had only two observations. A random effect was used to account for the subject-specific intercept. For the age effect, we used a quadratic penalized spline with 11 knots that were based on the percentiles of standardized age. We also included intracranial volume, sex, education, and handedness as covariates in W to adjust the ROI volumes.\nWe considered two sets of top AD-risk genes. First, we used the 114 SNPs in the top 10 genes reported by the AlzGene database. After we performed quality control to the data set, 87 SNPs, APOE-ϵ4, and their interaction with age were included in the model (1). Second, we selected the 1224 SNPs in the top 40 AD-risk genes by the AlzGene database. After applying quality control to the data, we included 1072 SNPs and their interactions with age in our analysis. A map of the linkage disequilibrium among the 1072 SNPs revealed a clear clustering pattern of SNPs (Fig. 1b) . Specifically, the correlations among SNPs within each gene were large (>0.7), whereas those among SNPs in different genes were relatively small.\nWe fitted the L2R2 model (1) to the ADNI data as follows: To determine the rank of B, the L2R2 model was run up to r=10 layers. By comparing the five different selection criteria in Zhu et al. (2014) , we chose r=3 layers as the optimal rank for the final data analysis. We ran the Gibbs sampler for 20,000 iterations after 20,000 burn-in iterations.\nFor the G-SMuRFS method, we used the same Y matrix, combined the W and X matrices into a single predictor matrix, and then used the five-fold cross validation to choose the optimal penalty.\nOn the basis of the MCMC samples, we calculated the posterior median and median absolute deviations of U, V, and B, and used 1.4826 × median absolute deviations to compute the robust standard errors for each element of B. To determine the important coefficients, we used the standardized estimates B std , which were the absolute values of the estimates over their standard errors. To validate the lowrank structure of B, we used the results of the top 10 genes and set the elements of B to zero if their absolute standardized estimates were larger than a threshold (Fig. 5) . The sparsely distributed points along the horizontal and vertical directions indicated that the low-rank model was suitable for characterizing the association between the neuroimaging and genetic variables in the ADNI data set. We used a pragmatic approach to calculate the threshold for the Bayesian estimates, which resembled the Bonferroni correction in a frequentist approach. The threshold was the F p r d r r (1 − 0.025/( /2 + + )), and F was the quantile function of standard normal distribution, where the denominator was the total number of parameters in the low-rank structure U int , Δ, and V. U int was the matrix of coefficients of interaction terms. The thresholds for the top 10 genes and top 40 genes were 3.912 and 4.339, respectively. We referred the SNPs that passed the thresholds as significant SNPs though the meaning is different from frequentist significance."}, {"section_title": "Random effects", "text": "We examined the usefulness of incorporating random effects into our model by investigating the distribution of the estimated random effects over all subjects for each ROI. We generated histograms and quantile-quantile plots of the random effects obtained from two randomly selected ROIs from the L2R2 model that were fitted to the top 10 genes (Fig. 11) . The variances of the estimated random intercepts were substantial compared with the scale of the response variables, which coincided with the subject-specific intercepts of the neuroimaging measurements (Fig. 2a) . Moreover, these distributions did not severely deviate from the normal distribution.\nTo statistically test the presence of the subject-specific random effects Zb, we refitted the data with a restricted L2R2 model without Fig. 7 . The effects of SNP alleles on the trajectories of two ROIs in the ADNI analysis. Black solid line represents the overall effects characterized by the basis functions and coefficients in Γ. The blue dashed, magenta dot-dash, and red dotted lines are the trajectories of the ROIs altered by the SNP with AA, Aa, and aa, respectively. 'A' represents the major allele and 'a' represents the minor allele of a SNP. (For interpretation of the references to color in this figure legend, the reader is referred to the web version of this article.) the presence of Zb and then compared the log likelihood ratio of the full and restricted L2R2 models. The inclusion of random effects decreased the log likelihood function by 14,000 (or 5%), and the number of parameters increased by 93. Therefore, incorporating random effects into the L2R2 model was useful for characterizing the correlation structure of the imaging phenotypes and improved the detection of the association between imaging phenotypes and genetic variants."}, {"section_title": "Discussion", "text": "We have developed a Bayesian L2R2 model to determine the association between longitudinal imaging responses and covariates with applications in imaging genetic data. We used this model to approximate the large association matrix. We combined a sparse latent factor model and random effects to flexibly capture the complex spatiotemporal correlation structure. We incorporated splines to capture the effect of aging and combined a traditional coefficient estimation with a low-rank approach. The L2R2 model dramatically reduced the number of parameters to be sampled and tested, leading to a remarkably faster sampling scheme and efficient inference. The simulation studies demonstrated that the L2R2 model has higher power in detecting important time-dependent and main genetic effects. Age-dependent genetic effects are useful for characterizing age-related degenerative disorders like AD. When strong genetic effects modify changes in brain morphology over time, it is critically important to account for SNP-age interaction effects and to improve the detection of time-invariant main genetic effects. Although our findings confirmed 9 . The SNP-specific networks of ROIs based on the ADNI data set with the top 10 genes. The first row depicts the locations of ROIs that are correlated with the SNPs rs10501604, rs475639, rs677909, and rs10501608 in gene PICALM; the second row shows those of rs3826656, rs3865444, rs988337, rs1354106 in gene CD33; the third row shows those of rs3752237 and rs3752240 in gene ABCA7 and rs12734030 and rs650877 in gene CR1; the last row shows those of APOE34 (APOE), rs880436 (BIN1) and rs6458573 (CD2AP). The sizes of the dots represent the absolute magnitudes of the regression coefficients. Warmer and cooler colors represent ROIs located in superior and inferior anatomical sites of the brain, respectively. (For interpretation of the references to color in this figure legend, the reader is referred to the web version of this article.) the important role of well-known genes, such as APOE-ϵ4, in the pathology of AD, they also elucidated other potential candidate genes that warrant further investigation. The L2R2 model effectively established associations between phenotypic markers present in neuroimaging data and the presence of high-risk AD alleles. However, many considerations still merit further research. First, it is important to consider the joint effect of genetic markers and environmental factors on high-dimensional imaging phenotypes (Thomas, 2010) . Second, it is of great interest to incorporate rare variant genetic markers (Bansal et al., 2010 ) with the L2R2 model. Third, the key features of the L2R2 model may be adapted to more complex data structures (e.g. twin and family sequencing studies) and other parametric and semiparametric models. Fourth, the L2R2 model may be extended to combine different imaging phenotypes calculated from other imaging modalities (e.g. diffusion tensor imaging, functional MRI, and electroencephalography) in concomitant imaging and genetic studies. Fifth, group structures among SNPs (i.e.\ngene-based grouping)could be incorporated to improve the efficiency of modeling-correlated SNPs by choosing group priors for U.\nOne important feature of L2R2 is the inclusion of SNP-age interactions to model the genetic effects on the longitudinal change of ROIs. The interactions can also be viewed as the age-dependent genetic effects. The total age-varying genetic effects of the jth SNP x ij is β β t + j jij 2 , which assumes that the effect is a linear function of age. This assumption can be relaxed by modeling the effects as more flexible functions of age, e.g., polynomial functions and nonparametric functions, which is known as the varying-coefficient models (Hastie and Tibshirani, 1993; Zhang, 1999, 2008) . Varying-coefficient models have been used to study the time-dependent genetic effects and gene-environment interactions (Gong and Zou, 2012; Wu and Cui, 2013; Li et al., 2015) . Compared to L2R2, these studies only modeled univariate response variables. Extending L2R2 to incorporate more flexible varying genetic effects is helpful to better understand the genetic impact on the complex diseases at different age and under various states of environment factors.\nIt is worth noting that in Fig. 2b , the volume of right hippocampal formation appeared to increase in the three-year visit for subjects with minor allele of rs768451. This phenomenon is less expected in studies of Alzheimer's disease but it may be explained by the following reasons. We included healthy subjects, MCI and AD patients from the ADNI data set in our analysis. The volumes for the healthy subjects may be relatively stable. Moreover, several studies in the literature (Erickson et al., 2011; Leavitt et al., 2014; Niemann et al., 2014) reported that exercises were associated with the increase of hippocampal volume in older adults. Also, the number of subjects in the three-year visit was smaller than those in the previous visits, and the average of the hippocampal volumes for these subjects was larger than the average for all subjects at the initial visit. The dropout during the last visit may be informative. These factors warrant further investigation in the future studies. . In model (5), we primarily made statistical inferences from B (equivalently U Δ V , , ) and Γ."}, {"section_title": "A.2. Priors", "text": "We consider priors on the elements of B. Let a b Ga( , ) be a gamma distribution with scale a and shape b. We choose L 2 priors on the parameters at each layer B l as follows: where a 0 and b 0 are prespecified hyperparameters. Although, we have used the same precision parameter for each element of u l , group information can be incorporated by choosing separate precision parameters for each group. The number of predictors p (or d) is included in the hyperprior of u l (or v l ) to have a positive definite covariance matrix of high dimensional u l (or v l ). Moreover, this data driven approach for the priors of u l and v l requires no additional hyperparameters to choose. because we standardize all predictors to have zero mean and unit variance, a single prior suffices for all elements of u l . Moreover, because we rescale all of the responses, we use the same dispersion for all components of v l . Since we focus on exploiting the potential two-way correlations among the estimated coefficients, we choose the L 2 priors, which tend to borrow strength from correlated neighbors and force the coefficients towards each other to produce two highly correlated coefficients. Moreover, the posterior computations are simpler and faster under the L 2 priors. We consider priors on the elements of γ Γ = ( ) jk . We also choose the L 2 prior on the γ jk s as follows: where e 0 and f 0 are hyperparameters.\nFor the sparse factor model (4), we assign the multiplicative gamma process shrinkage prior (Bhattacharya and Dunson, 2011) on Λ to automatically determine the dimension of the factors needed to characterize the error covariance structure. The shrinkage prior increasingly shrinks the factor loadings towards zero with the column index and avoids identifiability of the order of the factor in t η ( ) "}]