[{"section_title": "Abstract", "text": "Healthy People 2020 states that ethnic health disparities are a priority for the US. Although considerable national statistics document ethnic-related health disparities, information specific to rural areas is scarce and does not provide direction for implementing chronic disease prevention programming. Therefore, the purpose of our project was to undertake the Hispanic Health Needs Assessment (HHNA), a tool designed by the National Alliance for Hispanic Health (NAHH), in culturally-diverse rural Southwest Kansas. Our focus areas included: access to healthcare, heart disease, diabetes, overweight, nutrition, and physical activity. Methods: The assessment followed six steps: (1) developing the assessment team, (2) data gathering using community member surveys, existing statistics, and community leader interviews, (3) assembling the findings, (4) formulating recommendations for action at individual, institutional, community and policy levels, (5) sharing findings and program planning (6) sharing findings with NAHH. We identified several challenges collecting health related data in rural communities. But overall, the HHNA was a comprehensive and useful tool for guiding a community level health assessment.\nConclusion: This process has provided our community partners with locally relevant statistics regarding the current status of health, health behaviors, and perceived community needs to inform resource allocation, program planning and applications for new funding initiatives. "}, {"section_title": "Introduction", "text": "A primary goal of Healthy People 2020 is to achieve health equity and eliminate health disparities by racial or ethnic background (U.S. Department of Health and Human Services (USDHHS), 2010). Suggested strategies for achieving these goals include working within multiple sectors to improve policies and strengthen practices based on evidence, knowledge, and research. This suggests a strong need for community level approaches to assessing and evaluating health outcomes, promoting health, preventing disease and encouraging participation in healthy behaviors, especially within communities with a significant history or risk of prevalent chronic diseases such as cardiovascular disease, obesity, diabetes, and cancer.\nHispanics are the fastest growing ethnic minority population in the United States (U.S.\nCensus Bureau, 2011) , and are disproportionately burdened with chronic diseases that negatively impact quality of life, morbidity and mortality (U.S. Department of Health and Human Services (USDHHS), 2010). In addition to ethnic health disparities, a significant portion of the Hispanic population in the US is of low socioeconomic status resulting in higher rates of uninsured and underinsured and ultimately, less access to adequate healthcare and preventive services. To parallel the efforts of Healthy People 2010, The U.S. Office of Minority Health National Plan for Action for Reducing Health Disparities (Office of Minority Health, 2010) outlines several objectives and strategies for reducing chronic disease health inequities. These objectives include (1) increasing awareness of health disparities throughout communities and (2) documenting the extent to which underserved groups lack access to healthcare services, prevention strategies, or experience a disproportionate burden of chronic disease or early mortality. There is a great need for locally relevant information for communities, given the extraordinary amount of diversity for socioeconomic, linguistic, education, acculturation, country or origin, physical and social environment, needs, preferences, cultural, and political factors within the Hispanic population.\nDeveloping a greater understanding of the population will allow for programming and initiatives that are more culturally tailored to be reflective of the norms and beliefs of the community, which are more efficacious (Resnicow, Baranowski, Ahluwalia, & Braithwaite, 1999) .\nA commonly used approach for minority health promotion is community-based participatory research (CBPR) (Yancey, et al., 2004) , a process characterized by a long-term cooperative engagement by researchers and community members as equal contributors to the process (Minkler & Wallerstein, 2002; Viswanathan, et al., 2004) The main principles and characteristics of CBPR include: (1) recognizing the community as a unit of identity, (2) emphasizing local relevance of public health problems and ecological perspectives that recognize and attend to the multiple determinants of health and disease, (3) facilitating collaborative partnerships and promoting co-learning and capacity building among all partners, (4) integrating and achieving a balance between research and action for the mutual benefit of all partners, (5) building on strengths and resources within the community, and (6) disseminating findings and knowledge gained to all partners and involving all partners in the dissemination process (Minkler & Wallerstein, 2002) . This approach emphasizes community participation as an important outcome in the overall process (Viswanathan, et al., 2004) . A CBPR approach often results in more sustainable, culturally sensitive community programs and greater support from community members resulting in the empowerment of the community for health-related issues. One of the early steps in the CBPR process for community health promotion is to engage the community in conducting a health needs assessment. Despite the importance of this critical step in communitybased health promotion, there is limited documentation of this process in predominantly Hispanic underserved communities. As a result, public health researchers and practitioners lack experience-driven, practical information and strategies to guide their CBPR approaches among Hispanic populations with substantial health disparities."}, {"section_title": "Objectives", "text": "The objective of this study is to document the process of community engagement for the use and application of the Hispanic Health Needs Assessment tool (National Alliance for Hispanic Health, 2004) in three diverse rural Kansas communities. Specifically, we will describe our CBPR partnership and the planning, conducting and disseminating the results of the health needs assessment. Finally, we outline future plans for community action to improve Hispanic health."}, {"section_title": "Methods", "text": ""}, {"section_title": "Context", "text": "Within the state of Kansas, approximately 8% of the population is Hispanic, though the primarily rural region of southwest Kansas has a much more diverse population. U.S. Census Bureau data recently declared Finney County in southwest Kansas as a majority-minority county (U.S. Census Bureau, 2011), with the majority consisting of individuals primarily of Mexican descent. Similar to Finney County, nearby Ford and Seward Counties are equally diverse compared with the rest of Kansas (see Table 1 ). Geographically, these counties are within close proximity to the Colorado and Oklahoma borders and have a vibrant economy, primarily based on agriculture, meat-packing, and cattle feed lots, which are the major employers for Hispanics in this region (Broadway & Stull, 2006 Table 1 ), limited project time and resources, and to also avoid overburdening our community respondents, our collaborative opted to focus on (1) heart disease and stroke, (2) diabetes, (3) nutrition and overweight and (4) physical activity and fitness and (5) access to quality health services.\nThe HHNA approach outlines six major steps in this process of community assessment which are outlined in Figure 1 and are described in greater detail below (National Alliance for\nHispanic Health, 2004).\nStep 1: Developing the assessment team\nThe original CBPR partnership this study built upon grew from an initiative to target obesity prevention in the three communities through the development of a community resource guide for physical activity and nutrition is described in detail elsewhere (authors, in press).Our first partners were Family and Consumer Sciences Cooperative Extension Service agents in the three communities, including the regional office. From those initial contacts, our collaborative has grown and includes over 10 individual and organization partners focusing on Hispanic health and/or Hispanic needs (e.g., English as a second language). Specifically, our partners include the county health department, community health clinic, local hospitals, community colleges, local coalitions and foundations, and faith organizations.\nStep 2: Data gathering Survey (U.S. Census Bureau, 2011). One difficulty we faced was the lack of current and relevant local data, as population trends have shifted very rapidly within these three communities.\nConsequently, available data was not likely an accurate reflection of the demographic make-up of the community, especially of the Hispanic population in Ford, Finney and Seward counties.\nThe mortality overview of the community documented the death rates by age group, death rates for leading 15 causes of death, and causes of death by age group. National and state level statistics were found at the National Vital Statistics System at the National Center for Health Statistics (Centers for Disease Control and Prevention, 2010). Local statistics were unavailable by city level and were aggregated at the county level from the county health department and the state health department (Kansas Department of Health and Environment, 2010).\nThe health overview of the community was based on both measurable and developmental objectives from Healthy People 2010. As noted above, the scope of this assessment included the focus areas of heart disease and stroke, diabetes, nutrition and overweight, and physical activity and fitness. Data for each of the objectives for these areas were obtained from and national and state level data collection systems (e.g. BRFSS, Community Health Survey), as there were no mechanisms tracking local data in any of our three communities. For all health objectives, data were aggregated at the county level rather than the city level. Due to low numbers of participants taking part in these state level surveys, most statistics were not available with a race/ethnicity breakdown at the local level."}, {"section_title": "Strategy 2: Community Members Health Survey", "text": "The HHNA provides a template for the community members' survey which asks respondents to report on their perceptions of current health problems in the Hispanic community and issues related to access to healthcare. Since the health conditions we focused on were related to physical activity and healthy eating, we expanded on the survey to address health behaviors, demographics, and environmental influences on physical activity. The final survey was completed in either English (n=33) or Spanish (n=156), consisted of 47 items, and was designed to take less than 15 minutes for participants to complete. The HHNA provided the template for the survey already translated into Spanish and the remaining questions were translated through the process of translation and back translation as outlined by the World Health Organization (World Health Organization, 2009). The survey was approved by the institutional review board at Kansas State University. Once an initial draft of the survey was completed, we pilot tested it with 10 Hispanic participants from a local Women Infant and Children (WIC) Clinic. These respondents were asked to provide feedback on the clarity, layout and length of the survey. Some minor adjustments to wording and layout were made after receiving this feedback.\nCommunity partners administered the survey from January through July 2009 (Dodge City n=4, Garden City n=4, Liberal n=4). These individuals were representatives of our CBPR organizations who worked with either health related issues or with the Hispanic community. This included county health departments, community health clinics, churches/faith organizations, adult learning centers (English as a second language programs), and community colleges.\nPartners were provided a log to track the number of surveys offered, document refusals, and the administration of incentives for completing the survey (grocery tote bag, pen, magnet, and community resource guide for nutrition and physical activity). Community members within in Dodge City (n=70), Garden city (n=68) and Liberal (n=51) completed the survey. Although we instructed the partners on the proper method to track respondents, only two of our partners completed the log. After data collection, our partners disclosed that the logistics of logging the process were burdensome and/or impractical for the locations where we collected the data.\nDetails of the survey measures are outlined below and the results are found in Table 2 .\nDemographics: Participants self-reported their age, sex, household size, marital status, employment status, education level, country of ancestry, and current weight and height. Body mass index was calculated (weight(kg)/height (m) 2 )."}, {"section_title": "Health behaviors: Using the BRFSS physical activity module (Centers for Disease Control", "text": "Prevention, 2010), we assessed participant's moderate and vigorous physical activity participation. Participants also reported the number of fruits and vegetables they consumed daily, how many days per week they walked or biked to work, how many hours per day they spent doing sedentary activities (screen and computer time), and how often they ate meals in a restaurant."}, {"section_title": "Perceptions about health problems:", "text": "Participants were asked open-ended questions regarding their perceptions of the major health concerns among Hispanics in their community. Responses were coded by a research technician. In a separate section of the survey, participants were presented with 14 items that assessed how important a particular health condition was for Hispanics in their community. Participants were asked to rank the top five health conditions for the community, with 1 being most important, 2 being next important, etc. Available responses included: alcohol/drug addiction, cancer, depression, diabetes, heart disease, HIV/AIDS, obesity/overweight, injuries/death from violence, liver or lung disease, infant mortality, pneumonia/influenza, stroke, or other.\nAccess to healthcare: Participants were asked six questions about their access to healthcare.\nParticipants reported where they go for help when they are sick (television/radio/internet, health education specialist, curandero/espiritista/santero, hospital emergency room, family/friend/neighborhood, counselor, doctor, nurses, pharmacist, social service agency, books/magazines, or other\n). An open-ended question addressed whether participants ever had difficulty getting needed health services and responses were coded by a technician. Participants also selected any barriers to receiving needed health services from a list of 10 options (transportation, cost of services, unsure of available services, inconvenient hours, unsure where to go for special medical concerns, prefer to take care of own problems at home, prefer to not have health insurance, unsure that services would be helpful, dislike of doctors, other reasons).\nLastly, participants indicated how long it had been since their last two physical examinations and where they went for that examination (nurse, doctor, curandero, physical therapist, nurse practitioner, acupuncturist, other professional).\nEnvironmental influences on physical activity: Perceptions of the neighborhood environment\nwere measured with the International Physical Activity Questionnaire Environmental Module (Sallis, et al., 2009 ). The 17 items in the IPAQ-E cover elements such as residential density, land use mix, transportation, aesthetics, and safety from traffic and crime, and are taken or adapted from previously evaluated surveys of neighborhood environments (Brownson, et al., 2004; Saelens, Sallis, Black, & Chen, 2003) . Specific findings for this scale in the context of the present study are reported elsewhere (authors, 2011)."}, {"section_title": "Strategy 3: Community leader interviews", "text": "Community leaders, many of whom were representatives from our CBPR collaborative, were recruited to take part in interviews. Participants were identified as being a community leader related to health or Hispanic related issues and included: chief executive and operating officers of a community health clinic that primarily serves Hispanics, community development and outreach workers of community health clinics, directors of county health departments, WIC clinic workers, Hispanic nurses, hospital administrators, adult education specialists, Hispanic radio personality, Hispanic priests, and cooperative extension specialists.\nProcedure and guide: Leaders were recruited through personal contact and through a snowball technique from contact with previous leaders. Participants provided consent to take part in the interview and the interviewer audio recorded the conversation. Leaders (Garden City n=6, Dodge City n=4, Liberal n=6) were interviewed either in person (n=1) or over the phone (n=15), in English (n=14) or Spanish (n=2). For the interview, participants were asked about their personal demographics (sex, age, race, ethnicity), the type of organization they were affiliated with and details about their duties at the organization. The questions asked were outlined the HHNA document and included questions about the interviewee's perception of major health concerns, conditions and behaviors for the community, causes of health problems, social issues related to health, ideas for improvement, currently existing effective programs for health, and perceptions of resources and policies that influence physical activity or healthy eating. The recorded transcripts were transcribed and analyzed for themes and frequencies.\nStep 3: Assembling the Findings\nThe information attained from all three strategies (currently existing health & mortality statistics, community member surveys, and community leader interviews), were compiled and organized according to community (Garden City, Dodge City, & Liberal) and focus area (access to healthcare, diabetes, heart disease & stroke, nutrition & overweight, and physical activity & fitness). We felt it was best to prepare two types of reports to present our findings to the communities, one full report that contained all of the information for all three communities and brief reports that would feature the results of a single community.\nThe contents of the full report are outlined in Table 3 . This report was targeted toward community leaders, legislators and policy makers, and had a 12 th grade reading level (McLaughlin, 2008) . After laying out the text in English, it was translated into Spanish through the work of two translators. Each translator worked separately, meeting to discuss discrepancies and attain consensus on phrasing (World Health Organization, 2009). One document contained the information in both English and Spanish. The guide was printed so that all of the English information was presented (e.g., pages 1-8), and subsequently all of the information was then printed in Spanish. However the Spanish information was rotated 180 degrees resulting in a format that allows the guide to read like a book (left to right) regardless of the language preference of the reader. Photos of local landmarks and culturally relevant foods, physical activity, and health-related scenes were included in the layout of the report. The final report was 88 pages 8.5\"x 11\" in size.\nThe brief reports were prepared for each community separately and laid out in either English or Spanish. These briefs were targeted to community members and had a 6 th grade reading level (McLaughlin, 2008) . They presented a brief overview of the HHNA process and featured relevant local results, highlighting disparities between national, state and local Hispanics and general populations. A number of recommendations for action were included that were more community-member oriented. Briefs were colorful, laid out with four pages of text (one 11\"x 17\" paper, double sided, folded in middle to create a booklet style) and included many photos of local landmarks and culturally relevant scenes to enhance the interest and readability among community residents.\nThe findings outlined some slight discrepancies between what the community leaders felt were main health concerns and what community members indicated as concerns. Overall community members indicated that the main health concerns were nutrition, obesity, diabetes and alcohol/drug addiction while community leaders added violent crime/gang activity, childhood obesity, heart disease and teen pregnancy to the list of concerns. As a part of the structured interview the leaders were asked for suggestions for improving Hispanic health in the community and the most common suggestions included: lower costs of services and medications, providing information on existing community programs and resources, providing Spanish speaking healthcare providers or translators, and more education on chronic health conditions.\nTo address some of the concerns with health behaviors related to obesity, community leaders had several comments, including the perception that fruits and vegetables are too expensive in that region of the state and current resources for physical activity (trails, parks) were underutilized by Hispanics. Their suggestions for targeting these behaviors included: schools could be targeted for improving nutrition for children, while churches and worksites could reach adults with health education, Hispanic radio stations would be effective for delivering health promotion messages.\nMost community leaders indicated that there is a need for culturally relevant nutrition material\nStep 4: Formulating Recommendations for Action\nAlthough each community had unique findings, overall the suggestions for programming, policies, and strategies to address the health concerns in the three communities were similar enough to create one master list of recommendations. Therein, the communities could select the approaches most appropriate for their needs, preferences, and resources. The recommendations In addition to these resources, we also eluded to evidence based strategies for effective approaches for improving health behaviors and outcomes.\nStep 5: Sharing the Findings & Planning Programs\nOnce the reports were prepared, we worked with our community partners to arrange to present our results to interested parties. We encouraged the communities to make the arrangements for the type of delivery that would fit their needs. Two of the communities opted for a town-hall style meeting, with several community leaders and representatives of community partner organizations attending. These community leaders then became empowered advocates for Hispanic health in their communities, sharing the results with local news media, politicians, and other key leaders. In these meetings the findings were presented and some of the most relevant recommendations were presented as possible strategies for the community. Paper and electronic copies of the full and brief reports were made available to attendees. For the third community, they were unable to decide on a single event for delivering our findings, so alternatively we visited individually with several of the community leaders, sharing the report and providing copies for dissemination to community members associated with their organization.\nThe results of the HHNA report were well received in all three communities. In one community, the local newspaper published the results to start a dialog about some the issues outlined in the report. This community also used the information as a part of their annual health assessment as a requirement for some of the grants the community has for addressing chronic health problems. Future programs are planned in this community to incorporate some of the ideas suggested in the guide.\nAfter our HHNA report was delivered in another community, leaders came together to discuss health issues concerning new populations migrating to work at the beef packing plants, the largest industry in the area, that employed Hispanics as well as other new immigrants. A refugee support group indicated it would be helpful to understand the needs of the Burmese and Somali populations, similar to how the HHNA documented health issues for Hispanics in the community, and initiated a new study to examine these and other underserved populations in the community. Two local foundations, looking to be more proactive in addressing health, education, social, and well-being issues, convened representatives of the local health coalition; the health department, United Way, the recreation commission, and the indigent health care\nclinic to lead a new study. This study, now in progress, has built on the HHNA report to assess health with added questions about safety, educational needs, community engagement, and social connections. Data collection tools have been translated into Karen (a Burmese language), Somali, Vietnamese, and Spanish and will be used in focus groups and face-to-face interviews.\nThe end goal for this group is to have a document, similar to the HHNA, which will be used by human service agencies to address the needs of individuals and families.\nAdditionally, based on the HHNA findings, the Kansas State University Expanded Food families prior to the HHNA to 58 families eight months after the HHNA was released. Program participants are generally mothers with young children. The program has grown to three more counties in Southwest Kansas, with Hispanic populations ranging from 38% to 40%.\nStep 6: Sharing findings with the National Alliance for Hispanic Health\nThe electronic versions of the reports were also made available on our laboratory website and community partners were encouraged to post it on their organizations' website. The report was also made available to the state health department, related health foundations and the National Alliance for Hispanic Health. Additionally, the results were presented at a national public health conference (Bopp, et al., 2010) ."}, {"section_title": "Lessons Learned and Recommendations", "text": "This project documented the complex process of engaging community partners in attempting to address the challenges facing health and health behaviors in a diverse population.\nSome of the lessons learned through this project can provide insight into potential challenges that other communities may face in using the HHNA to examine Hispanic health. One of the greatest challenges we faced with our project was in the gathering of currently existing health statistics from diverse sources. The communities and counties we worked with were in more rural areas (United States Department of Agriculture Rural-Urban Continuum codes 5-7)(U.S. Department of Agriculture, 2008). Therefore, the state health department undersampled for the state BRFSS in these communities, leading to a lack of data, especially among ethnically diverse populations within the communities. Subsequent initiatives within the state have attempted to address this disparity (Kansas Health Institute, 2008) , but for the purpose of this project, the information was unavailable. Moreover, these state-level data collection strategies may not be appropriate for capturing health outcomes and behaviors for our communities, given that the Hispanic population in this region is comprised of new immigrants who may possibly be distrustful or hesitant to provide information or due to socioeconomic constraints, lack access to a phone.\nFuture projects may include planning assessment strategies with state or local health departments for additional data collection, or performing their own sampling similar to BRFSS methods.\nAnother challenge was working with our partners to communicate the importance of tracking community member survey participants carefully. Despite instructions to carefully log the number of surveys they gave out and the number of refusals, we struggled to get this information from our partner organizations. Strategies to improve our tracking could include incentives for community partners for returning tracking logs and additional instructions on the importance of this component of the project for documenting response rates. Ultimately, however, this may be indicative of a logistical process that is too overwhelming for community partners who are all-too-often over-burdened and under-resourced. Future initiatives should plan for a full-time salary position based within the community and hire a community member who is bilingual, culturally competent, and trained in research practice and methodologies to assist community partners with gathering data.\nOne of the most important insights brought about by these findings was the recognition of some of the cultural, social and community level influences on health noted by both community members and leaders, which were similar to influences noted in other studies (Cersosimo & Musi, 2011) . Some significant barriers to health were identified that could be targeted with future interventions, initiatives or policy changes. The findings suggested strategies to enhance the cultural competency of healthcare providers; for example conducting workshops or trainings with healthcare providers for continuing medical education that address issues associated with working in a diverse community. There was also an indicated need for greater availability of bilingual resources, which could be addressed with the dissemination of previously translated materials from trustworthy sources (e.g. Centers for Disease Control and Prevention, National\nInstitutes of Health, American Diabetes Association) through schools, healthcare settings, or faith-based organizations. Additionally, there could some training on health-related Spanish language skills offered for local healthcare providers through local community colleges, where people are frequently trained for health-related occupations in this region. One of the insightful findings indicated where residents were receiving their health-related information, which leads to the suggestion for providing training or workshops for non-traditional sources of information (e.g. pharmacists). Another issued noted in these communities referred to access to health-related facilities, which leads to examining strategies for enhancing could access (e.g. addition of public transportation stops or routes, traveling clinics, expanded hours). This process highlighted the need for some of these approaches and as noted, the communities have been responsive and used the information in program planning.\nThe HHNA tool proved to be a useful tool for gathering a comprehensive picture of Hispanic health in these three diverse communities in southwest Kansas. It provided a structured approach to gathering the vast types of demographic and health information available from multiple sources. The information garnered from using the HHNA tool in these communities provided a strong foundation for developing future programs and policies, directing programming, and providing evidence of need for future grant proposals for community initiatives. Other communities looking to closely examine issues of Hispanic health should consider using this tool to guide their process. One of the limitations of using the HHNA was the difficulties in finding the specific information to \"fill-in\" the tables provided, and we believe we spent more time searching for the information to complete the tables than to consider other sources of information that could provide similar but not exactly the same information. Thus, researchers should not feel constrained by explicitly adhering to the structure of the HHNA documents at the expense of developing a flexible data collection protocol that is responsive to information available in the local community.\nOur community partners, who were extraordinarily supportive and strong and passionate advocates for Hispanic health in our communities, were willing to help with multiple phases of the project, ranging from the initial planning stages to collecting data, recruiting community members to complete our surveys, and being interviewed as community leaders. We recognize the importance of these relationships and realize that our project could not have been successful without this collaboration. Future researchers and practitioners looking to complete this process would benefit from paying attention to building strong relationships with interested parties, as outlined in the initial stages of the CBPR process (Minkler & Wallerstein, 2002 ).\nUltimately we believe that using the HHNA tool in these rural Kansas communities has provided a comprehensive, strong foundation for future programs and public health strategies.\nEngaging in the CBPR process allowed us to ensure that our community partners would maximally benefit from our results and have a lasting resource for many years to come. Step 6: Report findings to the National Alliance for Hispanic Health\nStep 5: Planning programs based on findings\nStep 4: Make recommendations\nStep 3: Assemble findings and develop report\nStep 2: Data Gathering Community leader interview\nStep 1: Identify and assemble needs assessment team"}]