[{"section_title": "Abstract", "text": "This study contributes to ongoing scholarship at the nexus of translational research, education reform, and the developmental and prevention sciences. It reports 2-year experimental impacts of a universal, integrated school-based intervention in social-emotional learning and literacy development on children's socialemotional, behavioral, and academic functioning. The study employed a school-randomized, experimental design with 1,184 children in 18 elementary schools. Children in the intervention schools showed improvements across several domains: self-reports of hostile attributional bias, aggressive interpersonal negotiation strategies, and depression, and teacher reports of attention skills, and aggressive and socially competent behavior. In addition, there were effects of the intervention on children's math and reading achievement for those identified by teachers at baseline at highest behavioral risk. These findings are interpreted in light of developmental cascades theory and lend support to the value of universal, integrated interventions in the elementary school period for promoting children's social-emotional and academic skills."}, {"section_title": "", "text": "Over the last two decades, developmental science has made significant progress in understanding children's trajectories toward social-emotional and academic outcomes (e.g., Arnold, 1997; Blair, 2002; Duncan et al., 2007; Miles & Stipek, 2006) . At the same time, there has been dramatic growth in the design, implementation, and rigorous evaluation of schoolbased interventions to promote positive social-emotional development and ⁄ or academic achievement (e.g., Brown, Jones, LaRusso, & Aber, 2010; Embry, 2002; Jones, Brown, Hoglund, & Aber, under review; Kellam et al., 2008; Payton et al., 2008; ProthrowStith, 2007; Webster-Stratton, Reid, & Stoolmiller, 2008) . This present study contributes to ongoing scholarship in the school-based prevention of socialemotional, behavioral, and academic problems by reporting experimental impacts of a novel social-emotional learning and literacy intervention (the 4Rs Program, ''Reading, Writing, Respect and Resolution'') on a cohort of third grade children's social-emotional, behavioral, and academic functioning after two consecutive years of exposure to the intervention."}, {"section_title": "School-Based Social-Emotional Learning and Violence Prevention Interventions: Theory and Research", "text": "The past decade has seen dramatic growth in programs focused on enhancing children's social and emotional skills to reduce aggression and violence and to promote positive interactions (Clayton, Ballif-Spanvill, & Hunsaker, 2001; Payton et al., 2008; Wilson, Lipsey, & Derzon, 2003) . This period has also witnessed a growing convergence of developmental science and prevention science in guiding the design and evaluation of interventions aimed at preventing future aggressive and violent behavior in children and youth (Institute of Medicine, 1994; Maggs & Schulenberg, 2001) . From developmental science, knowledge has grown about the mechanisms by which exposure to violence affects children's risk for such outcomes (Coie & Dodge, 1998; Dodge, 2006) . Our greater understanding of these causal mechanisms has led to improvements in both the design and evaluation of preventive interventions, which increasingly target these mechanisms as their focus of change (e.g., Aber, Brown, Chaudry, Jones, & Samples, 1996; Dodge, 2001; Hudley & Graham, 1993) . Indeed, several of these causal mechanisms are central to the 4Rs Program and to the evaluation design of this study (see below). Developmental science is also the source of valuable theoretical perspectives that are aligned with our expectations of how such interventions work in school settings and how their effects are anticipated to unfold over time. For example, our approach to the evaluation of the 4Rs is guided by developmental cascades theory (Masten & Cicchetti, 2010; Masten, Long, Kuo, McCormick, & Desjardins, 2009) which emphasizes an ecological, multi-level lens, focuses attention on change processes in multiple domains, and considers child development in context as dynamic systems (Jones, Brown, & Aber, 2010) .\nFrom prevention science, knowledge has grown about the effectiveness of these intervention strategies at reducing children's risk for future aggressive and violent behavior (Aber, Brown, & Jones, 2003; Clayton et al., 2001; Conduct Problems Prevention Research Group (CPPRG), 1999 Embry, 2002; Prothrow-Stith, 2007; Webster-Stratton & Taylor, 2001) . Although the literature on school-based preventive interventions is rich with studies of interventions targeted at subgroups of high-risk children (Vitaro, Brendgen, & Tremblay, 2001) , with a few exceptions (e.g., the Good Behavior Game; Kellam et al., 2008) , it has only recently expanded in the area of large-scale evaluations of universal interventions implemented with general populations of students (Durlak, 1995; IES, 2003; Payton et al., 2008) . Furthermore, among the best studies of universal school-based interventions designed to reduce risk for future aggression and violence, a variety of methodological challenges limit the quality and generalizability of the knowledge base (Hundert et al., 1999) . With some exceptions (e.g., CPPRG, 2007; Ialongo et al., 1999; Kellam et al., 1998) , these earlier studies rarely employ both experimental random assignment designs and appropriate analytic methods (e.g., multilevel modeling with intervention status modeled at the level of random assignment). Similarly, studies typically fail to employ multi-year, longitudinal designs and to examine changes in both short-and long-term developmental outcomes as they unfold over time."}, {"section_title": "Integrated Approaches", "text": "Historically, school-based interventions have been focused on either academic or socialemotional outcomes. However, consistent with developmental cascades theory and other recent research (e.g., Blair, 2002) , and considering the limited time in schools for outside interventions integrating academic and social-emotional learning intervention efforts, and of examining the direct effects of such integrated intervention on both domains of development (e.g., Bierman et al., 2008; Durlak, Weissberg, Dymnicki, Taylor, & Schellinger, 2011; Ialongo et al., 1999) . Efforts at such integration are supported by a mounting body of research linking successful school adjustment and performance with the development of social-emotional competence (e.g., Miles & Stipek, 2006; Pianta, Steinberg, & Rollins, 1995; Rogoff, 1990; Wentzel, 1991) . At the elementary school level, learning involves successful relationships with teachers and peers requiring skills in problem-solving and conflict resolution (Chen, Rubin, & Li, 1997; Maughan, Pickles, Hagell, Rutter, & Yule, 1996) . Research also suggests that children who have difficulty regulating emotions and therefore experience high levels of negative emotional arousal may have trouble concentrating in class and recalling things they have learned (Raver, Garner, & Smith-Donald, 2007) . Finally, there is a great deal of evidence that poor academic achievement cooccurs with disruptive and aggressive behavior (DeBaryshe, Patterson, & Capaldi, 1993; Masten et al., 1995; Ollendick, Weist, Borden, & Greene, 1992) and is a predictor of future maladaptive behavior (Kellam, Brown, Rubin, & Ensminger, 1983; Williams & McGee, 1994) . Indeed, prior reviews have proposed that shared or correlated risks underlie the development of poor social-emotional skills, aggressive behavior, and academic problems (Hinshaw, 1992; Olweus, 1983) .\nRecently, interest has grown in developing and testing integrated approaches to building socialemotional and literacy skills both in the preschool period (e.g., the eight studies funded as part of the Interagency Consortium on School Readiness; Bierman et al., 2008; Raver et al., 2009) , and in the elementary school years (e.g., Shinn, Walker, & Stoner, 2002; Zins, Weissberg, Wang, & Walberg, 2004) . Several recent reviews of school-based preventive interventions targeting social-emotional or academic skills suggest that the ''prevention strategies that directly target one of these problem areas tend to have indirect, positive effects on the other target area'' (Walker & Shinn, 2002, p. 3). For example, in our previous work, we found that exposure to a social-emotional learning and conflict resolution curriculum for 2 years was associated with improvements both in social-emotional learning (Aber et al., 2003) and in scores on standardized tests of math achievement (Brown, Roderick, Lantieri, & Aber, 2004) . Other work has shown similar cross-over effects, primarily in the case of impacts in the academic domain that are linked to exposure to a school-based social-emotional learning intervention (e.g., Durlak et al., 2011; Flay & Allred, 2003; Flay, Allred, & Ordway, 2001 ). Kellam et al. (e.g., Ialongo et al., 1999; Kellam, Rebok, Mayer, Ialongo, & Kalodner, 1994) reported the effects of two independent universal interventions (Good Behavior Game and Mastery Learning) implemented with first grade children, followed by reports in which the two interventions were integrated as they are in the 4Rs Program, with the integrated program resulting in larger effects in each domain than seen previously (Ialongo et al., 1999) ."}, {"section_title": "The 4Rs Program Theory of Change", "text": "The 4Rs Program is a universal, school-based intervention for grades K-5 focused on socialemotional learning and literacy development that provides a pedagogical link between the teaching of social-emotional competencies and fundamental academic skills, capitalizing on their mutual influence on successful youth development (Hinshaw, 1992) . (See Method for a full description of the program.) Building off its predecessor, the Resolving Conflict Creatively Program (RCCP; Aber et al., 1996; Aber, Jones, Brown, Chaudry, & Samples, 1998; Aber et al., 2003) , and consistent with both developmental cascades theory (Masten & Cicchetti, 2010) and current notions of translational research, the 4Rs Program can be characterized as a ''developmental intervention '' (National Research Council, 1993) , one that focuses on changing underlying processes that lead to aggression and violence when they are still in the formative stage. The theoretical model underlying the social-emotional learning core of the 4Rs Program emphasizes the social-cognitive and social-emotional processes prior research has shown link individual, family, school, and community risk factors to the development of aggressive behavior, and that place children at higher risk for future violence (Coie & Dodge, 1998; Dodge, 2006; Gershoff & Aber, 2006; Huesmann & Guerra, 1997) .\nThe key processes in the social-cognitive domain include: the scope and intensity of children's attributional biases toward interpreting ambiguous social cues as hostile rather than prosocial (e.g., Dodge, Bates, & Pettit, 1990) , their normative beliefs about aggression (Huesmann & Guerra, 1997) , and the developmental maturity of children's interpersonal negotiation strategies with peers (e.g., Selman, Beardslee, Schultz, Krupa, & Podoresky, 1986) . Theory, basic, and applied research suggest that each of these social-cognitive processes is: (a) affected by certain types of experiences (e.g., a history of harsh, punitive, or abusive parenting, exposure to community violence; Dodge, 2006) or a peer environment in which violence is normative (Bierman & Wargo, 1995; Tremblay, Pagani-Kurtz, Masse, Vitaro, & Pihl, 1995) , and in turn; (b) increases the probability of aggression and violence by children and youth (Dodge, Laird, Lochman, Zelli, and Conduct Problems Prevention Research Group, 2002; Guerra & Slaby, 1990; Huesmann & Guerra, 1997) . These social-cognitive processes constitute a potential causal mechanism linking exposure to ecological risk with later developmental outcomes of aggression and violence. While the body of evidence supporting the linkages described here is largely correlational (Dodge, 2006) , basic principles of translational research and prevention science (e.g., Kellam & Langevin, 2003) suggest that if experimental evaluations of interventions that target theoretically and empirically supported causal mechanisms reveal changes in both the proximal mechanisms (e.g., social-cognitive processes) as well as the distal target (aggressive behavior), additional support for the basic developmental theory is provided.\nIn our earlier work evaluating the RCCP (Aber et al., 1998 (Aber et al., , 2003 , we examined children's trajectories of aggression and violence over the course of elementary school and estimated the effects of participation in RCCP on changes in these trajectories. In contrast to the present experimental evaluation of the 4Rs Program, the design of the RCCP evaluation was quasi-experimental. We found that children's exposure to teachers who taught more of the SEL curriculum (the core of both RCCP and 4Rs) slowed children's rates of growth in aggression-related cognitions, including their hostile attributional biases (HAB) and aggressive interpersonal negotiation strategies (AINS) over the course of elementary school (Aber et al., 2003) .\nThe key processes in the social-emotional domain include children's aggressive and prosocial fantasies, and their levels of affective symptomatology, including symptoms of depression and attention deficit hyperactivity disorder (ADHD). Child reports of affective symptomatology have been used extensively in prior evaluations of preventive interventions (CPPRG, 1999 (CPPRG, , 2002 (CPPRG, , 2004 (CPPRG, , 2007 Dalberg, Toal & Behrens, 1996; Kellam et al., 1994) . Moreover, because of the fear, anxiety, and sadness caused by environments characterized by high concentrations of children who misperceive social interactions and cues, or who hold beliefs that aggression is a normative response to problemsolving situations, the 4Rs Program is expected to reduce children's depressive symptomatology and build their capacity to focus attention. Our earlier work found significant impacts of exposure to RCCP on children's depressive symptoms and aggressive fantasies (Aber et al., 2003) .\nThe literature briefly reviewed here, our prior work, and developmental cascades theory (Jones et al., 2010) inform both short-and longer term expectations for 4Rs Program effects on children's outcomes. Our short-term expectations after 1 year were for program impacts primarily in the socialcognitive and social-emotional domains, and this was partly confirmed (see Jones et al., 2010) . The approach of embedding social-emotional learning and conflict resolution lessons in a balanced literacy delivery strategy, and research tying together the social-emotional and academic domains, support our expectation for longer term effects on behavior and academic achievement. Thus, we directed our focus to constructs in four primary domains that either represent direct proximal targets of the intervention, or are known predictors of children's future functioning: children's Social-Cognitive Processes, their Social-Emotional Symptomatology, their Aggressive and Prosocial Behavior, and their Academic Functioning. Results after 1 year of exposure to the 4Rs Program indicate main effects of the intervention on children's social cognitions (i.e., self-reports of HAB [ES = .17]), and social-emotional symptomatology (self-reports of depression [ES = .17] ). In addition, there were intervention impacts on children's self-reports of aggressive fantasies, teacher reports of academic skills, and attendance records for those children identified by teachers at baseline at highest behavioral risk (ES = .32-.59; Jones et al., 2010) .\nThis study is the first report of experimental effects of the 4Rs Program on change over 2 years using four repeated assessments of children's socialcognitive, social-emotional, behavioral, and academic outcomes. The primary questions addressed in the article are: (a) What is the experimental impact of the 4Rs Program on 2-year change in third grade children's social-cognitive processes, socialemotional symptomatology, aggressive and socially competent behavior, and academic functioning, controlling for key demographic covariates? (b) Building on recent findings demonstrating significantly stronger intervention impacts for families facing more versus fewer poverty-related risks (e.g., Tolan, Gorman-Smith, & Henry, 2004) , is the 2-year impact of the 4Rs Program moderated by child-level demographic baseline covariates including child gender, race ⁄ ethnic background, family socioeconomic risk, and community risk? (c) Finally, building on evidence from the 1st year of our 4Rs evaluation (Jones et al., 2010) and other experimental evaluations of universal school-based prevention programs (CPPRG, 2007; Multisite Violence Prevention Project, 2009) Vuchinich et al., under review) . Attrition between waves was minimal (on average 8.6%) and primarily because of student mobility. Parental refusals to continue were rare (e.g., n = 1 in Wave 2).\nAccording to parent-reports at baseline, 53.4% (n = 503) of children lived in a single-parent household, 15.1% (n = 142) of parents were unemployed, 31% (n = 292) of parents had less than a high school diploma or GED, and 61.8% (n = 582) of households were at or below 100% of the federal poverty level. Based on parent-reports at baseline and NYC Department of Education records when parent-reports were missing, children represented diverse racial ⁄ ethnic groups; 45.8% (n = 542) were Hispanic ⁄ Latino, 41.3% (n = 489) Black ⁄ African American, 4.3% (n = 51) non-Hispanic White, and 8.6% (n = 102) represented other racial ⁄ ethnic groups (e.g., Asian, Pacific Islander, Native American). Table 1 Note. a Baseline covariate significantly higher for intervention compared to control group: community risk, t(1182) = 2.20, p < .050; behavioral risk, t(1182) = 2.41, p < .050; Y1-Y2 (Year 1-Year 2) classroom size, t(1182) = 3.94, p < .001; Y1-Y2 teacher experience, t(1182) = 8.92, p < .001. SES = socioeconomic status. potential participants in the 4Rs evaluation. Twenty-four agreed to the matching and randomization process. Prior to randomization, a pairwise matching procedure was used to maximize demographic similarity of intervention and control schools. An algorithm was used to compute the distance from each school to every other school along 20 demographic and school characteristics drawn primarily from the 2001-2002 administrative databases kept by the city's Department of Education (Jones et al., 2010) . The matching procedure produced 12 matched school pairs, and the 9 best matched pairs of schools were initially selected for inclusion in the study with the three remaining pairs reserved as back-ups. The first back-up pair was eliminated from consideration by a Local Instructional Superintendent. Two of our initially selected best matching pairs were dropped (in one case the Principal was previously trained in the RCCP-an original exclusion criterion, and in the other, the Principal was unwilling to proceed with the study if assigned to the control group) and were replaced with our 2nd and 3rd back-up pairs. The first school in each pair was assigned to the intervention or control group based on a randomly generated number, and the second school in the pair was, therefore, assigned to the other group. The two groups did not differ significantly on any of the matching characteristics and eta-square values were minimal. Based on these statistics, the schools can be described as racially and ethnically diverse, composed primarily of students receiving free school lunch, and with attendance rates over 89% and 1-year stability rates ranging from 86% to 95%.\nConsent packages (in English and Spanish) were sent home to all parents of third grade children in the 18 participating schools informing them of the study and seeking consent for their child to participate. For the purposes of this article, as children continued to enter the study over time consent rates were calculated at the end of Year 2. The overall consent rate was 64.54% across schools (range = 44%-79%); consent rates did not differ between intervention (65.2%) and control (63.7%) schools. Nonparticipants included children whose parents did not speak English or Spanish well enough to consent and special needs children who could not be interviewed even on an individual basis (e.g., because of autism). Demographic and achievement comparisons between consented and nonconsented children were conducted using school records data (with nonconsented children's records stripped of identifiable information), and while significant differences were found for gender (fewer male participants, Cohen's d = .15) and school absences (higher absences for nonparticipants, Cohen's d = .21), their effect sizes were small. No differences were found for children's race ⁄ ethnic status, receipt of free lunch, number of suspensions, and New York state reading and math test scale scores. Furthermore, there were no differences in strength of association between demographic and achievement variables and children's consent status between intervention and control schools. These results make us confident that we have obtained a representative sample of children from the 18 schools.\nWith regard to outcomes, at each wave teachers completed questionnaires rating the language and literacy skills, as well as social competence and externalizing problems of each consented child in their class. Teachers were paid the union wage of $36.50 per hour for survey completion at each assessment. At each wave, children also completed questionnaires rating their aggressive and prosocial cognitions, and their internalizing symptoms. Data were collected from the children in small class groups (n = 5-20). Questions were read aloud by a research assistant while a second research assistant circulated to monitor children's placement of responses and answer their questions. Children who were either nonconsented or consented but refused assent, worked on an alternative activity with their classroom teacher."}, {"section_title": "Intervention", "text": "The 4Rs Program (Reading, Writing, Respect and Resolution) is a universal, school-based intervention in literacy development and social-emotional learning that integrates a focus on social and emotional development into the language arts curriculum for children in grades K-5. Developed and run by a community-based nonprofit organization called the Morningside Center for Teaching Social Responsibility (MCTSR), the 4Rs Program uses high quality children's literature as a springboard for helping students gain skills and understanding in the areas of handling anger, listening, assertiveness, cooperation, negotiation, mediation, building community, celebrating differences, and countering bias. By highlighting universal themes of conflict, feelings, relationships, and community, the 4Rs curriculum adds social and emotional meaning and skill building to rigorous literacy instruction.\nThe 4Rs Program has two primary components: (a) a comprehensive 7-unit, 21-35 lesson, literacy-based curriculum in social-emotional learning; and (b) 25 hr of training followed by ongoing coaching of teachers to support them in teaching the 4Rs curriculum with a minimum of 12 contacts in one school year. Each of the seven curricular units is organized around a specific grade-appropriate children's book. Each unit begins with a comprehensive book reading and discussion, ensuring students understand the primary themes of the story and allowing them to connect the themes to their own lives. This is followed by three to five social-emotional learning skill lessons in which children are able to practice specific skills in the context of a larger discussion of the book. The lessons are designed to engage the children in the learning and practice of social-emotional, conflict resolution, and community building skills relevant to each unit. Each unit also includes additional activities and related readings. The curriculum provided to teachers (i.e., the seven units and accompanying lessons) is detailed in a standardized, grade-specific teaching guide.\nIntensive professional development for teachers using the 4Rs curriculum includes a 25-hr introductory training course, and ongoing classroom coaching by a 4Rs staff developer from Morningside Center. Teachers receive Learning Kits with a full set of materials needed to implement the program, including the children's books, the manualized teaching guide for the appropriate grade, and the parent guide. The introductory training is designed to: (a) introduce the teachers to the curricular units, children's books, lessons, and activities; (b) provide opportunity for teachers to practice conflict resolution skills at the adult level through role play and experiential learning; and (c) to inspire them to employ curricular ideas and skills in their own professional and personal lives. Ongoing classroom coaching encompasses class lesson modeling and workshops led by the staff developer, co-planning and teaching of lessons by the teacher and staff developer, and lessons observations and feedback. Staff developers convene regular conferences with teachers either one-on-one or in a grade-specific group. A full cost study for this evaluation has not yet been completed; however, the estimated implementation cost of the 4Rs Program for this evaluation study is approximately $90.00 per child per year.\nSchool-wide implementation of the two primary 4Rs components (curriculum delivery and teacher training and coaching) was systematically tracked and monitored during the course of the study. Implementation data from Year 1 show that teachers in the nine intervention schools received (a) on average 2.4 (SD = 0.33) days of training in the delivery of the 4Rs curriculum, and (b) an average of 38 (SD = 9.6) days of coaching per school. On average, teachers delivered three-quarters of a lesson per week, with the majority closer to the benchmark of one lesson per week. The majority of teachers spent on average between 20 and 25 total hours on 4Rs during Year 1 (40 min ⁄ week). Year 2 implementation data reveal a slight decrease in training days, coaching days, average classroom lessons per week, and amount of time spent on 4Rs per week. Our data indicate that teachers trained in the 1st year of the study who remained in the school the following year were closer to program benchmarks (i.e., on average they implemented one lesson ⁄ week and spent 50 min on 4Rs per week).\nInformation on the implementation of various social and character development activities was also gathered from all third-, fourth-, and fifth-grade teachers in both intervention and control schools using a measure developed for the broader SACD research program. The percentage of control teachers reporting using any SACD activities in their classroom ranged from 75.6% to 85.6% over the three full years of the study. A greater percentage of intervention compared to control teachers reported using any SACD activity in Year 1 (effect size = .31), as well as specific activities targeting violence prevention ⁄ peace promotion (effect size = .50) and social and emotional development (effect size = .52; SACD Research Consortium, 2008)."}, {"section_title": "Measures", "text": "All scale scores were computed as the mean across the items for each construct. Basic psychometric properties and mean levels for each construct at each time point are presented by intervention and control groups (see online Supporting Information Table S1 ). These measures are theoretically based (e.g., from Dodge (1986) and Social Information Processing Theory; Selman (2003) and Developmental-Structural Theory) and have been shown to be psychometrically valid with low-income, multiethnic groups (e.g., Dalberg, Toal & Behren, 1998) . Moreover, they have been used by our team in previous work evaluating the RCCP (Aber et al., 1996) . The primary constructs and measures are presented by domain, followed by the child baseline covariates and classroom covariates."}, {"section_title": "Social-Cognitive Processes", "text": "Hostile attribution biases were measured using child self-reports on an adaptation of the Home Interview Questionnaire (Dalhberg, Toal, & Behrens, 1998; Dodge, 1986) . A series of six vignettes that depict ambiguous but provocative social scenarios is read aloud while pictorial representations of the scenarios are presented (e.g., a student's milk carton is spilled on another child's back). Following presentation of each vignette, children are presented with four possible causal attributions regarding the intent of the provocateur and are asked to select one causal attribution. Two attributions refer to the provocateur's intent as benign or accidental = 0 (e.g., the milk was spilled accidentally) and two responses describe the provocateur's intent as hostile or purposeful = 1 (e.g., the student was being mean). Cronbach alphas for this scale across the four waves range from .76-.81.\nAggressive interpersonal negotiation strategies were also self-reported using an adaptation of the Home Interview Questionnaire (Dalhberg et al., 1998; Dodge, 1986) . Following the presentation of each vignette and causal attributions, children are presented with four response strategies about what they would do next in the scenario and are asked to select one strategy. Three response strategies are nonaggressive or benign = 0 (e.g., act like nothing happened) and one strategy is aggressive or hostile = 1 (e.g., spill paint on the child). Cronbach alphas for this scale across the four waves range from .89-.91.\nNormative beliefs about aggression were measured using the Normative Beliefs about Aggression Scale (Huesmann & Guerra, 1997) , a measure design to assess children's beliefs about the acceptability of the use of aggression in certain situations. The total normative beliefs scale ranges from (1) low normative beliefs, the use of aggression is ''perfectly OK,'' to (4) high normative beliefs, the use of aggression is ''really wrong'' and includes 12 items. Cronbach alphas for this scale across the four waves range from .85-.92."}, {"section_title": "Social-Emotional Symptomatology", "text": "Child ADHD Symptoms was measured using teacher reports on nine items from the ADHD Symptomatology Scale (Milch, Loney, & Landau, 1982) . This questionnaire asks teachers about children's typical behaviors observed within the past 30 days and is rated on a 4-point scale (never = 1; almost always = 4). The scale includes two subscales: Hyperactivity (e.g., is excitable or impulsive) and Inattentiveness (e.g., has difficulty organizing tasks or activities). Cronbach alphas for this scale across the four waves range from .91-.92.\nDepressive symptoms were assessed via self-reports of depressive symptoms on the Diagnostic Interview Schedule for Children Predictive Scales (Lucas et al., 2001 ). This questionnaire contains six items that ask children about whether they have experienced particular depressive symptoms (e.g., ''Has there been a time when nothing was fun for you and you just weren't interested in anything?'' in the past year [for Wave 1] or since the new year [for Wave 2]). Items are rated on a 2-point scale (no = 0; yes = 1). Cronbach alphas for this scale across the four waves range from .49-.86.\nAggressive and prosocial fantasies were measured using self-reports on the What I Think instrument (Rosenfeld, Huesmann, Eron, & Torney-Purta, 1982) . The Aggressive Fantasies subscale contains six items that ask children about aggressive thoughts that just ''pop into your head'' or ''daydreams'' (e.g., daydreams about hitting or hurting someone; pretending to fight with someone). The Prosocial subscale contains six items that ask children about prosocial thoughts that just ''pop into your head'' or ''daydreams'' (e.g., daydreams about helping other kids, about doing nice things for other kids). Items are rated on a 3-point scale (no = 0; a lot = 2). Cronbach alphas for these scales across the four waves range from .59-.74."}, {"section_title": "Aggressive and Prosocial Behavior", "text": "Child Aggression was measured using teacher reports of aggression on the Behavioral Assessment System for Children (Reynolds & Kamphaus, 1998) . This questionnaire asks teachers about children's typical behaviors observed within the past 30 days, and includes 13 aggressive behavior items (e.g., physically aggressive, threatening or critical of others). Items are rated on a 4-point scale (never = 1; almost always = 4). Cronbach alphas for this scale across the four waves range from .95-.96.\nChild Social Competence was measured using teacher reports on the 18 item Social Competence Scale (CPPRG, 1999) , which includes two subscales: Prosocial Behaviors (e.g., is good at understanding other people's feelings) and Emotion Regulation (e.g., can calm down when excited or all wound up). Cronbach alphas for this scale across the four waves were .97."}, {"section_title": "Academic Functioning", "text": "Academic skills were measured from teacherreports on items adapted from the Early Childhood Longitudinal Study, Kindergarten Cohort of 1998-1999 (ECLS-K), 3rd Grade Assessment. Nine items tap the degree to which a child has acquired and demonstrates the targeted language and literacy skills, knowledge, and behaviors appropriate for third graders (e.g., reads fluently, conveys ideas clearly, composes multiparagraph stories). Items are rated on a 5-point scale (not yet = 1; proficient = 5). Cronbach alphas for this scale across the four waves range from .96-.97.\nStandardized math and reading achievement were measured using children's scaled scores on the New York State standardized assessments of math and reading achievement at the end of third grade for the 2004-2005 school year and at the end of fourth grade for the 2005-2006 school year. Attendance rate was obtained from the NYC Department of Education. Attendance rate was assessed as the proportion of full days present in school during children's third and fourth grade school years (2004-2005; 2005-2006) .\nWhile there were no main effects of intervention on teacher reports of children's academic skills or on the three school records outcomes, there were intervention by baseline behavioral risk interactions for standardized math and reading achievement and for teacher-reported academic skills. In short, children identified by teachers at greatest behavioral risk at baseline showed greater improvements as a result of exposure to 4Rs in their math and reading achievement and in teacher reports of their academic skills. Importantly, this set of intervention by baseline behavioral risk interactions were not evident for the social-emotional outcomes, regardless of the type of model examined (i.e., as a growth model estimating intervention effects on growth parameters, or a basic point-in-time model estimating intervention effects on Wave 4, controlling for baseline levels). This suggests these intervention by risk interactions are not an artifact of the form of model applied, but instead are tied to the developmental domain examined: children's academic functioning and not, in this case, their social-emotional skills.\nThis set of findings builds upon and expands those identified after only 1 year of intervention (Jones et al., 2010) . After 1 year, we saw main effects for children's self-reports of HAB and depressive symptomatology; but there were no intervention main effects for child reports of AINS, and teacher reports of ADHD, social competence, and aggression. In addition, consistent with the moderating role of baseline behavioral risk after 2 years reported here, there were intervention by baseline behavioral risk interactions for teacher reports of children's academic skills and for children's school attendance after 1 year, with children at greatest risk showing the most substantial gains over time as a result of the 4Rs Program in the academic domain. Overall, the intervention main effects reported after both 1 and 2 years, are small in size (ranging in size from .05 for the teacherreported aggression slope to .22 for the depressive symptoms slope). In contrast, the interactions of intervention with baseline behavioral risk are represented by effects for the highest risk group of moderate size (ranging from .56 for math achievement and academic skills to .60 for reading achievement).\nTogether, these findings indicate two primary types of effects of this universal intervention through the 2nd year. First, consistent with social information processing theory (e.g., Dodge, 1986) , developmental-structural theory (e.g., Selman, 2003) , and with our own prior work (Aber et al., 2003) , we see effects for the general population of children in child reports of their social cognitions (i.e., HAB, AINS) and their social-emotional symptomatology (ADHD and Depressive Symptoms). Interestingly, intervention effects appear for children's AINS only after 2 years and after we see consistent positive changes over 2 years in their hostile attributions and depressive symptoms. Second, consistent with our theory that changes in children's social cognitions about aggression would lead to changes in their behavior, we see universal effects of the 4Rs Program after 2 years on teacher reports of aggressive behavior and social competence. While, this overall pattern is suggested by the findings, we have not yet conducted a direct test of the degree to which 4Rs-induced changes in children's social cognitions and social-emotional symptomatology lead to subsequent changes in their behavior.\nConsidering these findings from another perspective, there is growing evidence in the field of prevention science for ''sleeper effects,'' especially with respect to the prevention of externalizing behaviors such as conduct problems (e.g., Tremblay et al., 1995) and antisocial behavior (e.g., Smolkowski et al., 2005) . In our case, we expected that the early changes we see for 4Rs children in HAB would translate into later changes in aggressive behavior. Consistent with the notion of sleeper effects, and with the application of cascades theory and translational research to developmental trajectories, we expect the changes we are currently seeing in children's social cognitions and their aggressive behavior to offset problematic delinquent behaviors in later elementary and middle school when these more serious behaviors begin to increase. We also expect some of the early effects we are observing in depressive and ADHD symptoms to translate into universal benefits in other developmental domains later in elementary school and in middle school (e.g., reduced academic disengagement ⁄ failure and delayed onset of substance use; e.g., Eddy, Reid, Stoolmiller, & Fetrow, 2003; Lochman & Wells, 2004) . The long-term effects of the 4Rs on such related outcomes are the focus of a follow-up study in middle school.\nFinally, consistent with developmental contextualism (Cicchetti & Aber, 1998) , we see 2-year effects for a targeted group of children at highest behavioral risk on their academic functioning; specifically children's scores on standardized tests of math and reading skills and teacher reports of children's academic skills. These findings are consistent with other experimental evaluations of school-based interventions that target primarily children's externalizing behavior problems. For example, the most recent report from the CPPRG indicates that the Fast Track Program showed significant effects for diagnoses and behavior in the externalizing domain (e.g., diagnoses of conduct disorder and antisocial behavior scores) for children after grades 3, 6 and 9, but only for children identified at Kindergarten at highest behavioral risk (using parent and teacher reports; CPPRG, 2007). In addition, Van Lier, Muthen, van der Sar, and Crijnen (2004) report positive impacts of the Good Behavior Game, a classroom-based behavior management program, on trajectories of conduct problems from grades 1 to 3 for children with the highest levels of disruptive behavior at baseline (Fall first grade), with similarly sized effects to those reported here (ES = .55).\nEach of these studies report the impact of interventions that target one domain of functioning (i.e., externalizing behavior problems) on outcomes in that domain for children at highest behavioral risk at baseline. This study is, in contrast, the second in this project, and the first study we know of that reports significant experimental impacts of a universal, integrated, school-based social-emotional learning and literacy intervention for a subgroup of children identified based on functioning in one developmental domain, on outcomes in another developmental domain. In other words, this study reports effects of this integrated intervention on children identified at baseline as having serious behavioral difficulties on outcomes in the academic domain.\nFuture work with our sample will be focused on identifying the specific processes by which this universal intervention has impacts for this subgroup of children. For example, do universal, school-level population changes in the degree to which children generally attribute hostile intent to ambiguous provocations, in their aggressive and inattentive behaviors and their socially competent behavior, create the conditions in which children with particular problems (i.e., high level of behavioral difficulties) have greater learning opportunities (e.g., greater access to the teacher's focused attention)? These findings are consistent with the notion of developmental cascades (Masten & Cicchetti, 2010) and provide strong evidence for the power of translational research to influence developmental studies of trajectories of aggressive and competent behavior, particularly studies which address multiple domains of development and which consider the nuanced intersections between simultaneous changes in whole populations of children and those at particular need.\nWhile this study has several strengths, our conclusions are tempered by limitations. A primary limitation is that our analyses were limited to outcomes at the end of the 2nd year of this 3-year intervention. With continued high quality and quantity implementation, we expect these impacts to both be sustained through the end of the 3rd year in the areas for which we already see impacts, and to expand to additional outcome domains. If, on the other hand, implementation quality and ⁄ or quantity diminishes in the 3rd year, we may see the effects reported to date attenuated.\nA second factor to consider when interpreting the findings reported here is program implementation. As described in the Method section (a) there was both variability in implementation of the 4Rs Program in the intervention schools and the quantity of program implementation was below benchmarks, and (b) there was a great deal of program activity in the control schools in the broad domain of social and character development. That control schools were implementing programs and doing activities in the social and character domain to the degree they were is not surprising given the dramatic growth in interest in social-emotional learning in the last decade (Payton et al., 2008) . Nonetheless, the intervention schools were implementing significantly more social and character activities, particularly and not surprisingly, those addressing violence prevention and social and emotional development. These implementation data underscore the need to examine intervention effects in a manner that both accounts for dosage, and for implementation of similar forms of intervention activities in the control schools using sophisticated methodological tools (e.g., propensity scores, Lochman, Boxmeyer, Powell, Roth, & Windle, 2006) . It is possible that such analyses will reveal stronger effects of the 4Rs, suggesting that our current findings may underestimate the impact of the 4Rs on children. These implementation data also provide a view into the possible sustainability of 4Rs in our research schools, or likely take-up of 4Rs in new schools. It is clear from the data from school districts, principals, and other decision makers in the control group that school officials are interested in social-emotional learning programs and have been purchasing and implementing a wide variety of programs in their schools. Our initial, rigorous empirical support for the 4Rs, combined with its relatively low cost (see Method) , indicate that this program shows promise for its sustainability and scalability beyond the intensive support provided by this research program.\nA third limitation is that the embedded nature of the intervention itself, and the design of the evaluation, precludes any ability to disentangle the impact of specific program components. As such, we cannot determine whether the activities in socialemotional learning are primarily responsible for outcomes in this domain, or whether the literacy activities are primarily responsible for outcomes in the academic domain.\nDespite these limitations, this report of 2-year impacts of an integrated, social-emotional and literacy program provides evidence that this universal intervention has both universal impacts on social-cognitive processes and behaviors in the social-emotional domain, and subgroup impacts in the academic domain. This study provides good evidence that universal school-based interventions, delivered to whole populations of children, can result in positive changes in children's developmental health and well-being."}, {"section_title": "Baseline Covariates", "text": "Household socioeconomic status (SES) risk index was calculated as the sum of four parent-reported, dichotomous demographic characteristics at baseline; single-parent household, less than high school education, poverty at or below 100% of the federal poverty level, and unemployment. For children with missing parent-reported risk indicators, these values were imputed based on child school, gender, and race ⁄ ethnicity.\nCommunity risk was measured from parentreports on the Community Risks and Resources Questionnaire (Forehand et al., 2000) . Parents are asked to rate how well seven statements describe their neighborhood (e.g., people roam streets and carry weapons, drugs are sold or used, houses ⁄ apartments are in poor condition). Items are rated on a 4-point scale (not at all = 1; a lot = 4). For children with missing parent-reported community risk indicators, these values were imputed based on child school, gender, and race ⁄ ethnicity.\nChild behavioral risk was measured from baseline teacher-reports of aggression and conduct problems on the Behavioral Assessment System for Children (Reynolds & Kamphaus, 1998) . This questionnaire asks teachers about children's typical behaviors observed within the past 30 days, and includes 13 aggressive behavior items (e.g., physically aggressive, argumentative, threatening or critical of others) and 11 conduct-disordered behavior items (e.g., steals, truancy). Items are rated on a 4-point scale (never = 1; almost always = 4). Behavioral risk was calculated based on a nationally normed t-score average (t = 63.5 and 62.9 for aggressive behavior and conduct disorder, respectively). Children were grouped at baseline according to whether they were below the t-score cutoff on both behaviors = 0, at or above the cutoff on one behavior = 1, or above the cutoff on both behaviors = 2.\nIn addition to this set of child baseline covariates, child gender and race ⁄ ethnic background were included. To account for potential teacher effects owing to the fact that teachers change between the 2 years of the study (i.e., from third to fourth grade), a set of key teacher ⁄ classroom covariates were also included at the child level in the models for teacher-reported outcomes. These included Teacher Burnout (Maslach, Jackson, & Schwab, 1996) , Teacher Experience, and Classroom Size. It should be noted that because these constructs reflect the entire period of growth examined in this article, and were included primarily as a way to control for changes in the teachers reporting on children over time, their associations with growth and change in the outcomes of interest are not presented next but are included in the relevant table."}, {"section_title": "Results", "text": "The results will be described in two parts. First, a set of preliminary analyses are presented, followed by results from a series of hierarchical linear growth models employed to address the study's primary questions."}, {"section_title": "Preliminary Analyses", "text": "Descriptive statistics for the primary child outcomes at Wave 1 (baseline, Fall third grade), Wave 2 (Spring third grade), Wave 3 (Fall fourth grade), and Wave 4 (Spring fourth grade) are presented for the sample overall and by intervention group (see online Supporting Information Table S1 ). As expected, owing to the matching and randomization procedures we employed, there were no differences in mean levels of the outcomes at baseline by intervention group.\nA series of independent samples t-tests, analyses of variance, and bivariate correlations were employed to examine basic mean differences in Wave 1 (baseline, Fall 2004) measures of the child outcomes by key baseline covariates including: child gender, child race ⁄ ethnic background, baseline behavioral risk, household SES risk, and community risk. Findings from these analyses are consistent with those presented next in which the association between baseline covariates and the growth parameters (intercept and slope) are described, and are therefore not presented in detail here. Complete tables from these analyses are available from the first author upon request."}, {"section_title": "Main Analyses Analytic Strategy", "text": "As described in the Method section, schools were matched into pairs prior to randomization on 20 characteristics, including such constructs as size, race ⁄ ethnic composition, reading achievement, per pupil expenditures. Thus, the data presented here are nested: time (four repeated assessments) is nested in children, children are nested in schools, and schools are nested in their matched pairs. To accommodate these design features, estimates of intervention impact on change in the primary child outcomes from preintervention baseline (Wave 1, Fall 2004) to the fourth time point (Wave 4, Spring 2006) were calculated using a series of three-level hierarchical linear growth models with matched pair fixed effects in HLM 6.02. In these models, Level 1 represents time (i.e., the four repeated assessments of the constructs of interest for each child), Level 2 represents the child, and Level 3 represents schools. All child-and classroom-level covariates were included at Level 2. Level 3 included an intervention dummy as well as eight school pair dummies to represent the school matches. In addition, as indicated in the Introduction, both in response to the growing literature reporting stronger effects of school-based interventions for high-risk children (e.g., CPPRG, 2007) and building on our findings from the 1st year of the study (Jones et al., 2010) , we examined a number of cross-level intervention by baseline covariate interactions. In interpreting the results, we adhere to the traditional benchmarks for considering an alpha level of p < .05 as statistically significant, but given the nature of the design (resulting in only 8 df to estimate the intervention effect), we note effects up to the .10 level, particularly in the case of interactions (McClelland & Judd, 1993) . In addition, for both main and interaction effects, we report effect sizes (e.g., McCartney & Rosenthal, 2000) . Following procedures adapted from Snijders and Bosker (1999) , effect sizes for the growth models were calculated by dividing the relevant intervention estimate by an estimated standard deviation of the outcome (calculated from a fully unconditional three-level model as the square-root of the total variance). Effect sizes for the two-level models employed for the school record outcomes were calculated by dividing the estimate of the intervention effect by the standard deviation of the control group (Jones et al., 2010) .\nIn the following presentation, we describe results from three models: (a) a series of unconditional models designed to determine the most appropriate functional form to represent change in the childand teacher-reported outcomes (as primarily linear or curvilinear), (b) building from the unconditional models, a set of models that include intervention status and the full set of baseline covariates as predictors of the intercept and the relevant growth parameters, and (c) models in which intervention status is interacted with each baseline covariate. As noted in the Method section, we chose and included a set of classroom covariates to account for changes in the teachers reporting on children between years and for any potential influence of the intervention on teachers and their reports on children, resulting in a very conservative assessment of the impact of intervention on children's outcomes. In addition, we provide additional support for intervention effects on the growth parameters by conducting a set of parallel but simpler models in which the impact of intervention on Wave 4 (Spring 2006) was examined controlling for baseline levels and for the baseline covariates. Finally, because the school records data were only available for two time points (i.e., no preintervention baseline, and once in the Spring of each year), these models were estimated slightly differently as presented next."}, {"section_title": "Unconditional Models", "text": "To determine the most appropriate functional form for each outcome three models were compared: intercept only; intercept-slope; and intercept-slope-quadratic. Model comparisons were conducted using a method similar to the chi-square difference test frequently applied to structural equation models. In this case, the statistical significance of changes in the Deviance statistic between models, given parallel change in degrees of freedom between models, were examined. In all cases, intercept-slope models were significantly better than intercept only models. With respect to child self-report outcomes, in all cases, the interceptslope-quadratic model was a significantly better fit than the intercept-slope only models. However, despite the better fit of the model, the quadratic parameter itself was not significant for any childreported outcomes. In contrast, for teacher-reported outcomes (Academic Skills, Aggression, Social Competence, and ADHD Symptoms), the interceptslope-quadratic models did not provide a better fit to the data than did the intercept-slope only models. In general, consistent with our prior work (e.g., Aber et al., 2003) , children showed growth over the four repeated assessments in negative outcomes (e.g., HAB, AINS, aggressive fantasies) and declines over time in positive outcomes (e.g., prosocial fantasies). In general, children's academic skills increased over the course of each academic year, and their scaled scores on standardized tests of reading and math achievement increased between school years.\nBased on this set of models, intervention effects were estimated for the intercept, slope, and quadratic parameters for the child-report outcomes, and for the intercept and slope parameters only for the teacher-reported outcomes. In addition, intervention by baseline covariate interactions were estimated only for the appropriate growth parameters for each reporter ⁄ outcome. Finally, because the form of the final models differ between child-and teacher-reported dependent variables, results are reported next first for child self-reported outcomes, followed by teacher-reported outcomes, and then for school record outcomes."}, {"section_title": "Main Effects of Intervention and Baseline Covariates", "text": "Child self-reports. Intervention effects were estimated for three parameters: the intercept, centered at Wave 1 and representing intervention-control differences at the preintervention baseline (Fall 2004) , the slope representing intervention-control differences in linear change in the outcome of interest across the four repeated assessments, and the quadratic parameter representing intervention-control differences in acceleration or deceleration of the trajectory over the four repeated assessments. As presented in Table 2 , there were no interventioncontrol differences at the preintervention baseline for any outcome examined (i.e., no significant effects for the intercept parameter). This suggests that our process of pairwise matching and randomizing schools was successful in creating equivalent groups at baseline. There were intervention-control differences in the slope parameter for two of the six childreport outcomes, one with a p-value < .1 (HAB, ES = .14, see Figure 1) ; and the other with a p-value < .05 (Depressive Symptoms, ES = .22). The effects are supported by intervention effects for Spring 2006 (Wave 4) levels of HAB, at p < .05 (ES = .25), controlling for baseline levels. There was an intervention effect on the quadratic parameter for AINS at p < .1 (ES = .08, see Figure 2 ), which indicates that the paths for the intervention and control groups begin to diverge at the beginning of the 2nd year of exposure to the 4Rs Program. This effect is supported by significant intervention effects on Spring 2006 (Wave 4) levels of AINS (ES = .42), controlling for baseline levels. There were no intervention effects for normative beliefs about aggression, aggressive or prosocial fantasies.\nAs shown in Table 2 , with regard to the impact of the baseline covariates, there were few intercept associations with the exception of gender for AINS, normative beliefs about aggression, and aggressive fantasies (with girls showing lower levels of aggressive strategies and fantasies at baseline), and baseline behavioral risk for higher HAB, AINS, aggressive and prosocial fantasies. There were few significant effects of the baseline demographic characteristics on the slope or quadratic parameters.\nTeacher reports. For teacher-reported outcomes, intervention effects were estimated for two parameters: the intercept, centered at Wave 1 and representing intervention-control differences at the preintervention baseline (Fall 2004) , the slope representing intervention-control differences in linear change in the outcome of interest across the four repeated assessments. As with the child-report outcomes, as shown in Table 3 , there were no intervention-control differences at the preintervention baseline for any outcome examined (i.e., no significant effects for the intercept parameter). There were intervention-control differences in the slope parameter for three of the four teacher-report outcomes: teacher-reported ADHD Symptoms at p < .1 (ES = .12) which was accounted for in follow-up analyses by one of its subscales, Hyperactivity, ().093 (.05), p < .10, ES = .13); teacher-reported Social Competence at p < .05 (ES = .14) which was accounted for in follow-up analyses by one of its subscales, Prosocial Behavior, (.135 (.05), p < .05, ES = .18); and teacher-reported Aggression at p < .05 (ES = .05). The effect for teacher-reported Aggressive Behavior is supported by significant intervention effects on Spring 2006 (Wave 4) levels of Aggression also at p < .05 (ES = .21), controlling for baseline levels. There were no intervention effects for teacher report of Academic Skills.\nAs shown in Table 3 , there were a number of effects of the baseline covariates for the intercept parameter. Specifically, there were significant effects of gender on the intercept parameter such that teachers reported girls as having significantly lower levels of Aggression, ADHD Symptoms, and higher levels Social Competence and teacherreported Academic Skills at baseline than boys. Teachers also reported Black children as having significantly higher levels of Aggression and lower levels of Social Competence compared to White children at baseline. Children rated as high on baseline behavioral risk were rated as significantly higher in intercept levels of Aggression, ADHD Symptoms, and lower in levels of Social Competence and Academic Skills. With regard to slope, children rated as high on baseline behavioral risk showed steeper declines in Aggression, ADHD Symptoms, and steeper increases in Social Competence. These somewhat unexpected slope effects are likely because of the high levels of these constructs at baseline for children rated as high on baseline behavioral risk.\nSchool records. As noted earlier, the three school record outcomes were examined as two-level models with Year 2 scores as the dependent variable, the same set of baseline covariates presented before included at Level 1, and intervention and the eight school pair matches included at Level 2. (For attendance rate, these analyses were also Note. Eight dummy variables representing eight of the nine school-level matched pairs are included in all models at the school level (Level 3) along with estimates of intervention on intercept, slope, and quadratic, with pair 9 serving as the referent group. HAB = hostile attributional biases; AINS = aggressive interpersonal negotiation strategies; NOBAGS = normative beliefs about aggression; AGGFANT = aggressive fantasies; PROFANT = prosocial fantasies; DEP = depression; CR = child report. p < .10. *p < .05. **p < .01. ***p < .001.\nconducted including attendance from the year prior to the onset of the study [i.e., when children were in second grade], and the intervention findings did not differ from what is reported here.) A baseline measure of the dependent variable could not be included in these models as universal testing did not begin until children were in third grade.\nAs shown in Table 4 , there were no main effects of intervention for any of the three school record variables. There were main effects for baseline behavioral risk on the academic outcomes, including math achievement, reading achievement, and attendance such that children rated as high on baseline behavioral risk scored lower on standardized tests of math and reading achievement, and had lower rates of school attendance at the end of Year 2. In addition, for all three school record outcomes, there was a significant effect of socioeconomic risk at baseline, such that children with higher levels of socioeconomic risk did worse on the three indicators of school achievement at the end of Year 2."}, {"section_title": "Interaction Effects of Intervention by Baseline Child-Level Covariates", "text": "As noted earlier, cross-level interactions between intervention and the child-level baseline covariates (child gender, race ⁄ ethnic background, baseline behavioral, community, and SES risk) were estimated in a second set of models for the intercept, slope, and quadratic parameters for child-report outcomes, for the intercept and slope parameters for the teacher-report outcomes, and for the twolevel models for the school record outcomes. There were no statistically significant intervention by baseline covariate interactions with three exceptions: as shown in Table 4 , there were interactions of intervention by baseline behavioral risk for children's math achievement at p < .1 and children's reading achievement at p < .05. As shown in Figure 3 for math achievement, children with the highest level of baseline behavioral risk (based on teacher reports) show the greatest positive difference in math achievement between the intervention and control groups with effect sizes of .56 for a score of 2 on behavioral risk, of .18 for a score of 1, and .14 for a score of 0. For reading achievement a similar pattern holds, with effect sizes of .60 for a score of 2 on behavioral risk, of .39 for a score of 1, and .06 for a score of 0. In addition, there was a significant intervention by baseline behavioral risk interaction for teacher report of academic skills in the model that estimated intervention impacts on Wave 4 levels of academic skills controlling for baseline levels and covariates (0.35 (.18), p < .1, see Figure 4 ). Again, the pattern of this interaction is consistent with the school records outcomes, such that children with the highest level of baseline behavioral risk (based on teacher reports) show the greatest positive difference in teacher-reported Academic Skills between the intervention and control groups with effect sizes of .56 for a score of 2 on behavioral risk, of .25 for a score of 1, and .13 for a score of 0. Note the form of this analytic model is parallel to those conducted for the school Figure 2 . Impact of intervention on aggressive interpersonal negotiation strategies quadratic parameter. record outcomes, however, in this case, baseline levels of the dependent variable were controlled. Interactions were also tested in these models (i.e., Wave 4 controlling baseline levels) for the socialemotional outcomes (both child-and teacher-report) and no additional interactions were detected."}, {"section_title": "Co nt ro l", "text": ""}, {"section_title": "Inter ven on", "text": ""}, {"section_title": "Discussion", "text": "This article presents 2-year, longitudinal experimental impacts of a universal, integrated intervention in elementary schools that embeds instruction in social-emotional learning into a balanced literacy curriculum. The article was designed to address a number of limitations in current research on whole school reform initiatives designed to prevent behavioral and academic maladaptation and promote children's social and emotional development.\nTo begin, consistent with the 4Rs program theory and with developmental cascades theory, it focuses on outcomes in multiple domains, addressing key social-cognitive processes and behaviors, as well as academic outcomes. In addition, the data presented are analyzed in a manner consistent with the randomized, experimental design of the evaluation and with the developmental nature of the longitudinal data, estimating intervention effects at the school level on children's developmental growth parameters across four repeated time points. As such, and as noted in the beginning of the Results section, in interpreting the results we adhere to the traditional benchmarks for considering an alpha level of p < .05 as statistically significant; but given the nature of the design (resulting in only 8 df to estimate the intervention effect), we report effects up to the .10 level, particularly in the case of interactions (McClelland & Judd, 1993) . Note. Eight dummy variables representing eight of the nine school-level matched pairs are included in all models at the school level (Level 3) along with estimates of intervention on intercept and slope, with pair 9 serving as the referent group. ADHD = attention ⁄ hyperactivity symptoms; AGG = aggression; S-COMP = social competence, AC SKILL = academic skills; TR = teacher report. p < .10. *p < .05. **p < .01. ***p < .001.\nConsistent with the dual focus of the 4Rs Program and with the emphasis of translational research on the promotion of social-emotional well-being as well as the prevention of problems, the primary findings presented in this article are summarized next by broad outcome domain. The findings are then considered in the context of intervention impacts after only 1 year of intervention (Jones et al., 2010) . Note. Eight dummy variables representing eight of the nine school-level matched pairs are included in all models at the school level (Level 2), with pair 9 serving as the referent group. MATH = math achievement, READ = reading achievement, ATTEND = attendance rate; SR = school records. p < .10. *p < .05. **p < .01. ***p < .001. "}, {"section_title": "Social-Cognitive Processes and Social-Emotional Symptomatology", "text": "The evidence presented in this article suggests that over two consecutive years, children in 4Rs schools reported slower rates of increase in HAB, a slowed rate of growth in AINS that appears to begin toward the outset of the 2nd year of exposure to intervention, and a steeper rate of decline in depressive and ADHD symptoms compared to children in the control schools."}, {"section_title": "Aggressive and Socially Competent Behavior", "text": "Teachers in 4Rs schools reported slower growth in children's aggressive behavior (compared to increases in control schools), and increases in social competence (compared to declines in control schools) over two school years."}, {"section_title": "Implications for Policy and Practice", "text": "The translational value of this study also extends to both practice and policy arenas. From the standpoint of practice, our current evidence suggests that integrating pedagogical attention to building socialemotional skills through simultaneously enriching literacy practices, as instantiated by the 4Rs Program, can promote positive development in both social-emotional and academic domains. These findings challenge schools and school-based program practitioners to continue to conceptualize and operationalize a variety of practice models in which social-emotional and academic development can be fostered both in the classroom and in the school as a whole. From the standpoint of policy, findings from this study highlight the short-sightedness of educational policies that privilege and reward school and teacher attention to narrowly defined domains of development, such as academic performance at the exclusion of attention to children's social-emotional development. A growing theoretical and empirical literature supports the inextricably connected links between these domains and so we must now face the challenge of developing and adopting educational policies that both acknowledge and support this reality."}, {"section_title": "Supporting Information", "text": "Additional Supporting Information may be found in the online version of this article: Table S1 . Psychometric and Descriptive Characteristics of Dependent Variables at Wave 1 (Baseline), Wave 2, Wave 3, and Wave 4 by Intervention and Control Schools Please note: Wiley-Blackwell is not responsible for the content or functionality of any supplementary materials supplied by the authors. Any queries (other than missing material) should be directed to the corresponding author for the article."}]