[{"section_title": "", "text": "found that students with disabilities had higher rates of poverty than the general population, and that poor students with disabilities were even less likely to attend college. Nationally representative studies using data collected by the US Department of Education have examined whether students with disabilities are likely to matriculate in community college (Wagner et al., 2005) and measured their 3-year attrition (Mamiseishvili & Koch, 2012). The 3-year attrition rate among community college students with disabilities was estimated to be 51% (Mamiseishvili & Koch, 2012). Analysis of Beginning Postsecondary Students (BPS) data found lower persistence among students with orthopedic or physical conditions, learning disabilities, and psychiatric conditions compared with other health conditions, in bivariate analysis (Mamiseishvili & Koch, 2012). The underlying framework for this research design is the minority group model of disability (Hahn, 1988) which implies that people with health conditions should be considered as if they were racial, ethnic, religious, or sexual minorities (Beauchamp-Pryor, 2012). The minority group model argues that it is important to recognize the heterogeneity of health impairments, which is supported by economic models of earnings that show that the population does not divide into \"disabled\" versus \"non-disabled\" categories (Jones, 2011). This study compares people with each health condition with the population without that health condition, rather than comparing people with disabilities with each other."}, {"section_title": "Literature review", "text": "The prevalent model for college completion, Tinto's model, posits that students with greater academic and social integration are more likely to complete college (Tinto, 1993). Despite concerns about the relative lack of social opportunities and dormitories on community college campuses compared with 4-year colleges (Bailey & Alfonso, 2005;Flowers, 2006), some research has supported applying Tinto's theory to community colleges (Karp, Hughes, & O'Gara, 2010). Based on Tinto's theory, health conditions that reduce students' ability to interact with their peers and faculty could reduce their likelihood of graduation from community and 4-year colleges, even if the health conditions do not pose logical obstacles to class attendance. Crosnoe (2007) has proposed a further social process about how health conditions may reduce college matriculation through social stigma, psychological, and behavioral processes, independent of physical impact. Crosnoe contends in an analysis of obesity that while \"no consistent evidence links obesity to cognitive skills or scholastic abilities...the social stigma of obesity triggers psychological and behavioral responses that interfere with college matriculation\" (Crosnoe, 2007, p. 241). A systematic review of the impact of obesity stigma and psychological outcomes found a consistent association between obesity and reduced self-esteem (Sikorski, Luppa, Luck, & Riedel-Heller, 2015). The association between obesity and reduced self-esteem could explain reduced matriculation or social integration in college. Obesity-related stigma and discrimination in secondary and higher education has been noted for over 50 years (Canning & Mayer, 1966), but obesity predicts more negative impacts on educational attainment in contemporary cohorts (Fowler-Brown, Ngo, Phillips, & Wee, 2010.) Obese youth in a nationally representative sample of adolescents (National Longitudinal Study of Youth [NLSY], 1997) were less likely to graduate from 4-year college, but no such association was found in the 1979 NLSY, suggesting that despite the greater prevalence of obesity in the contemporary cohort, obesity-related stigma may have increased and may have a greater impact on college student success (Fowler-Brown et al., 2010). This result may suggest that social contexts with greater obesity prevalence may not have lower obesity-related stigma. Past research has used the Add Health data to study whether obesity predicted college matriculation (Crosnoe, 2007) and whether students with diabetes have lower college completion rates, employment, and wages in young adulthood (Fletcher & Richards, 2012). Some studies group many disabilities together into broad categories, rather than investigating individual disability types. A survey of 1289 former students with inactive disability files at 3 Midwestern public universities evaluated the association between disability type (physical disabilities, cognitive disabilities, and mental disorders) and graduation likelihood, but the study did not consider obesity as a disability (Pingry O'Neill, Markward, & French, 2012). Physical disabilities included hearing or vision impairments, mobility impairments, and disease-related impairments; cognitive disabilities included learning disorders, brain injuries, and attention deficit hyperactivity disorder; and mental disorders included DSM-IV psychiatric diagnoses. Students with physical disabilities were more likely than those with cognitive disabilities to graduate; services that predicted greater chances of graduation included distraction-reduced testing environments, deadline flexibility, learning skills assistance, and physical therapy (Pingry O'Neill et al., 2012). Other health conditions may also carry social stigma similar to that of obesity. For example, stuttering may carry social stigma that impairs interacting with college instructors (Daniels et al., 2011) and classmates (Hughes, Gabel, Irani, & Schlagheck, 2010) if instructors believe that students who stutter have substantial limitations. Research shows that youth with stuttering report reluctance to seek assistance from college faculty (Dorsey & Guenther, 2000;Gabel, Blood, Tellis, & Althouse, 2004;O'Brian, Jones, Packman, Menzies, & Onslow, 2011;Silverman & Zimmer, 1982).Youth who stutter commonly experience anxiety (Blood, Blood, Maloney, Meyer, & Qualls, 2007), and adults who stutter believe that it impairs their career advancement (Klompas & Ross, 2004). This exploratory analysis examines whether 57 health conditions predict college enrollment and degree completion for multiple credentials with increasing academic and time requirements -certificates, associates, and bachelors degrees -in a nationally representative sample of young adults, ages 25-32, a longer time period than would be permitted by standard educational datasets. Our study includes all high school graduates, not just those with health conditions perceived as disabilities, and it includes a broader set of health conditions, including overweight, stuttering, and wearing glasses. We also used multivariate analysis to see whether each condition predicted graduation after controlling for a wide range of potential confounders. If health impairments that do not pose logical obstacles to class attendance predict reduced chance of graduation for community college degrees (associates degrees and certificates) after controls, this study can address whether Tinto's theory applies to community college students."}, {"section_title": "Methods", "text": ""}, {"section_title": "The Research Model", "text": "This study relies on a case-control research design to evaluate whether a broad array of factors predict non-persistence in college. Case-control study designs identify potential causes of diseases for further study and are often used by epidemiologists in preliminary studies of disease etiology (Schulz & Grimes, 2002). In a case-control study, people with a disease are compared with those without the disease to identify potential predictors. Casecontrol studies do not provide definitive evidence about the causes of disease, but they guide future research. This study compares young adults who graduated from each type of college with those who did not."}, {"section_title": "Data", "text": "This study uses the National Longitudinal Study of Adolescent and Adult Health (Add Health), i a nationally representative sample of students in grades 7-12 interviewed in 1995, and followed in 2001 and 2008 with supplemental biomarkers (e.g., height and weight measurements and blood and urine tests) and surveys of parents. Our sample comprises respondents whose highest degree in 2001 was a high school diploma (n=9909). In 2001, the sample is 23.5% Black, 15.3% Hispanic, 7.6% Asian, 39.6% male, and on average 21.7 years old, and graduated high school at 18.4 years, on average. Values of the control variables for the full sample are in Table 1. We examine two subsamples: high school graduates enrolled in community college (n=1494) and in 4-year college (n=2721) in 2001. Add Health asks for a history of all credentials, but it lacks full enrollment histories; some of the 4-year college students may have been enrolled in community college prior to entering 4-year college without earning a credential."}, {"section_title": "Measures", "text": "This exploratory analysis identifies health conditions that predict postsecondary matriculation and educational attainment. We consider 57 health conditions derived from 32 survey items, listed in Table 2. This study used obesity (based on body-mass index calculated from participants' measured height and weight), perceived overweight, and items in the \"Illnesses, Medications, and Physical Disabilities\" section of Add Health administered to all respondents. 1 Items that did not represent lasting or significant health condition (vaccine receipt, alternative medicine use, emergency room use, being prescribed \"other\" non-specified drugs) or that were endorsed by few participants (e.g., having been prescribed male sexual performance drugs, reported by two respondents) were not analyzed. The full set of health conditions are considered in this analysis to avoid the appearance of false significance due to multiple comparison. We use three outcome variables: attaining any credential (certificate, associates degree (AA), or bachelors (BA) or above); attaining an associates degree or above; and attaining a bachelors degree or above. The missing data strategy is not critical when only small amounts of data are missing (van der Heijden, Geert, Donders, Rogier, Stijnen, & Moons 2006), or from variables where the standard errors are not going to be used (Gelman & Hill, 2007). Missing data were singly imputed and an indicator for missingness was included in the regression if more than 50 cases were missing, which was the case for high school grades. The indicator for missingness permits testing whether grades were missing for students with atypical high school grades. Single imputation predicts missing values from relevant present values, such as estimating average weight from a respondent's height, age, and gender, or using mean imputation when potential predictors are unclear."}, {"section_title": "Analysis", "text": "For bivariate analysis of the association between each level of educational attainment and each health condition, we used Cuzick's non-parametric test for trend to identify predictors of college matriculation for respondents whose highest degree is a high school diploma. Cuzick's test for trend is a generalization of the Wilcoxon rank-sum test that evaluates whether a monotonically increasing (or decreasing) relationship is evident across several categories of an ordered categorical variable (Cuzick, 1985.) In this case, Cuzick's test for trend evaluated whether respondents were less likely to enroll in 4-year college than community college, and less likely to enroll in community college than no college. For multivariate analysis of the association between each level of educational attainment and each health condition, we estimated the relative risks of attaining each educational level using a multivariate regression. The multivariate regression controlled for 15 variables: demographics (gender, Latino/Asian/Black race/ethnicity); educational background (high school grade average, grade average missing, Peabody vocabulary test score percentile, college expectancies); socioeconomic status (parent-reported mother's educational level and log household income); and full-time college enrollment status, delay in matriculation, age at high school graduation, and age. Most control variables for the multivariate analysis were measured before college enrollment, in 1995 at ages 12-18. Age, full-time college enrollment status, and high school graduation age were measured concurrent with college enrollment, in 2001. The outcomes of the regressions ---attaining a certificate or above, an AA or above, and a BA or above ---were binary but not rare, so the analysis used a Poisson working model with robust standard errors. A Poisson model allows coefficients to be interpreted as relative risks, which are more easily interpreted than odds ratios from a logistic regression model and less subject to bias towards significance (McNutt, Wu, Xue, & Hafner, 2003;Zou, 2004;Austin & Laupacis, 2011). The goodness-of-fit for each regression model was assessed with a likelihood ratio test using the residual deviance, which follows a chi-squared distribution with degrees of freedom equal to the residual degrees of freedom (Kleinbaum, Kupper, Nizam, & Rosenberg, 2014). The residual deviance is the difference in deviance between the saturated model that explains each observation perfectly (i.e., zero deviance) and the model being evaluated. The residual deviance follows a chi-squared distribution with degrees of freedom equal to the difference in degrees of freedom of those models. If the p-value obtained from the chisquared test is insignificant with p > 0.05, the model fits the data well. All analyses used Stata SE 11.2 and the R statistical package, including the sandwich library (Zeileis, 2004;Zeileis, 2006)."}, {"section_title": "Results", "text": ""}, {"section_title": "College Enrollment", "text": "We evaluated whether students with health conditions were less likely to enroll in 4-year college than in community college, and in community college than in no college. In bivariate analysis of 57 health conditions, using Cuzick's test for trend as the test of trend, students with 36 health conditions were less likely to enroll in 4-year college than in community college, and less likely to enroll in community college than no college, compared with students without these health conditions; 12 conditions predicted greater enrollment across the college categories; and 9 conditions did not have different college enrollment across the college categories (see Table 3). Health conditions that predict lower chances of college enrollment in bivariate analysis include all 10 evaluated activity limitations (all p < .001), activity limitations that are new in the past year (p < .001), activity limitations that lasted more than a year (p < .001), having ever been diagnosed with depression (p < .001), diabetes (p < .001), epilepsy or seizure disorder (p < .001), and hypertension (p < .001); having been prescribed medication in the past 12 months for diabetes (p = .004), hypertension (p = .008), seizures (p < .001), smoking cessation (p = .02); having been hospitalized in the past 6 or 12 months (p < .001), hospitalized for pregnancy in the past 6 or 12 months (p < .001), hospitalized for conditions other than pregnancy in the past 6 months (p = .002) or past 12 months (p < .001); having received in-patient mental health treatment in the past 5 years (p < .001); being totally blind in one or both eyes (p = .08); vision that is fair, poor, or very poor when corrected (p < .001); hearing that is fair, poor, very poor, or deaf without hearing aid (p < .001); self-reported problems with stuttering (p < .001); overweight (p < .001); obesity (p < .001); and perceived overweight (p < .001). Health conditions associated with greater chances of community college and 4-year college enrollment include: having taken antibiotics in the past 30 days (p = .01); having ever been diagnosed with asthma (p = .005); having ever been diagnosed with high cholesterol (p = . 03); having taken any prescription medication in the past 12 months (p < .001), including medications for acne (p < .001), allergies (p < .001), asthma (p < .001), attention problems (p = .04), infection (p = .009), birth control (p < .001), and menstrual issues (p < .001); and wearing contact lenses for vision correction (p = .04). The positive association between college enrollment and these health conditions may partially be explained by greater health care access because youth with greater access to health care may have been more likely to be prescribed medication and contact lenses."}, {"section_title": "Community College and 4-year College Graduation", "text": "We have shown above that high school graduates with most evaluated health conditions are less likely to matriculate in college than those without health conditions. Here we will evaluate whether high school graduates with each health condition enrolled in community college are less likely to graduate. Among high school graduates enrolled in community college in 2001 (n = 1398), about 60% had earned a post-secondary credential by 2008: 13% earned certificates, 28% earned AAs, 17% earned BAs, and 2.6% earned degrees above a BA. Among those with a BA or above, 42% also had an AA or certificate, suggesting that the cautious incremental strategy of earning certificates or AAs prior to matriculating for BAs could benefit some students."}, {"section_title": "Health Conditions That Predict Community College Graduation", "text": "Among high school graduates enrolled in community college (n = 1284), the health conditions associated with lower chances of attaining any post-secondary credential (certificate or above) in multivariate regression controlling for demographics, educational background, socioeconomic status, full-time college enrollment status, and delay in college enrollment were limitations in vigorous activities (relative risk (RR) 0.87 with 95% confidence interval [0.78, 0.97], p = .015, residual deviance χ(df = 1267)=736, p = 1.000), limitations in any activities (RR = 0.88, 95% CI [0.79, 0.97], p = .01, χ 2 (df = 1267)= 736, p = 1.000), having had activity limitations lasting longer than a year (RR = 0.89, 95% CI [0.79, 1.00], p = .05, χ 2 (df = 1267)= 737, p = 1.000), hospitalization not for pregnancy in the past 6 months (RR = 0.68, 95% CI [0.45, 1.02], p = .06, χ 2 (df=1267)= 736, p = 1.000), self-perception as overweight (RR = 0.92, 95% CI [0.84, 1.00], p = .06, χ 2 (df=1267)= 737, p = 1.000), and having been prescribed medication for diabetes (RR suppressed for privacy reasons, p < .001, χ 2 (df=1267)= 735, p = 1.000) (Table 4). Among community college students in 2001 (n = 1284), health conditions associated with lower chances of attaining AA or above by 2008 in multivariate regression controlling for demographics, educational background, socioeconomic status, full-time college enrollment status, and delay in college enrollment included all of the above health conditions that predicted not attaining certificate or above: vigorous activities (RR = 0.83, 95% CI [0.72, 0.96], p = .01, χ 2 (df=1267)= 827, p = 1.000), any activities (RR = 0.84, 95% CI [0.73, 0.96], p = .011, χ 2 (df=1267)= 827, p = 1.000), having had activity limitations lasting longer than a year (RR = 0.85, 95% CI [0.72, 0.99], p = .04, χ 2 (df=1267)= 828, p = 1.000), being prescribed a diabetes drug in the past year (RR suppressed, p < 0.001, χ 2 (df=1267)= 828, p = 1.000). In addition, the following health conditions were associated with lower chances of attaining AA or above: overweight (RR = 0.87, 95% CI [0.77, 0.97], p = .01, χ 2 (df=1267)= 828, p = 1.000), obesity (RR = 0.78, 95% CI [0.67, 0.91], p = .001, χ 2 (df=1267)= 825, p = 1.000), self-perception as overweight (RR = 0.84, 95% CI [0.75, 0.95], p = .005, χ 2 (df=1267)= 827, p = 1.000) or very overweight (RR = 0.76, 95% CI [0.58, 0.99], p= .045, χ 2 (df=1267)= 828, p = 1.000), hospitalization not for pregnancy in the past year (RR = 0.72, 95% CI [0.50, 1.05], p = .09, χ 2 (df=1267)= 829, p = 1.000) and past 6 months (RR = 0.56, 95% CI [0.32, 0.97], p = .04, χ 2 (df=1267)= 827, p = 1.000), being prescribed a stomach drug in the past year (RR = 0.78, 95% CI [0.58, 1.05], p = .10, χ 2 (df=1267)= 829, p = 1.000), and, for females, having been prescribed medication for menstrual issues (RR = 0.62, 95% CI [0.39, 0.98], p = .04, χ 2 (df=1267)= 828, p = 1.000). Among community college students in 2001 (n = 1284), health conditions associated with lower chances of attaining a BA or above by 2008 in multivariate regression included many of the same activity limitations (e.g., limitations in vigorous activities (RR = 0.78, 95% CI [0.59, 1.04], p = .09, χ 2 (df=1267)= 757, p = 1.000), limitations in any activities (RR = 0.75, 95% CI [0.57, 0.98], p = .04, χ 2 (df=1267)= 755, p = 1.000)), overweight factors (e.g., being overweight (RR = 0.72 95% CI [0.58, 0.90], p = .004, χ 2 (df=1267)= 753, p = 1.000), obese (RR = 0.65, 95% CI [0.48, 0.88], p = .006, χ 2 (df=1267)= 752, p = 1.000), and selfperception as overweight (RR = 0.78, 95% CI [0.62, 0.99], p = .04, χ 2 (df=1267)= 756, p = 1.000) or very overweight (RR = 0.49, 95% CI [0.26, 0.93], p = .03), χ 2 (df=1267)= 754, p = 1.000), having been hospitalized in the last 6 months (RR = 0.41, 95% CI [0.18, 0.96], p = .03, χ 2 (df=1267)= 754, p = 1.000) and in the last 6 months not for pregnancy (RR = 0.28, 95% CI [0.07, 1.09], p = .07, χ 2 (df=1267)= 754, p = 1.000), and being prescribed a diabetes drug (RR suppressed, p < .001, χ 2 (df=1267)= 758, p = 1.000). Additional health factors associated with decreased chances of attaining a BA or above include having ever been diagnosed with depression (RR = 0.69, 95% CI [0.46, 1.05], p = .09, χ 2 (df=1267)= 757, p = 1.000), wearing eyeglasses for vision correction (RR = 0.70, 95% CI [0.52, 0.94], p = .02, χ 2 (df=1267)= 754, p = 1.000), and having a problem with stuttering or stammering (RR = 0.47, 95% CI [0.24, 0.90], p = .02, χ 2 (df=1267)= 754, p = 1.000). No community college students with the following rare health conditions earned a BA or above: 10 students ever diagnosed with cancer or leukemia, 4 students prescribed drugs for diabetes, 5 students prescribed drugs for a heart problem, 6 students prescribed drugs for smoking cessation, and 13 students prescribed drugs for weight control. The 79 community college students who were prescribed medication for acne had greater chances of community college graduation (attaining certificate or above and AA or above) but not BA or above. The 33 community college students who reported that their vision was poor or very poor with glasses were more likely to earn AA or above, and the 34 students who reported that they were limited in walking 1 block were more likely to earn AA or above. Among community college students, 33% of obese students and 26% of overweight students reported being limited in vigorous activity versus 18% of non-overweight students (χ 2 (df=2, n=1774) = 31.8, p < .001). Both obesity and activity limitations remained significant predictors of achieving an AA or above when both limitations were included in the multivariate regression, but they were not both significant predictors of attaining a certificate or above or BA or above when both obesity and activity limitations were included in the multivariate regression. There was no evidence for effect modification between limitations in vigorous activities and obesity: an interaction term was not significant in multivariate regression."}, {"section_title": "Health Conditions That Predict 4-year College Graduation", "text": "Here we will evaluate whether high school graduates with each health condition enrolled in 4-year college are less likely to graduate. Among high school graduates enrolled in 4-year college in 2001 (n = 2411), 84% had earned a post-secondary credential by 2008: 2.3% earned certificate(s), 5.4% earned AAs, 60% earned a BA, and 17% earned above a BA; 5% of youth with BA or above also had an AA or certificate. The outcomes of high school graduates enrolled in 4-year college in 2001 are in Table 5. The students enrolled in 4-year college all attempted to attain a BA, and few earned degrees below a BA, so this analysis focuses on the predictors of attaining a BA or above, rather than sub-BA degrees. Among 4-year college students, health conditions associated in multivariate regression with lower chances of attaining a BA or above included more kinds of activity limitations than at community colleges (Table 5): limitations in vigorous activities (IRR = 0.95, 95% CI [0.90, 1.00], p = .04, χ 2 (df=2401)= 846, p = 1.000); limitations in climbing several flights of stairs (RR = 0.91, 95% CI [0.84, 1.00], p = .05, χ 2 (df=2401)= 846, p = 1.000); limitations in climbing one flight of stairs (RR = 0.76, 95% CI [0.59, 0.99], p = .04, χ 2 (df=2401)= 845, p = 1.000); limitations in walking more than a mile (RR = 0.88, 95% CI [0.79, 0.99], p = .03, χ 2 (df=2401)= 846, p = 1.000), several blocks (RR = 0.70, 95% CI [0.56, 0.87], p = .002, χ 2 (df=2401)= 843, p = 1.000), or one block (RR = 0.68, 95% CI [0.48, 0.95], p = .03, χ 2 (df=2401)=845, p = 1.000); having been prescribed a drug for headaches (RR = 0.90, 95% CI [0.81, 1.00], p = .05, χ 2 (df=2401)= 846, p = 1.000) or stomach problems (RR = 0.86, 95% CI [0.76, 0.98], p = .03,, χ 2 (df=2401)= 846, p = 1.000); having been hospitalized in the past 6 months (RR = 0.78, 95% CI [0.64, 0.95], p = . 01, χ 2 (df=2401) = 845, p = 1.000) or 12 months (RR = 0.86, 95% CI [0.76, 0.98], p = .02, χ 2 (df=2401) = 845, p = 1.000) for any reason; having been hospitalized in the past 6 months (RR = 0.62, 95% CI [0.39, 0.98], p = .04, χ 2 (df=2401)= 845, p = 1.000) or 12 months (RR = 0.63, 95% CI [0.45, 0.87], p = .005, χ 2 (df=2401)= 843, p = 1.000) for pregnancy; being obese (RR = 0.95, 95% CI [0.89, 1.01], p = .09, χ 2 (df=2401)= 846, p = 1.000); and perceiving oneself as overweight (RR = 0.95, 95% CI [0.90, 0.99], p = .01, χ 2 (df=2401)= 846, p = 1.000). In multivariate regression, the ten 4-year college students prescribed medication for diabetes (RR suppressed for privacy reasons, p = .003, χ 2 (df=2401)= 847, p = 1.000) and the 6 students who were totally blind in one or both eyes were more likely to graduate, but the coefficients could not be displayed due to privacy restrictions in using the Add Health data to analyze less than 10 individuals in a category (Table 5). Among 4-year college students, 27% of obese students reported being limited in vigorous activity versus 16% of overweight students and 16% of non-overweight students (χ 2 (df=2, n = 3268) = 37.4, p < .001). The regression was repeated with both weight status and vigorous activity limitations included in the multivariate regressions, but neither variable remained significant at the 0.05 level in predicting BA or above; the regression controlled for demographics, educational factors, SES, full-time college enrollment status, on-time matriculation, age at high school graduation, and current age. The multivariate regression was repeated with an interaction term between vigorous activities and obesity included, but the interaction term was not significant at the p = .05 level, so there was no evidence for effect modification between limitations in vigorous activities and obesity."}, {"section_title": "Discussion", "text": "High school graduates enrolled in 4-year college were more likely to graduate than those enrolled in community college in 2001 in this study, concurring with past research (Carnevale, Rose, Cheah, 2011;Dougherty, 1994;Grubb, 1996Grubb, , 2002. A larger number of health conditions predicted lower graduation chances for students attending 4-year college than for students attending community college, which may imply that community colleges are more accessible to students with health conditions than 4-year colleges. Alternatively, community colleges may have also adapted more to their student population's needs, with accommodations such as flexible deadlines found helpful in previous studies (Pingry O'Neill et al, 2012). Health conditions that represent social barriers to college integration but do not prevent completion of classwork, such as overweight and obesity, predict lower chances of graduation for both types of college, which may suggest that social integration matters for community college completion and that Tinto's theory applies to community colleges. Attending 4-year college without earning a credential does not yield reliable labor market payoffs in the general population (Grubb, 1996(Grubb, , 2002. Credentials may be particularly important in the post-2008 economy where even recent college graduates experience low wages and poor job quality (Abel, Deitz, & Su, 2014.) Discrimination against job applicants due to their health status is illegal, but credentials may be nonetheless especially important for young adults who may otherwise experience discrimination in the labor market. A cautious approach towards earning degrees has been recommended for all students: earning a community college credential before bachelors to improve their chances of good labor market outcomes. College students with health conditions may particularly benefit from this approach. Qualitative and quantitative research needs to elucidate the mechanisms for reduced educational attainment due to stigmatized health conditions."}, {"section_title": "Four-year College Graduation", "text": "Compared with community colleges, four-year colleges presented more activity restrictions that predicted reduced educational attainment, including climbing stairs (i.e., one or several flights) and walking (one block, several blocks, and more than a mile). Other health conditions that predicted reduced attainment among four-year college students included recent hospitalization (any, and for pregnancy), measured obesity, and perceived overweight. Disability accommodations may facilitate physical access to classrooms and flexible deadline for homework assignments (Pingry O'Neill et al., 2012), but not address social integration at college. Students may also not request all needed accommodations, such as deadline flexibility for a recent hospitalization. The disability accommodation systems at four-year colleges may not be sufficient to enable students with activity restrictions to complete college. In the general population, earning a community college degree before transfer to four-year institutions for a BA and beyond has been recommended (Rosenbaum & Rosenbaum, 2013;Cohen, Brawer, & Kisker, 2013). This recommendation may be even more important for students with health conditions. Until four-year colleges improve accommodations, students with health conditions may find better support by first earning credentials at community college before transferring to four-year institutions for a BA and beyond. It is unexpected that total blindness and diabetes medication prescriptions predicted, respectively, 45% and 23% greater chances of graduation (BA+) among students at four-year colleges. Students with total blindness and diabetes medications were less likely to be enrolled in 4-year colleges than either no college or 2-year college, however. The lower enrollment but greater graduation chances for these groups could be due to self-selection: for example, students with better social and family support for these conditions may choose 4year colleges with better disabilities support for these conditions. These students are rareonly 0.2% and 0.4% of 4-year college students in our nationally representative sample -so the 4-year colleges that retain these students may devote more adequate resources than to more common health conditions, or the results may be due to chance."}, {"section_title": "Community College Graduation", "text": "High school graduates with many health conditions measured in the Add Health data were less likely to enroll in community college than graduates without these health conditions, and even less likely to enroll in 4-year college. Once in community college, students with some health conditions were less likely to earn a credential. With few exceptions (i.e., recent hospitalization not for pregnancy, having any activity limitation that lasted more than a year), few health conditions associated with lower educational attainments among community college students appear related to students' ability to complete coursework or attend class. Most health conditions that predicted lower educational attainments appeared related to stigma and social integration, suggesting that Tinto's theory that social integration predicts college completion applies to community colleges in addition to 4-year colleges. Although Tinto does not discuss stigma, stigmatized conditions may impair social integration and thus educational attainment, as discussed by Crosnoe (2007). For example, the single activity restriction significant at all educational levels was vigorous activities, described on the survey as including running, heavy lifting, and participation in strenuous sports. Vigorous activities are only necessary for some degrees, and a person with these limitations would likely choose degree programs that do not require vigorous activities. Vigorous activity limitations may suggest reduced likelihood of social integration (appearing \"unathletic\"), rather than reduced ability to complete classwork. Most community college students were overweight: 57% of community college students had a measured body-mass index over 25. Despite this trait being present in most community college students and almost certainly being unrelated to ability to complete schoolwork, overweight predicted lower chances of attaining an associates degree. This result coheres with the finding that obesity predicted reduced educational attainment in the 1997 NLSY but not the 1979 NLSY, despite greater obesity prevalence in the later cohort (Fowler-Brown et al., 2010.) There were similar or larger effects for obesity and perceived overweight. Students with visible and stigmatized conditions such as stuttering, wearing eyeglasses, and overweight were less likely to achieve BA+ but not less likely to achieve certificate+. Stuttering and wearing eyeglasses appear to be a greater disadvantage for earning BAs than sub-BA credentials. Obesity, perceived overweight, and recent hospitalization appear to be greater disadvantages for earning an AA+ or BA+ but not certificates. The stigma of stuttering and obesity may impair performance in classes less for certificates than for BA degrees. Students with problems with stuttering can choose sub-BA programs in technical or health areas that do not require large-group class discussion. BA degrees are often in academic areas, and academic courses are more likely to require class discussion or requesting help, which has been found to be a barrier for students with stuttering and stammering in 4 year colleges (Dorsey & Guenther, 2000). Studies of students with stuttering have not been conducted in community colleges, but courses in technical fields are less likely to include class discussion, and requesting help may be more informal. Community college faculty may be more tolerant of difference than faculty at 4 year colleges; they go out of their way to avoid conferring stigma, such as by relabeling remedial classes \"developmental education\" (Rosenbaum, Deil-Amen, & Person, 2006, Chapter 4). In describing his own classes, Professor X. (2012) describes the necessity for tolerance of student difficulties and disabilities. Colleges may face limitations in their abilities to help students with acute illnesses to complete their degree programs. It is particularly striking that an obese or stuttering student would have similar risk of non-completion as a recently hospitalized student. These findings suggest the need for further studies of the specific barriers these students face and for exploring specialized efforts to encourage and assist such students. If stigma is unconscious, improved faculty awareness of such stigma may reduce its impact. Conversely, the one health condition associated with greater chances of graduation could suggest better social integration: having been prescribed acne medication, which predicts greater chances of certificates and associates degree. Acne medication may indicate better health care access and greater socioeceonomic status, even after controlling for household income and parent's educational level. This evidence finds that community college students impaired in daily activities, such as bending, engaging in moderate activities, hearing, and seeing, were less likely to matriculate in college. If students with these health conditions did matriculate, they were not less likely to graduate than students without these health conditions. Students with these health conditions who enrolled completed certificates, AAs, and BAs at comparable rates as their classmates. Students with these impairments may have been negatively affected in ways that do not show up in the data. Alternatively, it may be that students with health impairments self-select into college: the students who chose to enroll with these health conditions may have had more confidence or better outside supports than students with these conditions who did not enroll. It is noteworthy that colleges do not present obstacles that limit their attainments. Most community colleges do not award BA degrees, so lower BA+ completion rates for community college students suggests failure in entry or success at 4-year colleges. However, until 4-year colleges accommodate all disadvantaged youth, disadvantaged youth can benefit by acquiring sub-BA certificates on the path to BAs. Students who enter community college with health disadvantages should attain credentials on their path to the BA, so that they have some credentials that will make them eligible for better jobs, in case they do not finish their BAs. Certificates in some fields have good earnings payoffs; certificates in some fields offer higher earnings than the median earnings for BAs (Jacobson & Mokher, 2009). The US postsecondary educational system is BA-centric and emphasizes academic skills, despite the economic and non-economic gains from sub-BA credentials (Belfield & Bailey, 2011;Rosenbaum & Rosenbaum, 2013). Young community college students under age 25 appear to aim for BA transfer rather than professional credentials. For example, the three largest majors comprise over half of community college students: health professions (23% of community college students), liberal arts (15% of community college students), and business (12% of community college students) (Synder, de Brey, & Dillow, 2016). Community college students under age 25 are more likely to enroll in BA transfer majors such as liberal arts, 63% of whom are under age 25, than in occupational majors such as health professions and business, of whom respectively 46% and 54% are under age 25; similar patterns are seen in most smaller majors (Snyder, de Brey, & Dillow, 2016, table 311.60.) In an effort to avoid low expectations, both community college and high school counselors encourage BA plans for young students, even students who will need many remedial courses (Rosenbaum, et al., 2006;Rosenbaum, 2001.) Emphasizing BAs in place of sub-BA credentials may result in greater drop-out as community college students are encouraged to take remedial classes necessary for BA transfer but not for certificates, and these remedial course sequences become obstacles to graduation, as students leave before earning any college credit (Rosenbaum & Rosenbaum, 2013.) In this study, students with many health conditions are not disadvantaged in their likelihood of earning certificates, suggesting that certificates could be a valuable starting point before continuing to AA and BA: 42% of the community college students who earned a BA also had a sub-BA degree. In other data (Survey of Income andProgram Participation, 2004 and2008), a third of individuals with certificates also have AA, BA, or graduate degrees (Carnevale et al., 2012)."}, {"section_title": "Limitations", "text": "The first limitation of the study is potential for false significance due to multiple comparisons. This study has taken an epidemiological approach to the research question, using a case-control approach to identify health conditions that predict educational outcomes. Case-control designs are the first step in clarifying the origins of non-completion among community college students. Any study that makes multiple comparisons has a risk of false significance due to multiple comparisons because 5% of null comparisons will be significant at the alpha=0.05 level. We addressed the potential for false significance due to multiple comparisons in three ways. First, we focused on health limitations that had been identified by prior literature as associated with reduced graduation likelihood: physical obstacles and stigmatized conditions. Most past literature used datasets other than the Add Health data, so it is unlikely that a health limitation would be falsely significant in more than one dataset. That is, health limitations found associated with reduced graduation likelihood in past literature and different datasets are less likely to be false. The second way that we addressed potential false significance due to multiple comparisons is by conducting separate analysis for each of three levels of educational attainment: certificate or above, AA or above, and BA or above. Significant associations between health factors and educational attainment for more than one level of education is less likely to occur by chance. The third way that we addressed potential false significance due to multiple comparisons is by including related health conditions (e.g., 4 different outcomes were related to overweight/obesity): it is unlikely to occur by chance that all coefficients for a set of related health conditions go in the same direction (e.g., all positive or all negative), and even less likely that all would be significant at the 0.05 level. If the coefficients of related health conditions go in the same direction, that suggests a real effect rather than false significance, so that the effect is unlikely to be attributable to multiple comparisons. The second limitation is that the study is not a nationally representative sample of current college students because the outcomes are evaluated up to 13 years after college enrollment. This study uses a nationally representative age cohort, some of whom were enrolled in community or 4 year college in 2001. However, the sample was not constructed to be representative of all high school graduates or community college students. College enrollment was measured in 2001, and health outcomes were measured in 2008; the findings may not apply to current college students, but this data measures educational outcomes through ages 25-31, at up to 13 years after college enrollment, which is longer follow-up than many Department of Education datasets such as the National Education Longitudinal Study, the Education Longitudinal Study, and BPS. This long follow-up is necessary to measure the educational attainment of community college students: of community college students who get BAs within 8 years, 57% take 6-8 years, and only 14% get a BA (\"4 year degree\") within 4 years (Rosenbaum, Stephan, Rosenbaum, Foran, & Schuetz, 2015). Add Health does not collect detailed college enrollment information creating a limitation in the ability to conduct trajectory or timetable analyses. We do not know respondents' entire educational histories, only their educational status in 2001, so we cannot estimate attrition as others did (Mamiseishvili & Koch, 2012). Students who matriculated in college and then left prior to the 2001 survey wave would be counted as having not enrolled. Lack of college trajectories is not a substantial limitation because the study's follow-up to 2008 allows the study to determine participants' educational attainment by age 25-32."}, {"section_title": "Conclusion", "text": "A smaller number of health conditions appear to limit success among students attending community college than students attending four-year college. Stigmatized health conditions that do not interfere with class attendance or assignments, such as obesity, predict lower educational attainment. These results suggest that health conditions that carry social stigma, such as overweight, may impair students' social integration predict non-completion of community college, which is consistent with Tinto's theory to the extent that the theory applies to community colleges. In both kinds of college, but especially in four-year colleges, some limitations seem likely to arise from informal and perhaps unconscious social stigma. Colleges that improve social acceptance of all students may increase completion, especially if colleges see social acceptance and community as relevant to their mission. Until colleges learn how to provide equal opportunities to all students, college students with health conditions may have better post-college outcomes from a cautious approach towards earning degrees: earning a community college credential before bachelors degree. This cautious approach has been recommended for all students but may particularly benefit students with health conditions, who experienced greater completion rates for community college credentials than for bachelors degree. Zou G (2004). A modified Poisson regression approach to prospective studies with binary data. American Journal of Epidemiology, 159(7), 702-706. DOI: 10.1093/aje/kwh090 [PubMed: 15033648]  Note: Health status measurements were measured in 2001 (Add Health wave 3) among respondents whose highest degree is a high school diploma.   Note: Each entry in the table corresponds to the relative risk of attainment of each of three post-secondary credentials estimated from multivariate regression: community college certificate or above, AA or above, and BA or above. Some coefficients are suppressed due to privacy concerns, due to Add Health's restricted data policy."}]