[{"section_title": "Abstract", "text": "Educational governance today increasingly needs to be understood as digital educational governance. The monitoring and management of educational systems, institutions and individuals is taking place through digital systems that are normally considered part of the backdrop to conventional policy instruments and techniques of government; technical systems that are brought into being and made operational by certain kinds of actors and organizations, and that are imbued with aims to shape the actions of human actors distributed across education systems and institutions. The aim of the original articles collected in this special issue of the European Educational Research Journal is to bring into the foreground the digital technologies, software packages, database platforms and related forms of technical expertise involved in the rise of digital educational governance. The authors seek to understand how such digital technologies and techniques may be contributing to, or transforming, trends such as governing through data, the globalizing and Europeanizing of educational policy, accountability and performativity, global comparison and benchmarking, and to emerging local, national and supranational objectives."}, {"section_title": "", "text": "infrastructures, architectures, servers, platforms and packages; it is managed through new data analytics and other digital platforms that enable the collection, cleaning and connection of data; it is mediated through websites, data visualizations and graphical forms of communication; it is peopled by new kinds of experts in digital data analysis, knowledge production and presentation; and it is located in particular institutions, organizations and communities with their own technical ways of doing things, scientific styles of thinking, professional subjectivities and objectives and aspirations. Digital software technologies, data systems and the code and algorithms that enact them have become powerful yet largely hidden influences in the governing of education."}, {"section_title": "Digitizing education", "text": "To give some sense of the scale of the digitization of educational governance, for example, the OECD (Organization of Economic Cooperation and Development) has launched Education GPS, an openly accessible data portal enabling users to actively interact and manipulate large-scale datasets from its international tests and surveys (http://gpseducation.oecd.org/), and Pearson plc, the world's largest education publisher, now provides access to over 60 global educational datasets through its Learning Curve data bank to help support 'evidence-informed decision-making' among policymakers (http://thelearningcurve.pearson.com/). More locally in the UK, Ofsted, the educational standards watchdog, has produced RAISEonline (Reporting and Analysis for Improvement through school Self-Evaluation) and 'School Data Dashboards' to provide interactive analysis of school and pupil performance data (https://www.raiseonline.org), while the Education DataLab has been established to undertake quantitative analysis of large-scale administrative and survey datasets and produce independent research to support those leading education policy and practice (http://www.educationdatalab.org.uk/). Early years education in the UK is now subject to Reception Baseline Assessment that, through private sector companies like Early Excellence, must be completed online to automatically produce the data needed by the Department for Education to measure progress for which schools can be held accountable (http://earlyexcellence.com/eexba/). More internationally, the major global learning analytics company Knewton claims that over nine million students have used its proficiency-based adaptive learning platform, which automates the analysis of individual learner data to generate 'personalized' recommendations for learning tasks (http://www.knewton.com/). Finally, Pearson has even started supporting research and development (R&D) in Artificial Intelligence (AI) in education, using 'big data' from massive populations of learners to gain insight into learning processes that might be coded into 'smarter digital tools' that will govern the classroom (https://www.pearsoncollegelondon.ac.uk/subjects/business-school/ news/2015/09/intelligence-unleashed.html).\nThese examples are in addition to the massive digital systems required to administer the flow of assessment data, administrative data and staff data that are all used in the management and control of educational systems, institutions and individuals. From large-scale, longitudinal datasets to school-level administrative data, and to real-time big data systems, digital technologies are playing an increasing role in the administration of educational data, and in the organization of classrooms and online courses. The work of policymakers, education leaders and educators, the choices of parents, and the behaviour and progress of learners alike are all being sculpted or governed by technologies that are instructed by the code and algorithms written by technical experts according to particular discourses of what education is or should be. The governance of education systems, then, is happening not only through a reshaping of the work of policymakers and the bureaucratic organs of government as data-driven departments, but also through the ways that leaders, teachers, learners and other users and stakeholders are solicited by software systems to do things in different ways. In this sense, governance needs to be understood in two ways: as referring to the structural organization of the social system of education, one that arises from the exchanges between different actors, groups, organizations and institutions; and also as referring to the specific techniques, concepts and practical tools that are used to shape particular forms of human action, decisionmaking habits, capacities and conduct in order to achieve specific outcomes (Rose, 1999) .\nAs the above examples indicate, educational governance today increasingly needs to be understood as digital educational governance. The monitoring and management of educational systems, institutions and individuals is taking place through digital systems that are normally considered part of the backdrop to conventional policy instruments and techniques of government; technical systems that are brought into being and made operational by certain kinds of actors and organizations, and that are imbued with aims to shape the actions of human actors distributed across education systems and institutions. The aim of the original articles collected in this special issue of the European Educational Research Journal is to bring into the foreground the digital technologies, software packages, database platforms and related forms of technical expertise involved in the rise of digital educational governance. The authors seek to understand how such digital technologies and techniques may be contributing to, or transforming, trends such as governing through data, the globalizing and Europeanizing of educational policy, accountability and performativity, global comparison and benchmarking, and to emerging local, national and supranational objectives.\nIn many ways, the special issue can be read as a response to Martin Lawn's (2013) claim that while the history of educational governance can be traced through the statistical infrastructures of data collection, calculation and communication that originated in 19th-century administrative systems, today the 'hidden managers' of educational systems are the software products, data servers and analysis packages that make educational data amenable to being collected, visualized and used in a variety of ways. As Lynch (2015) conceptualizes it in his book The Hidden Role of Software in Education, a new kind of 'software space' made of code, algorithms and data produced by commercial actors, programmers and analysts is nowadays working alongside the 'political space' of educational governance, then exerting its influence on the 'practice space' of the classroom.\nAt the same time, digital technologies and emerging sources of digital data are providing new opportunities for empirical analysis and posing new methodological and theoretical challenges across the social sciences. In researching the details of digital education governance, what tools and digital methods of data collection and analysis might be required? Indeed, the future of educational research may be at stake as analyses are conducted by technical specialists in big data labs and commercial organizations rather than university settings. As Mayer-Schönberger and Cukier (2014) argue, education is being transformed into a 'big-data ecosystem' in which educational 'algorithmists' and other data experts are making claims to legitimate authority in education research. A whole new field of 'educational data science' is opening up for researchers and developers (Piety et al., 2014) as learning processes are digitized, educational institutions are turned into data production platforms, and learners and educators are disassembled into digital bits and data points that are amenable to new forms of measurement. Educational data science is simultaneously methodological and powerful: it is a site of innovation in conducting educational research, and seriously consequential to the ways in which educational realities are rendered digitally, pictured in data visualizations, circulated through social networks and governed through data. What methodologies might be required of critical education researchers to examine the emerging digital methods of algorithmists and education data scientists as they stake their claim to expertise in educational research and knowledge production?"}, {"section_title": "Digital instruments of governance", "text": "It is worth considering briefly the rationale for emphasizing the specifically digital aspects of educational governance. Lynch (2015) usefully distinguishes between 'analogue technologies' and 'digital technologies' in the management of education systems. Analogue technologies include paper-based instruments used in institutions to generate and gather data. Digital technologies, by contrast, are created with software, hardware and information systems. Digital technologies are, of course, not supplanting the analogue infrastructure of paper and the inscriptions printed on it, but increasingly augment it with a software layer that accelerates the temporalities of data collection, calculation and communication. Software enables educational data to flow throughout the system through the coded infrastructures of communication networks, to be entered into vast databases, to encounter analytics packages, and to be transformed into new kinds of graphical display and visualization.\nOf course, the point of foregrounding the digital is not to claim that technologies act deterministically to transform education systems. Instead, the special issue draws from fields such as science and technology studies (STS), software studies and digitally oriented studies in sociology, geography and philosophy to approach technologies as 'sociotechnical' systems (e.g. Beer, 2013; Fuller, 2008; Kitchin, 2014a; Lupton, 2015) . Such studies show how technological innovation is always embedded in the social contexts of its production; at the same time, social developments are increasingly shaped by the technologies that inhabit social worlds. In the field of education, investigating the sociotechnical systems of digital education governance therefore means attending to the specific social, institutional, political and economic contexts that have given rise to new technologies such as educational data analytics, data dashboards and so on; it also demands attention to the ways in which those technologies then fold back to re-shape the contexts in which they originated. In other words, the technologies of digital education governance are socially, politically and economically produced, and also socially, politically and economically productive.\nOne useful way of conceptualizing the work of digital technologies in educational governance is through the notion of 'policy instrumentation'. Education governance is always at least partly technical. It is subject to what Lascoumes and le Gales (2007: 4) articulate as 'public policy instrumentation', the techniques, methods of operation, and devices that 'allow government policy to be made material and operational … [and] the effects produced by these choices'. Drawing on STS insights into the hybridity of sociotechnical systems, Lascoumes and le Gales detail how public policy instruments both constitute 'a condensed form of knowledge about social control and ways of exercising it', and also how 'instruments at work are not neutral devices: they produce specific effects, independently of the objective pursued (the aims ascribed to them), which structure public policy according to their own logic' (Lascoumes and le Gales, 2007: 3) . As such, instruments are bearers of values and interpretations of the social world that are materialized and operationalized by particular concrete techniques and tools, and that as a result have the capacity to partly structure policies, determine how actors behave and privilege certain representations of problems to be addressed.\nIn the current context of massive digitization and datafication of education detailed above, we can now see how new digital instruments are being mobilized to make educational policies (as well as other, more commercialized ambitions) operational. Such instruments are combinations of both technical components and social components that ultimately partake in a shaping of the ways in which educational realities are seen, known, made amenable to intervention and acted upon-in the pursuit of improvement, accountability or discipline, and so on. The articles in this special issue emphasize how the technical aspects of instruments (the software, its code, algorithms and database architectures) and their social aspects (the organizations and actors producing them, their representations about education, their values and the discursive regimes framing them) combine in the enactment of specific techniques of digital education governance."}, {"section_title": "Digital code, algorithms, data and infrastructures", "text": "While digital policy instruments are certainly facilitating a temporal acceleration of data collection and use, as well as enabling a greater spatial flow of data from, through and to different sites-at local, national and even global scales-it is also worth taking account, as many of the articles in the special issue do, of some of the specific technicalities of digital devices. Here, the articles draw on emerging conceptual resources from recent studies that attend to the computer code, algorithms, digital data and data infrastructures that constitute the digital policy instruments that operationalize educational governance (see also Williamson, 2015b) .\nCode itself is an elusive category, as a recent 38,000 word answer to the question 'what is code?' in Business Week demonstrates (Ford, 2015) . In computer science, code refers to the machinereadable instructions crafted by a programmer in a specific programming language to instruct computer software or hardware to do something. Code is, ultimately, the substrate to all software (Mackenzie, 2006 ). Yet to fully appreciate what code is, and what it does, it is important not simply to view it as a technical artefact, as lines of code, but to acknowledge that it is socially produced in particular expert technical settings. How any coded system functions is ultimately the end-result of decisions made by programmers with their own professional identities, working towards specific objectives and goals, under particular labour conditions, within institutions with their own business plans, and in accordance with the constraints of particular standards (Kitchin and Dodge, 2011) .\nMoreover, code also has productive power. As code is written and woven into the world in software products, it is now understood among many researchers as more than just the machine-readable script that instructs and controls computing devices and software, but as a lively and active substratum of everyday life. As Lev Manovich (2013: 15) phrases it, software is 'a layer that permeates all areas of contemporary societies': Therefore, if we want to understand contemporary techniques of control, communication, representation, analysis, decision-making, memory, vision, writing, and interaction, our analysis cannot be complete until we consider this software layer.\nThrough activating software processes, code organizes, disrupts and participates in contemporary social, economic, political and cultural activities and practices. For example, code makes possible the techniques of data collection, collation and calculation without which, Chun (2011) argues, there might be no government, no corporations, no global marketplace and no schools in their current form. Yet, code tends to remain deep in the background of such things, hidden in the 'black boxes' of technologies and obscured by taken-for-granted discourses, so that its specific functioning is perceived (if considered at all) as opaque and unavailable to common comprehension. As the hybrid progeny of a variety of social, human and technical elements, lines of code combine with and work in relation to socially defined codes of conduct as a set of active scripts that are increasingly generative of how people think, feel, act, form identities and conduct themselves (Mackenzie and Vurdubakis, 2011) .\nAlgorithms, likewise, may be understood as both sociotechnical products and sociotechnically productive processes. In computer science an algorithm is defined as a set of steps to process input to produce a desired output. This definition, however, glosses over the full sociotechnical complexity of algorithms. Kitchin (2014b) details how algorithms might be variously understood as follows: 'black boxes' that are hidden inside intellectual property and impenetrable code; as 'heterogeneous systems' in which hundreds of algorithms are woven together in relation with datasets, companies, programmers, standards and laws; as 'emergent' and evolving systems that are constantly being refined, reworked and tweaked; and as complex, unpredictable and fragile systems that are sometimes miscoded, buggy, and 'out of control'. As a consequence, Kitchin argues, it may make little sense to interrogate any algorithm singularly, but rather to unpack complex 'algorithmic systems' that are both products of social practices and productive of ways in which other social practices are enacted.\nTaking up the social scientific challenge of studying algorithmic systems as both products and productive processes, Gillespie (2014) has argued that 'sociological analysis must not conceive of algorithms as abstract, technical achievements, but unpack the warm human and institutional choices that lie behind these cold mechanisms'. In particular, he highlights the importance of examining how complex human and social activities-and the values and assumptions held about them-are operationalized within algorithmic systems by being translated into a functional interaction of models, goals, data, variables, indicators and outcomes. In order for an algorithmic system to function, the world outside of the system has to be mathematically modelled in such a way that it can become part of 'the social world of the algorithmic system' (Neyland, 2014: 10) . As a consequence, according to Beer (2013) , algorithms are becoming an integrated part of everyday social processes that can reinforce, maintain or even reshape visions of the social world, knowledge and encounters with information. In the articles in this special issue, the politics of algorithmic modelling practices are traced in the work of governmental and commercial organizations that increasingly mobilize algorithmic systems in the collection, calculation and communication of digital educational data-an educational materialization of 'algorithmic ideology' (Mager, 2012) .\nDigital data, or 'big data', has become a hyped concept in recent years. Broadly put, big data refers to datasets that are huge in size, generated continuously, created in or near real time, highly diverse, exhaustive in scope, combinable, flexible and scalable-sometimes characterized as the 'three Vs' of volume, velocity and variety (Kitchin, 2014a) . Rather than treating big data just in terms of its volume, variety and the velocity of its collection and analysis, however, Ruppert et al. (2015) conceive of big data as enacted through social and technical practices that are both socially and technically performed, as well as institutionally, spatially and temporally situated. However, as Ruppert et al. (2015) also argue, the generation of these data are also generative of particular effects and social implications: data and the algorithms that process it are consequential to 'what is known', and can influence decision-making and other activities. As Beer (2015: 10) notes, big data do not 'exist outside of the social world,' but instead: …circulate through it, reshaping it, altering it, and disrupting the configurations of power and decisionmaking. These new types of data are an implicit and integrated part of how the social world is performed and enacted … with analytics, visualization and statistical techniques used in the conduct and enactment of culture … [and to] define what is valued and what are considered desired behaviours and practices.\nThese are important cues for the analysis of new forms of educational digital data, making the practices of data production and use the object of scrutiny-practices that are inextricably both socially and technically enacted, just as code and algorithms are both socially and technically performed.\nThe final point of definition with regard to digital education governance to make here pertains to data infrastructures. Building on a relational view of infrastructure from STS, infrastructures can be understood as consisting of technical and social components. As Bowker and Star (1999: 35) have defined it, 'infrastructure is sunk into, inside of, other structures, social arrangements, and technologies'; it is a historically worked-out set of technologies, routines, conventions of practice and organizational structures. Technically, infrastructures consist of database architectures, platforms, packages and the thickets of code, algorithms, ontologies and standards on which they depend for their functioning. Socially, they are peopled by new kinds of experts in digital data analysis, knowledge production, presentation and communication, and are located in particular institutions, organizations and communities with their own ways of doing things, knowledge practices, expert methodologies, styles of thinking, professional subjectivities, and objectives and aspirations, all situated in social, political and economic contexts (Kitchin and Lauriault, 2014) . As one such emerging infrastructure of digital data and knowledge production in which policy instruments do their work, education is increasingly the site for an array of digital data collection and analysis practices. As Sellar (2014: 6) argues from the educational perspective, the concept of data infrastructure can be defined as 'an assemblage of material, semiotic and social practices' that functions to translate things into numbers; enables the storage, transmission, analysis and representation of data using algorithmic logics and computational technologies; embeds data usage into other practices; produces new kinds of spaces through practices of classification, measurement and comparison; and produces new social practices."}, {"section_title": "Digital education governance", "text": "Together, software code, algorithms, data practices and infrastructures make up some of the key elements of what is termed digital education governance in this special issue. The original articles in the issue take up the challenge of analysing the sociotechnical entanglements of software code, algorithms, data practices and infrastructures that constitute many contemporary techniques of governing.\nIn the first paper, Manuel Souto-Otero and Roser Beneito-Montagut provide a wide-ranging synthetic overview of the technical artefacts that constitute the 'digital turn' in education governance. These often-overlooked artefacts include learning analytics platforms in schools, academic metrics in Higher Education, data repositories and interfaces, as well as new kinds of search engines that support such practices as academic research and school choice. Such artefacts are the product of governments, private companies and educational establishments that are, in different ways, shaping data consumption and production in education. They argue that social actors' capacities to participate in and deal with the automated interrogation of educational data are leading to diverse strategies of 'alignment', as well as 'resistance,' 'gaming' and 'rebellion'. Their analysis calls for a shift in attention from processes of bureaucratic control to also include potentialities for resistance and to the formation of new kinds of agency and subjectivities.\nThe role of commercial companies with vast R&D resources to develop data analysis technologies and infrastructures is a major factor in techniques of digital education governance. Ben Williamson examines the 'digital methods' of Pearson plc: the digitized techniques of data collection, calculation and communication it is now mobilizing in making educational institutions, practices and people amenable to measurement and evaluation. He argues that for Pearson it is the computational affordances of 'data science' that promise to produce the knowledge through which education and learning are to be understood and acted upon in the data scientific 21st century. His analysis traces the specific methodological devices and algorithmic processes of data analysisincluding data analytics, pattern recognition, data visualization, human-computer interaction and predictive machine learning techniques-that make Pearson into a dominant source of research and knowledge in contemporary education, and that displace the legitimate authority of the social sciences in the production of knowledge about education. Pearson, he argues, is constructing nothing less than a new infrastructure for the collection, calculation and communication of educational knowledge, and codifying the insights it generates into software products that are intended to reshape pedagogic practices and 'personalize' learning. In contrast, Neil Selwyn then analyses many of the more mundane and everyday ways in which digital data work is being conducted within schools and enacted by school leaders, managers, administrators and teachers. Drawing on extensive ethnography of data work in schools in Australia, he argues that alongside the digitized data regimes associated with state and federal governments, are smaller-scale accountability procedures and practices initiated 'inhouse' by school managers and/or teaching staff. While digital technologies are clearly reinforcing wider trends in educational managerialism, Selwyn also considers the subtle ways that local enactments of such governance are shaped by schools' relatively unsophisticated data processing technologies and techniques.\nWhile in-house data analysis is expanding in schools, external agencies continue to generate and circulate much of the data used to govern them. Jenny Ozga demonstrates how the embodied work of school inspection in the UK-as well as elsewhere in Europe-is now increasingly being displaced to digitized data technologies. School inspection technologies and websites such as school data dashboards and Ofsted's RAISEonline, Ozga argues, produce new kinds of governing knowledge that is rendered in calculable numbers, graphs and interactive visualizations. In this context, policy problems do not appear in the external environment but are identified through their statistical representation from which solutions are also derived, and thus create a demand for new governing skills, knowledge production and practical problem-solving. As such, the frameworks that govern how schools are inspected are now coded into software devices produced by commercial contractors and competitive agencies, which then enact algorithmic processes of measuring, categorizing, classifying, sorting, ordering and ranking in ways that displace the embodied professional judgment of school inspectors to coded surveillance instruments.\nData-based techniques of surveillance and cybersecurity are the focus for the article by Nelli Piattoeva, who discusses the effects of digitization, scientization and datafication of education policy in the specific context of the Russian Federation. In particular, she analyses the recent introduction of obligatory video surveillance equipment during public examinations in Russia, and argues that these instruments turn sites of public examination into sites of numerical data production, coercing schools and individual test-takers to become docile data producers. The need for surveillance and cybersecurity technology in education institutions, she argues, is embedded in and reproduces mistrust of the human agents associated with the data assembly-line, replacing it with the capacity of surveillance devices to achieve objectivity.\nThe remaining articles then attend to the specific digital technologies and techniques involved in the tracking and analysis of data about the learning, skills and competencies of adults, professional learners and academics in Higher Education. Cormac O'Keeffe provides a forensic examination of the entanglements of human and nonhuman actors that enact the OECD's Program for the International Assessment of Adult Competencies (PIAAC) survey of adult literacy. His investigation employs a novel digital methodology known as 'trace ethnography' to examine the detail of e-assessment events, especially focusing on the interactions between coded technologies, algorithms and people and how these are translated into statements about what it means to be a literate adult learner. This, in turn, highlights the role of non-governmental organizations in influencing educational and economic policy-making through the intensification of data production.\nIn the following paper, Richard Edwards and Tara Fenwick focus on the 'smart' technologies that are increasingly intervening in professional learning. They argue that the interplay of code, algorithms and big data are increasingly pervasive in the governing, leadership and practices of different professional groups, reshaping the relationships between professional groupings and between professionals and their clients/users/students. Their argument is that smart technologies are reconfiguring professional practice, accountability and responsibility, but that the education of professionals has yet to adequately reflect these changes.\nFinally, Matthias Decuypere and Maarten Simons demonstrate how digitally coded technologies are shaping the role of academic practice itself within Higher Education institutions. Through painstaking ethnography, they specifically examine the role of the computer screen in the daily composition of academic practice, drawing attention to how screens perform different functions in academic work, and especially to the capacity of screens to 'script' academic settings and make actors in university settings 'do particular things' in lecture halls, offices and seminar rooms, in ways that (sometimes) materialize processes of increased bureaucratization, accountability and marketization in Higher Education. The article speaks to the embeddedness of academic research and teaching in highly code-scripted settings, where the values, worldviews and aspirations of programmers, algorithm designers, human-computer interaction designers and data scientists work from a distance to delimit academic practices.\nThese studies, in combination with one another, demonstrate how digitized techniques of educational governance are now being performed by governmental, technical and commercial actors, through schools and universities, in classrooms, lecture halls, examination settings, online e-assessments and in professional sites of learning, and through specific coded devices, algorithmic forms of analysis and other data practices that are embedded in vast new data infrastructures for the creation and communication of knowledge about education. These developments register a structural shift in educational governance, from the formal organs of government to a more distributed range of commercial, international and non-governmental actors working in networks (Ball, 2012) . New kinds of data actors, such as the analysts and data scientists at Pearson, the OECD, Ofsted and within schools and universities themselves are being brought into being; new data careers are available for specialists, or 'algorithmists', with the expertise to turn educational data into useful intelligence that might shape the decision-making of policymakers, influence the interventions made by educational leaders or the pedagogic decisions made by teachers or even shape the choices of parents and learners themselves.\nHowever, new techniques of governing are also enabled by the specific affordances of the digital instruments they employ. For example, real-time digital data technologies make it possible to provide fine-grained assessments and analyses of individuals, and to activate interventions automatically within digitized classrooms, seminar rooms and online courses rather than through the bureaucratic organs of government. Schools' data dashboards make their progress visible, and can be used to hold them accountable. Policymakers may also be influenced by digital decision-support systems that augment human decision-making with automated data analytics capacities. Individuals, including learners at all stages, teachers, academics, educational leaders, examiners, inspectors and even policymakers themselves, are thus to be governed up-close by increasingly automated management machines that are programmed into existence in competitive commercial and international organizations-their actions, behaviours and comportment within education institutions shaped, enabled or constrained, ultimately, by the models and values programmed in to digital systems. Software and data companies and agencies are becoming dominant sites for the instrumentation of education.\nThe term digital education governance, the topic of this special issue of the European Educational Research Journal, registers the displacement of educational governance to new digitized sites of expertise, and also acknowledges the role of digital instruments in governing and guiding the conduct of diverse educational actors and institutions in Europe and globally. Much more remains to be done, but the collected articles map the emerging contours of digital education governance and offer coordinates identifying those spaces where it is materializing in the activities of educational data analysts and methodologists, school data officers, school inspectors, examiners, pupils and students in schools and universities, adult learners in online tests, professional learners at work and in the practices of academics in Higher Education institutions."}]