[{"section_title": "Figures", "text": "1. Areas of potential reduced spending in Michigan due to school readiness through ECE investment ........................................................................................... 2. Michigan Special Education enrollment, 2008-2009 "}, {"section_title": "Summary", "text": ""}, {"section_title": "Background", "text": "Educational and economic research shows that investing in school preparedness for lowincome children prevents needless public spending and produces payoffs in K-12, government programs, and the private sector. Conversely, not investing in or cutting programs that produce school readiness results in increased spending and lost benefits for:  Schools -through higher special education costs, higher costs of grade repetition, and lost aid as unprepared students become unsuccessful students and eventually some become dropouts.  Taxpayers -through higher costs of dealing with juvenile and adult criminals; through higher welfare, Medicaid and unemployment costs; and through lower tax revenues as unsuccessful students become unproductive adults.  The public -not only through higher school costs and higher taxes, but also through injuries and property losses, as some juveniles and adults turn to criminal activity.  The economy -through an inability to compete nationally and internationally due to a higher tax burden and a less educated and skilled workforce. Beginning in the 1980s, Michigan began making investments in fully preparing young children for school -cognitively, physically, socially and emotionally. Currently Michigan's Great Start system encompasses both early childhood services and a strategic plan for the state's early childhood system of programs, services, and supports for children from birth to age five and their families. One element of that system, the Great Start Readiness Program (GSRP), in concert with federally-funded Head Start programs, serves over 47,000 low-income 4-year-olds annually through either a half-day or full-day program of educational preparation. Economists and economic development officials agree that any strategies to enhance the long-term growth of Michigan must include maintaining and upgrading the quality of its workforce. Yet some recent Michigan data raise the discomfiting prospect that the educational attainment of the state's workforce may decline as retiring workers are replaced by the young people who are currently finishing or (in too many cases) not finishing school. This study estimates the current cost savings and revenues to Michigan generated from the investments in school readiness over the past 25 years, the cost burden to Michigan when children are not fully-prepared at kindergarten entry, and the additional benefits that could be realized if Michigan were to expand its investment in school readiness to all educationally disadvantaged children."}, {"section_title": "Current cost savings and revenues", "text": "The cost savings and revenues realized in 2009 due to the investments in school readiness over the past 25 years is an estimated $1.15 billion. This study provides estimates of the dollar value of benefits to Michigan in 2009 generated by current school children who received early education services and by young adults who have been more successful because of school readiness programs. Schools  $221 million in k-12 savings:  $136 million in reduced spending because fewer K-12 students repeated a grade  $69 million in reduced special education spending for disabilities that have been prevented or ameliorated through early intervention such as mild or moderate speech or language problems, cognitive impairment, specific learning disabilities, emotional impairment, and other health problems  $16 million in reduced costs of replacing teachers who leave their jobs due to dissatisfaction with working conditions related to student behavior or performance that are influenced by improved school readiness Moreover, school budgets are higher by an estimated $125 million, funding they would have lost if more current students prepared by early education had dropped out. This amount isn't counted with the other benefits to Michigan because, technically, the schools get more money but it is merely a transfer from the taxpayers, thus netting to zero for the state as a whole. Taxpayers  $584 million in reduced government spending and increased tax revenues:  $214 million in juvenile corrections, which includes reduced costs to arrest, adjudicate, and detain juvenile offenders  $106 million in reduced substantiated child abuse and neglect, including the costs of out-of-home placement  $94 million in adult criminal justice, which includes reduced costs to arrest, process, and incarcerate adult offenders  $66 million in reduced spending by the state on welfare (TANF) and Medicaid due to the improved employment outcomes for disadvantaged children who have reached adulthood  $40 million in reduced unemployment benefits due to improved employment outcomes for disadvantaged children who have reached adulthood  $31 million in reduced child care subsidies for families who are eligible for child care subsidy payments but do not use the subsidy while their children are enrolled in the early education program  $33 million in increased income tax and sales tax revenue due to both higher wages for disadvantaged children who have reached adulthood and higher productivity of parents while their children are enrolled in early education programs The public  $347 million in reduced social costs to the public:  $162 million in reduced tangible losses to victims of violent crimes and property offenses committed by juveniles  $97 million in reduced tangible losses to victims of violent crimes and property offenses committed by adults  $74 million in increased productivity and incomes of employed parents while their children are enrolled in early education programs  $14 million in health savings due to reduced alcohol and drug abuse among teenagers and adults who benefited from school readiness programs when they were children The economy Based on past participation and success rates of early education programs in Michigan, an estimated 80,000 adults, age 18 to 29, in the Michigan labor force today are high school graduates who likely would have dropped out of school if not for Michigan's past investment in their school readiness. These people contribute more to state government than they use in government services, but had they not graduated they would have been a net fiscal drain on the state. The estimated economic impact of these adults is about $1.3 billion annually, including the $584 million described above in reduced government spending and increased tax revenues and at least $700 million in additional wages they have generated."}, {"section_title": "Ongoing costs when children are not fully-prepared at kindergarten entry", "text": "The ongoing cost burden of not investing in school readiness for all disadvantaged children is an estimated $598 million per year. Based on a study by Michigan State University, an estimated 35,000 additional lowincome 4-year old children in "}, {"section_title": "Methodology", "text": "To make these estimates, we relied on the best available research data from longitudinal studies of early childhood education programs in Michigan and other states; recent evaluations of the GSRP program done by the High/Scope Educational Research Foundation based in Ypsilanti, Michigan; and a study commissioned by the C.S. Mott Foundation on the multiple impacts of high school dropouts on the Michigan economy. We used both current and historical expenditure and enrollment data for Michigan schools from the Center for Educational Performance and Information (CEPI) and the Michigan Department of Education, as well as data from early education programs in the state. In some cases, we made conservative assumptions using Minnesota or national data when current Michigan data was limited or unavailable. The estimates presented here, based heavily on studies of early childhood education, represent conservative estimates of the value conveyed by the school readiness produced by the total array of early childhood investments in Michigan. There are other programs and services for children and parents that enhance school readiness, including many that have not yet been studied from a cost-benefit basis."}, {"section_title": "Conclusions", "text": "Michigan has made substantial investments in school readiness over the past 25 years and, accordingly, has reaped the benefits of adequately preparing many children for school success, resulting in more than a billion dollars in annual savings and revenues. If the state's current investments in school readiness were discontinued or reduced, these annual savings and revenues would subsequently erode, causing a significant negative impact on the State of Michigan's future annual budgets and overall economy. Conversely, those benefits will rise if the state sustains its current level of investment and will increase exponentially as a result of increased investment in the Great Start Readiness Program, Great Start system, and other high-quality and comprehensive programs that promote early educational preparation."}, {"section_title": "The estimated annual cost of expanding the Great Start School Readiness Program to all eligible children IS AT MOST $236 MILLION, BASED ON A COST OF $6,800 FOR A FULL-DAY PROGRAM PER NEW STUDENT. THAT COST IS LESS THAN HALF OF THE ANNUAL EDUCATIONAL, SOCIAL, AND ECONOMIC BENEFITS THAT WOULD EVENTUALLY BE", "text": ""}, {"section_title": "REALIZED THROUGH THIS ADDITIONAL INVESTMENT IN MICHIGAN'S FUTURE.", "text": "School success is a critical issue for our nation and especially for states such as Michigan who are facing short-and long-term economic challenges. Not investing in school readiness costs Michigan money. Of equal importance, by not preparing more young children for school success, Michigan will lack the educated and skilled workforce required for its economic competitiveness and, ultimately, its economic growth."}, {"section_title": "Introduction", "text": ""}, {"section_title": "Purposes of this study", "text": "This study demonstrates the value of school readiness, meaning the costs associated when students are not fully prepared for kindergarten, to Michigan in three ways:  First, it estimates the current cost savings to Michigan generated by school readiness. These calculations represent savings that would be lost and costs that would be added, if the state's current investment in early education were discontinued.  Second, it estimates the cost burden to Michigan when all children do not arrive at the kindergarten door ready for school. This analysis examines additional savings that could be realized and costs avoided in coming years if Michigan were to expand its investment in early education to all eligible low-income children.  Third, the study estimates the current and potential impact of school readiness on economic activity and the overall vitality of the state's economy. Beyond costing Michigan money by not investing in school readiness, without greater school readiness, Michigan will lack a more educated and skilled workforce, and the state's economic competitiveness, and ultimately, its economic growth will suffer. In particular, the range of costs saved by the state from increased school readiness and the potential costs to Michigan of not investing in school readiness include:  The estimated portion of the actual costs to K-12, government programs, and the private sector that can be attributed to children entering kindergarten not fully prepared;  Avoidable potential costs to K-12 and other state department spending related to an increase in school readiness; and  The estimated lost earnings and tax revenues that can be attributed to children entering kindergarten not fully prepared. This study replicates models and methods used in a recent study in Minnesota that translates the best research on the returns associated with comprehensive early childhood education (ECE) into usable estimates of the actual cost burdens to be expected from reducing or not expanding such investments that support school readiness. The Minnesota study, commissioned by the Bush Foundation, focused solely on the K-12 school system as a whole. This study, using Michigan data, expands the focus to include estimated costs and savings to additional state departments, state-funded programs, and an estimation of the implied future gains in economic activity in Michigan. The study design and source of data were modified based on review and discussion with stakeholders identified by the Early Childhood Investment Corporation (ECIC), see Acknowledgements."}, {"section_title": "Overview of early childhood education cost/benefit literature", "text": "Many studies show that high-quality early learning experiences pay off in the long run (Ehrlich, E. and Kornblatt, T., 2004;Karoly, L.A., Kilburn, M.R., & Cannon, J.S., 2005;Friedman, D.E., 2004;Lynch, R.G., 2007;Temple, J.A. & Reynolds, A.J., 2005;Reynolds, A.J., 2007;Rolnick and Grunewald, 2003). Most of the return on investment is in reduced public costs associated with child welfare, public assistance, crime and incarceration, and benefits related to increased education and earnings. Several studies focus specifically on measuring the effects of early childhood interventions and quality early care and education on school systems and time spent in K-12 special education and special education spending (Barnett, S.W., 1995;Belfield, C.R., 2004;Conyers, L.M., Reynolds, A.J., and Ou, S., 2003;Harvey, J., 2006;Reynolds, 2007). Other studies focus on the impact of early childhood education programs on other areas of government spending, including criminal justice, welfare, public assistance, Medicaid, unemployment, child welfare, health care, and child care (Aos et al., 2004;Mann and Reynolds, 2006;Nores et al., 2005;Oppenheim and MacGregor, 2002;Reynolds et al. 2002). Finally, some studies have illustrated the effect of early childhood education on increased tax revenues from higher earnings of mothers of children who participate, and more commonly, from increased earnings of participants themselves, and future generations due to higher educational attainment that can be attributed to early childhood interventions (Campbell et al., 2002;Nores et al., 2005;Oppenheim and MacGregor, 2002;Sum et al., 2008)."}, {"section_title": "Assumptions in the analyses", "text": "The analyses in this study estimate benefits and cost savings for various Michigan government systems, including K-12 education, criminal justice, welfare/public assistance, Medicaid, unemployment, child welfare, health care, and child care.  Estimates of saved costs are based on actual data from Michigan whenever possible, with occasional proxies either from Minnesota or national averages only when considered appropriate.  Proposed expansion of early childhood education programs is targeted to the lowest income children (at or below 300% of poverty) for optimal return. The number of eligible children is estimated accordingly.  Estimated benefits are predicated on the early childhood education being of high enough quality to achieve levels of benefits similar to those found within the research literature. As a proxy for quality, we use spending of $6,800 or more per child for 30 or more weeks."}, {"section_title": "Research on potential cost savings", "text": "The research literature on school readiness investments documents potential savings in K-12 spending; crime-related cost; and government health, welfare, and child care programs. Cost-benefit studies of comprehensive early education programs have also documented potential benefits to society in increased personal earnings and tax revenues."}, {"section_title": "K-12 cost savings", "text": "According to the research literature, the largest potential savings to K-12 systems due to improved school readiness is in special education spending. A portion of these costs could be reduced or prevented if more low-income 4-year-olds participated in early education and were fully prepared for kindergarten. Nationally, approximately 20 percent of children are identified as having special educational needs (High, 2008). Two percent have normative disabilities -blindness, deafness, autism, moderate/profound mental retardation, or significant language impairment. Eighteen percent have non-normative disabilities such as learning disabilities, speech and language delays, mild hearing loss, mild mental retardation, and social/emotional/ behavioral maladjustments that are preventable or ameliorated with early intervention. Of those with non-normative disabilities (90% of the students in special education), research shows that anticipatory guidance, such as parenting education provides, can reduce social and emotional risks and build protective factors in young children (Edwall, 2008) and quality early care and education can reduce the amount of time spent in K-12 special education (Reynolds, 2007). In addition, research on children with mild hearing loss shows they have more academic difficulties and are more likely to repeat a grade than their peers with normal hearing, which could be prevented with earlier detection and treatment (Tharpe, 2006). Figures A1 and A2 in the Appendix summarize the estimated effects and net benefits of early childhood education with regard to special education and grade repetition. Based on the outcomes of three major early childhood education studies (High/Scope Perry Preschool, The Abecedarian Project, and Chicago Child-Parent Centers) and a metaanalysis of 48 other studies, the return to each K-12 dollar invested in early childhood education range from 4 cents to 73 cents. This study also looks at other possible benefits within the K-12 system in addition to the actual costs of non-normative special education and grade repetition. Using data from the Early Education Longitudinal Study,   Belfield further finds that a .3 standard deviation increase in student achievement leads to a 19 percent reduction in physical attacks on teachers. The 32 point improvement in student behavior raises the probability that the kindergarten teacher will report \"really enjoys current job\" or \"would choose teaching again.\" This point is made even more clearly in Michigan by the results of a 2009 survey of kindergarten teachers: 68 percent of those surveyed agreed that they had \"experienced significant frustration as a direct result of needing to address the physical, social-emotional, language, cultural, cognitive, and/or special needs of a kindergarten student or students;\" and 18 percent said they had \"experienced a desire to change professions\" based on the same factors. These findings suggest that there are additional teacher, school, and school system related benefits, beyond the scope of this Michigan analysis, that can be produced by improving school readiness through early childhood education.  identifies five areas that could potentially be affected by increases in early childhood education enrollment:  Teacher turnover due to behavior problems, low achievement, or lack of preparation for K-12 education among students;  Teacher absenteeism due to behavior problems,  Low achievement, or lack of preparation for K-12 education among students; and  School safety programs (child or adolescent delinquent or criminal behavior increasing the need for spending on school safety programs). Other potentially avoidable costs to K-12 systems include costs associated with English Language Learner programs. Research indicates that quality early education may improve the English abilities of English language learners, which could reduce the need for future spending in this area (Barnett, 2007;Gormley, 2007;and Magnuson, Lahaie, and Waldfogel, 2006)."}, {"section_title": "Crime-related cost savings", "text": "The relationship between early childhood education (ECE) program participation and reduction in crime appears to be direct (i.e., children in ECE programs learn to control their behavior better than their peers who do not receive this early education opportunity) and indirect (i.e., ECE contributes to better academic achievement, reduced special education placements, and reduced child maltreatment, which are all associated with a reduction in crime) (Mann and Reynolds, 2006). Criminal history can also be considered as an intervening variable in terms of the relationship between ECE and employment and earnings outcomes, since a criminal background may affect employability and/or career mobility (Nores et al., 2005). Crime-related cost savings attributable to ECE interventions are due to juvenile justice system savings, adult criminal justice savings, and savings for crime victims. In fact, some believe that \"[t]he greatest economic benefit of providing high-quality preschool education to disadvantaged children is a dramatic reduction in crime\" (Oppenheim and MacGregor, 2002). Of the studies included in this analysis, only the Abecedarian program in North Carolina has not produced any statistically significant cost savings due to reduced crime. This lack of evidence of cost savings in the area of crime reduction has been attributed to the fact that the area in which the Abecedarian program was located has relatively low crime rates compared with the communities served by other wellstudied ECE programs, and could also be due to the small sample sizes which reduce statistical power (Campbell et al., 2002). It appears that the largest cost savings due to crime reduction that can be attributed to ECE programs is in the area of crime victims' savings. Oppenheim and MacGregor (2002) reported the national average savings to crime victims is $5.86 for every dollar invested in ECE whereas Reynolds et al. (2002) reported 90 cents saved by crime victims for every dollar invested in the Chicago Child-Parent Centers ECE program. Juvenile justice system cost savings are between 68 cents and 90 cents for every dollar invested. One study using the Chicago Child-Parent Centers data found that preschool participation is associated with a reduction in any instance of juvenile arrest, number of juvenile arrests, and incidence of violent arrests (Mann and Reynolds, 2006). This study did not find a statistically significant relationship between participation in preschool and incidence of juvenile drug arrests. Adult criminal justice system cost savings are about 40 cents for every dollar invested. When including all types of cost savings from crime reduction, a meta-analysis of 58 ECE programs found an average cost savings of nearly 69 cents for every dollar invested (Aos et al., 2004). The Chicago Child-Parent Centers program results indicated a savings of $1.98 due to reduced crime for every dollar invested (Reynolds et al., 2002). Even more significant, the Perry Preschool program produced $11.30 of savings for every dollar invested at a 3 percent discount rate, or $4.85 savings for every dollar invested using a 7 percent discount rate. For this program, there was a much more significant effect for male program participants than females (Nores et al., 2005). As previously mentioned, the Abecedarian program did not produce savings in the area of crime. Therefore, the total benefit-to-cost ratio with regard to crime reduction outcomes of ECE programs is between $0 and $11.30 for every dollar invested."}, {"section_title": "Cost savings for public assistance programs", "text": "Unemployment is reduced by ECE program participation indirectly via the impact participation has on educational attainment. Individuals with high school degrees have an overall unemployment rate of 3.8 percent compared to 7.9 percent for high school drop outs (according to 2000 U.S. Census data cited in Oppenheim and MacGregor 2002). Nores et al. (2005) found that the cost of administering welfare is nearly 30 percent of total disbursements in Michigan. In addition, overpayment and payment to ineligible families is 6 percent of total disbursements. Therefore, for every dollar disbursed in welfare there is a cost to society of 38 cents (i.e., from the general public's viewpoint expenditures on welfare are 1.38 times higher than the actual transfer value to private individuals). Overall, cost savings for public assistance programs (TANF/AFDC) are not large compared with the benefits to other systems (K-12 education and criminal justice system). Most studies found only 1 to 2 cents per dollar invested in terms of cost savings to these programs."}, {"section_title": "Cost savings for the child welfare system", "text": "The literature reviewed here does not explicitly state the causal mechanisms by which ECE programs contribute to a reduction in child maltreatment (also called child abuse and neglect). The national review by Oppenheim and MacGregor (2002) found that 15 cents in cost savings accrue for every dollar invested in ECE. The Chicago Child-Parent Centers produced 12 cents of cost savings for every dollar invested (Reynolds et al., 2002). These cost savings benefit the child welfare system and also the individuals who do not suffer from abuse and neglect."}, {"section_title": "Cost savings for health care", "text": "Cost savings in the area of health care can be attributed to reduced incidence of tobacco use and reduced need for treatment for alcohol or other drug abuse. Citing a 2001 U.S. Department of Education report, Oppenheim and MacGregor (2002) assert that highquality ECE programs contribute to lower public (i.e., Medicaid) and private health care costs via improving educational attainment, which leads to better health directly and indirectly via higher earnings. Specifically, 38.7 percent of individuals without high school degrees are in excellent or very good health, compared with 57.8 percent of individuals who completed high school. Masse and Barnett (no year) attribute all differences in health behavior for ECE program participants vs. non-participants to the increased educational attainment among participants and to the better job opportunities that arise when one has more education. \"Education increases the ability to be an effective consumer of health care services and producer of personal health. Education also increases earning power, the ability to command wages, fringe benefits, vacation time, and the ability to avoid working conditions that may be detrimental to personal health. Education also increases income that allows one to purchase higher quality and quantity of health services and to establish living conditions that are conducive to good health\" (p. 22). These researchers also describe how the tendency to have concern for the future is represented both by people who are willing to invest in more education and engage in behavior that promote future good health. In their meta-analysis of benefit-cost research for 58 ECE programs, Aos et al. (2004) reported a cost savings of 4 cents for every dollar invested in terms of a reduction in alcohol and drug abuse. The Abecedarian program participants were 16 percent less likely than control group individuals to be tobacco users, which increased the lifespan of program participants an average of 6.5 years at an estimated value of $161,000 per year, so the return on investment is huge: $3.91 for every dollar invested."}, {"section_title": "Cost savings for child care", "text": "Child care cost savings, which mainly accrue to the parents of participants but can also accrue to the general public in cases where the participant is eligible for child care subsidy, can be attributed to a reduced need for child care services during the hours in which the child is participating in the ECE program. Oppenheim and MacGregor (2002) reported cost savings related to child care expenses of 19 cents for every dollar invested. Reynolds et al. (2002) found the Chicago Child-Parent Centers program saved 25 cents on child care expenses for every dollar invested."}, {"section_title": "Increased earnings resulting in increased income tax revenue", "text": "Increased income tax revenue due to increased earnings is derived from three sources: increased income for mothers of children who participate in ECE, due to their ability to work more hours while their child is participating in early education; increased income for participants, due to increased educational attainment that can be attributed to ECE enrollment; and increased income for future generations (children and grandchildren of participants), due to the increased educational attainment of participants that is associated with higher educational attainment for their offspring. Therefore, the primary way in which ECE intervention results in increased earnings and tax revenue is via increased educational attainment among ECE participants. Increased earnings by participants are a benefit of ECE programs that accrue to individual participants and also generate increased income tax revenue, which is a benefit that accrues to the general public (taxpayers). In 2006, 43 percent of individuals 19 to 64 years old without high school diploma in Michigan were employed, compared to 62 percent of high school graduates and 70 percent with bachelor degrees. In addition, the difference in mean annual earnings for this age group between non-high school graduates and graduates was $8,853 a reduction of approximately 40 percent. This gap is almost 60 percent when compared to college graduates in Michigan. In terms of lifetime earnings, obtaining a high school diploma increases income by $352,000 and improvement of 36 percent over non high school graduates. College graduates see their lifetime earnings increased by more than $1.3 million dollars compared to individuals without high school diplomas (Sum et al. 2008). Benefit-cost studies of the Abecedarian program are the only research reviewed here that included increased maternal earnings and earnings of future generations in calculations of benefits of ECE programs. Campbell et al. (2002) reported that 44 cents in increased income tax revenue for mothers of participating children was obtained for every dollar invested in the program. The same authors reported 13 cents in increased earnings of future generations (children through great-grandchildren, projected) for every dollar invested. In terms of participant lifetime earnings, the return on investment ranges from $1.23 for every dollar invested (Oppenheim and MacGregor, 2002) to $3.32 for every dollar invested (Nores et al., 2005). In terms of income taxes paid by participants, the return on investment ranges from 17 cents for every dollar invested (Oppenheim and MacGregor, 2002) to $1.08 for every dollar invested (Nores et al., 2005). Results from the Perry Preschool benefit-cost analyses show that increased participant earnings and increased participant income taxes are more significant for female participants than for male participants (Nores et al., 2005). Overall, increased earnings and taxes that can be attributed to ECE program participation produce a benefit that exceeds program cost from $1.40 to $4.38 for every dollar invested."}, {"section_title": "Estimates of potential cost savings from reviewed studies", "text": "The following table summarizes the cost savings in different categories generated per dollar of investment in school readiness through ECE estimated in different studies. In each line the numbers indicate the present value of the dollars and cents saved for each dollar invested.  Isaacs (2007); Belfield (2006) These estimates show that the range of potential returns estimated in different studies to be from $2.36 per dollar of investment to $16.14. These are present values of the stream of benefits and reduced costs received over the lifetime of a student."}, {"section_title": "Estimated current cost savings to Michigan", "text": "This section estimates the annual cost savings to Michigan as a result of more children having been adequately prepared for kindergarten because of previous and existing school readiness investments. Through the state-funded Great Start School Readiness Program (GSRP) and federally-funded Head Start programs, over 47,000 4-year-olds are served in comprehensive early childhood education programs. Additional investments are also made in school readiness supports and services for younger children. We form these following cost savings estimates associated with such school readiness investments by calculating the estimated total cost savings to the Michigan K-12 education system; criminal justice systems and crime victims; child welfare system and child abuse victims; public assistance systems including welfare, unemployment, and Medicaid; and health care in Michigan as a result of improved school readiness. All of these savings would be lost and additional costs would be added over upcoming years if the state's current investment in early education were reduced or discontinued. These estimates are based on actual expenditure and enrollment data from Michigan and program effect sizes and parameters from the existing research on effects of early childhood education."}, {"section_title": "Estimated current cost savings for K-12 education", "text": ""}, {"section_title": "Special education", "text": "Michigan K-12 spending in 2009 totaled over $2 billion on special education. Currently, approximately 11.6 percent of students in Michigan K-12 are enrolled in special education. Figure 2 shows the special education enrollment by type of primary disability for Michigan during the 2008-09 academic year. For this analysis, we assume that while special education can assist in some non-normative areas of special education, such as emotional or behavioral disorder, it cannot assist in normative areas, such as deafness or blindness. Therefore, researchers expect school readiness efforts to impact six primary disabilities areas: speech or language impaired (2.7% of all students), mild to moderate cognitive impairment (0.8%), specific learning disability (4.7%), emotional impairment (0.9%), other health impairment (1.0%), and early childhood delay (0.1%). A literature review performed by the Task Force on Community Preventive Services of the Centers for Disease Control and Prevention found a reduction in the incidence of special education due to early education ranging from 6 to 48 percent with an average impact of 12 percent (Anderson, 2002). For this analysis, we used the average effect size, and reduced the special education rates in the disabilities that can be reduced or prevented by 12 percent. These costs of special education are considered to be in addition to regular track costs. Accordingly, benefits include the reduction in special education costs but do not net out potential added costs of returning the students to regular classrooms."}, {"section_title": "Michigan Special Education enrollment, 2008-2009", "text": "Primary disability The estimated savings for K-12 are calculated using student numbers from the Michigan Department of Education. This analysis uses the disability coded as primary type, which is tied to spending, but may not be the only or actual type. The per-pupil costs for each primary disability area of special education that could be prevented or ameliorated through ECE are shown in Figure 3. Since we could not obtain costs for treating different pupils in Michigan, we used the corresponding costs obtained from Minnesota in our earlier study. The costs of special education are assumed to be in addition to the cost of educating students on a regular track."}, {"section_title": "Number of students", "text": ""}, {"section_title": "3.", "text": "Assumed per pupil costs of special education by type of disability Based on the estimated per-pupil costs for each primary disability area of special education that could be prevented or ameliorated, we reach an estimate of $69.1 million in yearly savings to Michigan's K-12 system."}, {"section_title": "Estimated annual special education savings: $69.1 million", "text": ""}, {"section_title": "Grade repetition", "text": "The literature review also found that quality early childhood education reduced the incidence of grade repetition ranging from 6 percent to 23 percent with an average impact of 21 percent (Anderson, 2002). To estimate the number of students who would have repeated a grade in the latest school year in Michigan, we used different methods for different grades. For grades K through 8, we used the change in grade repetition reported in two evaluations of the GSRP by High/Scope Educational Research Foundation, Xiang and Schweinhart, (2002) and Malofeeva, Daniel-Echols, and Xiang, (2007). For grades 9 through 12, a different strategy was employed using cohort graduation reports. In the four-year graduation report for the school cohort that should have graduated in 2008, 9.3 percent of the students were listed as \"off-track continuing,\" meaning they were still enrolled in (at least) a fifth year of high school, but the reports do not list which year (or years) would have been repeated. Similarly, the four-year report for the 2007 cohort showed that 8.6 percent of students were repeating a year of high school, and the five-year report showed that 2.8 percent were still enrolled in what must have been (at least) their sixth year of high school. We used these data to infer grade repetition rates for grades 9 through 12 that added to the appropriate sum. To account for the effect of existing school readiness programs, we assumed that early education had lowered the repeat rate for these four grades by 21 percent. For this analysis, we also assumed that each student who repeats a grade is retained only a single year. Based on this modeling we estimate that school readiness programs in prior years prevented 14,213 Michigan children from repeating a grade. The cost of each grade repetition was assumed to be the cost of an additional year of regular track education for those students who are held back during their K-12 career. In 2007-08, the average per pupil cost of regular track enrollment was $9,380. Using that figure, previous participation of Michigan children in school readiness programs yields an estimated annual savings of $136.2 million in costs associated with grade repetition."}, {"section_title": "Estimated annual grade repetition savings: $136.2 million", "text": "Teacher turnover Michigan had 110,344 public school teachers for school year 2008-09. A recent report by the National Center for Education Statistics (NCES) found that the teacher turnover rate nationally is about 16 percent, with half moving to different schools and half leaving the teaching profession (Marvel et al., 2006). Based on the reasons teachers expressed for leaving their jobs, about 60 percent are potentially related to dissatisfaction with working conditions due to student behavior or performance that could be influenced by improved school readiness. As quoted earlier, a recent survey of Michigan kindergarten teachers indicated that 68 percent experienced significant frustration and 18 percent had considered changing professions based on similar issues. To represent the potential improvement in turnover, we used an estimated turnover rate of 9.6 percent in this study. For this analysis, we assume the turnover rate for teachers in Michigan is lower because they encounter better-prepared students who were enrolled in the existing Michigan ECE programs. We use the estimates developed by Belfield that this level of ECE graduates in the student population reduces the net turnover of teachers by 24 percent. This yields an assumption that turnover is lower in Michigan by 859 teachers per year as a result of existing school readiness. To calculate the turnover costs, we use a model developed by the Bureau of Labor Statistics which assumes that the cost of turnover is 33 percent of the teacher's salary plus benefits at a rate of 30 percent of salary. The average salary plus benefits for a Michigan public school teacher is $57,072. Using the Bureau of Labor Statistics model, we estimate the average cost per teacher turnover in Michigan is about $18,833. Therefore, improved school readiness as a result of early childhood education efforts yields an estimated savings of $16.2 million in costs related to teacher turnover."}, {"section_title": "Estimated annual teacher turnover savings: $16.2 million", "text": "Summary of estimated K-12 savings due to increased school readiness Figure 4 shows the estimated potential savings that would be lost due to inadequate school readiness at just over $220 million annually. Finally, from the point of view of K-12 school finances, there is another substantial savings -per pupil aid received by the schools because school readiness reduces the dropout rate for students. In the HighScope/Perry Preschool study, the rate of high school graduation was increased from 54 percent for non-participants to 71 percent for children who participated in a comprehensive early education program, a decrease of 17 percent in the dropout rate. Using the estimate from the Chicago Parent Child Study that participants attend school .35 more years on average than non-participants and the fact that roughly 38,000 4-year-olds were enrolled in early education in the 1994-95 school year, we estimate that roughly 13,300 more students are currently enrolled in Michigan schools because of their previous participation in early education programs. When multiplied by average per student spending of $9,380 from the most recent school year, that translates into roughly $125 million dollars of additional financial aid to schools. However, since this analysis is being done from the point of view of the State of Michigan as a whole, the loss of per-pupil aid that is prevented due to school readiness is not included in the savings from school readiness since the dollars are transferred from taxpayers to school districts, thus netting to zero."}, {"section_title": "Estimated K-12 annual savings due to increased school readiness", "text": "While increased dropouts do not, in technical financial sense, cost the taxpayers money in the near term through increased education costs, their ultimate cost to the state is far greater than the cost of another year of schooling. A recent study commissioned by the C.S. Mott Foundation (Sum, et al., 2008) provides a wealth of detail on the implications for Michigan's economy when students drop out of high school rather than graduating. Based on the American Community Survey data for 2006, these include: From the point of view of their net fiscal impact on the State of Michigan, adult dropouts are the only group that costs the state in services more than they pay in taxes. The Sum (2008) study estimates that each dropout costs the state on average $3,269 per year, compared to high school graduates who contribute over $4,000 more in taxes than they use in services. But beyond even these statistics, the biggest cost that dropouts impose on the state is the loss of economic output that results from having a less skilled workforce. More is presented on this point in a later section."}, {"section_title": "Additional considerations and issues", "text": "Many of the savings that we enumerate were considered and measured only by a subset of the relevant studies of the impact of early childhood education. And, in some cases, we have used the best assumptions made by other researchers because no accurate measurements of certain cost savings have been made to date. Nevertheless, we believe these cost savings estimates to be conservative for three reasons: First, where we had a choice of a given effect from among several studies which showed a range of effects, we chose the average effect or from the lower part of the range. Second, there is an additional list of potential cost savings to the K-12 system that could be lost due to inadequate school readiness that was not included in this analysis. These include reduction in the use of achievement enhancement and remedial education programs, reduced non-instructional and health costs related to special education and preventable health problems, reduced costs for alternative schools, recapture of lost revenues from parents choosing private or charter schools, and reduced costs of having to provide education to students in juvenile detention. While there is reason to believe that improved school readiness through early childhood education would affect these categories of expenditures, these saving could not be included because there has been no research to measure or monetize the impact of improved school readiness in these areas. To the extent that savings might be realized in all or some of these areas, the estimates presented here understate the total savings -and the potential lost savings -to the K-12 system. Third, we did not include some school savings that were part of our Minnesota study due to time constraints and data availability considerations. We did not include estimates of savings due to teacher absenteeism, reduced school safety spending in higher grades, and reduced costs associated with English Language Learners."}, {"section_title": "Estimated current cost savings to Michigan state government", "text": "This section estimates the annual cost savings attributed to increased school readiness based on actual expenditures in Michigan and program effect sizes and parameters from the research literature. In the most recently completed school year (2008-09), 24,523 4-year-olds were served by GSRP and another 22,276 were served by Head Start in Michigan for a total of 46,799 children. In addition, other children and parents participate in programs and benefit from supports and services that enhance school readiness, including many that have not yet been studied from a cost-benefit basis. Accordingly, the estimates presented here, and based most heavily on studies of ECE, represent conservative estimates of the value conveyed by the school readiness produced by the total array of early childhood investments in Michigan. To estimate the annual savings being realized in Michigan as a result of comprehensive school readiness programs, some additional assumptions need to be made. In particular, some of the benefits of school readiness are received throughout the adult life of children who succeed in school. Of necessity, we have used conservative estimates of the numbers of adults who would have been receiving TANF or committing adult crimes and combined these with effect sizes and costs from existing research to estimate the current impact of comprehensive school readiness efforts in Michigan. These estimates are based on historical data of the number of enrollees in early education programs who have now reached adulthood."}, {"section_title": "Juvenile justice", "text": "As cited above, research clearly supports reductions in juvenile justice costs and reductions in adult justice costs resulting from participation in comprehensive early childhood education programs. Participants in ECE programs in Chicago showed 33 percent fewer petitions to juvenile court than non-participants (Reynolds et al., 2002). Previous studies estimated savings per participant for the juvenile justice system between $5,869 and $13,200. For our estimation of costs savings for the juvenile we assume that juvenile crimes are committed by children age 12 to 18, meaning the oldest children arrested in 2008 were born in 1990 and the youngest in 1996. Consequently, in 2008 there were 6 cohorts of children who participated in Michigan early childhood education programs between 1995 and 2000 that were 12 to 18 years old in 2008. Note the $5,869 average cost includes the estimated crimes and arrests of a child for the 6 year period while they are 12 to 18 years old. To be precise, in 2008, each of these 6 cohorts costs 1/6 x $5,918 to the juvenile justice system. This analysis used Michigan early childhood education participation data and applied the estimated cost per participant per year to the cohorts between 1995 and 2000 for an estimated total savings of $214 million annually."}, {"section_title": "Estimated annual juvenile justice savings: $214 million", "text": "Adult criminal justice Participants in comprehensive early childhood education programs also show a reduction in the number of arrests when they were adults compared to non-participants. Previous studies show that this reduction can save the adult criminal justice system between $3,450 and $5,855 per participant. In our estimation of the costs savings for the adult justice system, we assume that the costs per participant can be spread across 10 years, which is approximately $345 per participant for each year. For this estimation, we use participation data on the cohorts of participants in early childhood education in Michigan from 1986 to 1994 corresponding to individuals who were 18 years old or older in 2008. The total savings for the corrections (adult justice) system in 2008 due to participation of young Michigan residents in early childhood programs is approximately $93.7 million. This cost includes both costs of arrested and processing adult offenders and the costs associated with their incarceration."}, {"section_title": "Estimated annual corrections system (adult criminal justice) savings: $93.7 million", "text": "Public assistance (state portion of TANF, Michigan Medicaid) According to a study by Nores et al. (2005), the cost per dollar of expenditure in welfare is 38 cents in Michigan, and the average savings in welfare costs per participant is $1,340 (an annual average cost of $134, spreading the cost over 10 years). The total potential savings for the state in welfare costs in 2008 consist of the sum of the annual savings in welfare expenses from all the adult individuals who in 2008 were not receiving welfare because they were better prepared for school due to their participation in early childhood programs in the past. Using data on participation from 1986 to 1994 to account only for individuals who were at least 18 year old in 2008, and multiplying by their estimated annual savings, this yielded an annual savings estimate of $36.2 million. In addition, we also estimated the annual savings in the utilization of Medicaid in Michigan because of increased school readiness. A recent study by Sum (2008) showed that even though 75 percent of workers without high school education had health insurance, a high proportion of them, 42.3 percent, were covered by Medicaid compared to only 19.1 percent for those who had high school diplomas or earned GEDs. Using our estimates of additional dropouts who would not be in the Michigan workforce without the help of early education and the fact that Michigan spends an estimated $2,190 per person as its share of Medicaid funding, we estimate the savings to Michigan in annual Medicaid expenditures to be $30.3 million."}, {"section_title": "Estimated total annual public assistance savings: $66.5 million", "text": "Child welfare (abuse, neglect, and out-of-home placements) Comprehensive early childhood education programs that promote school readiness also have been shown to contribute to reductions in child abuse and neglect (CAN). The studies we analyzed all showed significant savings in costs associated with child abuse and neglect, averaging $1,559 per child participant in the programs. In FY2008, there were 29,638 substantiated cases of child abuse and neglect in Michigan, and a financial analysis for the previous fiscal year set the direct costs of CAN in Michigan at $559 million, including the costs of out-of-home placement. Using Michigan data on comprehensive early education program participation, we estimate that an additional $106 million per year is being saved as a result of the positive impacts existing programs."}, {"section_title": "Estimated annual child welfare savings: $106 million", "text": ""}, {"section_title": "Unemployment", "text": "If students drop out before finishing high school, they are more likely to be unemployed, and even those who find employment are likely to find lower-paying and less stable jobs. Thus, they are more likely to collect unemployment insurance from the state during the periods of unemployment that interrupt their work careers. A recent study in 2008 showed the unemployment rate among those who did not finish high school to be 19.6 percent compared to 10.9 percent for those who have only completed high school but have no further education. To estimate the current impact of improved school readiness through previous participation in early education programming, we used our estimate of the number of additional high school dropouts there would have been in the Michigan labor force today. We estimated the cost savings since they are high school graduates and, hence, the state has fewer unemployed workers. Since those workers are likely to be employed in belowaverage-wage jobs, we assumed those unemployed workers would receive 80 percent of the average weekly benefit for all workers. We estimated there were about 3,200 less unemployed workers who would have received benefits of $239 per week for 52 weeks as a result of early education."}, {"section_title": "Estimated annual unemployment savings: $40 million", "text": "Child care subsidies Some families with children participating in state-or federally-funded early childhood education programs are eligible for child care subsidy payments but do not utilize the subsidy while their children are enrolled in a subsidized ECE program. Families qualify for child care subsidies in Michigan if their annual family income is at or below 185 percent of the Federal Poverty Line. The average annual cost per child in a family that utilizes child care subsidy payments in Michigan is estimated at $3,781. Because of participation in statefunded Great Start Readiness Program (GSRP), many low-income families do not fully utilize the child care aid for which they are eligible. In Michigan, if only half of the families classified as low income in GSRP classes would otherwise require child care aid, the State saves an estimated $31 million per year in child care subsidy payments."}, {"section_title": "Estimated annual child care subsidies savings: $31 million", "text": "Michigan Tax receipts The potential gains in income tax revenues for the State of Michigan as a result of more children exhibiting school readiness due to their participation in early childhood education depend on three parameters. The first element is the difference in mean annual income of adults between high school graduates and individuals without a high school diploma. According to data from Sum et al. (2008) this amount is approximately $9,454 (2008 Dollars). This amount can be multiplied by the estimated number of individuals who participated in early childhood education programs, did not drop out from school and who are at least 18 years old in 2008. Using dropout rates of high school graduates and non-high school graduates from Nores et al (2005) and the estimated number of participants in early childhood education in Michigan, the estimated percentage of nondropouts is 17 percent. Finally, tax savings for each cohort of participants are obtained applying the marginal tax rate of income taxes in Michigan of 4.35 to the previous multiplication for an estimate of $18.9 million in additional annual income tax revenue from participants. In addition, parents see their income increased due to their child's participation in these programs either through increased work hours or the ability obtain training more easily. The additional tax generated by this increased productivity of parents reaches $3.2 million for total additional revenue of $22.1 million."}, {"section_title": "Estimated annual additional revenues from income tax: $22.1 million", "text": "For the estimation of the potential additional revenues from sales taxes, we follow the same methodology used in the income tax estimation, using the sales tax incidence in the last step instead of the marginal rate of the income tax. However, we could not obtain an estimate of the incidence of the sales tax for Michigan, thus we used the Minnesota sales tax incidence as a proxy. This assumption is plausible as long as the sales tax rates and the range of goods subject to the sales tax are similar in both states, which we believe is the case between Michigan and Minnesota. The estimated annual additional revenues in sales taxes from participants are $9.1 million and from their parents' increased productivity is $1.5 million."}, {"section_title": "Estimated annual additional revenues in sales tax: $10.6 million", "text": "Summary of estimated Michigan state government savings and revenue due to increased school readiness of Michigan students entering kindergarten Figure 5 shows the estimated potential savings and tax revenues that the Michigan state government would lose due to inadequate school readiness is about $584 million annually. Total potential lost savings and revenue $583.9"}, {"section_title": "Estimated annual savings and revenue for the Michigan budget due to increased school readiness", "text": ""}, {"section_title": "Estimated current social cost savings in Michigan", "text": "This section estimates current social costs savings based on actual expenditures in Michigan and program effect sizes and parameters from research literature."}, {"section_title": "Crime victimization", "text": "The present value of juvenile justice crime victim savings per early childhood program participant is $4,475 (Reynolds et al., 2002). These are private costs consisting in tangible losses paid by the victims of violent crime and property offenses. Following the rationale used in the estimation of crime costs and using this estimation and the number of participants, we obtain an estimated annual savings in costs associated with juvenile crime victimization of $161.8 million per year for all living participants of Michigan early childhood education programs as of 2008. 1"}, {"section_title": "Estimated annual crime victim savings -juvenile system: $161.8 million", "text": "Similarly, Reynolds et al. (2002) estimates the annual saving cost for adult crime victims per participant in early childhood education to be approximately $3,618. The total estimated annual savings for the state in adult crime victim costs reaches $97.6 million."}, {"section_title": "Estimated annual crime victim savings -adult justice system: $97.6 million", "text": "Health (alcohol abuse, and drug use) Children who participated in comprehensive early childhood education programs are less likely to present problems of alcohol and illicit drugs abuse (Aos, et al. 2002). The savings in terms of program participants, tax payers and non-tax payers can reach up to $311 per participant. We estimate that the total savings for program participants (private savings) in costs related to alcohol and drug abuse for children who benefited from these programs in 2008 is $14.2 million. In this estimation, we include participating children that are as young as 8 years old in 2008."}, {"section_title": "Estimated annual health-related savings: $14.2 million", "text": ""}, {"section_title": "Productivity of employed parents", "text": "As a result of children receiving early childhood education, parents see their earnings increased. Research has shown that parents with children who participate in comprehensive early education programs are more likely to participate in the labor force, establish more stable work-related relationships, and spend more quality time with their children during non-work hours. Previous research has demonstrated that these additional earnings may 1 Neither this nor the following item includes estimates of the intangible losses suffered by victims of crime, namely, pain and suffering, death, or reduction in quality of life. Even though economists have sought to estimate the value of these outcomes, we have chosen to exclude them from this analysis, reach $4,488 per participant. Our estimation includes parents who are receiving additional income in 2008 because of their children's program participation."}, {"section_title": "Estimated annual productivity savings: $73.9 million", "text": "The total annual social costs savings to Michigan as a result of greater school readiness due to existing programs is an estimated $354 million, as summarized in the following figure."}, {"section_title": "Estimated annual social savings due to increased school readiness", "text": ""}, {"section_title": "Cost category In millions", "text": "Estimated annual crime victim saving-juvenile system $161.8 Estimated annual crime victim saving-adult justice system $97.6 Health (Alcohol abuse, and drug use) $14.2 Productivity of employed parents $73.9 Total potential savings $347.5\nEducation ( K-12 system) $221.5 Other Michigan state department budgets $583.9 Social cost savings $347.5 Total $1,152.9 Of this total, it should be noted that an estimated $567 million is generated through reduced juvenile and adult crime, both the costs to the state and the costs to the victims of crime. This result is especially important given the current high costs of crime and incarceration in Michigan. Without existing school readiness programs, these costs would be even higher. Expanding school readiness programs will also help to slow the growth of these costs in the future, as we discuss in the next section."}, {"section_title": "Summary of existing savings and revenue to Michigan from school readiness", "text": "The total savings to Michigan from increased school readiness generated by existing early childhood programs is summarized in Figure 7. It consists of the savings to the Michigan K-12 system, the savings to other Michigan state department budgets, and other social cost savings. We estimate the total savings as a result of participation by Michigan children in comprehensive early childhood education programs to be about $1.15 billion per year."}, {"section_title": "Estimated total annual savings and revenues in Michigan due to increased school readiness", "text": ""}, {"section_title": "Estimated cost burden to Michigan from inadequate school readiness", "text": "The cost savings outlined in the preceding section are all based on existing efforts to enhance school readiness. But such efforts do not reach all of the Michigan students who are eligible for such programs. If early education were extended to all 4-year-old children in families living under 300 percent of the federal poverty line, Michigan would reap additional cost savings as those students moved through the school system and then became productive adult members of society. The fact that many of these students may not be adequately prepared for kindergarten imposes an additional cost burden on K-12 and on Michigan state government."}, {"section_title": "Number of additional low-income 4-year-old children in Michigan eligible for school readiness supports and additional cost to serve them", "text": "To estimate the number of additional 4-year-old children who could potentially benefit from participation in comprehensive early childhood education programs, we start with an estimate of the number of eligible 4-year-old children in Michigan provided by the Michigan Department of Education from a study done by Michigan State University. From that number, we subtract the number of 4-year-old children currently served by the Great Start Readiness Program and Head Start programs in Michigan. As shown in Figure 8, an additional 34,684 currently unserved 4-year-old children in Michigan could be eligible for state-and federally-funded comprehensive early education programs if programming was available. The total added cost of increasing school readiness through comprehensive high quality early education for all eligible children is $235.8 million annually, based on existing school readiness programs in Michigan that entail 30-weeks and cost $6,800 per child as a proxy for quality."}, {"section_title": "Estimated unserved 4-year-old children eligible for early education services in families with annual income at or below 300 percent of Federal Poverty Line", "text": ""}, {"section_title": "Estimated cost burden attributable to inadequate school readiness", "text": "This investment would begin to pay some dividends immediately in certain savings in K-12 education and in saved child care subsidies. Other savings would be realized as the children who are adequately prepared for kindergarten grow up and have less involvement with the juvenile justice system, graduate from high school at increased rates, earn better wages and pay more taxes, and commit fewer crimes as adults. The total potential savings from this enhanced school readiness, because they have not been activated and are not being accrued, represent the additional annual costs attributable to the lack of sufficient school readiness in Michigan. We estimate the total potential annual savings from enhancing school readiness through expanded early education -or the cost burden attributable to inadequate school readinessto be $598 million. As shown in Figure 9, the largest portions of the public costs are to juvenile justice ($111 million), child welfare ($55 million), adult corrections ($49 million), Special Education ($36 million), and public assistance ($34 million). Costs to crime victims amount to $135 million. Lost productivity of employed parents amounts to $38 million. Added costs to the schools amount to $115 million, with the majority being the cost of grade repetition. Since some of the children and families served with income at or below 300 percent of the Federal Poverty Level will have higher incomes than those in the research studies on which we base our estimates, we have assumed only 70 percent of the per capita impact generated by existing school readiness programs. Nevertheless, these benefits, when fully realized, will be more than double the cost of enhancing school readiness for all eligible low-income children. Even these statistics do not present the entire case for enhanced school readiness in Michigan. Continuing existing investments in school readiness and, if possible, expanding them will have an impact on the total amount of economic activity and enhance Michigan's future economic growth, subjects we consider in the next section. The total inflation-adjusted output of all goods and services produced in Michigan has fallen in each of the last three years, according to estimates by the U.S. Bureau of Economic Analysis; while the same measure for the nation grew in each complete calendar year. Moreover, even in 2005 when output in the U.S. was expanding at a healthy annual rate of 3.1 percent, GDP in Michigan grew a scant 0.6 percent."}, {"section_title": "Costs attributable to inadequate school readiness", "text": "These statistics and others raise the very real possibility that the downturn in Michigan reflects not only the cyclical weakness of the United States economy, but also a structural shift in the Michigan economy. The recent restructuring of the automobile industry reinforces the view that, when the national economy rebounds, Michigan may be slow to follow. That means that Michigan's economic policies must deal with both the shortterm problem of weakness and also focus on creating long-term momentum for the state's economy whenever possible. Economists and economic development officials both stress the importance of the skill and quality of a state's workforce as one important element affecting a state's economic growth and prospects. So any strategies to enhance the long-term growth of Michigan need to include maintaining and upgrading the quality of its workforce. Yet some recent data on educational attainment of different age groups in Michigan raise the discomfiting prospect that the educational attainment of the state's workforce may decline as retiring workers are replaced by the young people who are currently finishing or (in too may cases) not finishing school. As Figure 11 makes clear, the percentage of working-age people in Michigan without a high school diploma is likely to rise over the next years as older workers are replaced by younger grads and non-grads. Moreover, the most recent statistics show even higher dropout numbers. For example, of the students who began ninth grade in the fall of 2003 and should have graduated on schedule in four years, only 78.9 percent had graduated after five years, 17 percent had dropped out, and a small percentage were enrolling for a sixth year of high school."}, {"section_title": "Measures of educational attainment of different age groups in Michigan, 2007", "text": "Figure 11 also shows that the percentage of 25 to 34-year-olds in Michigan holding bachelor's degrees or more advanced training is almost two percentage points lower than the percentage of 35 to 44-year-olds with the same level of education. Of course, it is too early to tell how many of the current 18 to 24-year-olds in the state will reach that level of education, but it is imperative that the percentage grow, not shrink."}, {"section_title": "Current impact on economic activity in Michigan", "text": "What is the impact on economic activity in Michigan from increased school readiness? We offer an approximate answer based on conservative assumptions using the best relevant data available to us. Based on historical participation in early education programs and the success rate of those programs, 80,000 is a conservative estimate of the number of adults in the Michigan labor force who finished high school, but who would have dropped out without the increased school readiness they developed through participation in such programs. These people contribute more to state government than they use in government services, but had they not graduated they would have been a net fiscal drain on the state. Sum (2008) has estimated that dropouts have net annual fiscal contribution to the state of minus $3,269; while those who have simply a high school diploma contribute a plus $4,201 to the state's coffers as measured by their taxes paid less the transfer payments they receive. Moreover, workers who have from one to three years of college are estimated to contribute $8,966, and those who earn bachelor's degrees a full $17,695 per year. If we assume that none of those 80,000 dropouts continued to higher education of any kind, we estimate the current impact on the state budget from past school readiness through participation in early childhood education as roughly $594 million per year. If we assume that a quarter of those graduates went to college but that none of them earned bachelor's degrees, our estimate jumps to $690 million annually. In addition to their impact on state government expenditures, these graduates earn higher incomes and spend the majority of that added income on goods and services in Michigan. We use an estimate of their earnings as the contribution to Michigan economy through their increased productivity at work. Sum (2008) estimates the average annual earnings of high school dropouts in 2006 at roughly $13,000, compared to $21,800 for high school graduates and $30,600 for workers with some college but no four-year degree. Using these values, we estimate that the additional after tax income spent by this group of graduates in Michigan is roughly $700 million if none of them pursued additional training. As in the previous calculation, if 25 percent attended college without finishing a four-year degree, the estimate rises to $875 million. 2 Using this alternative method of estimating economic impact and totaling these two estimates, we arrive at an estimated increase of from $1.3 billion to $1.6 billion in economic activity in Michigan courtesy of previous and existing school readiness investments. (While it is common in economic development studies to scale direct spending figures up by a multiplier to account for the additional induced spending in the economy, we have chosen to be conservative and not use such a multiplier for these estimates.)"}, {"section_title": "Estimated annual economic impact: $1.29 billion to $1.56 billion", "text": "This range of $1.29 billion to $1.56 billion represents between 0.4 and 0.5 percent of Michigan Gross Domestic Product (GDP). Those numbers seem reasonable when compared to a related study published in 2007 (Holzer, et al.) that estimated the cost of 2 These figures are probably conservative because they exclude the benefits of peer effects, that is the positive effects that more prepared students have on the educational outcomes of their classmates. While these effects are difficult to estimate with precision, a recent study by Bartik (2006) used existing research to infer that peer effects could increase the earnings impact of ECE by as much as 54 percent. childhood poverty to the United States economy. The study estimated the effect on national GDP of 17 percent of U.S. children growing up below the Federal Poverty Line rather than getting the opportunities and the life outcomes of children from average income families. They estimated the cost to the U. S. economy at almost 4 percent of GDP, with the main element being lost productivity and output, increased costs of crime, and increased health expenditures. Though the Holzer study did not identify specific channels of impact, it seems quite plausible that lack of school readiness is one of the ways in which family poverty affects individual life prospects and aggregate economic activity. Therefore, the estimate that school readiness programs in Michigan undo about one-tenth of the effect of child poverty in Michigan seems to be reasonable."}, {"section_title": "Future impact on economic activity in Michigan", "text": "The future of the Michigan economy, like the future of the U.S. economy, is impossible to predict with confidence. However, the contribution that school readiness will make to that future is likely to rise rather than remain constant as the jobs of the future demand more education and more training. The current impact on Michigan's economy today is generated by early education programs of 15 or more years ago. In like manner, changes in the level of early education and school readiness spending today will have impacts in the future. If investment is decreased, losses will accumulate over time. Conversely, if investment is increased, economic benefits will accrue over time. Additional savings in school expenditures will be felt in the near term, but most of the impact will be felt in later years in terms of the added productivity of the workforce, reduced crime, and reduced social spending. Increased and sustained school readiness investments today at the rate described earlier in this paper would produce additional economic benefits of about $600 million per year when all of those benefits are realized. Put differently, the cost burden of NOT investing the additional resources in early education and school readiness will mount up in the future until it reaches the equivalent of roughly $600 million of today's dollars per year. "}]