[{"section_title": "Abstract", "text": "This paper describes the Simple Ocean Data Assimilation (SODA) reanalysis of ocean climate variability. In the assimilation, a model forecast produced by an ocean general circulation model with an average resolution of 0.25°ϫ 0.4°ϫ 40 levels is continuously corrected by contemporaneous observations with corrections estimated every 10 days. The basic reanalysis, SODA 1.4.2, spans the 44-yr period from 1958 to 2001, which complements the span of the 40-yr European Centre for Medium-Range Weather Forecasts (ECMWF) atmospheric reanalysis (ERA-40). The observation set for this experiment includes the historical archive of hydrographic profiles supplemented by ship intake measurements, moored hydrographic observations, and remotely sensed SST. A parallel run, SODA 1.4.0, is forced with identical surface boundary conditions, but without data assimilation. The new reanalysis represents a significant improvement over a previously published version of the SODA algorithm. In particular, eddy kinetic energy and sea level variability are much larger than in previous versions and are more similar to estimates from independent observations. One issue addressed in this paper is the relative importance of the model forecast versus the observations for the analysis. The results show that at near-annual frequencies the forecast model has a strong influence, whereas at decadal frequencies the observations become increasingly dominant in the analysis. As a consequence, interannual variability in SODA 1.4.2 closely resembles interannual variability in SODA 1.4.0. However, decadal anomalies of the 0-700-m heat content from SODA 1.4.2 more closely resemble heat content anomalies based on observations."}, {"section_title": "Introduction", "text": "In this paper we report on the multiyear Simple Ocean Data Assimilation (SODA) effort to reconstruct the changing physical climate of the global ocean. The data assimilation approach used is an application of sequential estimation in which a numerical model driven by observed surface forcing is used to provide a first guess of the evolving ocean state, which is then corrected based on direct observations. The resulting ocean reanalysis provides an estimate of the state, which is an improvement over estimates based solely on either the sparse set of observations or numerical simulation. The results presented here cover the 44-yr period 1958-2001 spanned by the 40-yr European Centre for Medium Range Forecasts (ECMWF) atmospheric reanalysis .\nSince becoming available in the mid-1990s atmospheric reanalyses have proved revolutionary in providing uniformly mapped and regularly available samples of not only variables that are directly observed, but also indirect variables such as vertical velocity. However, the atmospheric observing system was set up to support weather forecasting, not to produce multidecadal reanalyses. As a result, the reanalysis variables are subject to systematic errors due to changes in the observing system. An example of these changes is the introduction of satellite radiance observations in the late 1970s (Mo et al. 1995; Bengtsson et al. 2004 ). Other changes have affected measurement errors in conventional observations, such as the gradual increase in the average height of shipboard anemometers. The influence of these changes may explain some of the trends evident in the reanalysis winds; trends that may be erroneous. Errors in the winds project onto the circulation produced by ocean general circulation models driven by these winds. In addition to errors in winds and other surface fluxes, ocean circulation models are subject to errors due to unrepresentative ocean physics parameterizations, inadequate numerics, internal variability, and errors in the initial conditions. Stockdale et al. (1998) document many of these model errors in their comparison of tropical circulation models.\nThe idea behind SODA is to use direct observations to correct model errors in order to improve the reanalysis of ocean variables with a straightforward assimilation algorithm. However, like its atmospheric counterpart, the ocean observing system was not originally designed to support the construction of ocean reanalyses. The main subsurface dataset consists primarily of temperature and salinity profile data whose distribution (dominated by temperature) is concentrated along shipping routes in the Northern Hemisphere and in some coastal regions. Beginning in 1981 continuous global remote sensing of SST began with the deployment of infrared Advanced Very High Resolution Radiometer (AVHRR) sensors aboard National Oceanic and Atmospheric Administration (NOAA) polarorbiting satellites.\nIn recent years there has been a proliferation of data assimilation algorithms that have been applied to problems in physical oceanography. These algorithms may be broadly divided into variational adjoint methods based on control theory and sequential estimation based on stochastic estimation theory, which for linear models leads to the Kalman filter-smoother. Comprehensive descriptions of algorithm alternatives are provided by Bennett (2002) , Kalnay (2002) , and Wunsch (2006) . The more sophisticated alternatives, such as the four-dimensional variational algorithm and full Kalman filter have limitations in terms of high computational expense, increased sensitivity to the quality of the statistical assumptions, and for the full Kalman filter the potential for stability problems. There is very active research in both the meteorological and oceanographic communities to explore efficient and accurate simplifications (e.g., Evensen 1994; Ott et al. 2004; Wunsch 2006) .\nHere we adopt a sequential approach in which a numerical model provides a first guess of the ocean state at the update time and a set of linear Kalman equations is used to correct the first guess. This correction is based on estimates of the errors contained in the model forecast (the difference between the forecast value and true value of a variable such as temperature at a particular location and time) and in the observations. This work is a continuation of the reanalysis effort described by Carton et al. (2000a,b) , which in turn followed multiyear efforts by Carton and Hackert (1990) and Rosati et al. (1995) .\nAll of these efforts used forecast models based on Geophysical Fluid Dynamics Laboratory (GFDL) Modular Ocean Model (MOM) numerics with modest horizontal and vertical resolution, resulting in considerable model bias. Their model grids excluded the Arctic Ocean, while the surface winds were smoothed with a monthly average and were based on earlier wind analyses. Additionally, the profile dataset was nearly 30% smaller than is currently available, and in the earlier studies SST data was included only in the form of an already gridded product. They assumed steady error covariances that were restricted to two dimensions. The impact of these limitations is described in an examination of thermosteric sea level presented by Carton et al. (2005) . Eight tide gauge stations were considered by Carton et al. (2005) and Carton et al. (2000a) . At these eight stations the average correlation of nonseasonal sea level estimates from the analyses has increased from r ϭ 0.44 to 0.70. This paper is organized in the following way. Section 2 provides an overview of the reanalysis system and description of two experiments. The datasets and assimilation procedure are described in sections 3 and 4. Section 5 examines the mean transports, while section 6 examines variability as a function of frequency."}, {"section_title": "Overview of the reanalysis system", "text": "The SODA system begins with a state forecast produced by an ocean general circulation model based on Parallel Ocean Program numerics (Smith et al. 1992) , with an average 0.25°ϫ 0.4°horizontal resolution and 40 vertical levels with 10-m spacing near the surface. The use of a displaced pole allows us to begin to resolve Arctic processes. Bottom topography has been obtained from the 1 ⁄30°analysis of Smith and Sandwell (1997) with modifications for certain passages provided by J. McClean (2002, personal communication) . Vertical diffusion of momentum, heat, and salt are carried out using K-profile parameterization (KPP) mixing with modifications to address issues such as diurnal heating, while lateral subgrid-scale processes are modeled using biharmonic mixing. Sea level is calculated prognostically using a linearized continuity equation, valid for small ratios of sea level to fluid depth (Dukowicz and Smith 1994) .\nDaily surface winds are provided by the ECMWF ERA-40 reanalysis (Uppala et al. 2005) for the 44-yr period from 1 January 1958 to 31 December 2001. Surface freshwater flux for the period 1979-present is provided by the Global Precipitation Climatology Project monthly satellite-gauge merged product (Adler et al. 2003) combined with evaporation obtained from the same bulk formula used to calculate latent heat loss. The other terms in the surface heat flux boundary conditions are also determined using bulk formulas. However, the details of the heat flux boundary condition are relatively unimportant in influencing the solution because of the use of near-surface temperature observations to update mixed layer temperature. The model also includes a relaxation to World Ocean Atlas 2001 (Boyer et al. 2002) climatological sea surface salinity (with a 3-month relaxation time scale).\nThe assimilation cycle is carried out every 10 days, but the corrections are introduced incrementally every time step. The incremental corrections are computed following the incremental analysis update methodology of Bloom et al. (1996) , in which an analysis at time t is followed by a 5-day simulation. On day t ϩ 5 the assimilation package is called to produce estimates of the temperature and salinity updates. The data window for this assimilation spans Ϯ45 days. Observations at large time lags have reduced influence on the estimates, as discussed in section 4. Note that this implies that a single observation will influence multiple updates. Then the simulation is repeated for 10 days beginning at time t with temperature and salinity corrections added incrementally to produce the final analysis for the 10-day period (from time t to t ϩ 10). This procedure, in effect a form of digital filter, has the advantage of maintaining a nearly geostrophic relationship between the pressure and velocity fields with a minimum excitation of spurious gravity waves. The procedure also reduces bias in the forecast model by 50% relative to the forecast bias when the incremental analysis update procedure is not used.\nAverages of model output variables (temperature, salinity, and velocity) are saved at 5-day intervals. These average fields are remapped onto a uniform global 0.5°ϫ 0.5°horizontal grid (a total of 720 ϫ 330 ϫ 40 grid points) using the horizontal grid spherical coordinate remapping and interpolation package with second-order conservative remapping (Jones 1999 ) and saved in netcdf format. (Each 5-day file is 157 Mb, so a 44-yr dataset at this reduced resolution is 497 Gb. The monthly averaged dataset is a more manageable 83 Gb.) The mapping shifts the locations of the temperature and horizontal velocity grids, which are offset in the model, to the same set of remapped gridpoint locations.\nTo take account of changes in the surface forcing datasets as well as to help identify the impact of the observations, we compare two experiments. SODA1.4.0 is a simulation forced by ERA-40 winds with no ocean observations used for updating. SODA1.4.2 is a data assimilation analysis forced by ERA-40 winds in which all temperature and salinity observations are used in the updating procedure. In addition to our basic dataset, a number of derived quantities such as heat content are computed on the original grid."}, {"section_title": "Preparation of data for reanalysis", "text": "The basic subsurface temperature and salinity observation sets consist of approximately 7 ϫ 10 6 profiles, of which two-thirds have been obtained from the World Ocean Database 2001 (Boyer et al. 2002; Stephens et al. 2002) with online updates through December 2004. This dataset has been extended by the addition of realtime temperature profile observations from the National Oceanographic Data Center (NODC)/NOAA temperature archive, including observations from the Tropical Atmosphere-Ocean/Triangle Trans-Ocean Buoy Network (TAO/TRITON) mooring thermistor array and Argo drifters. This dataset represents an increase of some 1.7 million profiles relative to the World Ocean Database 1998 (WOD1998) dataset. The data coverage, shown as a function of depth and time in Fig.  1 , has several characteristics that may affect the temporal variability of the results. Before the late 1960s the primary temperature profiling instrument was the mechanical bathythermograph. This device was limited to depths shallower than 285 m and thus did not sample the main thermocline in many parts of the ocean. With the exception of the International Geophysical Year (1957-58) the total number of observations reaching a depth of 300 m was less than 5000 yr Ϫ1 . In the late 1960s a new expendable bathythermograph (XBT) began to be used, extending the depth of temperature coverage to 450 m and below. It was later discovered that these instruments suffered from biases in drop rates and much effort since then has been devoted to correcting for these biases. Here we use the drop rate correction described by Stephens et al. (2002) for most of our data. This dataset has been thinned in the vertical in accordance with NODC standard levels. In the early 1990s the tropical ocean moored thermistor data increased dramatically with the expansion of the TAO/TRITON array, while a decrease in observations later in that decade reflects the end of the World Ocean Circulation Experiment and reductions in the Volunteer Observing Ship program.\nThe data counts for salinity (Fig. 1b) are lower than those for temperature by a factor of 3-4 because this variable is not measured by the bathythermographs, but by several less common deeper profiling instruments. The reduction in salinity observations after 1995 is even more dramatic because of the delay in getting salinity observations into the data archives. Recently a new observing system called Argo has been deployed, which makes profiles to 1000-2000 m available in nearreal time, resulting in an increase in temperature sampling in the middepth ocean and in salinity sampling throughout the upper-and middepth ocean.\nAll profile data are subject to nonrandom errors. A series of quality control filters has been applied to temperature and salinity profiles prior to entry into the World Ocean Database 2001. These include, for example, location checks and checks on local stability. We apply some additional quality control to our dataset including buddy checking and examination of forecast Ϫ observation differences, excluding the observations when the differences exceed three standard deviations of the analysis variability. Together these quality control procedures eliminate an additional 5% of the profiles (a failure of either test causes the whole profile to be rejected). Finally, examination of the results from previous reanalysis experiments allows us to eliminate a handful of additional outliers that have not been identified in previous objective quality control procedures. After quality control procedures are applied the profile data is binned into 1°ϫ 1°ϫ 1-week bins.\nIn addition to the temperature profile data a large number of near-surface temperature observations are available both in the form of in situ observations [bucket and ship-intake temperatures from the Comprehensive Ocean-Atmosphere Data Set (COADS) surface marine observation set of Diaz et al. 2002] and from satellite remote sensing. The in situ observations are made at a nominal depth of 1 m and are treated as estimates of mixed layer temperature. We currently use the nighttime NOAA/National Aeronautics and Space administration (NASA) AVHRR operational SST data, binned into 1°ϫ 1°bins with no attempt to fill empty bins (Vazquez et al. 1995; Reynolds et al. 2002) . These data are available beginning November 1981 and average 25 000 samples per week. Use of only nighttime retrievals reduces the error due to skin temperature effects, which results from solar heating under low wind conditions (Ewing and McAlister 1960) . Although a much smaller dataset than surface temperature, the near-surface salinity observation set averages more than 10 000 yr Ϫ1 since 1960 (Bingham et al. 2002) . Nearly continuous sea level information is available from a succession of altimeter satellites beginning in 1991. This additional extremely useful data has not been included in the results presented here in order to avoid introducing a massive change into the observing system."}, {"section_title": "Data assimilation", "text": "The ocean state, a is computed using a linear filter based on the difference between observations o and a model forecast mapped onto the observation locations\nwhere the gain matrix K determining the impact of the observations depends on the observation error co- \nϪ1 is determined by minimizing the expected variance of the analysis error subject to some simplifying assumptions, including the assumption that the model forecasts and observations are unbiased Carton et al. 2000a for a discussion). The observation error we assume to be uncorrelated white noise with an amplitude equal to 10% of the zero lag model forecast error variance, ⌽. The model forecast error itself relies on many assumptions that are only approximately valid. Here we briefly list these assumptions and comment on their validity.\nFirst, we assume P f has a functional form following Carton et al. (2000a) \nwith dependence on arrays containing the zonal (⌬x), meridional (⌬y), and vertical (⌬z) distance between two grid points as well as the time difference (⌬t) and the change in sea level (⌬) between the two locations (flow dependence). We use the same parameters, including the scales (␥ i ) for (i ϭ x, y, z, t) as developed by Carton et al. (2000a) , which include some anisotropy (zonal scales are larger than meridional scales in the tropics) and some latitude dependence (horizontal scales decrease somewhat with increasing latitude). The functional form for the dependence of P f on ⌬ is chosen to be Gaussian with a scaling ␥ ϭ 100 km, in order to roughly match the scales of boundary currents. These choices are somewhat subjective and should be revisited. In addition to these geographic dependencies, there are two dependencies of P f on the model state itself. The first is a dependence of the vertical covariance on stratification. A forecast of mixed layer depth is derived from the forecast density fields based on a 0.125 criterion (following, e.g., Kara et al. 2003) . If both points between which the error covariance is being evaluated lie within the forecast mixed layer (and are horizontally and temporally collocated) they are assumed to be highly correlated. This depth dependence allows surface observations to influence our analysis throughout the mixed layer. If at least one of the points lies below the mixed layer then the vertical covariance is determined from a lookup table as a function of depth and geographic position. This submixed layer depth dependence is included to reduce the correlation between two variables at depths separated by the pycnocline. The usefulness of this procedure depends on the accuracy of the model forecast mixed layer.\nA comparison of the SODA1.4.2 analysis mixed layer depth with the data-based depth climatology of Kara et al. (2003) is provided in Fig. 2 for Northern Hemisphere winter [December-February (DJF)] and late summerautumn [August-October (ASO)] seasons. Although the data-based climatology is limited by a lack of salinity data coverage, the qualitative features are similar to the reanalysis. In winter the subpolar North Atlantic The presence of similar features in the mixed layer of SODA1.4.2 and a data-based climatology provides some confidence that the vertical error covariances are being handled properly. The vertical structure of the resulting analysis temperature anomaly correlation along the equator is shown in Fig. 3 (top panels). The correlation with SST (left panels) remains high primarily within the mixed layer everywhere except the eastern Pacific. The temperature correlation extends below the mixed layer in the eastern Pacific because of the influence of eastward-propagating baroclinic equatorial waves. The correlation with temperature at 317 m, which is below the thermocline, extends approximately 60 m about this central depth, although the correlation has a scale that is somewhat smaller in the western and central Pacific due to the presence of a deep thermocline. It is worth noting that this vertical scale is close to the vertical grid spacing at this depth.\nThe second dependency on model state in (2) is associated with the strength of the perpendicular component of geostrophic surface currents between the two station locations [and thus to the sea level difference as indicated in (2)] following the method of Riishojgaard (1998) . The introduction of the dependence on the sea level difference reduces the covariance of variables separated by a strong current such as the Gulf Stream.\nTo further evaluate the reasonableness of the assumptions underlying (1) and (2) we have saved the differences between the temperature forecast and the temperature observations {the [H(\n] from (1)} calculated during the course of the integration and then binned them monthly onto a 1°ϫ 1°ϫ 40-level grid (see Purser and Parrish 2003 for a discussion of the analysis of these differences for atmospheric applications). These differences may include time lags of up to a couple of weeks between the times of the forecasts.\nExamination of the forecast Ϫ observation temperature differences in Fig. 4 (top panels) show that our forecast error is weakly biased (͗ f ͘ 0). The timemean temperature bias may exceed 0.2°C (10 day) maximum on the equator (although note that the use of differences with time lags of up to a couple of weeks may explain some of this bias). Along the equator the bias is negative east of 140°W and positive west of 170°W indicating that the forecast thermocline is too steeply sloped along the equator, displaced too shallow by 1-3 m in the east and too deep by a similar amount in the west. A similar pattern of displacement exists along the equator in the Atlantic, while in the Indian Ocean the forecast thermocline is too deep in the east. In the midlatitude Pacific the forecast model is too cool in the Northern Hemisphere mixed layer by 0.2°C (10 day)"}, {"section_title": "Ϫ1", "text": ". Mean forecast bias also occurs near strong frontal zones and results from the tendency of the model to misplace the temperature fronts geographically.\nNext we consider the distribution of the variability of forecast Ϫ observation differences (Fig. 4 , bottom panels). Along the equator we find most forecast Ϫ observation variability concentrated at thermocline depths with values in excess of 0.8°C (10 day)\n, roughly 4 times larger than the time-mean bias. Significant variability also exists in the mixed layer of the eastern equatorial Pacific and Atlantic, where the thermocline is shallow. In the midlatitudes the magnitude of variability is lower by 50% than along the equator. The variability is also large in the midlatitude mixed layer. Cross sections in the interior Atlantic show similar behavior in the northern subtropics and midlatitudes. The spatial distribution of forecast Ϫ observation error variability closely resembles the spatial distribution of analysis Ϫ observation differences (not shown). Along the equator, for example, root-mean-square SODA1.4.2 forecast Ϫ observation differences about their mean, reach peak values of around 0.8°C at thermocline depths while SODA1.4.0-analysis Ϫ observation differences are twice as large."}, {"section_title": "Mean transports", "text": "We begin our examination of the analysis by examining the time-mean volume transports at several key passages and sections where observation estimates are available, listed in Table 1 "}, {"section_title": "AUGUST 2008 C A R T O N A N D G I E S E", "text": "observations. This problem of insufficient Florida Straits transport seems to be a common feature of eddy-permitting simulations and is even more evident in SODA1.4.0.\nIn contrast with Florida Straits transport, the SODA1.4.2 transport in the Antarctic Circumpolar Current at Drake Passage is high (157 Sv) in comparison with observations (137 Sv). The processes controlling this excess transport, which is also a common feature of eddy-permitting model simulations, are still a subject of debate. According to Gent et al. (2001) the 20-Sv excess in their modeled zonal transport results from the secondary circulation associated with a moderate (3 Sv) excess in meridional overturning circulation off the Antarctic shelf.\nIn contrast with this excess, the warm water transports between the Pacific and Indian Oceans through the Indonesian Archipelago and between the Indian and Atlantic Oceans by way of the Agulhas Current are both similar to the observed estimates. The Indonesian Straits have an average of 15 Sv of transport in SODA1.4.2 exiting the Pacific to the Indian Ocean with a majority of this transport going through narrow Lombok Strait. Current estimates of the Indonesian Strait transport is 12 Sv, but estimates have large uncertainty (Sprintall et al. 2004 ). The average transport across the Agulhas Current in SODA1.4.2 is 61 Sv, slightly less than observed (Bryden et al. 2005) , and contains strong temporal variability. However, the transport is confined primarily above 800 m, while the observations show flow extending to deeper levels that includes a deep undercurrent not present in the reanalysis.\nshows that in both the ENSO-related variance is concentrated in two regions on either side of the equatorial Pacific basin. The variance is larger for SODA1.4.2 and interestingly, both SODA1.4.0 and SODA1.4.2 show that the variance in the west is actually displaced into two narrow bands a few degrees north and south of the equator. In addition, SODA1.4.2 shows some ENSOrelated variance in the Brazil Current retroflection region just east of Argentina. The magnitude of the ENSO-related heat content variability is evident in a Hovmöller diagram of 0-300-m heat content anomaly along the equator in the Pacific (Fig. 9) . A succession of warm and cool anomalies are evident, generally appearing in the western and central basin and then propagating eastward at rapid Kelvin wave speeds. A comparison of results from SODA1.4.0 and SODA1.4.2 shows that the timing of anomalies is very similar, but that the latter has somewhat larger anomalies. The 1976/77 El Niño, for example, is barely captured in SODA1.4.0, but is quite evident in SODA1.4.2. Superimposed on heat content is the time series of zonal currents in midbasin. The timing of surface current anomalies is also quite similar between the two experiments, but the magnitude of the anomalies is somewhat greater for SODA1.4.2.\nFinally, we consider the pattern of decadal variance of sea level and eddy kinetic energy, shown in Fig. 10 . As was the case in the intraseasonal and interannual bands, we find decadal sea level variance in SODA1.4.2 concentrated in the western boundary current regions. In the North Pacific Ocean high variance extends from the Kuroshio region eastward to the Alaskan gyre. Sea level variance is high in the Southern Ocean, particularly in the Indian and western Pacific sectors. In the tropics, eddy kinetic energy is generally high reflecting slow changes in the equatorial currents. The tropical Atlantic is particularly noticeable in this regard. Sea level variance is also elevated, but with high variance geographically concentrated in a few regions such as the western equatorial Pacific."}, {"section_title": "Variability", "text": "In this section we focus on three variables: sea level, vertically averaged temperature, and near-surface currents. We begin by examining sea level variability at Bermuda, which is located in the western subtropical Atlantic (32.4°N, 64.7°W). This station has a nearly continuous tide gauge record spanning the years 1958-89 and is available from the Permanent Service for Mean Sea Level (Woodworth and Player 2003) . The station is also appealing in that it is exposed to the open ocean and is not subject to unusual geologic uplift. A previous comparison to the SODA reanalysis by Carton et al. (2005) found a correlation of r ϭ 0.66 between the observed and SODA sea level time series.\nHere we examine the frequency dependence of the sea level power density (Fig. 5) . At periods of less than 3 months the power density of the tide gauge record decays with inverse dependence on frequency. In this intraseasonal band the power density of SODA1.4.2 is a factor of 2-3 less than observed, while SODA1.4.0 is lower by a factor of 10. In the seasonal-to-interannual band (periods of 3 months to 5 years) the power densities of SODA1.4.0 and SODA1.4.2 sea level become more similar to the observations. In the decadal band (periods longer than 5 yr) again the power density of the observed sea level is highest, with SODA1.4.2 somewhat lower and SODA1.4.0 distinctly lower. This apparent separation of the properties of the experiments motivates us to examine our results in these three frequency bands. To determine the decadal signals we low-pass filter each variable with a running mean symmetric filter with a width of 5 yr. The seasonal-to-interannual band is constructed using a bandpass filter whose limits are 5 years and 3 months; while the intraseasonal band is constructed using a 3-month high-pass filter. We begin by considering sea level and currents in the intraseasonal band. For comparison, we include similar monthly average estimates from a gridded version of the French Ssalto/Duacs delayed mode multimission altimeter analysis, available on a 1 ⁄3°ϫ 1 ⁄3°grid beginning in late 1992. At intraseasonal periods (Fig. 6 , left pan- Bryden et al. 2005) 70 Ϯ 4 6 1 6 2 Indonesian Throughflow (Meyers et al. 1995) 12 c 15 12\na The second estimate derived from summarizing previous estimates. Uncertainty given here is the average of the range of uncertainties reported. b The SODA1.4.2 transport is computed between Florida and Cuba, while the observations are made between Florida and the Bahamas. c The SODA1.4.2 transports do not include the transport through the Sunda Straits. els) altimeter sea level variability is primarily confined to the eddy development regions of the western boundary currents as well as the Southern Ocean. Variance is also large in the coastal regions of the Arctic Ocean where it exceeds 20 cm 2 . However the variance estimates in this region are based on altimetry only during the ice-free summer-fall seasons so the annual statistics may be biased.\nThe pattern of sea level variance for SODA1.4.0 is similar to the altimetry, but the amplitudes are much weaker than observed. SODA1.4.2, in contrast, shows both similar patterns of variance and similar amplitudes. One location where SODA1.4.2 has more sea level variability than the altimetry is the subtropical South Indian Ocean. One possible explanation is that the increased variance is a result of the longer record length of SODA1.4.2 compared to the altimeter record. But an alternative explanation is that SODA1.4.2 has a few erroneous or unrepresentative observations in this data-sparse region. Indeed, an examination of the dataset shows a handful of anomalously cold XBTs here. However, removing the months when the bad XBTs occur from the calculation of SODA1.4.2 sea level variance does not substantially improve the comparison.\nNext we examine near-surface currents in the intraseasonal band. Here we present these results (Fig. 7 , left panels) in the form of the variance of the vector currents, or eddy kinetic energy, (u 2 ϩ 2 )/2. For comparison we include kinetic energy estimates based on the monthly Ocean Surface Current Analysis-Real Time (OSCAR) near-surface current analysis of Bonjean and Lagerloef (2002) , which spans the 13-yr period beginning January 1993 at 1°ϫ 1°resolution in the latitude range 58°S-58°N. This analysis combines estimates of geostrophic currents derived from altimetry with ageostrophic wind-driven effects derived from satellite scatterometer wind products with considerable smoothing. Interestingly, the Bonjean and Lagerloef analysis has less variance than either SODA1.4.0 or SODA1.4.2, with energy in the tropics barely exceeding 60 cm 2 s Ϫ2 and with surprisingly weak variance in the western boundary current regions. In contrast both SODA1.4.0 and SODA1.4.2 show regions of enhanced variance in the eddy-production regions as well as throughout the tropics. The energy is particularly intense in the tropical Indian Ocean where SODA1.4.2 eddy kinetic energies may exceed 400 cm 2 s"}, {"section_title": "Ϫ2", "text": ". Next we turn to the seasonal-to-interannual band (right panels of Figs. 6 and 7) . Both SODA1.4.0 and SODA1.4.2 show patterns similar to the altimetry, but again the sea level variance is somewhat reduced for SODA1.4.0. A detailed comparison of sea level variance in the western North Atlantic shows that the SODA1.4.2 sea level variance is 20% lower than the altimeter sea level and is distributed over a somewhat wider region about the mean position of the Gulf Stream than is the case for the altimetry. In contrast, SODA1.4.0 is weaker than observed by a factor of 2, its band of high variability is wider than observed (i.e., spread farther to the sides of the mean position of the Gulf Stream) and is displaced somewhat northward. SODA1.4.0 is also missing the peak in variability in the eastern Gulf of Mexico associated with Gulf rings. In the eastern equatorial Pacific the variance of the altimetry is somewhat higher than SODA1.4.2. The subtropical South Indian Ocean has significant sea level variability in both the altimetry and in SODA1.4.2.\nIn contrast, in the seasonal-to-interannual band the SODA1.4.2 eddy kinetic energy differs substantially from the OSCAR current analysis (Fig. 7) . Like its structure in the intraseasonal band, the OSCAR eddy kinetic energy in the seasonal to interannual band is concentrated in the tropics and has little variability in the subtropics and midlatitudes. In contrast, eddy kinetic energy in SODA1.4.2 exceeds 20 cm 2 s Ϫ2 throughout much of the ocean with values approaching 400 cm 2 s Ϫ2 in the western boundary current regions. SODA1.4.0 shows similar patterns, but with reduced variance.\nVariance in the seasonal-to-interannual band is the result of several different phenomena, including the seasonal cycle (evident as a spectral peak in Fig. 5 ) and ENSO. We isolate the seasonal cycle by averaging the seasonal-to-interannual sea level records month by month (monthly variance is shown in Fig. 8 , left column). We isolate the ENSO-related signal by calculating the projection of each variable at each grid point on the Niño-3.4 time series. The Niño-3.4 time series, defined as the SST anomaly averaged in a rectangular box 5°N-5°S, 120°-170°W (Trenberth 1997) , is a common proxy for the phase of ENSO (the variance of this projection is shown in Fig. 8, right panels) . The altimetry shows monthly variance exceeding 20 cm 2 in the western boundary current regions. In the tropics, high variance is evident in the northern Indian Ocean, the eastern-central equatorial Pacific Ocean, and the western equatorial Atlantic Ocean. The patterns and amplitudes are quite similar in SODA1.4.2 and weaker but similar in pattern in SODA1.4.0.\nNext we consider the ENSO-related variance. We do not attempt to compare the experiments to the altimeter record because of its limited record length, but intercomparison of the two multidecade experiments "}, {"section_title": "Decadal trends in heat storage", "text": "Here we focus on one of the strongest and most interesting signals in the decadal frequency band, which is the decadal change in heat storage in the upper ocean. Since at least the mid-1980s it has been evident that the temperature of the upper ocean is not steady (Roemmich and Wunsch 1985) . Recently a number of studies have evaluated the global hydrographic record since the 1950s using nonmodel-based techniques and have identified a pattern of decadal temperature change that shows gradual warming with enhanced warming in the upper layers of the subtropical and midlatitude North Atlantic and cooling in the subpolar gyre (Gregory et al. 2004; Willis et al. 2004; Levitus et al. 2005; Ishii et al. 2006) . In other regions the patterns and rates of heat storage differ substantially among different analyses. The likely cause of these differences is poor data coverage.\nHere we begin our own analysis by comparing the 0-700-m heat content anomalies from SODA1.4.2 (expressed as depth-averaged potential temperature) with the corresponding analysis of Levitus et al. (2005) in the Atlantic (Fig. 11) . The pattern of anomalies in both analyses show changes that include not only a gradual warming trend in the western half of the northern subtropical gyre and cooling of the subpolar gyre, but also decadal fluctuations. In the Atlantic rapid decadal changes are evident in both Levitus et al. and SODA1.4.2 between the 1960s and 1970s , and again between the 1980s and 1990s (Fig. 11) . Interestingly, SODA1.4.0 shows some of the rapid warming that occurred between the 1960s and 1970s, but not the later warming.\nFinally, we evaluate the globally averaged heat content anomaly signal averaged into three latitudinal bands 60°-15°S, 15°S-15°N, and 15°-60°N surrounding the globe (following Ishii et al. 2006) , shown in Fig. 12 . The northern band shows the most rapid rise in temperature over the 42-yr period. This rise is evident in the eastern Pacific as well as the western Atlantic (as shown in Fig. 11) .\nThe gradual warming in the time series suggests that they may be roughly represented by a linear trend underlying the decadal variability discussed above. A least squares linear trend fitted to the SODA1. years and 0-700-m-depth range. The differences between these estimates come from the larger heat anomalies in SODA1.4.2 heat storage in both hemispheres. However, it is important to note that these two linear trend estimates are not quite statistically distinguishable at the 90% confidence level. South of 60°S heat storage anomalies published by Levitus et al. (2005) are small due to the limited observational data. In contrast, those of SODA1.4.2 remain substantial."}, {"section_title": "Summary and conclusions", "text": "We describe a new reanalysis experiment called SODA1.4.2 that spans the 44-yr period 1958-2001 using the ERA-40 winds. Model forecasts are provided by an FIG. 11 . (top to bottom) Decadal anomalies of 0-700m averaged potential temperature (°C) relative to the 40-yr mean for 1960-69, 1970-79, 1980-89, and 1990-99 . The results are from (left) SODA1.4.0 and (middle) SODA1.4.2. (right) The same quantities produced by the data-based analysis of Levitus et al. (2005) . Note the gradual warming in the subtropics and midlatitudes, as well as the presence of decadal variability. ocean general circulation model using Parallel Ocean Program V1.3 numerics with eddy-permitting resolution. The oceanographic data used in this reanalysis includes all available hydrographic profile data as well as ocean station data, moored temperature and salinity time series, and surface temperature and salinity observations, including nighttime satellite SST retrievals. The data assimilation uses the differences between these observations and the model forecasts to correct the latter. One additional experiment is described, SODA1.4.0, which is an unconstrained simulation spanning the full 44-yr period. We examine the statistics of the forecast Ϫ observation differences, which indicate the presence of weak bias in the depth of the thermocline and in the temperature of the midlatitude mixed layer. The larger random component of the forecast Ϫ observation differences is also concentrated at the depth of the thermocline. Temperature is highly correlated in the vertical within the mixed layer but the correlation decreases rapidly as a function of depth. Thus, proper estimation of the mixed layer depth is an important factor in determining the reasonableness of the vertical correlation scale. A comparison of mixed layer depths with an independent analysis suggests that the winterspring estimates from SODA1.4.2 are reasonable, although the summer-fall estimates are somewhat shallow.\nA comparison of the experimental results with observed sea level at Bermuda in the subtropical North Atlantic suggests that the similarity of SODA1.4.2 and SODA1.4.0 sea level to the observations varies with frequency. At intraseasonal frequencies SODA1.4.2 has variability that is about 20% weaker than observed, while SODA1.4.0 is weaker by a factor of 3. The effect of this weakness is evident in comparisons of global sea level and near-surface kinetic energy variability. In this intraseasonal frequency band much of the observed sea level variability is confined to the western boundary current eddy-production regions associated with strong currents such as the Kuroshio, Gulf Stream, Aghulas, and the tropical currents. The patterns of variability in SODA1.4.0 (the simulation) are similar to those of SODA1.4.2, but weaker in amplitude.\nWe compare sea level and near-surface eddy kinetic energy from the experiments in the lower seasonal-tointerannual frequency band as well. In this band two prominent phenomena are present: the monthly climatological cycle and ENSO. Both phenomena are prominent in SODA1.4.2 and SODA1.4.0. The monthly climatological cycle in these experiments compares quite well to the independent sea level altimeter record, while SODA1.4.2 does have somewhat more energetic seasonal surface currents than appear in the OSCAR surface current analysis. However, we believe at least some of the difference is due to an underestimate of variability in the latter. The altimeter and surface current records are too short to be used to confirm the reasonableness of the statistics of the behavior of El Niño in these experiments.\nFinally we examine the experimental results in the decadal frequency band. At decadal frequencies a comparison of sea level time series at Bermuda suggests that the variability in SODA1.4.2 is again more similar to the observations than either is to SODA1.4.0. To investigate the implications of this result we compare the spatial structure of decade-averaged 0-700-m heat content anomalies to those presented by Levitus et al. (2005) based on an analysis of the observations without assimilation. We find heat content from SODA1.4.2 and presented by Levitus et al. are reassuringly similar in data-rich regions such as the North Atlantic. Both indicate that there has been a substantial warming of the subtropical gyre and to a lesser extent the tropics in the 1960s to early 1970s, and again in the late 1980s to 1990s, with weak cooling in the late 1970s to 1980s. In contrast with the tropics, the subpolar gyre has been cooling during this time. A global average of 0-700-m temperature shows that the temperature variability is somewhat larger in SODA1.4.2 than shown by Levitus et al. So, for example, the best-fit linear trend of heat increase in SODA1.4.2 0-700-m temperature is nearly 50% higher than the corresponding estimate of Levitus et al. Similar calculations could be performed for the oceanic freshwater budget, but will be subject to considerable uncertainty due to limitations in the observation set."}]